[{"Article Image": "https://www.thehindu.com/life-and-style/motoring/odkd6h/article34429411.ece/ALTERNATES/LANDSCAPE_615/Bajaj-launches-new-Pulsar-NS125", "Article's Title": "Bajaj launches new Pulsar NS125", "Article's Text": "Bajaj has launched the new Pulsar NS125 at ₹93,690. The NS125 is the third model from the NS range and the 10th Pulsar model to now be on sale.\n\nThe NS125 looks identical to its larger siblings with the same smooth-flowing naked bike lines and it most likely shares some body panels with the larger models. The fuel tank appears to be the same unit and the spec sheet reveals that it has an identical capacity of 12 litres.\n\nPower comes from a 124.4cc, air-cooled, two-valve unit that makes 12hp and 11Nm of torque.\n\nThe NS125 uses a perimeter frame that uses a telescopic fork and monoshock for suspension. It also uses a 80/100-17 at the front and 100/90-17 tyre at the rear. Braking is carried out by a 240mm disc up front and 130mm drum at the rear. Unlike the larger NS160, the NS125 can’t be optioned with a disc brake at the rear."}, {"Article Image": "https://www.thehindu.com/life-and-style/motoring/ahd5ue/article34429339.ece/ALTERNATES/LANDSCAPE_615/RAC1534", "Article's Title": "TVS Apache RTR 160 4V assures greater fuel efficiency", "Article's Text": "TVS’ Glide Through Technology, or GTT, makes it an easy motorcycle to ride in slow moving traffic too\n\nIt is almost as if TVS does not rest when it comes to rolling out little updates for its motorcycles, the Apache line-up in particular. In late 2019, the manufacturer introduced the facelifted iterations of the popular Apache RTR 160 4V and the RTR 200 4V. A few months ago, the latter got another, rather substantial, improvement; and now, it is the smaller 160’s turn.\n\nAt the midst of it all\n\nFor starters, there is the updated engine. TVS has managed to churn out an additional 1.61 hp making it the most powerful engine in its class. Peak torque is impressive as well with 14.73 Nm produced at 7,250 rpm. Our performance tests showed that the Apache is also one of the quickest bikes in its segment.\n\nIt is outpaced to 60kph (by just 0.05sec) by its rival from Bajaj, but it is the quickest motorcycle to 100kph, getting there in 15.93sec. These numbers, combined with a smooth and free-revving engine, result in a rather sprightly motorcycle. It is only towards the very upper limit of the rev band that you can feel, and hear, vibrations from the foot pegs and the front end. The throttle response is crisp, too, and that improves the overall riding experience.\n\nAs was the case with the 2020 model, the 160 4V features TVS’ Glide Through Technology, or GTT, making it a very easy motorcycle to ride in slow moving traffic. The GTT, essentially, works like the creep function in an automatic transmission equipped car, allowing the rider to keep moving without the need to feed any throttle. It is a natural feeling system that works in the first three gears, with each subsequent gear offering a slightly higher ‘cruising’ speed.\n\nSpeaking of cruising, the 160 4V will sit comfortably between 90-95 kph all day long, and while it can stay at a constant 115kph, it does feel a little stressed at those speeds. If you are a stickler for good fuel efficiency, this Apache will not disappoint. In our tests, the bike returned 43.24 kpl in the city and 50.76 kpl on the highway.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOn its toes\n\nThe RTR 160 4V has always been a capable and easy bike to ride fast. The bike uses a conventional telescopic fork and monoshock that offer a plush ride. This setup is also quite adept at going around corners very well, in a manner that feels intuitive. With the 2021 model, TVS also managed to shave off two kgs. While it is not a difference you will immediately notice, it does play a part.\n\nThe only downside to the comfort is the ergonomics. The Apache has a predominantly relaxed riding position, but the foot pegs are a little rear-set and sit high up. It is not something that will bother you over short distances, but if you are over 5ft 10in, this does feel a little cramped over longer stints.\n\nThe Apache RTR 160 4V is one of TVS’ most popular motorcycles, and there is good reason to see why. It offers impressive performance, everyday practicality, and with prices starting at ₹1.08 lakh, it is also great value for money.\n\nDespite being part of a heavily competitive segment, the RTR 160 4V remains one of the top contenders. Is it at the very top though? That is a question we hope to answer soon."}, {"Article Image": "https://www.thehindu.com/life-and-style/motoring/rfcbkj/article34429386.ece/ALTERNATES/LANDSCAPE_615/Royal-Enfield-Classic-350", "Article's Title": "Q & A with Hormazd", "Article's Text": "Style and substance\n\nI am planning to buy the Royal Enfield Classic 350 Chestnut red. Is it worth buying or should I go for the Benelli Imperial 400? My priorities are low running costs and resale value.\n\nVinu, Bengaluru\n\nThe Benelli is a better choice than the current Classic 350. However, we would recommend that you wait a little more for the next-gen Classic 350. Its launch is due soon and it is based on the Meteor 350 platform, which is a huge improvement over the current Classic 350. The new platform has proven to be quite reliable so far, so running costs should be kept under check. The Classic 350 also commands decent resale value, so that should hold true for the next gen bike as well.\n\nTall order\n\nI want to purchase a bike that can deliver high performance, good efficiency, offers a comfortable highway performance and serves as a good city commuter. I have shortlisted the Royal Enfield Meteor 350, Honda CB 350 RS and BMW G 310 R , but I am not sure which to go for. Budget is not a concern.\n\nHitesh Kulkarni, Ahmedabad\n\nIt’s going to be very hard to find a bike that meets all those criteria — if you want high performance, you have to give up some efficiency. The Meteor and CB are both quite refined, but they are not exactly ‘high performance’. Of the two, the CB is more efficient.\n\nThe Interceptor is a great choice, but it is a heavy bike. Expect no more than 25kpl on city commutes with the RE. The BMW is another good all-rounder, but it doesn’t have the smoothest motor out there and service costs are high. We would recommend you also consider the KTM 390 Duke and 390 Adventure. They have the best performance here, but expect no more than 25-28kpl in real world riding.\n\nHormazd Sorabjee is the editor of Autocar India. Mail your feedback and queries to roadshow@thehindu.co.in"}, {"Article Image": "https://www.thehindu.com/life-and-style/motoring/8nc49s/article34429263.ece/ALTERNATES/LANDSCAPE_615/DSC5695", "Article's Title": "Mercedes’ AMG A35 is a treat on wheels", "Article's Text": "The vehicle offers sharper handling, a richer cabin and more kit, plus better performance\n\nThe A35 sedan packs a whopping 306 hp turbo-petrol engine, all-wheel drive and a number of suspension and chassis upgrades over the regular A-Class Limo to make it sportier. So, what is it like?\n\nStarting with the engine, this 2.0-litre, four-cylinder petrol engine is a development of Merc’s M260 unit, and it uses a twin-scroll turbocharger to boost torque at low speeds. Power is sent to all four wheels via Merc’s own 7-speed dual-clutch automatic, and the four-wheel-drive system allows up to 50% of the power to be sent to the rear.\n\nThe A35 even gets uprated suspension components to help deal with the power better. Up front, it now gets the addition of a lower wishbone along with a custom strut brace used to enhance stiffness, and the shell of the car even gets underfloor stiffening. At the rear, AMG uses a new subframe to stiffen up the rear suspension mounting points.\n\nAll these upgrades certainly make a massive difference to the driving experience. The steering feels beautifully weighted, very direct and delivers a fair amount of connect. There is plenty of grip, the nose is keen to change direction and with the four tyres turning and clawing in, it even inspires confidence over wet patches.\n\nYou cannot really tell when the rear axle chips in, or if it does at all, but it does manage to feel quite neutral and balanced. The body control is very good, with the A35 feeling well poised even when you hurl it around.\n\nPlenty of energy\n\nProd the throttle and responses are immediate, sharp and wonderfully addictive; keep your foot in and the tacho needle climbs with plenty of energy. In fact, flatten the accelerator in second or third, with the engine spinning at around 3,000 rpm, and the A35 will leave you grinning.\n\nThrottle responses aren’t as feral as the full blown V8, but this is still deeply addictive. Even flat-out performance is strong; we managed to record 0-100 kph in 5.6 sec without the use of launch control. The A35 is also a great tool for fast highway commutes; the stability is great, the brakes have a good amount of bite, and the twin-clutch gearbox works well.\n\nIn fact, the gearbox works particularly well when you are ‘on it’ — it shifts up crisply and it allows downshifts even when you are high up in the powerband. The gearbox, however, does pause and feel grabby at low speeds.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe A35’s adaptive AMG suspension also rounds off bumps on the road nicely, although larger bumps do catch it out occasionally; the short-travel suspension is not ideal.\n\nComing to the styling, Mercedes has given the A35 sedan flowing lines and spot-on proportions. On the inside, the A35 gets plenty of typical AMG touches — very supportive sports seats, a flat-bottomed steering wheel, aluminium sport pedals, and AMG-specific graphics for the digital instrument panel. What lifts the ambience considerably is the colour-matching ambient lighting in yellow.\n\nRear passengers also get a lot more space and comfort than the earlier CLA. Legroom is much improved, headroom is good for regular-sized passengers, and though you are seated a bit low, the rear seat isn’t uncomfortable for two, even over long-ish journeys. The boot isn’t too large at 420 litres, but it will carry a weekend’s worth of bags quite easily or swallow three large suitcases.\n\nLaunched at ₹56.24 lakh (ex-showroom, India), the locally assembled AMG A35 is clearly more expensive than the stock models, but then it delivers much more car as well. A lot more performance, sharper handling, a richer cabin, more kit and, not to be dismissed, the look of a higher-end AMG performance car.\n\nThe A35 isn’t as exciting as a C63 and it won’t be as practical on an everyday basis as something like a C-Class. Still, if you want the best of both worlds, the charming and fun-to-drive A35 certainly hits the spot."}, {"Article Image": "https://static.toiimg.com/thumb/msid-82291062,width-1070,height-580,imgsize-874414,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "Harley Davidson Pan America 1250 Price: Harley-Davidson Pan America 1250 launched in India at Rs 16.90 lakh", "Article's Text": "NEW DELHI: Harley-Davidson on Wednesday launched the Pan America 1250 Adventure in India at Rs 16.90 lakh (ex-showroom, Delhi) and revealed the prices of other motorcycles for the model year 2021.Pan America 1250 is the first rugged, powerful, technologically advanced multi-purpose motorcycle from Harley-Davidson, which made its global debut in February 2021.Pan America 1250 is powered by the new 150hp Revolution Max 1250 engine, a liquid-cooled 1,250cc-displacement V-Twin designed to offer a broad powerband. To minimize overall motorcycle weight (Pan America 1250 534lb. wet), the Revolution Max engine is integrated into the vehicle as the central member of the chassis.Three distinct elements – the front frame, the mid-frame and the tail section – bolt directly to the powertrain. This design reduces motorcycle weight and results in a stiff chassis that contributes to precise handling. The cast-aluminum swingarm minimizes unsprung weight. The chassis is designed with a 62.2-inch wheelbase, ideal for touring capability (especially with passenger and loaded luggage) and agile handling required for off-road maneuverability.Pan America is equipped with technologies designed to enhance the riding experience, including multiple electronically controlled ride modes plus Cornering Rider Safety Enhancements. This broad collection of technologies is designed to match motorcycle performance to available traction during acceleration, deceleration and braking.As an industry-first innovation, Pan America is equipped with Adaptive Ride Height (ARH), a new suspension system that automatically transitions between a low stopped position and optimal ride height when the motorcycle is in motion.The Pan America 1250 model features premium passive front and rear suspension that is fully adjustable for pre-load and compression/rebound damping. Suspension travel front and rear is 7.48 inches (190mm). Front suspension is provided by a SHOWA 1 by 147mm inverted cartridge fork. Rear suspension is a SHOWA Piggyback reservoir shock with adjustable hydraulic preload.From grab handles to integrated luggage mounts, to a horizontal headlamp configured to better illuminate an off-road trail, the function defines style. Inspired by the spirit of rugged North American off-road versatility, the Pan America 1250 stand out visually in the adventure touring landscape, with design that reflects the capability of the motorcycles.Harley-Davidson and Brembo collaborated on an all-new braking system for the Pan America model. A new radial monoblock four-piston (30 mm) caliper takes full advantage of the material characteristics to increase stiffness while reducing overall weight. Dual front brake rotors are 320mm in diameter; single rear-brake rotor is 280mm diameter. A new lightweight front brake master cylinder offers adjustable lever response.Pre-programed ride modes for the Pan America 1250 models include Road, Sport, Rain, Off-Road and Off-Road Plus. Each Ride Mode consists of a specific combination of power delivery, engine braking, Cornering Enhanced Antilock Braking System (C-ABS) and Cornering Enhanced Traction Control System (C-TCS) settings. The rider may use the MODE button on the right-hand controller to change the active ride mode while riding the motorcycle or when stopped, with some exceptions.All instrumentation and infotainment functions are displayed on a tilting 6.8-inch TFT touchscreen (thin-film-transistor, a type of liquid-crystal display noted for high image quality and contrast). Its non-reflective glass cover makes it easier to view in most lighting conditions."}, {"Article Image": "https://static.toiimg.com/thumb/msid-82285804,width-1070,height-580,imgsize-994246,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "ford electric vehicle: Ford plans to develop and produce electric vehicle batteries", "Article's Text": "DETROIT: Saying that it wants to control the key technology for electric vehicles, Ford plans to open a battery development center near Detroit by the end of next year.The company said the 200,000-square-foot facility will have equipment to design, test and even do small-scale manufacturing of battery cells and packs. The $185 million lab also will develop electronic controls and other items as Ford moves more of the process in-house.Eventually, the company wants to do large-scale manufacturing of its own batteries globally, a task now performed by supply companies.Like many global automakers who have been stung by a computer chip and other supply chain shortages, Ford wants to make sure it has enough batteries for what it says is an accelerating transition away from internal combustion engines.Hau Thai-Tang, the company's chief product and operations officer, said electric vehicles are moving from early adopters to an early majority as new models come out, and Ford wants to lead the transition.\"We now see that the market is going to develop very quickly, and we will have sufficient scale to justify having greater levels of integration,\" he said. \"We will no longer take an approach of hedging our bets and planning around the uncertainty of how fast that will play out.\"The move comes as the global auto industry races to control supplies including precious metals needed to make batteries and individual cells that form big battery packs to run as many as 300 new electric models coming out in the next two years. Under new CEO Jim Farley, the plan is a reversal from Ford's previous path of buying technology and batteries from supply companies. However, the company said it still could partner with suppliers, universities and startups on the technology.Ford wouldn't say where in Southeast Michigan it plans to build the battery center, named ``Ford Ion Park,'' nor would it reveal potential battery factory locations. The center would employ about 150 workers to start, and many of them already are working at existing Ford sites.Ford said it has discussed the transition to battery power with the Biden administration, which has pegged much of its climate change policy to getting more electric vehicles on the roads.The announcement comes after Ford got caught up in a trade secrets fight between its main battery supplier, SK Innovation, and LG Energy Solution. The US International Trade Commission decided in February that SK stole 22 trade secrets from LG Energy, and that SK should be barred from importing, making or selling batteries in the United States for 10 years.The decision gave SK four years to make batteries for Ford, and it could have left the company scrambling for supplies. SK has the contract to make batteries for an electric version of Ford's F-150 pickup, the nation's top-selling vehicle. The dispute was settled earlier this month with SK agreeing to pay $1.8 billion and an undisclosed royalty.Automakers have been moving toward building their own batteries, and they've been securing their own supplies of raw materials such as lithium, copper, nickel and other precious metals directly from producers. Guidehouse Insights Principal Analyst Sam Abuelsamid said the global semiconductor shortage and the SK Innovation trade dispute likely made Ford pull ahead its plans much faster.Many automakers including Volkswagen General Motors and Stellantis are pulling battery development and manufacturing in-house, or into joint ventures formed with parts supply companies, he said.\"Engines and transmissions have been considered a core competency of automakers since 1886, but as those go away, they are seeing the need to make batteries and motors the replacement,\" Abuelsamid said. \"No one wants to get locked out of supplies, and as volumes scale, the cost of paying a markup to suppliers is going to grow.\""}]