[{"Article Image": "https://static.toiimg.com/thumb/msid-82291543,width-1070,height-580,imgsize-1035811,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "Honda to suspend three Japanese plants in May due to chip shortage", "Article's Text": "TOKYO: Honda Motor Co will suspend three plants in Japan as many as six days in May due to a chip shortage, a spokesman said on Wednesday.\n\nHonda will suspend two plants in Saitama Prefecture for six days and its Suzuka plant in Mie Prefecture for five days, he said. The output cut was reported earlier by Kyodo .\n\nThe suspension is due to a chip shortage caused by various factors, he added. He declined to outline the volume or models of vehicles affected but said that the company will carefully examine the situation for production following June.\n\nAutomakers worldwide are struggling due to a shortage of chips, exacerbated by a fire at Renesas Electronic Corp's chip plant in Japan and a storm in Texas.\n\n\n\nFacebook Twitter Linkedin EMail"}, {"Article Image": "https://static.toiimg.com/thumb/msid-82290737,width-1070,height-580,imgsize-46472,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "sensex today: Sensex zooms 790 points to close at 49,734; Nifty settles above 14,850", "Article's Text": "Top gainers in the 30-share BSE pack included Bajaj Finance, IndusInd Bank, Bajaj Finserv, Kotak Mahindra Bank, ICICI Bank and SBI. (File photo)\n\nNEW DELHI: Equity indices continued to surge for the third straight session on Wednesday helped by gains in banking and auto stocks. The benchmark BSE sensex jumped 790 points or 1.61 per cent to close at 49,734; while the broader NSE Nifty moved 212 points or 1.44 per cent higher to settle at 14,865.\n\nTop gainers in the BSE pack included Bajaj Finance, IndusInd Bank, Bajaj Finserv, Kotak Mahindra Bank, ICICI Bank and SBI with their stocks rising as much as 7.73 per cent.\n\nOn the NSE platform, except for Nifty Metal, Pharma and Realty, all other sub-indices finished in green with Nifty Bank outperforming the index by gaining as much as 3.02 per cent.\n\nIn the previous session, sensex had settled 558 points or 1.15 per cent higher at 48,944, and Nifty surged 168 points or 1.16 per cent to close at 14,653.\n\nForeign institutional investors (FIIs) were net sellers in the capital market as they offloaded shares worth Rs 1,454.75 crore on Tuesday, while domestic institutional investors (DIIs) bought shares worth Rs 1,463.44 crore, according to provisional exchange data.\n\nAccording to V K Vijayakumar, chief investment strategist at Geojit Financial Services, there are some consistent trends in the market now.\n\n\"One, despite the bad news on the Covid front, the market has been maintaining the upside momentum. Two, FIIs have been consistent sellers (above Rs 10,000 crore in April, so far) and DIIs have been consistent buyers. These trends are likely to continue in the short run and markets are likely to remain strong,\" he told news agency PTI.\n\nCoronavirus: Live updates\n\nIt appears that markets are looking into the post-second wave scenario which is likely to emerge in May, he noted, adding that global support to markets continues with positive economic data from the US. The FOMC comment expected later in the day is likely to reaffirm the US Fed's accommodative stance, imparting further resilience to markets.\n\n\"Over the last two (to) three days, and especially over the weekend, there have been some positives such as ... the US allowing supply of Covid-19 materials and resources to India, and a fall in the number of active cases, especially in worst-hit states like Maharashtra,\" Gaurav Garg, head of research at CapitalVia Global Research in Indore, told Reuters.\n\nMeanwhile, India touched another grim milestone as the overall deaths in the pandemic crossed the 2-lakh mark on Wednesday. Over 3.6 lakh new cases were reported in the last 24 hours in yet another single-day record.\n\n(With inputs from agencies)\n\n"}, {"Article Image": "https://static.toiimg.com/thumb/msid-82291104,width-1070,height-580,imgsize-199903,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "Crisil: Limited incentives unlikely to drive vehicle owners to go for scrappage", "Article's Text": "MUMBAI: Limited incentives and poor cost economics for trucks in the Vehicle Scrappage Policy , coupled with lack of addressable volumes for other segments is unlikely to drive freight transporters to replace their old vehicles with new ones, a report said on Wednesday.\n\nThough the scrappage volume of buses, PVs and two-wheelers is expected to be limited as well, the policy's impact on new commercial vehicle (CV) sales could be sizeable, based on addressable volume, ratings agency Crisil Research said in its report.\n\nUnder the proposed policy, a scrapped vehicle will be offered a monetary value close to 4-6 per cent of the showroom value. There could even be up to 5 per cent discount on the purchase of a new vehicle if a scrap certificate is produced.\n\nIn addition, it also offers a 25 per cent discount in road tax, among others. It also proposes to de-register vehicles that fail fitness tests or are unable to renew registrations after 15-20 years of use.\n\nAccording to Crisil, in the bus segment, many buses owned by state transport undertakings will have a life of over 15 years. In comparison, buses operated for intercity, staff, school and tourist segments typically do not have a life beyond 15 years, and would thus be outside the ambit of the scrappage policy.\n\nCrisil Research estimates that around 45,000 buses, largely owned by STCs, could be scrapped and replaced, it said.\n\nAssuming a three-year window, starting April 2022, scrappage of around 15,000 buses annually could result in 15-20 per cent incremental new bus sales – based on the average of around 90,000 buses sold between fiscals 2016 and 2020.\n\nThis, however, would depend on the state government's wherewithal to purchase new vehicles and therefore will be a monitorable, Crisil Research said.\n\nAs for the passenger vehicles, renewal of registration fees is proposed to increase from Rs 600 to Rs 5,000 (valid for five years) for PVs older than 15 years, a hike of over eight times.\n\nHowever, these vehicles mostly ply in the rural areas where enforcement of higher registration fees is difficult to monitor. The potential benefit from scrapping a 15-year-old, entry-level small car will be Rs 70,000, whereas its resale value is around Rs 95,000. That makes scrapping unattractive, said the report.\n\nBut for vehicles older than 20 years, considering that there is a proposal to deregister them, the potential scrappage benefit is around Rs 50,000, which is similar to its resale value. That can incentivise scrapping, the report stated, adding as a result, 40,000-60,000 PVs can realistically be scrapped.\n\nTherefore, the incremental contribution to new vehicle sales works out to 12,000 to 20,000 PVs annually, assuming a three-year window. As the number is less than 1 per cent of the 30 lakh units sold on average over fiscals 2016-2020, scrapping will not contribute substantially to new sales, said the report.\n\nIn the case of two-wheelers, according to the report, while the fees for renewal of registration is proposed to increase from Rs 300 to Rs 1,000 (valid for five years) for vehicles older than 15 years, the cost burden in absolute terms is minimal.\n\nFor two-wheelers, the policy could incentivise scrappage of vehicles older than 15 years with a net benefit of Rs 3,000-4,000 (comparing total potential benefit on scrapping vs resale value).\n\nHowever, the majority of two-wheelers do not have a life beyond 15 years and volumes (assuming scrappage over a three-year period) would account for only around 1-2 per cent of the five-year average annual new sales volume of around 185 lakh, according to Crisil Research.\n\nThe scrappage policy, therefore, will provide no significant lift to sales of two-wheeler manufacturers.\n\nIn medium and heavy commercial vehicles (MHCVs), though, the potential scrappage volume is significant, it is estimated that around 5.1 lakh MHCVs (>7.5 tonne gross vehicle weight segment) are older than 15 years and hence, could potentially be destined for the scrapyard.\n\nCrisil said it gauged the scrapping potential of around 18.5 tonne GVW medium commercial vehicles with a sticker price of Rs 18-19 lakh in Maharashtra (erstwhile 16.0 tonne GVW trucks) that are more than 15 and 20 years old.\n\nThis segment comprises around 20 per cent share of the 5.1 lakh CVs older than 15 years. The insights from this analysis are applicable to the other CV segments as well, it said, adding two scenarios have been reviewed to assess the benefits the scrappage policy will provide.\n\nIn the optimistic scenario, the potential benefit of scrapping a 15-year-old CV, and its resale value are similar. As the age of vehicle increases, the benefit reduces, while incentives increase. That's because, the resale value of a 20-year-old truck is less compared with a 15-year-old truck, so scrapping makes sense, according to the report.\n\nHowever, in the base case, the potential benefit is less than the resale value of the truck, so scrapping does not make sense, it added.\n\nAccording to Crisil, the financial burden after replacement increases significantly, hence even in its optimistic scenario, it does not see much traction for the policy from an incremental demand perspective.\n\nAlso, to boost scrapping volume, it was proposed by ministry of road transport and highways in January that the Centre should direct state governments to impose 10-25 per cent green tax on old vehicles at the time of renewal of a fitness certificate.\n\n\n\nFacebook Twitter Linkedin EMail"}, {"Article Image": "https://static.toiimg.com/thumb/msid-82288457,width-1070,height-580,imgsize-62186,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "Mohammed bin Salman: No plan to introduce income tax in Saudi Arabia", "Article's Text": "Saudi Crown Prince Mohammed Bin Salman speaks during televised interview in Riyadh, Saudi Arabia.\n\nDUBAI: Saudi Arabia 's Crown Prince Mohammed bin Salman said in televised remarks on Tuesday that the kingdom had no plans to introduce income tax and a decision last July to triple value-added tax to 15% was temporary.\n\nThe kingdom had tripled VAT to offset the impact of lower oil revenue on state finances in a move that had shocked citizens and businesses expecting more support from the government during the coronavirus pandemic.\n\n\"Raising VAT was a painful measure and I hate to hurt any Saudi citizen, but it is my duty to build Saudis a long-term sustainable future,\" the prince said in an interview aired on Saudi TV to mark the fifth anniversary of Vision 2030.\n\n\"Raising VAT to 15% is a temporary decision that will last one to five years and then it will go down to between 5% to 10%,\" he said.\n\nPrince Mohammed also said the kingdom aims to reduce unemployment to 11% this year. Unemployment among Saudi citizens fell to 12.6% in the fourth quarter of 2020 from 14.9% in the third quarter.\n\nThe government has been pushing through economic reforms since 2016 to create millions of jobs and reduce unemployment to 7% by 2030.\n\nThe plans were disrupted by the coronavirus crisis that sent oil prices plummeting last year.\n\n"}, {"Article Image": "https://static.toiimg.com/thumb/msid-82286077,width-1070,height-580,imgsize-129952,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "Zomato IPO: Zomato files for Rs 8,250 crore IPO", "Article's Text": "BENGALURU: Food delivery startup Zomato , backed by China's Ant Group , has filed for an initial public offering of up to Rs 8,250 crore ($1.11 billion), as consumers increasingly turn to ordering food online during the Covid-19 pandemic.\n\nLaunched in 2008, Zomato is one of India's most prominent startups. It is present in 24 countries and employs more than 5,000 people, according to its website.\n\nIn February, the company raised $250 million from five investors including hedge fund Tiger Global Management for a post-money valuation of $5.4 billion.\n\nAccording to draft papers submitted to India's market regulator on Wednesday, Zomato's offering will comprise a fresh issue of shares worth up to Rs 7,500 crore. The company said it intends to use the proceeds to fund growth initiatives and general corporate purposes.\n\nTop shareholder Info Edge will sell shares worth Rs 750 crore in the IPO.\n\nThe company, along with domestic rival Swiggy, backed by Accel, dominates the Indian food delivery market, which research firm RedSeer estimates is worth $4.2 billion.\n\nIndia has been one of the hottest IPO markets so far in 2021, helped by a flood of foreign money and high interest from mom-and-pop investors.\n\nHowever, since late March, a second wave of coronavirus infections has dampened investor enthusiasm for stocks and IPOs.\n\nWell-known domestic brands and names such as Barbeque-Nation Hospitality Ltd and Macrotech Developers Ltd saw a muted response to their stock market listings.\n\nKotak Mahindra Capital, Morgan Stanley India, Credit Suisse Securities India, BofA Securities India and Citigroup Global Markets India are the lead book running managers for Zomato's IPO.\n\n\n\nFacebook Twitter Linkedin EMail"}, {"Article Image": "https://static.toiimg.com/thumb/msid-82284178,width-1070,height-580,imgsize-740628,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "Samsung inheritance tax: Samsung's Lee family to pay $10.78 billion in inheritance taxes", "Article's Text": "SEOUL: The family of deceased Samsung Electronics chairman Lee Kun-hee said on Wednesday it will pay more than 12 trillion won ($10.78 billion) in inheritance taxes for the estate of the late patriarch.\n\nLee, who is credited with transforming Samsung into the world's largest smartphone and memory chip maker, died on October 25. His estate included shareholdings in Samsung affiliates valued at $17 billion.\n\nThe Lee family's handling of the hefty inheritance tax bill - one of the largest ever in both Korea and globally - had been closely watched as it could have resulted in the dilution of the family's controlling stake in Samsung.\n\nThe family had been discussing using shares in affiliated companies as collateral for personal loans to pay part of the tax bill, a measure that would avoid the sale of their extensive Samsung holdings, Reuters reported last week, citing sources.\n\nThe family's statement on Wednesday did not give details of how Lee's shares will be distributed among the heirs or whether any will be sold. Besides loans, the family is expected to use dividends from both their own and Lee's shareholdings to pay the tax, analysts have said.\n\nLee's shareholdings included a 4.18% stake in Samsung Electronics, 0.08% of Samsung Electronics preferred shares, 20.76% of Samsung Life Insurance , 2.88% of Samsung C&T, and 0.01% stake in Samsung SDS, which according to South Korean tax code valuation were worth about 18.96 trillion won ($17 billion).\n\nSouth Korea's tax code allows payment in instalments, with one-sixth of the total tax bill to be paid first, then the rest over five years at an annual interest rate currently set at 1.2%.\n\nThe family also announced it will donate 1 trillion won to public health care charities, including for the creation of a specialised infection diseases laboratory. Lee's extensive collection of antiques and paintings will be donated to the National Museum of Korea and other cultural organizations.\n\n\n\nFacebook Twitter Linkedin EMail"}, {"Article Image": "https://www.thehindu.com/business/Industry/q92c4i/article34432116.ece/ALTERNATES/LANDSCAPE_615/SaudiArabiaAramco89989jpg-e2e06jpg", "Article's Title": "Saudi in talks to sell 1% of Aramco, says crown prince", "Article's Text": "Aramco, the world's biggest oil company which listed on the Saudi bourse in late 2019, could sell further shares including to international investors within the next year or two, says Mohammed bin Salman\n\nSaudi Arabia's crown prince said in televised remarks on Tuesday that the kingdom was in discussions to sell 1% of state oil firm Saudi Aramco to a leading global energy company.\n\nCrown Prince Mohammed bin Salman said Aramco, the world's biggest oil company which listed on the Saudi bourse in late 2019, could sell further shares including to international investors within the next year or two.\n\n\"There are talks now for the acquisition of a 1% stake by a leading global energy company in an important deal that would boost Aramco's sales in ... a major country,\" he said, without elaborating.\n\n\"There are talks with other companies for different stakes,and part of Aramco's shares could be transferred to the (Saudi)Public Investment Fund and a part listed ... on the Saudi bourse,\" he said in an interview aired by Saudi TV marking the fifth anniversary of Vision 2030.\n\nThe Aramco initial public offering in 2019 was seen as a pillar of the economic diversification programme aimed at attracting foreign investment.\n\nAramco raised $25.6 billion in the IPO and later sold more shares under a \"green shoe option\" to raise the total to $29.4 billion.\n\nThe crown prince in 2016 announced a plan to raise as much as $100 billion via an international and domestic listing of a 5% stake in Aramco. In 2017 sources said Chinese state-owned companies PetroChina and Sinopec had written to Aramco to express an interest in a direct deal.\n\nListing plans were halted in 2018 and when they were revived the following year the deal found little interest beyond theGulf. Riyadh scaled back its ambitions and canceled road shows in New York and London, selling a 1.7% stake and relying on mainly domestic and regional buyers.\n\nThe proceeds of that offer were transferred to the Public Investment Fund (PIF), Prince Mohammed’s vehicle of choice to transform the Saudi economy and diversify away from oil revenue."}, {"Article Image": "https://www.thehindu.com/news/national/67bpgb/article34431070.ece/ALTERNATES/LANDSCAPE_615/paytm", "Article's Title": "Paytm to make available 21,000 oxygen concentrators from May 1st week", "Article's Text": "Following overwhelming support and contribution from people across the country, Paytm is now aiming to raise over ₹14 crore to source over 3,000 OCs over the next few days\n\nDigital payments and financial services company Paytm has placed orders for 21,000 oxygen concentrators which will be made available from the first week of May in the country, a company spokesperson said on Wednesday.\n\nThe company has raised ₹5 crore contribution from the public and matched the same amount taking the total kitty to ₹10 crore for procurement of oxygen concentrators (OCs) which filter out oxygen from air and help patients with mild breathing issues.\n\n\"Paytm Foundation has already placed an order for importing 21,000 OCs to provide immediate relief. Our founder Vijay Shekhar Sharma is leading a dedicated team with medical expertise to push forward and streamline company-wide Covid relief measures,\" the company spokesperson told PTI.\n\nThese devices would be immediately sent to government hospitals, COVID care facilities, private hospitals, nursing homes as well as Resident Welfare Associations, the spokesperson said.\n\n\"As part of Oxygen for Life Campaign, on the Paytm foundation's website, private hospitals, RWAs, NGOs may request for guidance for purchase of the Oxygen Concentrators,\" he said.\n\nIndia is struggling with the second wave of the coronavirus infection and hospitals in several states are reeling under shortage of medical oxygen and beds in view of rising number of COVID-19 cases.\n\nIndia saw a record single-day rise of 3,60,960 coronavirus cases, which pushed the total tally to 1,79,97,267, while the death toll crossed two lakh following 3,293 fresh fatalities. Patients have been running for oxygen and have been reporting about shortage of breathing equipment in Delhi NCR area.\n\nHospitals in the region have reported loss of life because of several factors including oxygen shortage.\n\nSeveral oxygen vendors in the Delhi NCR area have said that they have run out of oxygen cylinder stocks.\n\nFollowing overwhelming support and contribution from people across the country, Paytm is now aiming to raise over ₹14 crore to source over 3,000 OCs over the next few days.\n\n\"Paytm aims to become the destination for other organizations & enterprises to procure OCs,\" the spokesperson said."}, {"Article Image": "https://www.thehindu.com/news/national/lqel67/article34399508.ece/ALTERNATES/LANDSCAPE_615/PM-Modi-rally-in-West-Bengal", "Article's Title": "IATO seeks PM’s intervention to remove anomalies in operational guidelines of ECLGS", "Article's Text": "ECLGS was launched by the Government of India as a special scheme in view of COVID-19 crisis.\n\nThe Indian Association of Tour Operators (IATO) on Wednesday said it has written to Prime Minister Narendra Modi seeking his intervention for removing anomalies caused by conditions imposed by NCGTC in the implementation of the Emergency Credit Line Guarantee Scheme (ECLGS).\n\nAccording to the conditions issued by NCGTC, the account availing ECLGS was not to be non-performing asset (NPA) or days past due (DPD) for over 90 days as on the date of sanction or disbursement of the facility, IATO said in a statement.\n\n“Consequent to that, it nullifies any benefit that may have accrued to tour operators....the condition as stipulated in NCGTC makes mockery of any benefit that may have accrued to the tour operators,” IATO President Rajiv Mehra said.\n\nThe current NCGTC operational guidelines should be either revoked or amended suitably as operational guidelines are inconsistent with the spirit of both ECLGS 3.0 scheme and the RBI notification. The guidelines have defeated the purpose of the scheme, he added.\n\nThe sector has been struggling for the last one year and whatever hopes there were of revival have been shattered by the current wave, IATO said.\n\nECLGS was launched by the Government of India as a special scheme in view of COVID-19 crisis."}, {"Article Image": "https://www.thehindu.com/sci-tech/technology/o83ytb/article34429603.ece/ALTERNATES/LANDSCAPE_615/Alphabet-reutersjpg", "Article's Title": "Alphabet sets profit record, plans $50 billion buyback", "Article's Text": "The results provided the first sign that Google services such as search and YouTube may hold on to gains made since lockdowns and other pandemic restrictions forced people to shop and communicate online over the last year\n\n(Subscribe to our Today's Cache newsletter for a quick snapshot of top 5 tech stories. Click here to subscribe for free.)\n\nGoogle parent Alphabet Inc on Tuesday reported record profit for the second consecutive quarter and a $50 billion share buyback but warned a surge in usage and ad sales during the pandemic may slow as people resume in-person activities.\n\nWith online consumer activity remaining elevated in the first quarter, Alphabet beat analysts' revenue estimates and nearly surpassed the sales record it set in the fourth quarter.\n\nGoogle ad sales jumped 32% in the first quarter compared with a year ago, above expectations of analysts tracked by Refinitiv. Cloud sales increased 45.7%, in line with estimates.\n\nAlphabet shares rose about 4.3% to $2,390.10 in extended trading.\n\nThe results provided the first sign that Google services such as search and YouTube may hold on to gains made since lockdowns and other pandemic restrictions forced people to shop and communicate online over the last year.\n\nAlso Read | Regulatory probes Google is facing in Asia\n\nAbout 17% of people in the United States, Alphabet's top region by revenue, were fully vaccinated against COVID-19 by the end of the first quarter. Activities including in-person dining resumed in big cities in March, and security screenings at U.S. airports had their busiest day in a year.\n\nBut Alphabet Chief Financial Officer Ruth Porat told analysts on Tuesday, \"it's too early to forecast the extent to which these changes in consumer behavior and advertising spend will endure.\"\n\nGoogle Chief Business Officer Philipp Schindler and Porat declined to comment on whether Google had seen a recovery in spending by travel and other industries that were major customers before the pandemic.\n\nAlphabet's overall quarterly sales rose 34% to $55.3 billion, above analysts' estimate of 26% growth from a year ago and close to the $56.9 billion it reported in the fourth quarter. Revenue benefited by an unspecified amount from Google's acquisition of smartwatch maker Fitbit in January.\n\nAlphabet's quarterly profit was $17.9 billion, or $26.29 per share, beating estimates of $15.88 per share and topping its previous-high of $15.2 billion last quarter.\n\nAlso Read | Google asks U.S. judge to move states’ antitrust lawsuit to California\n\nBut nearly $4 billion of earnings came from unrealized gains in venture capital investments and recalculating depreciation of some data center equipment.\n\nThe high sales pushed operating margins up to 30% for the first time since incorporating as Alphabet in 2015 even as its costs began to pick up again for hiring, legal matters and building out new facilities. Alphabet in 2020 suffered its slowest sales growth in 11 years but posted record profit and boosted its cash hoard by $17 billion after slowing hiring and construction.\n\nThe share repurchase authorization by Alphabet's board follows a $25 billion buyback program announced in 2019. Jefferies analyst Brent Thill estimated Alphabet now has $56 billion left to spend buying its shares.\n\nAd rebound\n\nGoogle's ad business, the global market leader as measured in sales, accounted for 81% of Alphabet's first-quarter revenue.\n\nSchindler said retail, technology and consumer product companies were among big search advertisers in the quarter.\n\nGoogle Cloud, a distant rival to the cloud businesses of Amazon.com Inc and Microsoft Corp, narrow edits operating loss to 44% to $974 million in the first quarter. But Porat told analysts not to glean too much from the drop because one-time factors, including the depreciation, were at play.\n\nShares of Alphabet, 184th among companies in the S&P 500 index, have surged 80% in the last year. Shares of top rival Facebook Inc, which had been up 62% during the last year entering Tuesday, rose 1.7% after hours.\n\nAlso Read | Google’s new ad tracking tech to be blocked by WordPress\n\nThough several concerns about Google's long-term prospects have emerged in recent years, none have significantly affected sales.\n\nResolution likely remains years away in privacy and antitrust lawsuits against Google that could result in changes to its ad operations.\n\nDiscussions about changing U.S. and European laws to impose new oversight on Google, Facebook and other companies, especially regarding privacy and artificial intelligence, have lagged as legislators have been distracted by the pandemic.\n\nStill, issues continue to emerge. On Monday, streaming TV technology company Roku Inc accused Google of engaging in anticompetitive behavior to benefit its YouTube and hardware businesses. YouTube called them \"baseless claims.\""}, {"Article Image": "https://www.thehindu.com/business/markets/oo1wnq/article34367043.ece/ALTERNATES/LANDSCAPE_615/rupee", "Article's Title": "Rupee extends gains for 3rd day; closes up by 30 paise at 74.36 against U.S. dollar", "Article's Text": "The dollar index rose 0.14% to 91.03.\n\nThe rupee rose by 30 paise to close at 74.36 (provisional) against the U.S. dollar on Wednesday, extending its gains for a third day on the back of strong rally in domestic equities.\n\nAt the interbank forex market, the local unit opened at 74.49 against the greenback and witnessed an intra-day high of 74.29 and a low of 74.50.\n\nIt finally ended at 74.36 against the American currency, registering a rise of 30 paise over its previous closing. On Tuesday, the rupee had settled at 74.66 against the American currency.\n\nThis is the third straight session of gain for the rupee, during which it appreciated by 65 paise.\n\n\"Indian Rupee appreciated on the back rise in risk appetite in domestic markets. However, sharp gains were prevented on strong dollar and continued FII outflows,\" said Saif Mukadam, Research Analyst, Sharekhan by BNP Paribas.\n\nFurther, concerns over rising COVID-19 cases in India and lockdown restriction in some States weighed on investor sentiment and capped the gains for the local unit, Mr. Mukadam said.\n\nAdditionally, traders remained cautious ahead of U.S. Federal Reserve monetary policy outcome and U.S. President Joe Biden Speech, he said.\n\nMeanwhile, the dollar index, which gauges the greenback's strength against a basket of six currencies, rose 0.14% to 91.03.\n\nBrent crude futures, the global oil benchmark, rose 0.18% to $66.54 per barrel.\n\nOn the domestic equity market front, the BSE Sensex ended 789.70 points or 1.61% higher at 49,733.84, while the broader NSE Nifty advanced 211.50 points or 1.44% to 14,864.55.\n\nForeign institutional investors were net sellers in the capital market on Tuesday as they sold shares worth ₹1,454.75 crore, according to the exchange data."}, {"Article Image": "https://www.thehindu.com/business/Industry/agjxis/article34421892.ece/ALTERNATES/LANDSCAPE_615/MarutiSuzuki", "Article's Title": "Maruti advances factory shutdown for maintenance purposes amid surge in COVID-19 cases", "Article's Text": "The country’s top carmaker Maruti Suzuki India (MSI) on Wednesday said it has decided to undertake a maintenance shutdown at its Haryana-based manufacturing plants from May 1-9 amid a surge in COVID-19 cases.\n\nThe auto major was supposed to take the shutdown of its two plants in Gurugram and Manesar in June, but due to the tsunami of COVID-19 cases, it decided to take it one month earlier in order to save oxygen for medical needs.\n\nMSI noted that as part of the car manufacturing process, it uses a small amount of oxygen in its factories, while relatively much larger quantities are used by the manufacturers of components.\n\n“In the current situation, we believe that all available oxygen should be used to save lives. Accordingly, Maruti Suzuki has decided to advance its maintenance shutdown, originally scheduled for June to 1st to 9th May,” it said in a regulatory filing.\n\nProduction in all factories will be closed for maintenance during this period, MSI said.\n\n“The company has been informed that Suzuki Motor Gujarat has taken the same decision for its factory,” it added."}, {"Article Image": "https://www.thehindu.com/business/markets/xgtts1/article34392569.ece/ALTERNATES/LANDSCAPE_615/bse", "Article's Title": "Sensex soars 790 pts, Nifty tops 14,850 as financial stocks shine", "Article's Text": "Bajaj Finance was the top gainer in the Sensex pack, soaring around 8 %.\n\nExtending its gains for the third straight session, equity benchmark Sensex rallied 790 points on Wednesday, led by gains in financial stocks amid a positive trend in global markets.\n\nThe 30-share BSE index ended 789.70 points or 1.61% higher at 49,733.84.\n\nSimilarly, the broader NSE Nifty surged 211.50 points or 1.44% to 14,864.55.\n\nBajaj Finance was the top gainer in the Sensex pack, soaring around 8 %, followed by IndusInd Bank, Bajaj Finserv, ICICI Bank, Kotak Bank, SBI, Bajaj Auto and HDFC Bank.\n\nOn the other hand, Nestle India, HCL Tech, L&T, Dr Reddy’s and TCS were among the laggards.\n\n\"Superior Q4 results and vaccine optimism buoyed domestic markets to trade on a positive footing for the third consecutive day ahead of the US Federal Reserve interest rate decision,” said Vinod Nair, Head of Research at Geojit Financial Services.\n\nStrong buying interest was seen in banking and auto stocks with enhanced business prospects which is likely to be maintained, he added.\n\nFurther, short covering ahead of derivatives expiry also contributed recent rally, analysts said.\n\nElsewhere in Asia, bourses in Shanghai, Hong Kong and Tokyo ended on a positive note, while Seoul was in the red.\n\nBourses in Europe were trading with gains in mid-session deals.\n\nMeanwhile, international oil benchmark Brent crude was trading 0.23% higher at $65.82 per barrel."}, {"Article Image": "https://ichef.bbci.co.uk/news/1024/branded_news/16D8F/production/_118238539_toyodagoseisign-1.jpg", "Article's Title": "Toyoda Gosei: Hundreds of jobs at risk at car parts plants", "Article's Text": "\"We understand and regret the uncertainty that this will cause for everyone at the Swansea and Rotherham sites and are doing all we can to support our employees throughout the consultation process,\" said Toyoda Gosei UK (TGUK) managing director Shigenori Matsuo."}, {"Article Image": "https://ichef.bbci.co.uk/news/1024/branded_news/2B41/production/_118237011_sainsburys.jpg", "Article's Title": "Sainsbury's: Cost of Covid has been high", "Article's Text": "It's not just about the shift to online, grocers are thinking about the future of work, and how to respond if many of us don't return to five days a week in the office."}, {"Article Image": "https://www.thehindu.com/business/Industry/tmtywv/article31876146.ece/ALTERNATES/LANDSCAPE_615/20THFAVIPIRAVIR", "Article's Title": "MSN Labs unveils higher strength Favilow tablets for COVID-19 treatment", "Article's Text": "Drugmaker MSN Laboratories has launched Favilow, its branded generic of antiviral drug Favipiravir, in a higher strength of 800 mg.\n\nUsed in the treatment of mild and moderate COVID-19 flu, Favilow was launched last year by the company in August, in the strengths of 200 and 400 mg. Favilow 800 mg is priced at ₹144 per tablet and will be available across pharmacies.\n\nThe field team of MSN Labs is also helping out with free home delivery in over 170 cities in coordination with local retail chemists for patient convenience, a release from the company said. CMD MSN Reddy said “in the light of increasing COVID-19 cases, affordable treatment options are the need of the hour to flatten the curve.”\n\nExecutive Director Bharat Reddy said MSN will scale up the manufacturing volumes to 6-8 lakh dosage regimen (30 lakh strips of different strengths of Favilow) by next month from the present one lac dosage regimen (five lakh strips). Each strip has 10 tablets. The release said MSN has developed the active pharmaceutical ingredient (API) and the formulation for Favilow 800 mg at its in-house research and development and manufacturing units."}, {"Article Image": "https://ichef.bbci.co.uk/news/1024/branded_news/1485/production/_118235250_gettyimages-1307238407.jpg", "Article's Title": "Business leaders set out plan for Covid recovery", "Article's Text": "He told the BBC: \"The pandemic has ensured that those who were worst off to start with have suffered more than those who were relatively well off, so that gap between the comfortably off and the less comfortably off has grown.\""}, {"Article Image": "https://ichef.bbci.co.uk/news/1024/branded_news/1F7F/production/_118236080_appspic.jpg", "Article's Title": "Australia warns Google and Apple over app stores", "Article's Text": "App developers should have more information about how their apps are made discoverable, while the two tech giants should be prevented from using data collected from their app stores to promote their own apps, the ACCC said."}, {"Article Image": "https://static01.nyt.com/images/2021/04/28/business/28economy-briefing-fedinflation/merlin_186962796_26b3a8de-c3da-41f7-975f-58c39273314a-facebookJumbo.jpg", "Article's Title": "A key question: How much inflation is too much?", "Article's Text": "When Jerome H. Powell, the Federal Reserve chair, speaks to reporters in a webcast news conference on Wednesday afternoon, he’s likely to face questions about a simmering topic: inflation.\n\nPrices are expected to pop in the coming months, both as inflation indexes lap very weak 2020 readings and as supply chains experience short-term reopening bottlenecks. The unknowns facing the Fed, and the investment world, are how big the jump will be and how long it will last.\n\nMost forecasters and the Fed itself expect the increases to be only temporary. But some economists have warned that they could be significant enough to become a problem as businesses reopen, consumers start to spend their savings and the government pumps stimulus money into the economy.\n\nIf the increases are big enough and sustained, the Fed could find itself in a tough spot, forced to choose between letting prices rise or raising interest rates before the labor market is fully recovered."}, {"Article Image": "https://static01.nyt.com/images/2021/04/27/us/27nypost-new/27nypost-new-facebookJumbo.jpg", "Article's Title": "New York Post Reporter Who Wrote False Kamala Harris Story Resigns", "Article's Text": "Ms. Italiano, a veteran Post journalist and longtime chronicler of the New York City courts, is a well-liked figure in the paper’s newsroom. She did not respond to inquiries about her resignation or how the Harris article came to be. Representatives for The Post did not respond to calls and emails on Tuesday night.\n\nHer abrupt exit underscored some of the tensions currently roiling The Post, a classic pugilistic city tabloid that was often a vessel for coverage favorable to former President Donald J. Trump during his term in office.\n\nMr. Murdoch, who spoke frequently with Mr. Trump, installed a new editor at the tabloid last month, Keith Poole, who formerly served in a top position at Mr. Murdoch’s London paper The Sun. At least eight journalists at The Post have departed the paper recently, including a White House correspondent, Ebony Bowden.\n\nFox News and The Post, given their shared Murdoch ownership, have long demonstrated a certain symbiosis. (Just last week, The Post ran a gossip item complaining that Glamour magazine was not writing features about female Fox News stars.)\n\nFox News hosts including Tucker Carlson, Greg Gutfeld and Martha MacCallum discussed the Post article on their programs on Monday. Peter Doocy, Fox News’s White House correspondent, cited “a report in the last couple days in The New York Post” before asking Jen Psaki, the White House press secretary, on Monday if Ms. Harris “is making any money” from her books supposedly being distributed in the shelters. Ms. Psaki said she would “have to certainly check on that,” which The Post described in a follow-up story as Ms. Psaki’s having offered “no answers.”\n\nOn Tuesday’s “Fox & Friends,” the co-host Ainsley Earhardt told viewers that the claims about the Harris book were “not accurate,” citing that morning’s fact-checking column in The Washington Post. Also on Tuesday, Fox News updated its article about the Harris book to note that only a single copy had been seen at the shelter and that it had been delivered as “part of a citywide book and toy drive.”\n\nFox News has faced criticism in recent days for a different false claim broadcast on the network: that President Biden was planning to restrict Americans’ red-meat consumption under his plan to address climate change. An on-air Fox News graphic declared, “Bye-Bye Burgers Under Biden’s Climate Plan,” setting off a cycle of outrage from conservative commentators."}, {"Article Image": "https://ichef.bbci.co.uk/news/1024/branded_news/C9ED/production/_118239615_e40296ee-0889-41a3-8776-771ccb53c4d7.jpg", "Article's Title": "Nestle to cut almost 600 jobs and shut Newcastle factory", "Article's Text": "\"We do not underestimate the impact that the closure of Fawdon factory would have on the local area and, as part of the consultation, we want to work with the local community to find ways that we can support the area and our employees if these proposals were to go ahead,\" Nestle said."}, {"Article Image": "https://ichef.bbci.co.uk/news/1024/branded_news/12D39/production/_118231177_whatsubject.jpg", "Article's Title": "Saving cash: A customer said we'd changed her life", "Article's Text": "\"Cash remains critically important, not only as a back-up when payment systems go down, but for millions of people who can't use digital payments, don't have reliable broadband or mobile coverage, or simply cannot afford or don't have access to wider banking services that many of us take for granted,\" she says."}, {"Article Image": "https://ichef.bbci.co.uk/news/1024/branded_news/107E1/production/_118235576_1a333dd6-587b-431a-90b9-abd8ce375539.jpg", "Article's Title": "'I feel much safer on board ship than in a supermarket'", "Article's Text": "\"Unfortunately we had to say goodbye to some really fantastic colleagues as the ships were not moving. Then of course we had to start planning the re-entry into service. No one has ever done anything like this before.\""}, {"Article Image": "https://static01.nyt.com/images/2021/04/28/business/23money/23money-facebookJumbo.jpg", "Article's Title": "How Identity Thieves Took My Wife for a Ride", "Article's Text": "Insurance companies routinely check your credit when signing you up, so it was baffling that Progressive would have issued my wife a policy without her thawing her file. But it listed TransUnion as “the financial responsibility vendor” — an amusing euphemism if you know how long consumer advocates have been complaining because insurance companies use credit data to set rates — and sure enough, my wife’s frozen credit file indicated that Progressive had pinged it this month.\n\nHow? Incredibly, an exception often allows insurance companies to check your credit even if you want nothing to do with them. As we learned, that exception meant that Progressive could help itself to my wife’s file — which in turn helped someone pick the pocket of the State of New York and its taxpayers, like us.\n\nIn its wisdom, Progressive considered my wife responsible enough to warrant coverage. Fortunately for us, Mr. Pasternak was paying! The second page of our welcome packet said that “the authorization you gave for your first installment payment” was to come from a bank account with his name on it.\n\nSo meet our new best friend. With a name like Shiran Pasternak, he was a quick internet search away. Was he the thief? We wondered. But if he was, he was doing a pretty good job of hiding it. Like my wife, he had a “Welcome to Progressive” package and notes from the state about a mysterious unemployment claim that he had never filed. (The bank account and routing numbers in his Progressive packet were identical to ours, but neither had any connection to institutions where any of us do our financial business. Because the numbers were truncated, it was impossible to figure out if they came from a third person or were made up.)\n\nOnce we put all of that together, Mr. Pasternak — coincidentally a former New York Times employee — breathed a sigh of partial relief up in Irvington, N.Y., and let me push forward finding out what had happened to all of us.\n\nHere’s how it works.\n\nAutomobile insurers — even the ones you don’t use — already know a lot about you. They share claims information among themselves to help weed out unprofitable or reckless customers who try to jump to another provider. They can also get access to your driver’s license number, your current auto policy data, and the make and model of your vehicle. Often, they buy this information from states (which end up sending money right back out when the buyers are careless and unemployment fraud proliferates).\n\nThe insurers want to make applying for a policy as easy as possible. So once you start entering information, they like to help you along and fill in some of those blanks for you. For some unfortunate victims, it was as simple for the scammers as copying down the driver’s license number that popped up, although it usually required more technical know-how."}, {"Article Image": "https://static01.nyt.com/images/2021/04/23/business/00iberdrola-1/00iberdrola-1-facebookJumbo.jpg", "Article's Title": "The Exxon of Green Power: A Spanish Company and Its Boss Set Sky-High Goals", "Article's Text": "MADRID — In the winter of 2015, three directors of a Connecticut electric company met with a potential acquirer: a determined Spanish utility executive named José Ignacio Sánchez Galán, who surprised them with a bold vision for America’s utility industry.\n\n“He was very clear then that he saw the U.S. as having enormous potential in renewable energy,” said John L. Lahey, who was chairman of the company, United Illuminating. “This guy six years ago was already way ahead of where the U.S. was.”\n\nMr. Galán clinched that deal for United Illuminating for $3 billion. His company, Iberdrola, is now poised, with a Danish partner, to begin constructing the first large-scale offshore wind farm in the United States, in waters off Massachusetts. Over all, Iberdrola and its subsidiaries reach 24 U.S. states and have investments in countries from Britain to Brazil to Australia.\n\nFor the past 20 years, since he took over Iberdrola, based in Bilbao with 37,000 employees, Mr. Galán has been on a mission to upend the electrical utility industry, a fragmented collection of companies tied to aging coal- and oil-burning generators."}, {"Article Image": "https://static01.nyt.com/images/2021/04/28/business/28manufacturing-01/28manufacturing-01-facebookJumbo.jpg", "Article's Title": "As Economy Rebounds, Manufacturers Face New Hurdles", "Article's Text": "Matt Guse would hire a dozen machinists — if only he could find them.\n\nThe owner of MRS Machining, a maker of precision metal parts in rural Augusta, Wis., Mr. Guse finds business is rebounding so quickly as the pandemic’s effect eases that his 47-worker shop is short-handed.\n\n“I’ve turned down a million dollars’ worth of work in the last two weeks,” he said. “Doing that, it’s hard to go to bed at night when you put your head to the pillow. I have open capacity, but I need more people.”\n\nAfter a sharp downturn when the pandemic hit last year, factories are humming again. But the recovery’s speed has left employers scrambling. Despite huge layoffs — manufacturing employment initially dropped by 1.4 million — some companies find themselves desperate for workers.\n\nIn other cases, shortages of parts like semiconductors and supply chain disruptions have made orders hard to fill and created fresh uncertainty."}, {"Article Image": "https://ichef.bbci.co.uk/news/1024/branded_news/15960/production/_115061488_hi064004163.jpg", "Article's Title": "Samsung heirs to pay record inheritance tax", "Article's Text": "Investors will instead need to wait for regulatory filings to discover changes in shareholdings by Lee's son and Samsung Electronics vice chairman Jay Y. Lee, who has been the de facto head of Samsung Electronics since 2014."}, {"Article Image": "https://static01.nyt.com/images/2021/04/28/business/28tech-fix1/merlin_186961923_6248d5ce-2131-4306-a9aa-7d376e4d7d80-facebookJumbo.jpg", "Article's Title": "Apple AirTag Review: A Humble Tracker With Next-Generation Tech", "Article's Text": "On the outside, Apple’s new AirTag looks like a ho-hum product that we have all seen before. It’s a disc-shaped tracking gadget that can be attached to items like house keys to help you find them.\n\nBut inside, the story gets far more interesting.\n\nThe AirTag, which Apple introduced last week, is one of the first consumer electronics to support a new wireless technology, ultrawideband, which lets you detect precise proximity between objects. Using ultrawideband, your iPhone can sense whether an AirTag is an inch or dozens of feet away from it. It’s so accurate that its app will even show an arrow pointing you in the direction of the AirTag.\n\nThat’s far better than other trackers that rely on Bluetooth, an older wireless technology that can only roughly guess an item’s proximity. (More on how this all works later.)\n\nUsing ultrawideband to find lost items is just one early example of what the technology can do. Because of its pinpoint-precise ability to transfer data quickly between devices, ultrawideband could become the next wireless standard that succeeds Bluetooth. It could lead to better wireless earphones, keyboards, video game controllers — you name it."}, {"Article Image": "https://static01.nyt.com/images/2021/04/23/business/00CA-Riches-01/00CA-Riches-01-facebookJumbo.jpg", "Article's Title": "California Is Awash in Cash, Thanks to a Booming Market", "Article's Text": "As the pandemic raged last May, California was reeling. Spending on unemployment assistance and health care had jumped, while tax revenues were on the verge of cratering. State officials, just months earlier counting on a $5.6 billion budget surplus, now anticipated a $54 billion shortfall. Severe cuts would be needed, making an already frightening recession even worse.\n\nGavin Newsom, the Democratic governor of California, warned of dark days ahead. “We are confronted with a steep and unprecedented economic crisis,” he wrote in his budget.\n\nThen Wall Street came to the Golden State’s rescue.\n\nThe stock market, after a steep but brief downturn in March 2020, has soared to new heights, prompting a record number of companies — many of them based in California — to go public. The rising market minted new millionaires and padded the incomes of the state’s wealthiest residents, who typically own a lot of stock. And for California, that meant a windfall. Its taxes on such stock-based gains are the highest of any state, and its largest revenue source is personal income taxes."}, {"Article Image": "https://static01.nyt.com/images/2021/04/28/business/27office-tech1/27office-tech1-facebookJumbo-v2.jpg", "Article's Title": "How Data Is Changing the Way Offices Are Run", "Article's Text": "The idea of tracking how workers use space is a core tenet of the corporate philosophy of the co-working giant WeWork, which often bragged about its technological prowess.\n\n“Hype and megalomania aside, WeWork was onto something when it came to flexible space and the underutilization challenge,” said Dan Ryan, the chief executive and a co-founder of VergeSense, a company that manufacturers optical sensors for buildings. “That philosophy, that we can all operate remotely, is being adopted by every company.”\n\nThe technology being used to monitor office activity tends to be nondescript. The VergeSense sensor, shaped like a smoke detector and roughly the size of a deck of cards, counts the number of people in a space and measures foot traffic. The firm has a proprietary algorithm that can tell if a space is being used passively by someone who has momentarily stepped away. Cisco and other enterprises with 10,000 or more employees have signed up to use the devices with a subscription service.\n\nOver the last year, start-ups have seen a surge of interest from clients. HqO, which provides an operating system for offices, raised $60 million this month. VergeSense, which raised $21 million in two funding rounds, announced a partnership with the global real estate firm JLL to install sensors in several buildings across the country. By the first quarter of 2021, VergeSense was analyzing more than 40 million square feet of real estate globally.\n\nEstablished developers have kept pace. Hines set up numerous tests of hardware and software over the last year. At 717 Texas in Houston, an office tower in the city’s Theater District, Hines deployed more than 150 sensors to count people and gauge indoor environmental quality. The company is also testing how cameras in lobbies of some of its buildings can be used to provide “consistent, helpful information to tenants.”"}, {"Article Image": "https://www.thehindu.com/sci-tech/technology/fib8h3/article34429782.ece/ALTERNATES/LANDSCAPE_615/smartphones-Reutersjpg", "Article's Title": "India’s second wave of COVID-19 infections may dent smartphone shipments: report", "Article's Text": "Smartphone shipments grew nearly 23% in the first three months of 2021 compared to last year, crossing 38 million units\n\n(Subscribe to our Today's Cache newsletter for a quick snapshot of top 5 tech stories. Click here to subscribe for free.)\n\nIndia’s smartphone shipments may be affected in the coming quarters as consumer demand may dip due to a surge in COVID-19 infections and subsequent lockdowns across the country, according to research firm Counterpoint.\n\nCounterpoint cautioned that \"A second and more virulent wave of COVID-19 is currently on in the country, and is likely to impact the coming quarters.”\n\nSmartphone shipments grew nearly 23% in the first three months of 2021 compared to last year, crossing 38 million units. The first-quarter shipment numbers were led by Xiaomi with a 26% market share, driven by its expanded manufacturing capabilities to meet demand. Samsung and Vivo captured the second and third spot.\n\nAlso Read | 5G phones to boost the global smartphone shipments this year\n\nApple retained the top position in the premium segment in terms of market share, registering more than 1 million shipments for two consecutive quarters for the first time, the research firm said in a statement.\n\nSmartphone maker OnePlus’s shipments grew over 300% in the January to March period compared to last year. Overall, Chinese smartphone brands held a total of 75% market share in the last three months, the market research firm stated."}, {"Article Image": "https://www.thehindu.com/business/Industry/8derm/article34428628.ece/ALTERNATES/LANDSCAPE_615/bl01zomato", "Article's Title": "Zomato files papers for ₹ 8,250-crore IPO", "Article's Text": "The online food delivery segment has seen significant growth in the last few years.\n\nFood delivery platform Zomato has filed preliminary papers with capital market regulator Securities and Exchange Board of India (Sebi) to raise ₹ 8,250 crore through an initial share-sale.\n\nThe initial public offer (IPO) comprises fresh issue of equity shares worth ₹ 7,500 crore and offer for sale to the tune of ₹ 750 crore by Info Edge (India) Ltd, draft red herring prospectus filed with Sebi showed on Wednesday.\n\nProceeds from the fresh issue would be used towards funding organic and inorganic growth initiatives; and general corporate purposes.\n\nThe online food delivery segment has seen significant growth in the last few years with Zomato and Swiggy competing head-on to grab market share.\n\nZomato's FY20 revenue had jumped over two-fold to $ 394 million (around ₹ 2,960 crore) from the previous fiscal, while its earnings before interest, taxes, depreciation and amortization (EBITDA) loss was around ₹ 2,200 crore.\n\nIn February, Zomato had raised $ 250 million (over ₹ 1,800 crore) in funding from Tiger Global, Kora and others, valuing the online food ordering platform at $ 5.4 billion.\n\nKotak Mahindra Capital Company Limited, Morgan Stanley India Company Private Limited and Credit Suisse Securities (India) Private Limited are the global coordinator and book running lead manager to the issue.\n\nBofA Securities India Limited and Citigroup Global Markets India Private Limited have been appointed as merchant bankers to the public issue.\n\nThe equity shares of the company will be listed on BSE and NSE.\n\nLast year, Zomato founder and CEO Deepinder Goyal had told employees that the company plans to go for an IPO in the first half of 2021."}, {"Article Image": "https://www.thehindu.com/business/markets/d9sv9r/article34430302.ece/ALTERNATES/LANDSCAPE_615/gold-thmni", "Article's Title": "Gold plunges by ₹ 505, silver declines by ₹ 828", "Article's Text": "Gold prices plunged by ₹ 505 to ₹ 46,518 per 10 gram in the national capital on Wednesday following a fall in the global metal prices, according to HDFC Securities.\n\nIn the previous trade, the precious metal had closed at ₹ 47,023 per 10 gram.\n\nIn-tandem with weak gold prices, silver also declined by ₹ 828 to ₹ 67,312 per kg from ₹ 68,140 per kg in the previous trade.\n\nIn the international market, gold was quoting lower at USD 1,769 per ounce and silver was flat at USD 26.02 per ounce.\n\n\"Gold prices traded lower with spot gold prices at COMEX trading at $1,769 per ounce on Wednesday. Gold prices traded under pressure on dollar recovery ahead of US FOMC (Federal Open Market Committee) meeting,\" according to HDFC Securities, Senior Analyst (Commodities), Tapan Patel.\n\nNavneet Damani, VP – Commodities Research, Motilal Oswal Financial Services, said, \"After trading steady for the first two sessions in this week, gold prices eased a bit as US yields rose in yesterday's session. Market participants awaited the US Fed's statement due later in the day, for cues on the central bank's monetary policy.\""}, {"Article Image": "https://static01.nyt.com/images/2021/04/28/business/28db-newsletter-allbirds/merlin_170580753_fc59934f-9159-49f5-b22d-85a8a1a4ac3c-facebookJumbo.jpg", "Article's Title": "Consumer Brands Eye Public Markets", "Article's Text": "Business for good? Allbirds is a certified B Corp, a certification earned by focusing on social good as well as profit. (Zwillinger joined a DealBook Debrief call last year to talk about the purpose of business.) Wall Street hasn’t always taken kindly to such companies: Etsy had to drop the status after taking a beating from the public markets following its I.P.O. Allbirds, though, said the $100 million funding round it announced last September was “indication of investors’ continued enthusiasm for its stakeholder-centric business model.”\n\n“Allbirds has always been focused on building a great company, and as a B Corp and Public Benefit Corporation, doing what is best for our stakeholders (planet, people, investors) at the right time and in a way that helps the business grow in a sustainable fashion,” the company said in a statement.\n\nImage\n\nHERE’S WHAT’S HAPPENING\n\nPresident Biden prepares for his first joint address to Congress. In a locked-down Capitol, before a far smaller audience than usual, he is expected to argue for his expansive infrastructure bill and unveil a sweeping plan for nearly universal children’s education programs. Polls suggest that Americans support Biden’s big spending proposals. Follow the lead-up to the speech in our live briefing.\n\nVaccinated Americans can go maskless outside. The C.D.C. revised its social-distancing guidelines, allowing people who have received their shots to forgo masks outdoors except in crowded venues like stadiums. Meanwhile, Pfizer’s C.E.O., Albert Bourla, said the drug maker might roll out an oral treatment for Covid-19 by year end.\n\nDeutsche Bank dodges a bullet. The German bank reported $1.1 billion in quarterly profit, its best performance in seven years, as its traders outperformed rivals on Wall Street. Just as notably, the bank said that unlike many of its competitors, it had suffered no losses from exposure to Archegos.\n\nThe cloud powers tech giants’ stellar earnings. Alphabet, Google’s parent company, said profit had more than doubled in the first quarter as online advertising and cloud services remained strong during the pandemic. Microsoft said its first-quarter earnings had jumped 44 percent, thanks to cloud and Office 365 workplace software. All eyes are now on Apple and Facebook, which report earnings after markets close today.\n\nJPMorgan Chase will open its U.S. offices to all employees next month. The bank told its American workers that they can return on May 17, subject to a 50 percent occupancy cap, with a formal return to the office for all in July. Separately, HSBC plans to cut its office space 20 percent this year as it adopts more flexible working arrangements."}, {"Article Image": "https://static01.nyt.com/images/2021/04/28/arts/28tv-production-Law/28tv-production-Law-facebookJumbo.jpg", "Article's Title": "TV Production Adapted to Weather the Pandemic. Now What?", "Article's Text": "When it became clear early in the pandemic that it was safer to be outdoors than in, the creators of “Big Shot,” a new Disney+ series being made with John Stamos, started rewriting scenes so they could be shot outside. Then new guidance emerged, which underscored that loading a cast and crew into buses and dispatching them to sites all over Los Angeles posed its own risks. So they rewrote their scripts again so scenes could be shot on sets.\n\nAs the surging virus made in-person work risky, many actors sought jobs on animated shows they could voice from home. But work-from-home acting posed challenges, even for seasoned veterans: Members of “The Simpsons” cast recorded episodes from inside closets, under blankets and makeshift studios fashioned from pillow forts and dog beds.\n\nAnd when the long-running police procedural “Law & Order: SVU” resumed shooting in New York this fall, it too changed with the times. Air filters would blast on set up until the moment someone yelled “Action!” There were fewer scenes shot on location, fewer costume changes, and fewer extras, since each one had to be tested for the coronavirus.\n\nIt has been a year of struggle and experimentation for the television industry, which has had to learn on the fly while trying to create new diversions for an unusually captive home audience. The work has not been without risk: After TV production restarted over the summer, it had to be halted at times when stars fell ill or the virus ran rampant; in Los Angeles there have been 23 outbreaks at television and film production sites since July, leading to 187 cases, according to county health data provided to The New York Times."}, {"Article Image": "https://www.thehindu.com/sci-tech/technology/658u9v/article34429341.ece/ALTERNATES/LANDSCAPE_615/MS-AFPjpg", "Article's Title": "Microsoft sales grow on cloud strength, shares dip on heightened valuation", "Article's Text": "Booming sales in personal computers for working from home have also helped boost the company's Windows operating system business, Microsoft said\n\n(Subscribe to our Today's Cache newsletter for a quick snapshot of top 5 tech stories. Click here to subscribe for free.)\n\nMicrosoft Corp on Tuesday met analysts' quarterly sales expectations and beat profit estimates, but its shares fell slightly as investors hoped for an even stronger performance after a year-long rally to a massive market valuation.\n\nThe Redmond, Washington company has become one of the world's most valuable companies, worth close to $2 trillion after its stock jumped 50% over the past year, by entering the booming market for cloud computing.\n\nMicrosoft has remained a household name during the pandemic through collaboration software as Teams. Sales have even boomed for its Windows operating system for PCs, which had waned for decades as smartphone have proliferated.\n\nMicrosoft's Azure cloud service is closing ground on market-share leader Amazon Web Services, and it is doubling down on productivity software used by businesses worldwide.\n\nAlso Read | Microsoft to invest $1 bln in Malaysia to set up data centres: Malaysian PM\n\nRevenue and adjusted earnings per share for the third quarter ended March 31 were $41.7 billion and $1.95 per share,above analysts' estimates of $41.03 billion and $1.78 per share, according to data from Refinitiv.\n\nShares fell 3.2% in after-hours trading.\n\n\"One-off tax and currency advantages have boosted Microsoft's third-quarter numbers, and as a result the market isn't being quite as welcoming of expectation-beating numbers as you might expect,\" said Nicholas Hyett, equity analyst at Hargreaves Lansdown.\n\n\"That is the danger of trading on the kind of valuation Microsoft enjoys, 32.8 times next year's earnings. Disappoint even a little and the market will be unforgiving.\"\n\nSales for what Microsoft calls its \"commercial cloud\" - which contains server infrastructure such as Azure along with cloud-based versions of its Office software - was up 33% to $17.7 billion. Sales for Dynamics 365, which competes directly with Salesforce.com, were up 45% and the business version of Office 365 added 15% more users.\n\n\"That's the fourth consecutive quarter of 15% seat growth on a very large base,\" Microsoft Chief Financial Officer Amy Hood said of the Office 365 results for commercial customers.\n\nMicrosoft has continued to double down on cloud-based software and said earlier month it would buy artificial intelligence software firm Nuance Communications Inc for $16 billion, excluding net debt, to bolster its healthcare business.\n\nBooming sales in personal computers for working from home have also helped boost the company's Windows operating systembusiness.\n\nAlso Read | Microsoft partners with aerospace firm for automated satellite image processing\n\nMicrosoft said Azure, its closely watched cloud computing business that competes with Amazon.com Inc's Amazon Web Services and Alphabet Inc's Google Cloud, grew 50% in the quarter, or 46% when adjusted for currency variations. This is down from a currency-adjusted 48% the quarter before but in line with analysts' expectations of 46.3% growth, according to data from Visible Alpha.\n\nOverall sales at Microsoft's \"intelligent cloud\" unit that contains Azure were $15.1 billion, above analysts' estimates of$14.92 billion, according to Refinitiv data.\n\nSales for Microsoft's productivity software unit, which includes its Office and Teams software, were $13.6 billion, compared with estimates of $13.49 billion, according to Refinitiv. Sales for its LinkedIn social network were up 23% on a currency adjusted basis, slightly above Visible Alpha estimates of 21.9%, as revenue continued to recover from a sharp decline in job listings and hiring at the onset of the pandemic.\n\nMicrosoft's personal computing unit, which contains its Windows operating system and Xbox gaming console, had $13.0 billion in sales, compared with analysts' expectations of $12.57 billion, according to Refinitiv data. Sales of Windows to PC makers were up 10%, compared to a 1% rise the quarter earlier."}, {"Article Image": "https://www.thehindu.com/sci-tech/technology/internet/fw24hm/article34428397.ece/ALTERNATES/LANDSCAPE_615/Apple-AP-3jpeg", "Article's Title": "Russia fines Apple $12 mln for alleged app market abuse", "Article's Text": "The FAS said in a statement it had imposed a turnover fine on Apple of 906.3 million roubles ($12.1 million) for the alleged violation of Russian anti-monopoly legislation\n\n(Subscribe to our Today's Cache newsletter for a quick snapshot of top 5 tech stories. Click here to subscribe for free.)\n\nRussia said it had fined Apple $12 million for alleged abuse of its dominance in the mobile applications market, in the latest dispute between Moscow and a Western technology firm.\n\nThe Federal Anti-monopoly Service (FAS) said on Tuesday that U.S. tech giant Apple's distribution of apps through its iOS operating system gave its own products a competitive advantage.\n\nApple said it \"respectfully disagreed\" with the FAS ruling and that it would appeal it.\n\nWestern tech companies have come under increasing pressure in Russia in recent months, with social network Twitter punitively slowed down over a failure to delete content which Moscow says is illegal.\n\nFacebook, TikTok and Alphabet's Google have also come under fire.\n\nAlso Read | EU to hit Apple with antitrust charge this week\n\nThe FAS said in a statement it had imposed a turnover fine on Apple of 906.3 million roubles ($12.1 million) for the alleged violation of Russian anti-monopoly legislation.\n\nIt determined in August 2020 that Apple had abused its dominant position and then issued a directive requiring the U.S. company to remove provisions giving it the right to reject third-party apps from its App Store.\n\nThat move followed a complaint from cybersecurity company Kaspersky Lab, which had said that a new version of its SafeKids application had been declined by Apple's operating system.\n\nApple said it was proud to have helped thousands of developers in Russia, including Kaspersky.\n\n\"We worked with Kaspersky to get their app in compliance with rules that were put in place to protect children,\" Apple said in a statement. \"They now have 13 apps on the App Store and we have processed hundreds of updates for them.\"\n\nAlso Read | Regulation may be needed for Apple, Google app stores if changes not made: Australian regulator\n\nAnton Gorelkin, a member of Russia's State Duma committee on information and communications, said the fine would not destroy Apple, but would be noticeable on financial statements.\n\n\"Gradually we are approaching the kind of seriousness in the conversation with Big Tech that has long been on display in the West,\" Gorelkin wrote on Telegram. ($1 = 74.8200 roubles)"}, {"Article Image": "https://www.thehindu.com/business/markets/xgtts1/article34392569.ece/ALTERNATES/LANDSCAPE_615/bse", "Article's Title": "Sensex surges over 350 points in early trade, Nifty tests 14,750", "Article's Text": "Bajaj Finance was the top gainer in the Sensex pack, rising around 3%.\n\nEquity benchmark Sensex rallied over 350 points in early trade on April 28, tracking gains in index-heavyweights HDFC twins, Bajaj Finance and Infosys.\n\nThe 30-share BSE index was trading 351.06 points or 0.72% higher at 49,295.20.\n\nSimilarly, the broader NSE Nifty advanced 95.30 points or 0.65% to 14,748.35.\n\nBajaj Finance was the top gainer in the Sensex pack, rising around 3%, followed by Bajaj Finserv, Bajaj Auto, SBI, IndusInd Bank, M&M, Bharti Airtel, HDFC twins, Kotak Bank and Infosys.\n\nOn the other hand, UltraTech Cement, Reliance Industries and Maruti were among the laggards.\n\nIn the previous session, Sensex ended 557.63 points or 1.15% higher at 48,944.14, and Nifty surged 168.05 points or 1.16% to 14,653.05.\n\nForeign institutional investors (FIIs) were net sellers in the capital market as they offloaded shares worth ₹1,454.75 crore on April 27, while domestic institutional investors (DIIs) bought shares worth ₹1,463.44 crore, according to provisional exchange data.\n\nAccording to V.K. Vijayakumar, Chief Investment Strategist at Geojit Financial Services, there are some consistent trends in the market now.\n\n“One, despite the bad news on the COVID front, the market has been maintaining the upside momentum. Two, FIIs have been consistent sellers (above ₹10,000 crore in April, so far) and DIIs have been consistent buyers. These trends are likely to continue in the short run and markets are likely to remain strong,” he said.\n\nIt appears that markets are looking into the post-second wave scenario which is likely to emerge in May, he noted, adding that global support to markets continues with positive economic data from the U.S.. The FOMC comment expected later in the day is likely to reaffirm the U.S. Fed’s accommodative stance, imparting further resilience to markets.\n\n“Meanwhile, Q4 results continue to be good. Axis Bank’s numbers confirm the trend of leading private sector banks growing their market share. Early bird midcap results are much better than expected. Midcaps are likely to outperform in the coming days,” he said.\n\nElsewhere in Asia, bourses in Hong Kong and Tokyo were trading on a positive note in mid-session deals, while Shanghai and Seoul were in the red.\n\nBourses on Wall Street ended with losses in overnight sessions.\n\nMeanwhile, international oil benchmark Brent crude was trading 0.09% lower at $65.82 per barrel."}, {"Article Image": "https://static01.nyt.com/images/2021/04/28/arts/28gatsby1/28gatsby1-facebookJumbo-v2.jpg", "Article's Title": "‘Great Gatsby’ Musical Sets Creative Team", "Article's Text": "After F. Scott Fitzgerald’s classic novel about America and aspiration entered the public domain in January, a glut of variations emerged that imagined the sentimental old sport, Jay Gatsby, as gay, a zombie or the hero of his own graphic novel.\n\nAnd now, the hopeless romantic is getting the musical treatment.\n\n“The Great Gatsby, A New Musical,” announced on Wednesday, has enlisted a formidable team to bring the self-made millionaire’s story to the stage. Florence Welch, the frontwoman of Florence + the Machine, will write the lyrics and compose the music with Thomas Bartlett, who collaborated with Sufjan Stevens on “Mystery of Love,” the Oscar-nominated song from “Call Me by Your Name.”\n\nRebecca Frecknall, who recently oversaw a popular new version of Anton Chekhov’s “Three Sisters” at London’s Almeida Theater, will direct, and the Polish-American playwright Martyna Majok, who won the Pulitzer Prize for Drama in 2018 for “Cost of Living,” will write the book.\n\nThe adaptation will be produced by Len Blavatnik (“Moulin Rouge!,” “Jagged Little Pill”) and the English singer-songwriter Amanda Ghost in association with Robert Fox, an executive producer of the Netflix series “The Crown.”"}, {"Article Image": "https://static01.nyt.com/images/2021/04/28/business/28economy-briefing-Fedoverview/28economy-briefing-Fedoverview-facebookJumbo.jpg", "Article's Title": "The Fed’s patient approach could be tested soon.", "Article's Text": "Instead, central bankers, including the Fed chair, Jerome H. Powell, have been emphasizing that the economy remains far from fully healed. Millions are out of work and the coronavirus has not been fully contained in the United States or globally — threatening an uneven economic recovery and risking the spread of new variants.\n\nThe policy-setting Federal Open Market Committee has said it wants to see “substantial” progress toward its goals of full employment and stable inflation before slowing down the monthly bond purchases. The hurdle for rate increases is even higher: A return to maximum employment and inflation that exceeds 2 percent and is expected to slightly overshoot that for some time.\n\nAt their meeting in March, the central bank’s officials signaled that interest rates were likely to remain near-zero through 2023 if the economy shapes up as they expect. But investors will be keenly focused on hints about the path ahead when Mr. Powell gives a post-meeting news conference around 2:30 p.m., after the committee’s 2 p.m. statement release.\n\n“By the time of the June meeting well over half of all Americans should be partially vaccinated, and the level of employment could be a few million greater than it is now, allowing the F.O.M.C. to discuss some tangibly improving outcomes,” Michael Feroli, chief U.S. economist at J.P. Morgan, wrote in a research note. “For now, however, we think the message from the committee will be little changed from the one delivered six weeks ago.”\n\nStill, the Fed’s commitment to patience — an approach that focuses on real-world outcomes, not just expected ones — is in for its first big challenge. As unemployment drops and inflation picks up, two trends that are expected to play out in the coming months, monetary policymakers are likely to face growing calls to dial back their support to prevent conditions from getting out of hand."}, {"Article Image": "https://static01.nyt.com/images/2021/05/02/arts/02opening-web-fleming/02opening-web-fleming-facebookJumbo.jpg", "Article's Title": "Renée Fleming Was Back Onstage. Here’s What Happened First.", "Article's Text": "The soprano Renée Fleming sauntered onstage in a shimmering long-sleeve gown, perched on a chair and started to sing.\n\nFor a renowned performer decades into her career, it might have been an uneventful Wednesday evening at the Shed, the expansive performance space in Hudson Yards. But after 13 months in a pandemic, a sea of faces was a novel sight for the opera star and the trio accompanying her.\n\n“Wow, applause!” she remarked after finishing the meditative opening number. “Very exciting.”\n\nExciting, indeed — and no mean feat to pull off.\n\nAfter the Shed and other flexible New York performance spaces lobbied to let audiences in, it got the go-ahead to open its doors for a live event on April 2, after 386 days of shutdown. Fleming’s April 21 show there, before a limited audience, was the fourth performance in a series co-sponsored by NY PopsUp, a public-private program aimed at reviving the arts."}, {"Article Image": "https://static01.nyt.com/images/2021/04/27/business/27DisinfoEvent-Still/frame_00_delay-0-facebookJumbo.jpg", "Article's Title": "Times Event: How to Save Ourselves From Disinformation", "Article's Text": "Times subscribers can R.S.V.P. for this free event on Wednesday, May 26 at 7 p.m. Eastern, 4 p.m. Pacific.\n\nIt spreads through social media and message boards. Through television pundits and talk radio. And in daily conversations, in every corner of the world. Disinformation can change minds and fuel movements. But is it an unstoppable force? How can we resist a torrent of falsehoods and distortions?\n\nJoin Sarah Silverman, comedian and host of The Sarah Silverman Podcast, and Times reporters Kevin Roose, Sheera Frenkel and Davey Alba as they untangle the roots of disinformation, and the effects it has on our world.\n\nWe’ll hear from people who emerged from radicalization, including Caolan Robertson and Caleb Cain, who was profiled in the recent Times podcast “Rabbit Hole”. And we’ll analyze how a few brave readers interact with news on social media — with help from David Rand, a professor of management and cognitive science at the Massachusetts Institute of Technology. (Want to participate in this segment? You can find all the details after you register.)"}, {"Article Image": "https://static01.nyt.com/images/2021/04/27/obituaries/27Martin1/merlin_186948303_149af99d-3128-4444-a09d-f021c13bec84-facebookJumbo.jpg", "Article's Title": "John C. Martin, 69, Dies; Led Drugmaker in Breakthroughs", "Article's Text": "John C. Martin, who became a billionaire by developing and marketing a daily single-dose pill that transformed H.I.V. into a manageable disease and who popularized another drug that cures hepatitis C, died on March 30 in Palo Alto, Calif. He was 69.\n\nHis death, in a hospital, was confirmed by Gilead Sciences, based in Foster City, Calif., where he was chief executive from 1996 to 2016 and executive chairman from 2016 until he retired two years later. The cause was head injuries suffered the day before, when he fell on a sidewalk while walking home in Old Palo Alto, according to the Santa Clara County medical examiner.\n\nA chemist who rocketed from research director to chief executive of Gilead in six years, Dr. Martin turned a struggling pharmaceutical firm with a staff of 35 into a $100 billion company based in Foster City, Calif., with some 12,000 employees.\n\nGilead jolted the industry with several major scientific breakthroughs, beginning with the development of the first anti-influenza pill, Tamiflu, which the company licensed to the Swiss drugmaker Hoffman-La Roche in 1996. Its advance against hepatitis C came in 2014, with the marketing of Sovaldi, which has been said to cure 90 percent of patients with that liver virus."}, {"Article Image": "https://www.thehindu.com/business/Economy/n3sdo6/article32605997.ece/ALTERNATES/LANDSCAPE_615/NKV-ASIANDEVELOPMENTBANK1", "Article's Title": "India’s GDP to grow at 11% this fiscal, says ADB", "Article's Text": "The Asian Development Bank cautioned that the surge in COVID-19 cases may put India’s economic recovery at risk.\n\nThe Indian economy is projected to grow at 11% in the current financial year amid the “strong” vaccine drive, said ADB on Wednesday, while cautioning that the recent surge in COVID cases may put the country’s economic recovery at “risk”.\n\n“India’s economy is expected to grow 11% in fiscal year (FY) 2021, which ends on March 31, 2022, amid a strong vaccine drive,” ADB said in its flagship Asian Development Outlook (ADO) 2021 released on Wednesday.\n\nHowever, the Asian Development Bank (ADB) cautioned that the surge in COVID-19 cases may put the country’s economic recovery at risk.\n\nFor FY2022, India’s GDP is expected to expand at 7%, it added.\n\nFurther, it said the gross domestic product (GDP) of South Asia is expected to rebound to 9.5% this year, following a contraction of 6% in 2020, before moderating to 6.6% next year (2022), it said.\n\nADB said the economic growth in developing Asia is set to rebound to 7.3% this year, supported by a healthy global recovery and an early progress on COVID-19 vaccines. The projected resurgence follows a 0.2% contraction last year.\n\n“The region’s growth is forecast to moderate to 5.3% in 2022. Excluding the newly industrialized economies of Hong Kong, China; the Republic of Korea; Singapore; and Taipei, China, developing Asia’s economic activity is expected to grow 7.7% this year and 5.6% in 2022,” said the report.\n\nThe report projects that most economies in developing Asia will see healthy growth this year and in 2022.\n\nDeveloping Asia comprises 46 members of ADB list on the basis of geographic group. These include new industrialised economies, countries in Central Asia, East Asia, South Asia, Southeast Asia and the Pacific.\n\nThe report said in China, strong exports and a gradual recovery in household consumption will boost economic activity this year.\n\nChina’s gross domestic product (GDP) is forecast to expand 8.1% in 2021 and 5.5% in 2022. East Asia’s GDP is expected to grow 7.4% in 2021 and 5.1% in 2022, it said.\n\nThe report said rising exports are boosting some economies in Developing Asia amid strengthening global economic activity, including a rebound in manufacturing.\n\nProgress on the production and delivery of COVID-19 vaccines has contributed to this momentum, but the pandemic remains the biggest risk for the region as potential delays in vaccine rollouts or significant new outbreaks could undermine growth.\n\nIncreasing geopolitical tensions, production bottlenecks, financial turmoil from tightening financial conditions, and long-term scarring like learning losses due to school closures are among other risk factors, said the report.\n\nGrowth is gaining momentum across developing Asia, but renewed COVID-19 outbreaks pose a threat to recovery, said ADB Chief Economist Yasuyuki Sawada.\n\n“Economies in the region are on diverging paths. Their trajectories are shaped by the extent of domestic outbreaks, the pace of their vaccine rollouts, and how much they are benefiting from the global recovery,” Mr. Sawada said."}, {"Article Image": "https://www.thehindu.com/business/Economy/jr8vl5/article34304590.ece/ALTERNATES/LANDSCAPE_615/NKV1-RUPEES", "Article's Title": "Rupee surges 22 paise to ₹74.44 against the U.S. dollar in early trade", "Article's Text": "In the previous session, the rupee had settled at 74.66 against the American currency.\n\nThe Indian rupee advanced by 22 paise to 74.44 against the U.S. dollar in opening trade on April 28, as a positive trend in equity markets lifted investor sentiment.\n\nForex traders said the appreciation in the local unit could be restricted amid a sharp rise coronavirus infections and fatalities in the country and as investors await the U.S. Federal Reserve’s monetary policy outcome.\n\nAt the interbank forex market, the local unit opened flat at 74.49 against the U.S. dollar, then gained some strength to quote at 74.44, a rise of 22 paise over its last close.\n\nIn the previous session, the rupee had settled at 74.66 against the American currency.\n\n“A rebound of the U.S. dollar and rise coronavirus infections and fatalities climbing to another record high in India could keep appreciation bias limited,” Reliance Securities said in a research note.\n\nAdditionally, month-end dollar demand from importers and traders looking to take profits on short positions on the U.S. currency could also cap appreciation bias, it added.\n\nThe dollar index, which gauges the greenback’s strength against a basket of six currencies, rose 0.10% to 91.\n\n“The U.S. dollar Index was trading higher this morning in Asian trade tracking the strength of the bond yields ahead of the Fed meeting outcome,” the Reliance Securities note said.\n\nBesides the Fed, investors are looking to U.S. President Joe Biden’s first address to a joint session of Congress.\n\nGlobal oil benchmark, Brent crude futures, rose 0.05% to $66.45 per barrel.\n\nOn the domestic equity market front, the BSE Sensex was trading 382.66 points or 0.78% higher at 49,326.80 in early deals, while the broader NSE Nifty rose 104.55 points or 0.71% to 14,757.60.\n\nForeign institutional investors were net sellers in the capital market on April 27 as they sold shares worth ₹1,454.75 crore, as per exchange data."}, {"Article Image": "https://static01.nyt.com/images/2021/04/28/obituaries/Anthony-02/Anthony-02-facebookJumbo.jpg", "Article's Title": "Ole Anthony, Scourge of Televangelists, Dies at 82", "Article's Text": "Ole Anthony, a former Air Force intelligence specialist and Texas political operative who found Jesus in 1972, built a following among the down-and-out of east Dallas, and then used that movement to take down a rogue’s gallery of unscrupulous televangelists and faith healers, died on April 16 at a house in Dallas that he shared with several members of his organization, the Trinity Foundation. He was 82.\n\nHis death was confirmed by Pete Evans, a Trinity member who, like Mr. Anthony, had taken a vow of poverty before acquiring a private investigator’s license, which let him peer deeper into the lifestyles of rich and famous preachers.\n\nMr. Evans said that the cause had not been determined, but that Mr. Anthony had been in declining health since breaking his hip in 2020.\n\nA tall, blond, irascible son of Norwegian immigrants with an ever-present pipe, Mr. Anthony resembled both an Old Testament prophet and an Old West prospector — a fitting look for a man who, like a latter-day Jeremiah, believed it was his job to call out religious scam artists, especially those who had grown wealthy off their congregations."}, {"Article Image": "https://www.thehindu.com/sci-tech/technology/6q0fdd/article34428322.ece/ALTERNATES/LANDSCAPE_615/Apple-AP-2jpg", "Article's Title": "Regulation may be needed for Apple, Google app stores if changes not made: Australian regulator", "Article's Text": "Apple and Google representatives told senators that their tight control over their stores and the associated revenue-sharing requirements were needed to enforce and pay for security measures to protect consumers from harmful apps and practices\n\n(Subscribe to our Today's Cache newsletter for a quick snapshot of top 5 tech stories. Click here to subscribe for free.)\n\nAustralia's competition watchdog said on Wednesday regulation may be required to address the significant market power app stores owned by Alphabet's Google and Apple have if they do not take steps to assuage concerns.\n\nThe global dominance of Apple's App Store and Google's Play Store has been criticised by some app makers for mandatory revenue sharing payments and strict inclusive rules by both companies.\n\nThe Australian Competition and Consumer Commission (ACCC), in a digital platforms services inquiry interim report, said app developers should be allowed to provide customers with alternative payment options and data collected by Google and Apple should be kept separate from their other operations.\n\nThe ACCC also called for consumers to be allowed to change or remove pre-installed or default apps.\n\nAlso Read | What do Apple's new iPhone privacy changes mean for consumers and businesses?\n\n\"We have identified a number of areas where action is required and have put forward potential measures to address areas of particular concern,\" ACCC Chair Rod Sims said.\n\n\"There is a window of opportunity for Apple and Google themselves to take steps to improve outcomes for app developers and consumers.\"\n\nApple and Google did not immediately respond to requests for comment.\n\nA panel of U.S. senators questioned both companies last week over their dominance and whether they were abusing their power at the expense of smaller competitors.\n\nApple and Google representatives told senators that their tight control over their stores and the associated revenue-sharing requirements were needed to enforce and pay for security measures to protect consumers from harmful apps and practices.\n\nSims said the ACC would look at changes of laws in other countries and other proposals, but \"regulation may be required if Apple and Google fail to take steps to address the concerns identified.\""}, {"Article Image": "https://www.thehindu.com/sci-tech/technology/internet/8oq3e7/article34428337.ece/ALTERNATES/LANDSCAPE_615/Apple-APjfif", "Article's Title": "EU to hit Apple with antitrust charge this week", "Article's Text": "Spotify took its grievance to the European Commission in 2019, saying Apple unfairly restricts rivals to its own music steaming service Apple Music\n\n(Subscribe to our Today's Cache newsletter for a quick snapshot of top 5 tech stories. Click here to subscribe for free.)\n\nEU antitrust regulators are set to charge iPhone maker Apple this week with blocking rivals on its App Store following a complaint by music streaming service Spotify, a person familiar with the matter said on Tuesday.\n\nThe move, the first EU antitrust charge against Apple, could lead to a fine as much as 10% of Apple's global revenue and changes in its lucrative business model.\n\nReuters was the first to report about the imminent EU antitrust charge in March.\n\nSweden's Spotify took its grievance to the European Commission in 2019, saying Apple unfairly restricts rivals to its own music steaming service Apple Music.\n\nAlso Read | Regulation may be needed for Apple, Google app stores if changes not made: Australian regulator\n\nIt also complained about the 30% fee levied on app developers to use Apple's in-app purchase system (IAP).\n\nThe EU competition enforcer, which has four Apple investigations including the Spotify complaint, declined to comment.\n\nApple referred to its March 2019 blog following the Spotify complaint, which said its App Store helped its rival to benefit from hundreds of millions of app downloads to become Europe's largest music streaming service."}, {"Article Image": "https://static01.nyt.com/images/2021/04/26/arts/00nft-collectors-1/00nft-collectors-1-facebookJumbo.jpg", "Article's Title": "As Auctioneers and Artists Rush Into NFTs, Many Collectors Stay Away", "Article's Text": "A handful of auctions this month testing the appetite for a type of investment known as NFTs seemed likely to prolong the nascent fad for ownership of works that exist only in the digital world. Missing from those transactions, however, were the blue-chip collectors who typically drive the art market’s sales.\n\nIndustry experts have observed a growing wedge between a new generation of digital speculators and an older school of art collectors who say their concerns about the quality, ownership and authenticity of NFTs have gone unresolved, even as their fears of legal challenges grow.\n\nMore than a dozen collectors interviewed for this article said that NFTs raise copyright and other issues that sellers and buyers have not fully thought through. “Absolutely none of my clients are buying NFTs,” said Lisa Schiff, an art adviser in New York. “I have people curious, but we are waiting to let the dust settle first.”\n\nNFTs, or nonfungible tokens, have taken off in music, art and sports, created and sold in marketplaces for crypto goods with names like Rarible and OpenSea, or in collaboration with auction houses. Sotheby’s made its initial push into the market earlier this month with a three-day auction of NFTs by the anonymous artist known as Pak. A flurry of blockchain bidding pushed the total price to around $17 million — paid through the digital platform Nifty Gateway with Ethereum cryptocurrency and credit cards — for 6,150 minted NFTs. One work, a single gray pixel, sold for more than $1.35 million after a prolonged bidding war."}, {"Article Image": "https://static01.nyt.com/images/2021/04/27/business/27dc-biden-tax01alt/27dc-biden-tax01alt-facebookJumbo.jpg", "Article's Title": "Biden Seeks $80 Billion to Beef Up I.R.S. Audits of High-Earners", "Article's Text": "Republicans criticized the agency repeatedly in the Obama administration for targeting conservative political groups, including several affiliated with the Tea Party, for tax scrutiny. A federal watchdog concluded in 2017 that I.R.S. officials had also targeted liberal groups, not just conservative ones, in questioning their claims of tax-exempt status.\n\nMany economists and tax experts welcomed the proposal, which they said would help reverse years of declining enforcement actions against companies and the rich at the agency.\n\n“The plan is good news for honest filers and businesses, the budget, and the rule of law,” said Chye-Ching Huang, the executive director of the Tax Law Center at N.Y.U. Law. “Stopping tax cheats from having an unfair advantage helps honest businesses to compete and thrive.”\n\nPrevious administrations have long talked about trying to crack down on tax evasion. This month, the head of the I.R.S., Charles Rettig, told a Senate committee that the agency lacked the resources to catch tax cheats, including those who hide income from cryptocurrencies, costing the government as much as $1 trillion a year.\n\nThe erosion of resources at the I.R.S. was detailed in a Congressional Budget Office report last year that examined the agency’s work from 2010 to 2018. During that time, the I.R.S.’s annual budget declined by 20 percent and its staff declined by 22 percent. Funding for enforcement activities fell by nearly a third.\n\nWith less money and staff, the I.R.S. was forced to become more lax at enforcing tax laws. Examinations of individual tax returns fell by 46 percent and audits of corporate tax filings fell by 37 percent, according to the Congressional Budget Office.\n\nThe top 1 percent of earners have become far less likely to be audited in recent years. That is because they are far more likely than low- or middle-income Americans to earn money from businesses, capital gains and other sources of income that are not wages. Research suggests nearly all wage income is reported correctly to the agency. Capital and business income are far more likely to be underreported."}, {"Article Image": "https://static01.nyt.com/images/2021/04/28/business/28dc-biden-econ01/28dc-biden-econ01-facebookJumbo.jpg", "Article's Title": "Biden Details $1.8 Trillion Plan for Workers, Students and Families", "Article's Text": "Mr. Biden would also invest $80 billion in personnel and technology enhancements for the I.R.S., in hopes of netting $700 billion in additional revenues from high earners, wealthy individuals and corporations that evade taxes.\n\nRepublicans and conservative activists have criticized all those measures. Administration officials told reporters that the president would be open to financing the spending and tax credits in his plan through alternative means, essentially challenging Republicans to name their own offsets, as Mr. Biden did with his physical infrastructure proposal.\n\nStill, many of the details in his new proposal poll well with voters across the political spectrum. Much of the package could win the support of the full Democratic caucus in Congress, which would need to band together to pass all or part of the plan through the fast-track process known as budget reconciliation, which bypasses a Senate filibuster.\n\nExpanded access to government-subsidized preschool and community college may have broad appeal.\n\nWorkers with only high school degrees are often stuck in low-wage jobs, and two-thirds of mothers with young children are employed, and thus need reliable child care. The high cost of quality day care and pre-K puts these services out of reach for many families, who may rely on informal networks of relatives and neighbors who are untrained in early education.\n\nExpanding access to pre-K has been particularly popular over the past decade in states and cities, including some with Republican governors. A large body of research shows that achievement gaps between poor and middle-class children emerge in the earliest years of childhood and are present on the first day of kindergarten. Administration officials contend that free, quality early childhood education can both help cash-strapped parents and build students’ skills in ways that will help them become more productive workers.\n\nStill, there are major disagreements about how generous any expansion of pre-K should be. President Barack Obama’s administration generally favored a centrist approach in which new seats were geared toward lower-income families."}, {"Article Image": "https://static01.nyt.com/images/2021/04/27/books/27rightbooks1-sub/27rightbooks1-sub-facebookJumbo.jpg", "Article's Title": "‘There Is a Tension There’: Publishers Draw Fire for Signing Trump Officials", "Article's Text": "After the 2020 election, those ideals have been tested in unprecedented ways.\n\n“There is a tension there — on the one hand, I’ve always believed, and I still believe fervently, that we need to publish major voices that are at the center of the national conversation, whether we agree with them or not,” said Adrian Zackheim, the president and publisher of two Penguin Random House imprints, including Sentinel, which is geared toward conservative books. “On the other hand, we have to be leery of public figures who have come to be associated with blatant falsehoods.”\n\nAt the same time, conservative publishers and some literary agents say there is enormous demand for books from voices on the right, particularly now that Republicans are out of power, and publishers are demonstrating that they are eager to work with politicians they regard as acceptable mainstream conservatives. Politico reported that William P. Barr, Trump’s former attorney general, sold a book about his role at the Justice Department. Sentinel acquired a book by Supreme Court Justice Amy Coney Barrett, whose appointment by Mr. Trump last year caused an uproar on the left. Ms. Conway’s book will be published by Threshold, a Simon & Schuster imprint focused on conservative titles, though a person familiar with it said it would be more of a memoir than a standard political book.\n\nSimon & Schuster declined to comment.\n\nThe company published several political blockbusters last year, including Mary L. Trump’s “Too Much and Never Enough” and John R. Bolton’s “The Room Where It Happened.” This year has been more complicated.\n\nIn January, Simon & Schuster dropped plans to release Mr. Hawley’s book following criticism of his efforts to overturn the election and accusations that he helped incite the Capitol riot on Jan. 6. This month, it said it would not distribute a title, published by Post Hill Press, a small publisher in Tennessee, by one of the police officers in the raid that killed Breonna Taylor.\n\nThe petition drafted by Simon & Schuster staff, which circulated on social media last week, demanded the company cancel Mr. Pence’s books, not sign any more former Trump officials and end its distribution deal with Post Hill Press. Jonathan Karp, Simon & Schuster’s chief executive, wrote a letter to the company saying it wouldn’t take those actions.\n\n“We come to work each day to publish, not cancel,” Mr. Karp wrote, “which is the most extreme decision a publisher can make, and one that runs counter to the very core of our mission to publish a diversity of voices and perspectives.”"}, {"Article Image": "https://www.thehindu.com/static/theme/default/base/img/og-image.jpg", "Article's Title": "Russia, Uzbekistan offer Remdesivir to India", "Article's Text": "A pharmaceutical firm each from Russia and Uzbekistan have conveyed readiness to supply Remdesivir, the antiviral drug indicated for COVID-19 treatment, to India where its demand has soared in recent weeks.\n\nBesides Remdesivir, a few Russian firms have also expressed interest in exporting oxygen- production devices.\n\nSharing information received through Indian Embassy in Moscow and Embassy of Uzbekistan in New Delhi, the Pharmaceuticals Export Promotion Council of India (Pharmexcil) said Russian firm Pharmasyntez had said it would be able to export 3-4 lakh packs per week of Remdeform (INN Remdesivir) to India.\n\nJV Jurabek Laboratories of Uzbekistan had made an offer to supply Remdessa (Remdesivir), a lyophilisate used for the preparation of an infusion solution, to India.\n\nPharmexcil also conveyed to its members the commercial offers for oxygen-production devices from different Russian suppliers. These can be airlifted at short notice from Russia to India, its communication said.\n\nThe commercial offers for Remdesivir supplies from the firms come in the face of a presumed shortage of the drug in India, making those in need, in desperation, ready to shell out many times over the set price.\n\nOn its part, the government has warned unscrupulous elements against indulging in hoarding and black marketing.\n\nThe offers are expected to generate considerable interest among Indian firms, even though U.S. biopharmaceutical firm Gilead Sciences has raised objections to Russia manufacturing its patented drug.\n\nGilead has a voluntary licensing programme with seven firms in India. On Monday, it said the seven firms have “significantly accelerated production of Remdesivir by scaling up their batch sizes, adding new manufacturing facilities and/or onboarding local contract manufacturers across the country. While these efforts are expected to increase availability of Remdesivir in the coming weeks, Gilead will donate at least 4,50,000 vials of Veklury (Remdesivir) to the Government of India.”\n\nPharmexcil Director General Ravi Udaya Bhaskar, however, does not anticipate any issue for those intending to get into agreements with Russia for Remdesivir.\n\nSources in the Council said following the communication to the members, a few firms are in discussion with the Russian and Uzbekistan firms.\n\n“Taking into account severe shortages through indigenous sources, Indian pharma importers may like to consider the Russian offer. Members may kindly be aware that import permissions from CDSCO needs to be taken while importing the said product,” a Pharmexcil communication said.\n\nAdvising members to make their own decisions before finalising their business transactions, the Council said “it is understood that Pharmasyntez is one of the largest drug manufacturers in the Russian Federation. It has acquired rights to produce and sell the Remdeform (Remdesivir, lyophilized powder for injection, generic drug of Veklury of Gilead Sciences). The Russian firm has estimated delivery time to be 8-10 days.\n\nOn the oxygen-production devices, Pharmexcil shared details of the commercial offers made by a few Russian suppliers. The equipment can be airlifted at short notice from Russia to India. Air India and Aeroflot flights from Moscow to Delhi have cargo supply capacities."}, {"Article Image": "https://ichef.bbci.co.uk/news/1024/branded_news/1504D/production/_118239068_durex-nurofen_comp_gettyimages-1265236636_1220780456.jpg", "Article's Title": "Reckitt: More sex, fewer colds drive sales at Durex maker", "Article's Text": "Chief executive Laxman Narasimhan said: \"Demand for Lysol and Dettol continues to be strong as consumers remain vigilant to the spread of the virus and see use of our products, and improved hygiene habits, as a way of protecting their health and regaining normality in their lives.\""}, {"Article Image": "https://static.toiimg.com/thumb/msid-82288429,width-1070,height-580,imgsize-921935,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "Brexit trade deal: European Union lawmakers clear post-Brexit trade deal with Britain", "Article's Text": "I warmly welcome the @Europarl_EN vote in favour of the EU-UK Trade and Cooperation Agreement.The TCA marks the f… https://t.co/oXc0Uef9DC — Ursula von der Leyen (@vonderleyen) 1619593925000\n\nBRUSSELS: The European Parliament has voted overwhelmingly in favour of the post-Brexit trade deal between Britain and the European Union , clearing the last hurdle towards full ratification of the accord.EU lawmakers backed the trade and cooperation agreement by 660 votes to five, with 32 abstentions, the parliament announced on Wednesday. The vote took place on Tuesday, but coronavirus working restrictions meant the result was not immediately known.Parliament's consent brings to an end over four years of acrimonious negotiations and debate and lingering mistrust as Britain ended 47 years of EU membership.European Commission president Ursula von der Leyen welcomed the European Parliament's approval of a trade accord with Britain and said its implementation was crucial.\"The TCA (Trade and Cooperation Agreement) marks the foundation of a strong and close partnership with the UK,\" von der Leyen said on Twitter. \"Faithful implementation is essential,\" she said."}, {"Article Image": "https://static.toiimg.com/thumb/msid-82284510,width-1070,height-580,imgsize-669793,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "White House considering intellectual property waiver for Covid-19 vaccines", "Article's Text": "WASHINGTON: The White House is considering options for maximizing global production and supply of Covid-19 vaccines at the lowest cost, including backing a proposed waiver of intellectual property rights, but no decision has been made, press secretary Jen Psaki said on Tuesday.\"There are a lot of different ways to do that. Right now, that's one of the ways, but we have to assess what makes the most sense,\" Psaki said, adding that US officials were studying whether it would be more effective to boost existing manufacturing of the vaccines in the United States.US trade representative Katherine Tai had not made a recommendation on the issue, and President Joe Biden had not made a decision, she said.US lawmakers and nonprofit groups are heaping pressure on the Biden administration to back the temporary patent waiver to help poor countries contain the pandemic as India and other countries battle a massive surge in cases.The United States and several other countries have thus far blocked negotiations at the World Trade Organization WTO ) about a proposal led by India and South Africa that would waive the IP rights of pharmaceutical companies to allow developing countries to produce Covid-19 vaccines.Proponents are pushing Washington to change course ahead of another WTO meeting on the issue on April 30.Critics say waiving the WTO's agreement on Trade-Related Aspects of Intellectual Property could reduce the safety of vaccines, and that setting up production in new places would sap resources needed to boost production in existing locations.Tai discussed the issue on Monday with drugmakers Pfizer and AstraZeneca PLC, noting her interest in a solution that gave developing countries a role in addressing critical gaps in vaccine production and distribution.US industry executives believe Tai may be leaning toward backing the waiver after she called the gaping divide between developed and developing countries' access to medicines \"completely unacceptable\" and said industry needed to make sacrifices in times of crisis."}, {"Article Image": "https://static.toiimg.com/thumb/msid-82289987,width-1070,height-580,imgsize-947583,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "Coronavirus crisis India: From Amazon to Tata, industry steps up to combat India's coronavirus crisis", "Article's Text": "BENGALURU: Global and Indian firms are flexing their industrial muscle to help the world's second biggest population battle coronavirus, coming to the rescue of a public health system buckling under the weight of surging infections and deaths.Amazon.com, Intel and Google , as well as Indian firms Tata Sons, Reliance Industries and JSW Steel have pitched in with everything from airlifts of medical equipment and funding pledges to making medical oxygen.\"What we need is better planning with the recognition that government's capacity is limited and therefore requires private participation,\" said economist Madhura Swaminathan of the Indian Statistical Institute in Bengaluru.Hospitals struggling with a massive second wave of infections are turning away patients as beds and oxygen supplies run out, and social media brim with desperate calls for help in finding supplies of oxygen and drugs such as remdesivir.A record increase in deaths over the prior 24 hours carried India's toll past 200,000 on Wednesday, a situation that experts blame on lack of oxygen supplies and infrastructure challenges.On Tuesday Amazon said it would ship 100 ICU ventilator units to India from the United States.It had earlier worked with partners to airlift more than 8,000 oxygen concentrators and 500 ventilators from Singapore, relying on its massive global logistics network to hasten procurement, a spokeswoman said.Google promised $18 million in new funding for India, including advertising support for public health campaigns.India's largest steel maker by market value, JSW, has stopped making some of the construction raw material as it diverts resources to turning out liquid oxygen instead.From April 21 to 23, JSW supplied 898 tonnes of oxygen each day from its plants, equivalent to about 13% of the combined daily demand for 6,785 tonnes of the life-saving gas in India's 20 worst-hit states.JSW said it was building large Covid patient centres around its plants, so that they can be serviced via a pipeline.Billionaire Mukesh Ambani's Reliance Industries tweaked manufacturing at its oil refineries to produce hundreds of tonnes of oxygen for hard-hit areas such as Maharashtra , India's richest and worst-hit state.Tata Group, one of India's oldest conglomerates, imported 24 cryogenic containers to transport liquid oxygen, while its Tata Steel unit ramped up oxygen supply.\"The government single-handedly cannot deal with this crisis any more, it is very important that the corporate sector gets into motion,\" said Kunal Kundu, India economist at Societe Generale in Bengaluru.\"We need all the help we can get.\"Economist Swaminathan called for the scope of private sector contribution to be widened beyond the merely voluntary.\"Anybody who has surplus funds and equipment should step in to help,\" she added. \"In terms of logistics, beds, oxygen, hospitals, the private sector has to be asked to do its task as part of policy.\""}, {"Article Image": "https://static.toiimg.com/thumb/msid-82284884,width-1070,height-580,imgsize-1311481,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "ADB India GDP Forecast: ADB projects India’s growth to rebound 11% in 2021-22, Covid surge could hurt economic normalization", "Article's Text": "NEW DELHI: The Asian Development Bank ADB ) projects India’s gross domestic product (GDP) will rebound strongly by 11.0% in fiscal year (FY) 2021-22 ending on March 31, 2022 due to continued economic recovery boosted by increased public investment, vaccine rollout, and a surge in domestic demand. The forecast assumes that vaccines are deployed extensively across the country and the second wave of the coronavirus disease ( Covid-19 ) pandemic is contained.In its latest Asian Development Outlook (ADO) 2021, the Manila based ADB forecasts India’s economic growth to moderate to 7.0% in FY2022 as base effects disappear. The economy is expected to have contracted by 8.0% in FY2020 in line with the government’s second advance estimate. The IMF recently estimated the Indian economy to grow by 12.5% in the current financial year.“India’s economy faced its worst contraction in FY2020 due to the Covid-19 shock. With large government stimulus and the ongoing vaccination drive, we expect economic activity will continue its recovery started from the third quarter of FY2020 and rebound strongly in the current fiscal year with an uptick in domestic demand, especially in urban services,” said ADB Country Director for India Takeo Konishi. “The government’s boost to public investment through its infrastructure push, incentives for manufacturing, and continued support to boost rural incomes will support India’s accelerated recovery.”Risks to the outlook tilt to the downside. An uncertain pandemic trajectory with a prolonged second wave despite the vaccination push could affect India’s economic normalization. The forecast, however, expects the economic impact of the second wave to be relatively muted compared to the first wave in line with global experience. Other downside risks include further tightening of global financial conditions on fast recovery in developed countries, which would apply pressure on India’s market interest rates, a statement from ADB said.Economists say the sharp surge in Covid-19 vaccination and the localised lockdowns is expected to hurt growth and economic recovery underway may slowdown significantly.Economic activity will continue to normalize and recover, backed by government measures over the past year including a large stimulus in FY2020 and a steep increase in capital expenditure budget in FY2021 . Increased government expenditure on health care, water, and sanitation will strengthen the country’s resilience against future pandemics. Private investment is expected to pick up on improving sentiment and risk appetite, as well as accommodative credit conditions.Domestic demand is expected to remain the main driver of growth. A faster vaccine rollout will boost urban demand for services, while the rural demand will be boosted by robust agriculture growth and continued government support to farmers by expanding irrigation, improving value chains, and increasing farm loan limits.Forecast of a normal monsoon and bumper harvest of summer crops will further boost the agriculture sector. The government’s push to the manufacturing sector through the production-linked incentive scheme will expand domestic production and help integrate domestic manufacturing with global supply chains.Inflation, after rising to 6.2% in FY2020, is projected to moderate to 5.2% in FY2021 as good harvests and supply chain recovery contain domestic food inflation. Inflation is expected to ease further to 4.8% in FY2022 on moderating domestic demand as the economy returns to normal. This will help the central bank maintain an accommodative stance by ensuring ample liquidity and keeping long-term interest rates from rising.In FY2021, the current account deficit will equal to 1.1% of GDP with imports outpacing exports on rising domestic demand and higher oil prices. Exports and imports will grow moderately in FY2022 as global demand normalizes bringing down the current account deficit marginally to 1.0%.In FY2021, the fiscal deficit is budgeted to fall to the equivalent of 6.8% of GDP with capital spending rising sharply from revised expenditure in FY2020 by 26.2%. The government revised the fiscal deficit for FY2020 from 3.5% of GDP before the pandemic to 9.5%."}, {"Article Image": "https://static.toiimg.com/thumb/msid-82288223,width-1070,height-580,imgsize-1397151,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "War-rooms and oxygen: India's IT companies scramble to handle Covid-19 surge", "Article's Text": "Covid-19 'war rooms'\n\nBENGALURU: India's giant IT firms in Bengaluru and other cities have set up Covid-19 \"war-rooms\" as they scramble to source oxygen, medicine and hospital beds for infected workers and maintain backroom operations for the world's biggest financial firms.Banks including Goldman Sachs and Standard Chartered , who run much of their global back office operations from large office parks in Bengaluru, Chennai or Hyderabad, have put in place the infrastructure to vaccinate thousands of employees and their families, when age restrictions are lifted on May 1.Workers at huge technology service providers Accenture and Wipro say teams are working 13-14 hours daily, under growing pressure and struggling to deliver on projects as staff call in sick and take time off to care for friends and relatives.They play down any threat of a collapse in operations - but at stake if the surge continues is the infrastructure put in place by the world's biggest financial companies in cost-cutting drives that have left them deeply-reliant on the big Indian offices.\"Employees have contracted Covid-19 since the second wave began, causing severe pressure for projects that are nearing deadlines,\" said one employee at Accenture, asking not to be named because he was not authorised to speak to the media.Five other sources at Accenture confirmed the growing issues with pressure of work. Accenture said it was providing some medical care and covering the cost of vaccinations for its employees but did not comment on the impact on productivity. Wipro did not immediately respond to requests for comment.India's second wave of infections has seen at least 300,000 people test positive each day for the past week, overwhelming healthcare facilities and crematoriums and driving an increasingly urgent international response.Asia's IT capital Bengaluru, desperate to calm a daily infection rate five times higher than in last year's first wave, on Monday ordered a full lockdown that allows ordinary residents to leave their homes only briefly between 6 a.m. and 10 a.m.Local IT managers say they struggled to get global chiefs outside India to recognise the seriousness of the outbreak.India's gigantic IT and call centre service industry employs more than 4.5 million people directly and relies substantially on thousands of graduates under the age of 30.They are paid a fraction of western salaries and had largely ridden out the Covid-19 pandemic working from home until the relaxing of restrictions in recent months spurred companies to call more employees back to the office.Managers at Goldman Sachs' massive complex in Bengaluru, for example, told staff in early March to prepare to return to full-scale office working.Chief executive officer David Solomon said then that the bank owed it to its incoming class of analysts and interns to have them come to work in offices for at least part of the summer.The company quickly U-turned, sending all but essential employees home on March 27 as cases began to rise.New strains of the virus have since sent India's case numbers soaring to global records and brought more infections among younger Indians.But all 15 of the large companies Reuters spoke to this week said that they now had vaccination schemes in place and several outlined Covid-19 \"war-rooms\" they had launched to support staff and secure oxygen and other supplies.\"The problem was that those outside India were anxious not to be seen to be jumping the queue,\" says a senior manager who runs a workforce of more than 600 staff at a global bank in Bengaluru, asking not to be named.\"The India CEO and others here said: we don't care what it looks like, people are dying.\""}, {"Article Image": "https://static.toiimg.com/thumb/msid-82284845,width-1070,height-580,imgsize-34834,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "American biz rallies to help India fight Covid-19", "Article's Text": "BENGALURU: In a big show of solidarity, numerous American businesses have stepped up to join India’s fight against the unprecedented pandemic crisis. The US Chamber of Commerce and CEOs from over 40 companies have set up a US public-private partnership called Global Task Force on Pandemic Response: Mobilising for India, to provide India with critical medical supplies, vaccines, oxygen and other life-saving assistance amid the surge in coronavirus cases.The partnership is supported by the Chamber’s US-India Business Council, the Business Roundtable and the US-India Strategic Partnership Forum. The announcement was part of a US Chamber of Commerce-hosted meeting with US Secretary of State Antony Blinken and deputy assistant to the president and coordinator for Indo-Pacific Affairs, Kurt Campbell.“What we are witnessing in India is a stark reminder that while the United States has turned a corner in our efforts to combat the pandemic, our global partners are facing a staggering health crisis that requires a substantial public-private response,” said Suzanne Clark, president and CEO of the US Chamber of Commerce. “This global crisis requires a global response, and the American business community could not be better positioned, or more determined, to help lead the way.”The US Chamber of Commerce Foundation has developed resources for India’s Covid-19 crisis, including a portal through which American companies can offer in-kind donations. Apple CEO Tim Cook said the company would be donating to support relief efforts on the ground. “Amid a devastating rise of Covid cases in India, our thoughts are with the medical workers, our Apple family and everyone there who is fighting through this awful stage of the pandemic. Apple will be donating to support and relief efforts on the ground,” Cook wrote. Earlier, on Monday, Microsoft CEO Satya Nadella and Google CEO Sundar Pichai had spoken about initiatives their companies were taking for India.Amazon India said it has procured 100 ventilators through its global resources to immediately import these into India. Amazon will work closely with Medtronic for these units to be airlifted into India and it expects the consignment to enter the country in the next two weeks. “We are doing more and are committed to support our country in the fight against Covid-19,” said Amit Agarwal, global SVP & country head of Amazon India.Mastercard has made a $10 million commitment to address Covid-19-related needs in India, including access to hospital resources and additional oxygen supplies. US biopharma company Gilead said it will donate a minimum of 450,000 vials of Veklury (Remdesivir, which Gilead markets as Veklury) to the Indian government. Gilead Sciences said the company is providing its voluntary licensing partners with technical assistance, support for the addition of new local manufacturing facilities and the donation of active pharmaceutical ingredients (API) to rapidly scale up production of Remdesivir. Deloitte CEO Punit Renjen wrote on LinkedIn: “I hope that the 1,000 oxygen concentrators provided by Deloitte today and an additional 11,000 being sourced by the end of this week from my fellow CEO colleagues, will help the wider international effort to assist the people of India. India will prevail.”"}, {"Article Image": "https://static01.nyt.com/images/2021/04/28/business/28econ-brf-boeing/merlin_187014315_83cccc6a-cc87-458f-b8ae-4d9ae07604c2-facebookJumbo.jpg", "Article's Title": "Boeing Sees Recovery Ahead Despite Continuing Losses: Live Updates", "Article's Text": "Live Boeing Sees Recovery Ahead Despite Continuing Losses: Live Updates RIGHT NOW Allbirds, Silicon Valley’s favorite footwear, is talking to banks about an I.P.O.\n\nBoeing posts a $561 million loss, but sees “an inflection point” for the industry. Boeing 777X jets at the company’s production facility in Everett, Wash. Boeing said it continued to expect the recovery to take years to unfold. Credit... Elaine Thompson/Associated Press Boeing said Wednesday that it lost $561 million in the first three months of the year as it emerged from its prolonged 737 Max crisis and contended with new problems related to the 787 Dreamliner jet. Revenue fell 10 percent to $15.2 billion compared with the same period last year. But, like his counterparts at major airlines, Dave Calhoun, Boeing’s chief executive, struck an optimistic tone. “While the global pandemic continues to challenge the overall market environment, we view 2021 as a key inflection point for our industry as vaccine distribution accelerates and we work together across government and industry to help enable a robust recovery,” he said in a statement. In an investor presentation, Boeing said it continued to expect the recovery to take years to unfold, with passenger traffic unlikely to return to 2019 levels until 2023 or 2024. It also said its financial results for this year “hinge” on a recovery in the commercial airplane market. At the end of March, the company had a backlog of more than 4,000 commercial airplane orders, valued at $283 billion. Its defense and space backlog was valued at $61 billion. The company’s results were weighed down by quality concerns with the 787, though deliveries of the plane resumed at the end of the quarter “following comprehensive reviews,” Boeing said in a statement. The company also suffered a $318 million charge related to development of the next Air Force One, which was affected by a pandemic slowdown and problems with a key supplier, which Boeing recently sued. It was also the first full quarter since the Federal Aviation Administration’s decision in November to lift its ban on the 737 Max, which had been grounded globally nearly two years following two fatal crashes in which hundreds were killed. Since the ban was lifted, Boeing has delivered more than 85 Max’s to customers worldwide. It also reported that it sold more planes than were canceled in February and March, its first months of positive sales in more than year. Nearly two dozen airlines have put the plane back into service on more than 26,000 flights, Boeing said. Mr. Calhoun also provided an update on an electrical concern with some Max planes that was disclosed this month. The F.A.A. has said the issue could affect the operation of a backup power control unit in 106 planes worldwide, all of which have been grounded. Boeing is working with the agency on a fix that should take a “few days per airplane” once approved, Mr. Calhoun said in a letter to staff.\n\nThe Fed’s patient approach could be tested soon. The Fed has held interest rates near zero since March 2020. Credit... Stefani Reynolds for The New York Times The Federal Reserve is expected to keep its monetary policy in crisis mode when it concludes its latest meeting on Wednesday, even as the economy improves. The question is how long it will take for the recovery to progress enough to inspire the central bank to change course. The Fed has held interest rates near zero since March 2020, and is buying bonds at a pace of about $120 billion a month. Those policies make many types of borrowing cheap and push investors toward riskier, more active investments — sending money coursing through the economic system and speeding up growth. Fed officials are in no rush to dial back that support — even as coronavirus vaccines become widely available, the labor market heals and retail spending rises, helped along by government stimulus checks. Instead, central bankers, including the Fed chair, Jerome H. Powell, have been emphasizing that the economy remains far from fully healed. Millions are out of work and the coronavirus has not been fully contained in the United States or globally — threatening an uneven economic recovery and risking the spread of new variants. The policy-setting Federal Open Market Committee has said it wants to see “substantial” progress toward its goals of full employment and stable inflation before slowing down the monthly bond purchases. The hurdle for rate increases is even higher: A return to maximum employment and inflation that exceeds 2 percent and is expected to slightly overshoot that for some time. At their meeting in March, the central bank’s officials signaled that interest rates were likely to remain near-zero through 2023 if the economy shapes up as they expect. But investors will be keenly focused on hints about the path ahead when Mr. Powell gives a post-meeting news conference around 2:30 p.m., after the committee’s 2 p.m. statement release. “By the time of the June meeting well over half of all Americans should be partially vaccinated, and the level of employment could be a few million greater than it is now, allowing the F.O.M.C. to discuss some tangibly improving outcomes,” Michael Feroli, chief U.S. economist at J.P. Morgan, wrote in a research note. “For now, however, we think the message from the committee will be little changed from the one delivered six weeks ago.” Still, the Fed’s commitment to patience — an approach that focuses on real-world outcomes, not just expected ones — is in for its first big challenge. As unemployment drops and inflation picks up, two trends that are expected to play out in the coming months, monetary policymakers are likely to face growing calls to dial back their support to prevent conditions from getting out of hand. But Mr. Powell and his colleagues have played down concerns about overheating and inflationary warnings that hark back to the 1970s and 1980s, arguing that the world has changed in recent decades. “We had 3.5 percent unemployment, which is a 50-year low, for much of the last two years before the pandemic,” Mr. Powell said in a recent “60 Minutes” interview. “And inflation didn’t really react much. That’s not the economy we had 30 years ago.”\n\nAdvertisement Continue reading the main story\n\nDeutsche Bank’s profit is its best in seven years. Deutsche Bank’s best quarter in seven years was a vindication for Christian Sewing, the chief executive who took over in 2018. Credit... Ralph Orlowski/Reuters Deutsche Bank reported its best quarterly profit in seven years Wednesday as it benefited from lively financial markets and avoided losses from the investment firm Archegos Capital that has battered rivals. The first-quarter profit of 900 million euros, or $1.1 billion, was better than expected and suggested that Deutsche Bank may be emerging from a decade of scandals and disasters that earned it a reputation as Europe’s most troubled lender. James von Moltke, the chief financial officer of Deutsche Bank, said in response to a question about Archegos during an interview with Bloomberg News that the bank had been able to exit its involvement without a loss. That is in contrast to rivals like Credit Suisse, which lost $4.7 billion it had lent to Archegos after the firm collapsed in March. Swiss bank UBS disclosed Tuesday that it lost $774 million from its involvement with Archegos. Deutsche Bank, like most big corporations, is assessing how the pandemic may have permanently changed the way employees do their jobs. Mr. von Moltke said the bank was working on a plan that would allow employees to work from home two or three days a week. Like many of its peers, Deutsche Bank has benefited from frenetic activity on financial markets, earning fees as it helped governments issue debt to finance stimulus programs or sell shares in blank-check investment vehicles known as SPACs. The bank said it had also benefited from a European Central Bank stimulus program that effectively pays commercial lenders to provide credit to businesses and consumers in the eurozone. In addition, Deutsche Bank slashed the amount of money it set aside for bad loans. The financial results are a vindication for Christian Sewing, the bank’s chief executive, who has been trying to show large shareholders like the private equity firm Cerberus Capital Management that he can generate consistent profits. Deutsche Bank shares rose 9 percent in Frankfurt trading Wednesday and are up more than 20 percent since the end of January. “Our first quarter is further evidence that Deutsche Bank is on the right path,” Mr. Sewing said in a statement.\n\nA key question: How much inflation is too much? Federal Reserve Chair Jerome Powell. Credit... Pool photo by Susan Walsh When Jerome H. Powell, the Federal Reserve chair, speaks to reporters in a webcast news conference on Wednesday afternoon, he’s likely to face questions about a simmering topic: inflation. Prices are expected to pop in the coming months, both as inflation indexes lap very weak 2020 readings and as supply chains experience short-term reopening bottlenecks. The unknowns facing the Fed, and the investment world, are how big the jump will be and how long it will last. Most forecasters and the Fed itself expect the increases to be only temporary. But some economists have warned that they could be significant enough to become a problem as businesses reopen, consumers start to spend their savings and the government pumps stimulus money into the economy. If the increases are big enough and sustained, the Fed could find itself in a tough spot, forced to choose between letting prices rise or raising interest rates before the labor market is fully recovered. Inflation also worries stock investors: If the Fed lifts interest rates to cool off the economy, it could make investing in bonds more attractive and corporate borrowing more expensive, both bad news for equities. The Fed wants inflation to average 2 percent annually over time, and it defines that goal using the Commerce Department’s headline personal consumption expenditure index. But officials look at a variety of indicators to gauge conditions. Here’s where a handful of critical inflation measures stand and, when it’s relevant, where economists surveyed by Bloomberg expect them to go in the coming months: P.C.E., the Fed’s preferred gauge: 1.6 percent in February, and expected at 2.3 percent in March and 2.2 percent for the full year.\n\nCore P.C.E., which strips out volatile food and energy prices: 1.4 percent in February, and expected at 1.8 percent in March and 1.9 percent for the full year.\n\nConsumer Price Index, an important Labor Department gauge: 2.6 percent in March and expected at 2.6 percent for the full year.\n\nProducer Price Index, a measure of wholesale prices: 4.2 percent in March, the highest since 2011.\n\nUniversity of Michigan consumer inflation expectation for next year: 3.7 percent as of this month, up from 3 percent at the start of the year.\n\nUniversity of Michigan consumer inflation expectation for five years from now: 2.7 percent as of this month, little changed from start of the year.\n\nFive-year, five-year forward inflation expectation rate, a market-based measure: 2.25 percent in recent days, roughly matching 2018 levels. Fed officials regularly point out that inflation has been too tepid in recent years, not too high, and they don’t expect that to change quickly. To raise rates, they say, they would need to see that inflation was going to remain higher sustainably — for instance, if it came alongside heftier wage increases. Part of the Fed’s comfort with a period of faster price gains is that consumer and business expectations have remained relatively low, despite some recent increases. If people aren’t anticipating higher prices, it’s likely to put a lid on how much more companies can charge.\n\nAdvertisement Continue reading the main story\n\nBond yields rise before the Fed’s policy decision. Google’s logo on a building in Zurich, Switzerland. Alphabet, Google’s parent company, reported a strong increase in revenue last quarter. Credit... Arnd Wiegmann/Reuters Government bond yields jumped on Wednesday ahead of the latest Federal Reserve policy meeting. Economists expect Fed officials to keep interest rates near zero and continue their bond-buying program, but central bank watchers will be looking for clues for how much longer the support will last as the U.S. economy improves. Higher yields on government bonds may reflect expectations that the Fed is inching closer signaling that it will change its policy, including raising its benchmark rate, even if that’s still years in the future. Jerome H. Powell, the Fed chair, will speak to reporters Wednesday afternoon. Fed officials have said they would telegraph any changes well in advance and expected the current rise in inflation to be temporary, which would diminish the need for a monetary policy reaction. The yield on 10-year Treasury notes as high as 1.65 percent on Wednesday. Yields on British and German government bonds also climbed. “We think risks around this meeting are firmly skewed toward higher rates,” analysts at ING said of bond yields. “This is particularly true if the Fed breaks with its cautious tone of late, or simply decides to hedge its bets by saying it will react as appropriate if the economy overheats.” Stocks The S&P 500 opened slightly higher on Wednesday.\n\nDeutsche Bank rose nearly 9 percent after the German bank reported its best quarterly profit in seven years. The bank also avoided losses from the collapse of Archegos Capital Management that were a blow to some of its European rivals.\n\nAlphabet, rose more than 4 percent trading after the tech company said revenue in its most recent quarter increased sharply from the same period a year ago, supported by strong demand for online advertising.\n\nPinterest shares dropped more than 13 percent after the company said the growth in its number of users would probably slow down as pandemic restrictions were lifted.\n\nOn Wednesday, Boeing, Apple, Facebook and Ford report earnings. European Economy A group that monitors risk in the eurozone warned on Wednesday that corporate bankruptcies could surge after government support measures for businesses expire. “More than a year of restrictions on economic activity has so far not resulted in financial instability,” the European Systemic Risk Board said in a statement. “However, the threat of a wave of insolvencies looms large.”\n\nThe risk board, led by Christine Lagarde, the president of the European Central Bank, said that governments needed to continue supporting businesses even after the economic effects of the pandemic fade.\n\nCatch up: Google’s and Microsoft’s profits soar as pandemic benefits Big Tech. Credit... Hiroko Masuike/The New York Times Google’s parent company, Alphabet, said on Tuesday that it posted revenue of $55.31 billion in the first three months of the year, up 34 percent from a year earlier, and net profit more than doubled to $17.93 billion in the first quarter. It was the third straight quarter of record profit for the company. Advertising revenue rose 32 percent in the quarter spurred by strong demand for search marketing. Alphabet also generated $6 billion in YouTube ads, an increase of 49 percent.\n\nMicrosoft on Tuesday reported that its quarterly sales grew at one of its strongest rates in years, as the company was poised to cross $2 trillion in market value. Revenue rose to $41.7 billion for the fiscal third quarter, up 19 percent from a year earlier, its biggest quarterly increase since 2018. Profits jumped 44 percent to $15.5 billion. Gaming revenue grew 50 percent, fueled by spending on the new Xbox gaming console, which was launched late last year, as well as on Xbox content and services.\n\nThe coffee giant Starbucks said that its sales in the United States made a “full recovery” in the first three months of the year. Same-store sales in the U.S. climbed 9 percent in the company’s second quarter compared with the same period last year, while global revenues climbed 11 percent to $6.7 billion. Starbucks made a profit of $659 million in the quarter."}, {"Article Image": "https://images.livemint.com/img/2021/04/28/600x338/2021-04-20T190932Z_338262551_RC2VZM9VYL46_RTRMADP_3_CRYPTO-CURRENCY-DOGECOIN_1619619970972_1619620180410.JPG", "Article's Title": "Dogecoin rallies over 20% on Elon Musk’s SNL tweet", "Article's Text": "Tesla Inc founder Elon Musk on Wednesday sent out a cryptic tweet on digital currency, Dogecoin , ahead of his hosting of American live television sketch comedy and variety show, Saturday Night Live (SNL), on 8 May 2021. This sent prices of the controversial cryptocurrency more than 20% higher to $0.33.\n\nAt 6.50pm IST, DOGE was trading 15.5% higher at $0.32, after moving in a wide range of $0.26-$0.33 over the past 24 hours, as per Coingecko. The digital asset with a market capitalization of over $41 billion is the sixth-biggest cryptocurrency in the world.\n\nMusk is one of the most prominent backers of the digital currency. “The Dogefather SNL May 8,\" Musk tweeted on Wednesday, hinting at the possibility of the crypto asset featuring on the upcoming episode of SNL.\n\nEarlier, the American show did a skit on what NFTs or non-fungible tokens are. In the sketch, actors dressed up as the US secretary of the treasury, Janet Yellen and comic character Robin explain the phenomenon through an Eminem-inspired rap. The SNL skit is an example of how cryptocurrency scene has exploded globally in recent months.\n\nMusk, who is the one of the richest persons in the world, has time and again come out in support of DOGE. Some of his earlier tweets read, “Dogecoin is the people’s crypto\" and “No highs, no lows, only Doge.\"\n\nLast week, DOGE had hit a high of $0.41 after Musk tweeted a painting of DOGE but slipped to a low of $0.25 later as experts highlighted the lack of fundamentals driving the rally.\n\nCreated in 2013 a joke or a meme in comparison to the world’s oldest cryptocurrency, bitcoin, DOGE, has jumped over 13,000% over the last one year.\n\nExperts warn that investing in cryptos is highly risky and one should have complete understanding of how the industry works and one’s own risk profile before dabbling into the world of cryptocurrency.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter."}, {"Article Image": "https://images.livemint.com/img/2021/04/28/600x338/6af6bbda-8888-11eb-86b1-fff15c0c578a_1618227667809_1619574423709.jpg", "Article's Title": "Markets rally for third day; Sensex ends 790 pts higher led by banks, financials", "Article's Text": ""}, {"Article Image": "https://images.livemint.com/img/2021/04/28/600x338/hdfc-amc-ipo_1619596985143.jpg", "Article's Title": "HDFC AMC’s steady market share erosion worries investors", "Article's Text": "Shares of HDFC Asset Management Co. Ltd have been under pressure for the past one month and the company’s March quarter results doesn’t seem to have given enough reasons to rejoice.\n\nThe company has been losing market share for the past two years. On a quarterly average asset under management basis, the fund house’s share stood at 16.7% in March, down from 17.2% in December and 16.9% a year ago. On an outstanding AUM basis, the market share erosion is steep, from 20.9% in FY20 to 15.7% in FY21. What’s more is the share in terms of unique investors has also come down for the company. In short, investors are preferring rivals over the company for products.\n\nThat said, there were bright spots in the March quarter performance. Operating revenue showed a 6% growth from the year ago period and other income growth too was healthy. Much of the boost to net profit came through growth in income rather than reduction in expenses as was the case in the December quarter. Further, systemic investment plans (SIP) inflows showed traction by growing 24% year on year. Another positive outcome was the increase in equity AUM during the quarter. Equity products have a higher yield and a reduction here has a larger impact on profitability compared with other products. The company reported an increase in the share of equity in overall AUM to 41.2%, better than industry level.\n\nIn a call with analysts on Tuesday, the management said that it would continue to diversify through new product launches in order to keep AUM growth healthy. To be sure, analysts believe that the trend for AUM growth must be watched in the wake of the second wave. “Improvement in equity flows is encouraging but imminent lockdowns could temper next few months,\" wrote analysts at Jefferies India Pvt Ltd.\n\nThe company’s valuation has been under pressure due to its market share loss. However, with a new chief at the top now and with new product launches, analysts believe the company could engineer a turnaround and gain lost market share.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter."}, {"Article Image": "https://images.livemint.com/img/2021/04/28/600x338/09e0689a-8d89-11eb-afe3-8cef4ccbbd72_1616698708138_1619579454839.jpg", "Article's Title": "Experts recommend 'buy' on oxygen maker company stock", "Article's Text": "Amid soaring demand for oxygen cylinders across nation, stock market experts have suggested investors to look at oxygen maker company stocks for immediate short-term time horizon. They said that due to the rise in their business, such company shares are expected to give sharp upside move. They named Linde India shares to buy today. They said that the stock has soared more than 100 per cent in the last three months and it is still poised for upside moves in immediate short-term.\n\nSpeaking on the fundamentals supporting Linde India share price rally Avinash Gorakshkar, Head of Research at Profitmart Securities said, \"Due to the spread of Covid-19 pandemic, demand for oxygen cylinders across nation has suddenly gone up to an alarming level. Recently, some corporate (ITC, TCS) have also come forward to supply oxygen cylinders to the Indian hospitals and they are ordering Linde India for oxygen cylinder supply. So, Linde India is expected to get major boost in its business outlook and revenue generation in immediate short-term time-frame. But, the stock has been rising for the last three months and profit-booking is awaited in it. I would advise investors to buy Linde India shares after the profit-booking, not at current market price.\"\n\nUnveiling important levels that would help investors maximise their income from the stock; Mudit Goel, Senior Research Analyst at SMC said, \"Linde India share price has strong support at ₹1820 and one can keep on accumulating this stock till it is trading above this level. But, one should strictly maintain the stop loss below ₹1820. The immediate short-term Linde India share price target is ₹2000 and ₹2070.\"\n\nLinde India share price history suggests that the oxygen maker company's stock has delivered more than 100 per cent to the investors in the last three months. Linde India share price had closed at ₹899.40 on 27th January 2021 while it closed at ₹1887 on 27th April 2021. However, in the last one year, Linde India share price has skyrocketed from ₹535.65 to ₹1887.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter."}, {"Article Image": "https://images.livemint.com/img/2021/04/28/600x338/TVS_1548145365397_1619592631679.jpg", "Article's Title": "TVS Motor’s all-time high Ebitda margin in Q4 gets amply rewarded by investors", "Article's Text": "NEW DELHI : Shares of TVS Motor Company Ltd rose more than 15% in early deals on Wednesday on the National Stock Exchange, hitting a new 52-week high. Not without reason. The two-wheeler company’s March quarter (Q4FY21) results, announced after market hours on Tuesday, have surprised the Street positively, especially on the profit margin front.\n\nThe company’s standalone earnings before interest, tax, depreciation, and amortization (Ebitda) margin expanded by around 60 basis points vis-à-vis the December quarter to 10.1%. One basis point is one-hundredth of a percentage point. On a year-on-year basis, Ebitda margin has improved by 304 basis points. According to Jefferies India Pvt. Ltd, TVS Motor’s Ebitda per vehicle increased by 12% sequentially and this measure, along with Ebitda margin were both at an all-time high.\n\nThe upshot: Ebitda for the March quarter has increased by 119% to Rs536 crore. This on the back of about 53% year-on-year revenue growth to Rs5,322 crore, which was helped by 46% sales volume growth. A combination of price hikes, better product mix (higher exports) and cost control initiatives have helped the company’s operating performance. It’s also worth noting that this comes at a time when investors are worried about the adverse impact of higher raw material cost pressures on profit margins for auto firms. Against this backdrop, TVS Motor’s performance is encouraging for investors.\n\nThe company’s March quarter results have prompted many analysts to upgrade their earnings estimates for financial year 2022 and financial year 2023.\n\nTo be sure, the road ahead is not particularly smooth. For one, the second covid-19 wave is expected to weigh on auto demand. TVS Motor management told analysts that it expects covid-19 lockdowns to impact demand in the June quarter. Further, higher commodity costs continue to be a worry for auto companies, which means investors will closely watch how margins shape up in the near future.\n\nIn general, analysts reckon TVS Motor would be able to cope with these challenges effectively. Analysts from Ambit Capital Pvt. Ltd said in a report on 28 April, “With industry-beating growth in the domestic two-wheeler market continuing, along with stronger growth in exports, the rising profitability trajectory would result in around 53% earnings CAGR in FY21-FY23E.\" CAGR is compound annual growth rate.\n\nJefferies’ analysts said in a report on 27 April, “Notwithstanding near-term covid issues in India, we expect a synchronized demand recovery in domestic and export markets driving strong 14%/13% volume growth for TVS in FY22/FY23.\"\n\nThe only hitch is that the stock’s sharp appreciation on Wednesday suggests investors are capturing a good portion of the optimism and earnings recovery. Currently, TVS Motor’s shares trade at around 29 times estimated earnings for financial year 2022, based on Jefferies’ data.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter."}, {"Article Image": "https://images.livemint.com/img/2021/04/28/600x338/35719c1d03e140f9aa95fab637ca8050-35719c1d03e140f9aa95fab637ca8050-0_1619589002395_1619589020416.jpg", "Article's Title": "Record defaults are clouding India’s stock, bond markets", "Article's Text": "Credit markets are sounding warnings for other asset classes amid India’s unprecedented surge in Covid-19 cases. Firms have defaulted on at least 57 billion rupees ($763 million) of domestic bonds this year, the most on record for a similar period. Traders expect more. They’ve pushed spreads on A rated local corporate bonds over AAA notes to a 17-year high, a grim sign for the small businesses that tend to have those weaker ratings and that form the bedrock of the $2.7 trillion economy.\n\nThat all suggests the need for further caution in the equities and government bond markets, which have held up better despite volatility. While the defaults are largely among smaller, often unlisted borrowers, they add to challenges for policy makers already grappling with one of the world’s worst bad debt ratios. On top of that, the Covid outbreak risks fanning inflation as local curbs disrupt supply chains, threatening to limit central bank options for juicing the economy.\n\n“One can’t expect there will be good news on the economy, good news on earnings and stock prices will go up,\" said Sunil Subramaniam, managing director of Sundaram Asset Management Co. “It is undoubtedly, going to be a volatile period for the market.\"\n\nEquities\n\nIn recent days, equity and government bond investors have focused on more optimistic signals as the government has refrained from broad national lockdowns. India’s S&P BSE Sensex Index rose to a three-week high Tuesday after a U.S. decision to offer vaccine support, and continued up Wednesday.\n\nBut there have been mounting concerns. Despite the recent rally, Indian stocks are lagging their Asian peers this month after outperforming for four straight quarters.\n\nAnd while some long-term investors including Fidelity International and Invesco have said they are seeking opportunities to add stocks, sentiment broadly has soured among global equity funds. Foreign investors sold a net $1.2 billion of Indian shares this month through April 26, on course for the worst outflow since March 2020.\n\nIndia’s central bank was able to tame yields with its announcement of a QE-like bond buying program earlier this month. That’s sent the yield on the benchmark 10-year sovereign bond down about 12 basis points in April, set for the biggest retreat in six months. The rupee has rebounded in the past few days as well, coming off its weakest against the dollar since August earlier this month.\n\nBut yields have been volatile, with traders nervous about the possibility of more government spending to mitigate the impact of the pandemic. Finance Minister Nirmala Sitharaman has raised the possibility of bringing forward planned borrowing.\n\nJitters about the supply of government notes have already resulted in underwriters being forced to rescue bond auctions and the central bank having to cancel some.\n\nMeanwhile, concerns about the economic impact from the Covid resurgence have left the rupee down about 2.1% in April against the dollar despite the recent rally, set for the worst drop since March last year.\n\nThe corporate bond market has been flashing other red lights.\n\nCredit-default swaps for State Bank of India -- considered a proxy for India’s default risk -- widened to a 9-month high this week, before dropping back Tuesday after the news about the U.S. vaccine assistance, CMA data show.\n\n“Markets are getting cautious on the credit side as economic growth is seen slowing down, raising concerns distressed debt may rise,\" said Vikas Goel, managing director and chief executive officer at PNB Gilts Ltd.\n\nSBI Funds Management Pvt., India’s biggest asset manager, has said they are watchful on the financial sector as relief announced by authorities such as a debt moratorium has hidden the true picture of the stress the pandemic has exerted.\n\nAcross industries, some borrowers are finding it harder to tap the credit market. Issuance of local-currency notes graded A and below fell to a 10-year low of 1.8 billion rupees in April.\n\n\n\n\n\nThis story has been published from a wire agency feed without modifications to the text. Only the headline has been changed.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter."}, {"Article Image": "https://images.livemint.com/img/2021/04/28/600x338/2021-04-28T044732Z_1_LYNXMPEH3R059_RTROPTP_3_INDIA-ALCOHOL-HOMEDELIVERY_1619585446160_1619585455275.JPG", "Article's Title": "Zomato files for ₹ 8,250 crore IPO", "Article's Text": "Food delivery startup Zomato, backed by Ant Group, has filed for an initial public offering of up to ₹8250 crore, draft papers submitted to the market regulator showed. The online food delivery segment has seen significant growth in the last few years with Zomato and Swiggy competing head-on to grab market share.\n\nZomato's FY20 revenue had jumped over two-fold to around ₹2,960 crore from the previous fiscal.\n\nFounded in 2008 in Delhi, Zomato employs more than 5,000 people. Zomato recently raised $250 million from investors including Kora Management and Fidelity Management & Research Co., valuing the startup at $5.4 billion, according to an exchange filing in February by Info Edge India Ltd., an existing backer. Info Edge India shares were up 1.5%.\n\nIn preparation of its much-awaited public listing, Zomato had recently amended its memorandum of association earlier this month to become a public limited company, renaming itself Zomato Ltd.\n\nThe online food aggregator Zomato has rolled out home-style meals in association with partner restaurants, as an increasing number of users, sick with covid infections, seek simple meals.\n\nIt has rolled out mini-menus on its app. “Over the last few days, one of the most requested features on @zomato has been – a selection of home style food for people battling poor health. We just launched home style mini-menus along with thousands of restaurants across the country,\" Zomato’s founder Deepinder Goyal said in a post on social media platform Twitter.\n\n(With Agency Inputs)\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter."}, {"Article Image": "https://images.livemint.com/img/2021/04/28/600x338/09e0689a-8d89-11eb-afe3-8cef4ccbbd72_1616698708138_1619617248127.jpg", "Article's Title": "Investor wealth jumps over Rs6 trillion in three days of market rally", "Article's Text": "Investor wealth surged ₹6.39 trillion in three days as global support continued to pour in to boost efforts to curb the spread of new coronavirus cases and speed up vaccination.\n\nIn the last three days, the benchmark index, Sensex gained 1855.39 points or 3.88% to close at 49733.84 and the broader index, Nifty gained 532.2 points or 3.65% to close at 14864.55.\n\nDriven by the rally, the market capitalisation of BSE-listed companies soared ₹6.39 trillion to ₹208.76 trillion in three trading days.\n\n\"Markets extended gains for the third consecutive session, in continuation to prevailing buoyancy around the earnings season. Despite caution amongst global peers ahead of the Federal Open Market Committee (FOMC) meet, the benchmark opened gap-up and continues to surge higher, markets will first react to FOMC meet outcome in early trade on Thursday and then focus would shift to the monthly derivatives expiry and earnings,\" Ajit Mishra, VP - Research, Religare Broking Ltd said.\n\nBajaj Finance was the lead gainer among the Sensex pack, rising 8.32%. IndusInd Bank climbed 5.08%, Bajaj Finserv (4.03%), ICICI Bank (3.72%) and Kotak Mahindra Bank (3.52%).\n\nOn the other hand, Nestle India, HCL Tech, Larsen & Toubro, TCS, Dr Reddy's and ITC were the laggards.\n\n\"Market sentiment has been boosted by a set of strong results and continuing strong momentum in global markets, which has over-shadowed concerns over economic activity arising from renewed lockdowns and the second wave of covid-19 infections\" S Hariharan, Head - Sales Trading, Emkay Global Financial Services said.\n\nFrom the broader market, the BSE midcap and smallcap fell by 0.99% and 0.71%, respectively.\n\nBSE sectoral indices closed on a positive note with Bankex, Finance, Auto, Telecom Consumer Discretionary, and Consumer Durables rallying up to 3%.\n\nMarket breadth was positive with 1,792 stocks ending higher against 1173 ending lower on BSE. 179 stocks were unchanged. Number of shares rising to their 52-week highs stood at 239 against 35 touching their 52-week lows. Tracking the positive sentiment in the market, 310 stocks hit their upper circuits against 207 falling to their lower circuits, respectively.\n\nForeign institutional investors have net bought $5.95 billion in equity and sold $2.12 billion in debt since the beginning calendar year, while domestic institutional investors have net sold ₹12,948.76 crore worth of stocks, according to data on the exchanges.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter."}, {"Article Image": "https://images.livemint.com/img/2021/04/28/600x338/abb_1551718549706_1619586949405.jpg", "Article's Title": "ABB India reports strong operating performance in Q1, sustenance key", "Article's Text": "A key positive takeaway from ABB India's March quarter earnings was its strong operating performance with Ebitda at ₹130 crore, beating analysts' estimates. Ebitda is short for earning before interest, tax, depreciation and amortization.\n\nShares of the company rose around 2% on the NSE in Tuesday's opening trade reacting to its Q1 earnings. The company follows calendar year as financial year.\n\nABB India's strong performance in Q1FY21 was aided by lower employee costs and other expenses. On a year-on-year (y-o-y) basis these components declined by 6% and 25%, respectively. Consequently, operating margins for the quarter stood at 8.1%, as compared to 1% in the same quarter last year.\n\nOf course, a favourable base has aided this steep surge. Analysts say, the steep decline in \"other expenses\" is a positive surprise, however with business normalcy resuming, investors should brace for a reversal here. Investors would reckon that in their December quarter earnings call, the company's management had said that the benefits of their cost optimisation measures had reached a peak.\n\n\"Ebitda came in 29% above our expectation with margin rising 210 bps q-o-q (quarter-on-quarter) and highest since 4QCY18. The beat primarily came from other expenses and was 15.8% of revenue, lowest in last few quarters. We would seek clarity on the call on key drivers behind low other expenses and sustainability of this ratio going forward,\" analysts at Ambit Pvt. Ltd said in a note. ABB India analysts' call is scheduled today post market hours.\n\nThe company's order inflows declined by 7% y-o-y to ₹1,830 crore in Q1CY21 and the current order book stands at ₹4,330 crore. According to analysts, Q1 is seasonally a strong quarter and weak order inflows is a concern in coming quarters as second covid wave impact plays out.\n\nMeanwhile, its parent company, which announced earnings on Monday, said that it will be separating its e-mobility division from the electrification segment. Investors need to monitor if this development will have an impact on ABB India.\n\nOn the valuation front, analysts estimates show that the stock is trading at one-year forward price-to-earnings multiple of 64 times. This is premium to peers Siemens and Honeywell Automation. Some analysts are of the view that Honeywell Automation is better placed than ABB India and Siemens, given that the company is pure play in the automation segment. They feel, on the valuations and return ratio parameters as well, th Honeywell is more attractive.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter."}, {"Article Image": "https://images.livemint.com/img/2021/04/28/600x338/2021-04-28T135633Z_1_LYNXMPEH3R0XX_RTROPTP_3_TURKEY-CRYPTO-CURRENCY-BAN_1619618937496_1619618949026.JPG", "Article's Title": "No more kebabs for bitcoins as Turkey's crypto-payment ban looms", "Article's Text": "ISTANBUL: Kebab chef Kadir Oner hoped to boost his new business by accepting payment in cryptocurrencies, but a ban by Turkish authorities will force him next month to fall back on payment methods as traditional as his spit-roasted meat.\n\nInterest in cryptocurrencies has boomed in Turkey, where double digit inflation and a tumbling lira make them an attractive alternative investment, and Oner says that customers used them to settle between 5% and 10% of their bills.\n\n\"The world is adapting to the digital era and we have to get on board with it,\" Oner said adding that crytopayments were easier than bank transactions and would have accounted for a growing slice of his doner kebab sales if allowed to continue.\n\nBut Turkey's Central Bank sees dangers in the new practice, and on April 16 banned the use of cryptocurrencies and crypto assets for purchases from April 30, citing \"irreparable\" damage and transaction risks.\n\nAuthorities last week also launched investigations into possible fraud at two cryptocurrency exchanges, and the Central Bank Governor Sahap Kavcioglu said the Finance Ministry is working on wider regulations regarding cryptocurrencies.\n\nCryptocurrencies remain little-used for global commerce even as they become increasingly mainstream assets, although companies including Tesla Inc and travel site Expedia Group Inc do accept such payments.\n\nIn Turkey, businesses like hairdressers and small grocery shops started accepting payments out of convenience as they also held crypto coins, Altug Isler, the founder of the Kripto Teknik news website said.\n\nIf the sector were well regulated, there would be potential for more cryptocurrency transactions, he said, but the central bank had taken the \"easiest option\" by closing it all down.\n\n\"The ban has became a serious issue for the fintech firms working in this area and they have started taking the crypto payment ban to court,\" Isler said. \"I think the government will make an effort to bring regulations into the cryptocurrency market and loosen this ban.\"\n\nTrading volumes in Turkish crypto exchanges doubled on the weekend following the central bank ban on crypto asset payments compared to the previous weekend, according to data from U.S. researcher Chainalysis and trading data firm Kaiko shared with Reuters.\n\nCryptocurrency trading volumes often spike during periods of volatility, with short-term traders seeking to profit from swings in price. Many market players say this is a key attraction of the emerging asset.\n\nPLANS SHELVED\n\nIn the covered halls of Istanbul's 15th century Grand Bazaar, cryptocurrency exchange shop Cointral can no longer sell gold for cryptocurrencies, its founder Ugur Hakan Cakan said.\n\nHe also had to put on hold a new initiative for e-commerce websites offering crypto asset payments.\n\n\"We have been selling gold, real estate and we were preparing to launch a new service... but the project is shelved now with the new regulation,\" Cakan said.\n\n\"I hope that this ban is a transition until the necessary regulations are put into implementation,\" he said, adding that gold for cryptocurrency sales had been popular.\n\nChef Oner says he will survive the ban on cryptopayments, which had been used to purchase more than 1,500 of his kebabs since he opened in March, but he also hoped the move would be temporary.\n\n\"I am sure when the necessary legal regulations are made we will win back the customers we've lost due to this ban.\"\n\nThis story has been published from a wire agency feed without modifications to the text.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter."}, {"Article Image": "https://images.livemint.com/img/2021/04/27/600x338/20210118023L_1615990836946_1619551070236.jpg", "Article's Title": "Discount brokers emerge big winners in the retail trading frenzy", "Article's Text": "The NSE’s Market Pulse Report, which has a wealth of information on trends in the stock markets, now includes new information on trading by individual investors. For the past few months, the report has separately called out the share of individual investors in total trading.\n\nIn the cash equities segment, their share has risen to 45% in fiscal 2021, compared to 38.8% in the preceding year. In absolute terms, their average daily turnover (ADT) nearly doubled last fiscal year. Note that turnover of institutional investors rose by a much lower 24%.\n\nA rise in retail trading activity has been witnessed globally post-covid. To start with, restrictions to tackle the pandemic gave people more time on their hands, and many fence-sitters rushed to the stock markets. What also helped the process was the crash in the markets, which made many stocks highly affordable.\n\nView Full Image Satish Kumar/Mint\n\n\n\n\n\nBut there’s more to the surge in retail trading than just the covid push, point out discount brokers, who have made the most of the increased interest, with massive market share gains. “Digital brokers have broadened the market, as they penetrated deeper into tier-2 and tier-3 towns. For Angel Broking, around 90% of new customers came from beyond tier-1 cities. Also, external factors such as rising savings, easier access to smartphones and more affordable internet packages have facilitated this growth momentum,\" said Prabhakar Tiwari, chief growth officer, Angel Broking. Leading digital brokers such as Angel, Zerodha, Upstox and Groww have cumulatively more than trebled their active client base in the past year, NSE data shows. The share of the four firms stood at 44% in March 2021 in terms of active clients, compared to 26% a year ago. To expand their reach beyond leading cities, some digital brokers have offerings in regional content as well, apart from multiple trading platforms including some that deploy algorithmic trading strategies.\n\nTiwari also said that a majority of new clients are relatively young, who are looking to diversify their investments and income streams. Another catalyst was the roaring IPO market last year, with the majority of issues listing at a huge premium to the issue price.\n\n“India is a highly under-penetrated country with equities forming a very low portion of an individual’s savings,\" added Tiwari. While there may be high scope for continued growth, the momentum gained post-covid has been reducing. The NSE data showed that the share of individual investors in turnover peaked at around 50% in July last year and has since then steadily declined to 41.8% in March 2021.\n\nThe IPO market is no longer hot, and there has been no major correction in stocks after the second covid wave. There isn’t enough action on the Street to draw fence-sitters like in the previous year.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter."}, {"Article Image": "https://images.livemint.com/img/2021/04/28/600x338/tvsmotors--621x414_1619592009260.jpg", "Article's Title": "TVS Motor shares surge to 52-week high after strong Q4 earnings", "Article's Text": "Shares of TVS Motor Company on Wednesday jumped over 17 per cent after the company posted nearly four-fold increase in its consolidated net profit for the fourth quarter ended March 31, 2021.\n\nThe stock zoomed 16.74 per cent to its one-year high of ₹661.10 on BSE.\n\nOn NSE, it rallied 17.25 per cent to ₹664 -- its 52-week high.\n\nThe earnings came in after market hours on Tuesday.\n\nTVS Motor Company posted nearly four-fold increase in its consolidated net profit to ₹319.19 crore for the fourth quarter ended March 31, 2021, riding on the back of robust sales in the domestic and international markets.\n\nThe company had reported a net profit of ₹81.84 crore during the January-March quarter of 2019-20.\n\nRevenue from operations rose to ₹6,131.90 crore in the fourth quarter from ₹4,104.71 crore in the same period of 2019-20 fiscal, TVS Motor said in a regulatory filing.\n\nDuring the period under review, the company said its total two-wheeler and three wheeler sales across domestic and international markets stood at 9.28 lakh units, up 47 per cent from 6.33 lakh units sold in the fourth quarter of 2019-20.\n\nFor the entire 2020-21 fiscal, the company posted a net profit of ₹607.50 crore as against ₹646.80 crore in the FY20, a decline of 6.07 per cent.\n\nConsolidated revenue from operations rose to ₹19,420.82 crore in FY21 from ₹18,849.31 crore in 2019-20.\n\nThis story has been published from a wire agency feed without modifications to the text. Only the headline has been changed.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter."}, {"Article Image": "https://images.livemint.com/img/2021/04/28/600x338/stocktraders-kZEB--621x414@LiveMint_1619583421420.jpg", "Article's Title": "Markets gain for third straight session amid drop in covid cases", "Article's Text": "MUMBAI: Indian markets on Wednesday surged for the third straight session amid better-than-expected earnings and dropping infection cases. Gains in global equities also boosted investor sentiment.\n\nAt 9.50 am, the benchmark Sensex rose 0.7% to 49,284 points while Nifty gained 0.64% to 14,746 points.\n\n\"Q4 results continue to be good. Axis Bank's numbers confirm the trend of leading private sector banks growing their market share. Early bird midcap results are much better than expected. Midcaps are likely to outperform in the coming days\", said V.K. Vijayakumar, chief investment strategist at Geojit Financial Services.\n\nBajaj Finance's net profit rose 42% to ₹1,347 crore in the January-March period from ₹948 crore a year ago, as per its exchange filing. Net interest income fell 2.4% to ₹4,569 crore at the end of the March quarter, compared to ₹4,684 crore a year ago\n\nLast week, ICICI Bank Ltd and HDFC Bank Ltd reported quarterly earnings. ICICI Bank reported 260% surge in net profit while net interest income advanced 17%. Asset quality for the quarter improved 46 basis points quarter-on-quarter (q-o-q) to 4.96% from 5.42%. Operating profit grew 16%, while advanced rose 14%.\n\nMeanwhile, HDFC Bank's operation growth continued to show improvement over the past three quarters as advances were up 4.7% q-o-q. NII growth was at 12.6% year-on-year (y-o-y), while net profit increased 18.2% y-o-y. Asset quality improved to 1.32% from 1.38% a quarter ago.\n\nThe focus on operational growth with strong revival in retail advances remains positive for both banks, according to a market analyst. Robust asset quality performance amid tight underwriting standards and contingency buffer provides comfort against uncertainties in the current environment, the analyst added.\n\n\"It appears that markets are looking into the post-second wave scenario which is likely to emerge in May. The global support to markets continues with positive economic data from the US. The FOMC (Federal Open Market Committee) comment expected today is likely to reaffirm the Fed's accommodative stance, imparting further resilience to markets. In brief, the gloomy covid scenario is unlikely to impact the market meaningfully,\" Vijaykumar added.\n\nMeanwhile, Maharashtra reported 66,358 new cases and 67,752 patients were discharged; Mumbai reported 4,014 new cases in 24 hours.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter."}, {"Article Image": "https://images.livemint.com/img/2021/04/27/600x338/rs-k4RC--621x414@LiveMint_1619548458824.jpg", "Article's Title": "At Bajaj Finance, asset quality concerns persist", "Article's Text": "Bajaj Finance Ltd showed the expected improvement in business growth for the March quarter. Its asset quality, too, looked less worrisome, thanks to the improvement in repayment collections. But what matters in the wake of a more virulent second wave of the pandemic is how these metrics will pan outin the coming quarters.\n\nThe consumer lender reported a 4% year-on-year growth in assets under management (AUM) on a consolidated basis. On a sequential basis, too, AUM grew by 4%, an improvement from the contraction seen in the previous quarter. But this growth came largely because of a 19% jump in mortgages of subsidiary Bajaj Housing Finance Ltd.\n\nFor Bajaj Finance, as such, AUM shrank 1%. What this means is that the consumer lender is yet to see meaningful improvement in loan growth. The pandemic has had a massive impact on its balance sheet as Indians have been unable to spend like before. The reluctance to spend exists even now with several surveys, including the Reserve Bank of India’s consumer confidence survey, showing that spending is unlikely to rise sharply in the coming months.\n\nView Full Image Satish Kumar/Mint\n\n\n\n\n\nHowever, Bajaj Finance’s management said that despite the second wave in the country already resulting in strict restrictions in large states, the lender would be able to take growth back to pre-pandemic levels. To be sure, this is not based on mere hope. In a call with analysts after the results, Rajeev Jain, Bajaj Finance managing director, said that increasing average daily business volume, along with collections, gives them this confidence.\n\n“As a high-frequency indicator, in the last 7-10 days, the company has continued to originate 50-55% of daily volumes in B2B business, 80-85% in B2C and SME business and 40-50% in mortgages,\" he added.\n\nThat said, the company’s presentation adds a caveat: “Barring a national lockdown, three-four large GDP-contributing states going into simultaneous lockdown for three-five weeks and another moratorium on loan repayment, the company is confident of delivering its long-term guidance metrics in FY22.\"\n\nSimply put, there is no way Bajaj Finance can escape the impact of the second wave, although the firm is better prepared in terms of operations than it was last year.\n\nBut there is some succour for investors on its asset quality. While headline numbers may have increased, the underlying stress and potential stress seem manageable. The lender’s gross bad loan ratio rose to 1.79% from 1.61% in the previous quarter.\n\nBajaj Finance’s restructuring loan pile was just ₹1,739 crore, against which the lender has made adequate provisioning. Write-offs were lower than last quarter. Moreover, the lender has increased provisioning to cover for pandemic risks, apart from existing bad loans. A key pressure point for the company seems to be its auto loans. The biggest stress pile was in auto loans, where the gross bad loan ratio was 9.3%. This segment also saw the third-highest restructuring loan pile.\n\nBajaj Finance has been on the mend over the past two quarters in terms of both loan growth and asset quality. But the second covid wave threatens this improvement.\n\nWhile the management remains optimistic of its prospects, going ahead, it remains to be seen whether investors would give a boost to its valuations in a hurry. The company’s stock has underperformed the broad Nifty index in the past one month, hinting at the concerns investors have.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter."}, {"Article Image": "https://images.livemint.com/img/2021/04/28/600x338/2021-04-28T051058Z_1412390562_RC2T4N9UK7DD_RTRMADP_3_USA-FED_1619613709283_1619613745464.JPG", "Article's Title": "Fed likely to keep rates near zero as recovery picks up", "Article's Text": "Federal Reserve officials are wrapping up a two-day policy meeting Wednesday at which they are likely to maintain ultralow interest rates to support the economy’s accelerating recovery.\n\nThe central bankers have noted in public comments the recent pickups in hiring, spending and inflation, but have signaled no readiness to consider changing the Fed’s key policies.\n\nThe Fed has held overnight interest rates near zero since March 2020, when the Covid-19 pandemic and related restrictions delivered a severe blow to the economy. Since June, the central bank has also been purchasing at least $80 billion of Treasury bonds and at least $40 billion of mortgage-backed securities to hold down longer-term borrowing costs for consumers and businesses.\n\nFed officials have said they would hold rates steady until the labor market is back to full strength and inflation has reached the central bank’s goal of averaging 2%. Chairman Jerome Powell has said those conditions are unlikely to materialize this year, and most Fed officials indicated last month that they expect to hold off on raising rates until 2024 at the earliest.\n\nThey also say they want to see the economy make “substantial further progress\" toward their goals of maximum employment and 2% average inflation before starting to reduce the pace of bond purchases. Mr. Powell clarified recently that officials are measuring the economy’s evolution since December, when the Fed first issued that guidance.\n\nThe economy has picked up steam in recent months as vaccination rates have risen, business restrictions have eased and the latest round of federal stimulus money has fueled spending. Consumer confidence rose in April to the highest level in 14 months, the Conference Board said Tuesday.\n\nEconomists surveyed by The Wall Street Journal expect hiring and inflation data to remain strong in the months ahead as the vaccination campaign advances, pushing economic growth to its fastest pace since 1983.\n\nFed officials have stressed that they want to see progress show up in economic data, rather than in forecasts, before they raise rates or scale back the bond purchases.\n\n“We’re just in the beginning stages of seeing these good data,\" San Francisco Fed President Mary Daly told reporters on April 16. “We’re going to need repeated months of this before we can distinguish optimism about the future from the realization of the future.\"\n\nAs more evidence of a speedy economic recovery emerges, officials will likely begin outlining when and how they expect to ratchet down the Fed’s bond purchases. Mr. Powell has said he wants to give plenty of advance warning ahead of such a shift.\n\nHis challenge will be to communicate the pivot while minimizing disruptions to financial markets.\n\nThe last time the Fed signaled a reduction in asset purchases, in 2013, it sparked a bond-market selloff known as the “taper tantrum.\" An ensuing spike in Treasury yields jolted Fed officials who worried they might undermine the economy’s recovery from the 2007-09 recession.\n\nIn contrast to that time period, the economy is now widely expected to recover faster. Yields on U.S. government bonds and certain derivatives suggest investors believe the Fed will be able to start raising rates by 2023, sooner than most central-bank officials have indicated.\n\nThis story has been published from a wire agency feed without modifications to the text.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter."}, {"Article Image": "https://images.livemint.com/img/2021/04/27/600x338/2020-05-24T105818Z_1_LYNXMPEG4N0AK_RTROPTP_3_MARUTI-SUZUKI-IN-JOBS_1594546776242_1619550559110.JPG", "Article's Title": "Maruti’s margins shrink further in Q4; road ahead may not be smooth", "Article's Text": "This calendar year has begun on a rough note for Maruti Suzuki India Ltd. The company’s shares have declined as much as 20% from their 52-week high in January on the National Stock Exchange. Not without reason. The second covid-19 wave brings uncertainty as far as demand is concerned. Plus, investors are worried about the hit to profit margins, owing to rising cost pressures.\n\nThe automaker announced its March quarter results on Tuesday and analysts are disappointed about the firm’s profit margins, in particular. Ebitda margin for the quarter stood at 8.3%, down 120 basis points compared with the December quarter. Ebitda stands for earnings before interest, tax, depreciation and amortization.\n\nView Full Image Satish Kumar/Mint\n\n\n\n\n\n“This is due to higher raw material cost and the lag effect of price hikes to pass on cost escalation,\" said Mitul Shah, head of research at Reliance Securities. “It seems that the company’s price hikes so far haven’t been sufficient to pass on the full cost escalation to customers, as the demand environment is weak, coupled with higher competitive intensity,\" he added.\n\nSequentially, Maruti’s Ebitda declined about 11% to ₹1,991 crore. For perspective: analysts at Kotak Institutional Equities had estimated Ebitda at ₹2,264 crore, assuming profit margins will hold at Q3 levels of 9.5%. Maruti had fallen far short of the Street’s estimates on margins in Q3 as well.\n\nThe company’s net profit declined by 10% year-on-year to ₹1,166 crore. A Bloomberg poll of analysts had estimated Maruti’s net profit at ₹1,699 crore. Of course, another reason for this miss is the sharp drop in other income due to mark-to-market losses on invested surplus.\n\nFor the March quarter, Maruti’s operating revenues, though, have increased by 32% over the same period last year to ₹24,024 crore. The company sold 492,235 vehicles last quarter, which is a near 28% increase year-on-year. Out of this, domestic volumes at 456,707 units increased by 26.7% year-on-year while export volumes increased by 44% year-on-year.\n\nTrue, a favourable base helped as last year’s March quarter saw a considerable drop in sales volumes, largely owing to the covid-19 lockdown. Dolat Capital Market Pvt. Ltd’s calculations show that the company’s average selling price has risen 4.5% year-on-year and 4% sequentially.\n\nAfter a lacklustre March quarter, the journey ahead will not be smooth. As mentioned earlier, near-term margin pressures are a worry. Investors will also closely watch the impact on demand of the second covid wave.\n\nCompetitive intensity is also rising. These factors are likely to weigh on sentiments for the stock from a near-term perspective. So far this calendar year, Maruti’s shares have declined by 14% compared to a 5% gain in the broader Nifty 100 index. However, from a medium-term perspective increasing consumer preference for personal mobility and rising affordability augur well for demand.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter."}, {"Article Image": "https://images.livemint.com/img/2021/04/28/600x338/21d6b124-4aa5-11eb-b097-bed98ba4ca79_1612443872815_1619577986719.jpg", "Article's Title": "Markets likely to consolidate; Axis Bank, Info Edge in focus", "Article's Text": "Mumbai: Indian stock markets are likely to consolidate on Wednesday, while trends in SGX Nifty suggests a flat to positive opening for domestic benchmark indices. On Tuesday, the BSE Sensex ended at 48,944.14, up 557.63 points or 1.15%. The Nifty closed at 14,653.05, up 168.05 points or 1.16%.\n\nAsian shares were mixed on Wednesday as already high valuations discouraged investors from buying equities ahead of a closely-watched U.S. Federal Reserve meeting.\n\nMSCI's broadest index of Asia-Pacific shares outside Japan declined 0.23%. Australian stocks rose 0.55%, but shares in China slipped 0.44%. Stocks in Tokyo edged 0.16% higher.\n\nFed Chairman Jerome Powell is expected to reaffirm that easy monetary policy will remain in place for a prolonged period and dismiss any suggestions of tapering bond purchases.\n\nUS President Joe Biden will also address a joint session of Congress, where he may make additional comments about infrastructure and stimulus spending.\n\nBack home, major companies that will announce March quarter results today are Bajaj Finserv, Biocon, Bombay Dyeing and Mastek.\n\nAxis Bank will be in focus as the lender on Tuesday reported its highest-ever quarterly standalone net profit of ₹2,677 crore in the March quarter on the back of lower provisioning. The private lender had reported a loss of ₹1,387.8 crore in the year ago quarter.\n\nInfo Edge India Ltd., on Tuesday said that it will be selling its stake worth ₹750 crore in Zomato's upcoming public offering.\n\nAn improving US economy, rising coronavirus vaccination rates, and expectations for big fiscal spending are causing more investors to question when the Fed will start slowing its bond purchases and how much inflation policymakers will tolerate.\n\nBreakeven rates on 10-year Treasury Inflation-Protected Securities, a measure of expected annual inflation for the coming decade, rose to 2.41%, the highest since 2013.\n\nYields on benchmark 10-year Treasuries stood at 1.6217%, close to a one-week high.\n\nThe dollar edged up slightly against the yen and the British pound, but trading is expected to be subdued until Powell speaks after the Fed meeting.\n\nThe Australian dollar was knocked lower after disappointing data on consumer prices.\n\nIn commodities, Brent crude futures fell 0.09% to $66.36 a barrel while U.S. West Texas Intermediate crude lost 0.05% to $62.91 per barrel due to worries about energy demand.\n\nBenchmark copper continued its assent toward a record above $10,000 a tonne. The metal is used so widely in manufacturing and heavy industry across the globe that it is considered a barometer of economic health.\n\nHowever, gold, which is often seen as a hedge against inflation, fell 0.49% to $1,768.00 in cautious trade ahead of the Fed meeting.\n\n(Reuters contributed to the story)\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter."}, {"Article Image": "https://images.livemint.com/img/2021/04/28/600x338/7863dc52-b919-11e9-8358-2b0715f878c4_1565606147077_1619607927817.jpg", "Article's Title": "Here are the key revealing figures from Zomato’s IPO prospectus", "Article's Text": "MUMBAI : Food delivery firm Zomato Ltd has filed a draft red herring prospectus (DRHP) for an initial public offering (IPO) of its shares, enabling a closer look at its financial performance.\n\nMost global food delivery businesses have reported a boost in business post-covid. In the case of Zomato, gross order value in the December 2020 quarter has only about inched back to pre-pandemic levels. But the good news for its investors is that the contribution margin has turned positive.\n\nIn the first nine months of financial year 2021 (9MFY21), Zomato reported a contribution margin of Rs22.9 per order, compared with a loss of Rs30.5 per order in FY20. This excludes costs associated with marketing, branding and other fixed operating costs. Still, the contribution margin had been on the mend even before the pandemic, and has turned positive since the first quarter of FY21.\n\nView Full Image\n\n\n\n\n\nThe vast improvement in unit economics will be a key factor used in promoting the IPO, although investors should note that some of the benefits to the food delivery business post-covid may not sustain. Already the contribution margin has tapered a bit in Q3, falling by a third, compared with Q2 levels.\n\nWhile the company hasn’t provided a quarterly break-up of its results, a comparison of unit economics of 9MFY21 and fiscal 2020 shows that the improvement in profitability was driven by higher fees and lower discounts.\n\nView Full Image\n\n\n\n\n\nAverage order value rose over 40% to nearly Rs400, driving an increase in commission earned on a per order basis. The company also increased delivery charges billed to customers. In FY20, only 30% of actual delivery costs were billed to customers. This was increased to 60% in FY21. Another major saving came in the form of lower discounts. On a per order basis, discounts were cut to merely a third of FY20 levels.\n\nWhile Zomato did well on costs, it hasn’t seen the rapid growth reported by some global firms such as Doordash. Gross order value stood at Rs2,981 crore in the December 2020 quarter, up 7% year-on-year. In the case of Doordash, which had a blockbuster IPO last year, revenues had more than trebled in the December 2020 quarter.\n\nView Full Image\n\n\n\n\n\nThe US firm’s losses have also magnified, showing that Zomato has preferred a cautious approach, with the main focus being on unit economics. Total orders received by the Indian firm were still 23% lower in the December quarter compared with pre-pandemic levels.\n\nThis is surprising, as it was felt that restrictions on eating out had led to an increase in food delivery orders. Higher delivery fees and lower discounts could partly be blamed for the drop in the number of orders. In other words, discounts will still play a big role for driving growth.\n\nIn this regard, Zomato appears to be well placed in terms of its cash position. In FY20, it had a cash balance of just Rs500 crore or so. This has risen to around Rs6,700 crore after large fundraising rounds ahead of the IPO, besides which another Rs7,500 crore will be raised through the IPO.\n\nView Full Image\n\nWhile cash burn has reduced meaningfully in 9MFY21 to Rs272 crore (versus Rs2,165 crore in FY20), the high cash balance may well prompt another round of discounting to drive growth. The fact that a number of private equity investors are staying put and aren’t selling in the IPO suggests they are in for the long haul as well.\n\nInfo Edge (India) Ltd is the only selling shareholder in the IPO, and isn’t exactly cashing out. It will be selling only around 10% of its holding for Rs750 crore. Its cost of acquisition on a per share basis was merely Rs1.16, and the last round of fundraising in February pegged the firm’s value at Rs58.2 per share. At Zomato’s most recent valuation, Info Edge will stay invested with a stake valued as high as Rs6,500 crore.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter."}, {"Article Image": "https://images.livemint.com/img/2021/04/28/600x338/4ec850a8-a76f-11eb-af25-752eabb3bc71_1619587266477_1619588208072.jpg", "Article's Title": "Axis Bank’s Q4 cheers, but high contingent provisions raise eyebrows", "Article's Text": "If anything is about to go wrong, it will go wrong. Perhaps this Murphy’s Law is what Axis Bank believes in, although its March quarter performance has given enough reasons for investors to expect better days ahead.\n\nThe private sector lender reported a sequential fall in its gross bad loan ratio, and its restructuring loan pile was less than 1% of the total portfolio. Fresh slippages for the March quarter at ₹5,285 crore, which analysts at Jefferies India Pvt. Ltd termed as marginally higher than expected. The management’s commentary showed optimism on the outlook notwithstanding the threat from the second wave of the pandemic.\n\nWhat seems to have raised eyebrows among investors is the huge pile of provisioning that the lender has made against the pandemic related risks. As of March, Axis Bank held ₹12,000 crore as contingency provisions over and above that of existing bad loans. As such, its provisioning coverage ratio is high at 72%. Analysts have viewed this large provisioning buffer as a positive in terms of profitability in the coming quarters. While only time will tell whether the lender’s provisions would give enough power to the lender to ride out the second wave impact, a peer comparison shows Axis Bank in better light.\n\nBut a move to keep provisions high cuts both ways. Perhaps investors also view this as an overly cautious approach in the wake of the second wave. The question being asked is does Axis Bank know about risks that other lenders are not seeing. Despite the net profit beat, the lender’s shares were trading weak in early trade today.\n\nThat said, its provisions keep Axis Bank in a sweet spot. If the pandemic results in increased stress, the lender has the necessary insurance against it and in the advent of such risks not materialising, the lender can write back these provisions as profit. Ergo, most analysts have increased their earnings per share estimates for the bank. “Axis Bank has delivered a strong performance and appears well-positioned to report robust earnings traction. Moreover, moderation in fresh slippages, coupled with improved underwriting and an increasing retail mix, would help maintain strong credit cost control,\" wrote analysts at Motilal Oswal Financial Services Ltd.\n\nWhile the net profit was boosted largely due to a sequential fall in provisioning, a healthy 11% growth in core interest income also supported. Shares of the lender have hardly gained in the past one month, but have outperformed that of the sector index because of the latter’s more than 3% fall.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter."}, {"Article Image": "https://images.livemint.com/img/2021/04/28/600x338/mutual-khTD--621x414@LiveMint_1619574157476.jpg", "Article's Title": "Stocks to Watch: Axis Bank, Bajaj Finance, Britannia, Info Edge, TVS Motor", "Article's Text": "NEW DELHI: Here are the top 10 stocks that could be in news today:\n\nAxis Bank: The private sector lender expects collections to slow down in the coming weeks as infections continue to rise, impacting movement of executives on the ground, its chief executive Amitabh Chaudhry said on Tuesday. The bank reported a net profit of ₹2,677 crore in the three months to March 2021, as compared to a loss of ₹1,388 crore in the same period last year.\n\nBajaj Finance: The largest non-bank lender reported a 42% jump in consolidated net profit to ₹1,347 crore at the end of March owing to improved asset quality. The company said it can mitigate any disruption caused by the second wave of covid infections in the first quarter.\n\nBritannia Industries: The FMCG major reported a 3% decline in consolidated net profit at ₹360.07 crore in the fourth quarter ended March, impacted by rise in commodity prices. Consolidated total revenue from operations grew 9% to ₹3,130.75 crore.\n\nInfo Edge India: The company will be selling its stake worth ₹750 crore in Zomato's upcoming public offering. Info Edge, which has been an early backer of the foodtech platform owned almost 18.4% stake in the company, after its latest funding round in February, this year.\n\nTVS Motor: The company posted nearly four-fold increase in its consolidated net profit to ₹319.19 crore for the fourth quarter ended March, riding on the back of robust sales in the domestic and international markets. Revenue from operations rose to ₹6,131.90 crore from ₹4,104.71 crore.\n\nABB India: The company posted more than two-fold jump in net profit to ₹151 crore for the January-March quarter. Total revenue from operations rose to ₹1,629.15 crore in the quarter from ₹1,522.24 crore year ago.\n\nBajaj Finserv: The financial services company will declare its March quarter earnings on Wednesday. The lender had reported 15% rise in consolidated net profit at ₹1,290 crore for the quarter ended December. The consolidated interest income was marginally lower at ₹6,599 crore as against ₹6,699 crore in Q3FY20.\n\nFuture Lifestyle Fashions: The company's board has cleared a resolution plan to rejig existing secured financial debt from its lenders. As part of the resolution plan, the debt raised through the non-convertible debentures issued by the company under Series IV are also proposed to be restructured.\n\nBank of India: The board of the lender will meet on 30 April to consider the proposal of raising capital, including by way of a further issue of equity shares and Basel III compliant additional Tier-1 and Tier-II bonds.\n\nHDFC Asset Management Company: The AMC on Tuesday reported a 26.5% growth in profit after tax at ₹316.08 crore for the three months to March. Total income rose 21.3% to ₹545.57 crore in Q4.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter."}, {"Article Image": "https://images.livemint.com/img/2021/04/28/600x338/2020-09-18T135755Z_1_LYNXMPEG8H190_RTROPTP_3_ASIA-GOLD-DEMAND_1601003025407_1619580469306.JPG", "Article's Title": "Gold prices today fall for 5th day in a row, down ₹ 1500 in a week; silver dips", "Article's Text": "Gold prices extended their losses to the fifth day in Indian markets amid weak global cues. On MCX, gold futures fell 0.8% to ₹46,904 per 10 gram while silver tumbled 1.7% to ₹67,750 per kg. In the previous session, gold prices had dipped 0.35% while silver had edged 0.3% higher. After hitting a two-month high of ₹48,400 last week, gold has been sliding, tracking a decline in global rates.\n\nIn international markets, gold prices fell today, pulled lower by firmer US Treasury yields and uptick in dollar index. Investors are looking out for policy cues from the Federal Reserve's two-day meeting, which ends today. Fed Chair Jerome Powell holds a press conference following the Fed meeting today while Joe Biden makes his first address as president to a joint session of Congress.\n\nSpot gold rates were down 0.5% at $1,767.76 per ounce. Benchmark US 10-year Treasury yields rose above 1.6%, increasing the opportunity cost of holding non-yielding bullion. The dollar index rose 0.1% against its rivals, making gold less appealing for other currency holders. Among other precious metals, silver fell 0.9% to $26.00 per ounce while platinum was down 1% at $1,216.75.\n\nTechnically, \"breaking the immediate resistance of $1800 is needed to continue positive outlook in the counter. Else there are chances of corrective selling pressure but stiff support is placed at $1760 which if broken the momentum may extended towards $1725 or more later,\" Geojit said.\n\nBond yields are rising again as markets await updates on government and central bank stimulus, with US President Joe Biden set to address Congress and the Fed delivering its policy statement later today. Investors are watching for any signs of the central bank pulling back on asset purchases as the economy gathers strength.\n\nIn equity markets, Asian stocks were mostly higher today with investors also cautious ahead of the Federal Reserve’s policy decision. (With Agency Inputs)\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter."}, {"Article Image": "https://c.ndtvimg.com/2020-05/cs3jpjhk_zomato_640x480_15_May_20.jpg", "Article's Title": "Key Things To Know About Zomato's Proposed Rs 8,250 Crore IPO", "Article's Text": "Size of the public offer: Through the initial public offer, Zomato intends to raise Rs 8,250 crore, out of which, around Rs 7,500 crore will be through a fresh issue of the equity shares. Info Edge, the top shareholder, and the company's earliest backer will sell shares worth Rs 750 crore through an offer for sale or OFS.\n\nPrice Band, Date of IPO: Zomato has not yet fixed the price band and lot sizes in which interested investors can bid for shares in the IPO. The date for the initial public offer was also not announced by the company in the draft red herring prospectus. (Also Read: Zomato Files For $1.11 Billion IPO As Food Delivery Surges In Pandemic Times\n\nObjectives of the IPO: According to the draft red herring prospectus, Zomato said that it intends to utilise the proceeds for funding the organic and inorganic growth initiatives and for general corporate purposes. It added that the amount utilised for general corporate purposes will not exceed 25 per cent of the net proceeds. The organic growth initiative includes delivery infrastructure, technology infrastructure, and customer and user acquisition.\n\nPre-IPO Placement: Zomato may consider a private placement of equity shares amounting to Rs 1,500 crore before the filing of the red herring prospectus. In case the pre-IPO placement is undertaken, the minimum offer size will constitute at least 10 per cent of the post-offer paid-up equity share capital. (Also Read: Info Edge India Shares Rise After Zomato Files Papers For IPO )"}, {"Article Image": "https://c.ndtvimg.com/2021-04/koupc1b_covid-family-crying-pti_625x300_23_April_21.jpg", "Article's Title": "Covid-19: Pandemic Second Wave May Impact India's Economic Growth, Says Report", "Article's Text": "Covid-19 second wave could impact India's economic recovery\n\nCredit rating agency S&P Global said on Wednesday the second wave of COVID-19 infections in India could impede the country's economic recovery and expose other nations to further waves of outbreaks.\n\n\"In addition to the substantial loss of life and significant humanitarian concerns, S&P Global Ratings believes the outbreak poses downside risks to GDP and heightens the possibility of business disruptions,\" the rating agency said in a note.\n\nIndia's healthcare system has been overwhelmed, with the world's second most populous country reporting more than 300,000 new COVID-19 cases daily over the past six days and the number of dead is set to cross 200,000.\n\nS&P, which has a long-term credit rating of 'BBB-' on India, just one notch above junk, said it may have to revise its base-case assumption of 11 per cent growth over fiscal 2021-22, especially if wider containment measures are re-imposed.\n\nS&P expects the consumer retail and airport sectors to have a dragged out recovery with localized lockdowns and curfews in several parts of the country, and said the Indian banking sector continued to face a \"high level of systemic risk\".\n\nThe rating agency noted that the pace and scale of recovery from the second wave of COVID-19 infections will have implications for India's sovereign credit rating.\n\nThe Asia-Pacific region is susceptible to contagion from the highly infectious COVID-19 variants present in India, given the low ratios of vaccination in the region, S&P said."}, {"Article Image": "https://c.ndtvimg.com/2020-08/2ri8g8i8_zomato_625x300_08_August_20.jpg", "Article's Title": "Zomato Files For $1.11 Billion IPO As Food Delivery Surges In Pandemic Times", "Article's Text": "Zomato IPO: Top shareholder Info Edge will sell shares worth Rs 7.5 billion in the IPO\n\nFood delivery startup Zomato, backed by China's Ant Group, has filed for an initial public offering of up to Rs 82.5 billion ($1.11 billion) as consumers increasingly turn to ordering food online during the COVID-19 pandemic.\n\nLaunched in 2008, Zomato is one of India's most prominent startups. It is present in 24 countries and employs more than 5,000 people, according to its website. In February, the company had raised $250 million from five investors including hedge fund Tiger Global Management for a post-money valuation of $5.4 billion. According to draft papers submitted to India's market regulator on Wednesday, Zomato's offering will comprise a fresh issue of shares worth up to Rs 75 billion.\n\nThe company said it intends to use the proceeds to fund growth initiatives and general corporate purposes. Top shareholder Info Edge will sell shares worth Rs 7.5 billion in the IPO. The company, along with domestic rival Swiggy, backed by Accel, dominates the Indian food delivery market, which research firm RedSeer estimates is worth $4.2 billion.\n\nIndia has been one of the hottest IPO markets so far in 2021, helped by a flood of foreign money and high interest from mom-and-pop investors. However, since late March, a second wave of coronavirus infections has dampened investor enthusiasm for stocks and IPOs. Well-known domestic brands and names such as Barbeque-Nation Hospitality and Macrotech Developers saw a muted response to their stock market listings.\n\nKotak Mahindra Capital, Morgan Stanley India, Credit Suisse Securities India, BofA Securities India and Citigroup Global Markets India are the lead book running managers for Zomato's IPO."}, {"Article Image": "https://c.ndtvimg.com/2018-10/npkpnibs_health-insurance_625x300_19_October_18.jpg", "Article's Title": "Why Millennials Should Invest In Health Plans Amid The Pandemic", "Article's Text": "At over 42 crore, millennials account for as much as 34 per cent of India's population\n\nMillennials - those born between 1981 and 1996 - are known to live an Insta-worthy life and work relentlessly to achieve it, without giving a second thought about their health. For many, their interests include investing in a certain standard of living that involves a healthy dose of self-care, recreation and travel. In the process, the quality of health often takes a backseat. But after the coronavirus pandemic, a majority of millennials are opting for health insurance to protect themselves, their family, and finances. They are now waking up to the benefits of having a health plan to cover the risk of a breadwinner succumbing suddenly to the virus.\n\nFor instance, in September, TransUnion, a global information and insights company, surveyed more than 3,000 people who had visited a healthcare facility in the past year and found that the younger generations were feeling the greatest impact from the pandemic. The survey highlighted that 33 per cent of Gen Z - those born after 1996 until 2010 - and 29 per cent of millennial respondents had their health insurance impacted by the pandemic. David Wojczynski, president of TransUnion Healthcare, said healthcare consumerism was growing partly because of the economic challenges resulting from the pandemic.\n\nCloser home, when Max Bupa Health Insurance conducted a survey in India, it found that it was not just people in the age group of 35 and about, but also millennials who were increasingly curious to understand health coverage and invest in it.\n\nThis interest is significant in a country, where according to experts, 80 per cent of the population still does not have any significant health insurance and 68 per cent has only limited or no access to essential medicines.\n\nAt over 42 crore, millennials account for 34 per cent of India's population and any impact on their savings could result in a ripple effect. Here are some factors that millennials should consider to understand why it could be a wise thing to invest in a health cover:\n\nTo support medical costs and extend protection to your family.\n\nTo boost your savings. Health insurance policies offer good returns when they mature.\n\nHealth covers are great as a tool for retirement planning.\n\nIn the current times, many medical insurance providers offer a cashless facility with their policies under certain conditions. This is a huge advantage to have during an emergency, where the insurer pays for eligible expenses directly to the institution, and the customers do not feel the pressure of making arrangements for immediate cash requirements.\n\nBesides covering health emergencies, these policies can also provide tax relief.\n\nPandemic or not, investing in health insurance across age groups is the need of the hour."}, {"Article Image": "https://c.ndtvimg.com/2021-04/89p1i5a8_drdo-oxygen_625x300_19_April_21.jpg", "Article's Title": "Covid-19 Pandemic: DRDO To Set Up 500 Oxygen Plants In Three Months", "Article's Text": "DRDO to set up 500 oxygen plants in three months\n\nResponding to the Centre's call to all state-owned companies across sectors to produce and distribute oxygen, the Defence Research and Development Organisation (DRDO) on Wednesday announced that it will set up 500 medical oxygen generating plants across the country within three months under the PM-CARES fund.\n\nAccording to a statement issued by the Defence Ministry, the technology for medical oxygen plant developed by DRDO for on-board oxygen generation for light combat aircraft Tejas, has now been transferred to Tata Advanced Systems Limited, Bengaluru, and Trident Pneumatics Pvt Ltd, Coimbatore, for setting up the plants.\n\nThese entities will be producing 380 of the 500 plants for installation across various hospitals in the country, the defence ministry statement said.\n\nThe remaining 120 plants will be produced by the industry in collaboration with the Indian Institute of Petroleum, Dehradun, it added.\n\nThe oxygen generation plants can produce 1,000 litres of oxygen per minute."}, {"Article Image": "https://c.ndtvimg.com/2018-12/ij20md5c_sensex-nifty-share-market-stock-market_625x300_18_December_18.jpg", "Article's Title": "PNB Housing Finance Gains After Reporting Profit Of Rs 127 Crore In March Quarter", "Article's Text": "PNB Housing Finance was last trading 0.03 per cent higher at Rs 377 on the BSE.\n\nShare price of PNB Housing Finance gained around one per cent on Wednesday, April 28, a day after the company reported a net profit of Rs 127 crore in the January-March quarter of the financial year 2020-21. On Wednesday, PNB Housing Finance opened on the BSE at Rs 375.20, touching an intra day high of Rs 385.45 and an intra day low of Rs 371.50, in the trading session so far. According to a statement shared by the firm, ONB Housing Finance reported a consolidated net profit of Rs 127 crore in the March quarter, compared to Rs 242 crore in the corresponding period of the previous fiscal.\n\nOn a sequential basis, the profit came down from Rs 232 crore in the third quarter of the financial year 2020-21. The total revenue during the fourth quarter of fiscal 2020-21 stood at Rs 1,834 crore, compared to Rs 1,952 crore in the corresponding period of the previous fiscal.\n\nPNB Housing Finance's asset quality deteriorated with the gross non-performing assets or NPAs increasing to 4.44 per cent of the gross loans by the January-March quarter, compared to 2.75 per cent in the corresponding period of the fiscal year 2019-20. The Net NPAs rose to 2.43 per cent from 1.75 per cent.\n\nMeanwhile, on the NSE, PNB Housing Finance opened at Rs 375.90, touching an intra day high of Rs 386, and an intra day low of Rs 370.25. It was last trading 0.11 per cent higher at Rs 377.50 on the NSE.\n\nPNB Housing Finance was last trading 0.03 per cent higher at Rs 377 on the BSE."}, {"Article Image": "https://c.ndtvimg.com/2021-04/oef7l7j8_maruti-suzuki-650_650x400_27_April_21.jpg", "Article's Title": "Maruti Suzuki Shuts Down Plants To Make Oxygen For Medical Needs", "Article's Text": "Maruti Suzuki said that it is committed to support government in diverting oxygen for saving lives.\n\nMaruti Suzuki, the country's largest car maker, will shut down its manufacturing units in Haryana to make oxygen gas available for medical needs, the company said in a stock exchange filing. Suzuki Motor has also decided to shut down its manufacturing unit in Gujarat, Maruti Suzuki added.\n\nThe company advanced its annual maintenance shutdown to May 1 through May 9 from earlier plan of June, Maruti Suzuki said while adding that it is committed to support government in diverting oxygen for saving lives.\n\n\"As part of the car manufacturing process, Maruti Suzuki uses a small amount of oxygen in its factories while relatively much larger quantities are used by the manufacturers of components. In the current situation, we believe that all available oxygen should be used to save lives,\" Maruti Suzuki said in a press release.\n\nThe company has been informed that Suzuki Motor Gujarat has taken the same decision for its factory, Maruti Suzuki said.\n\nIndia's new Covid deaths hit an overwhelming peak with 3,293 people dying in the last 24 hours. New cases rose by over 3.6 lakh, a global high, pushing the total cases to over 1.79 crore. The crisis has left India grappling for oxygen and medicines.\n\nThis is the seventh straight day that over three lakh cases have been recorded in India, the second worst-hit country after the US. The fresh deaths, marking the deadliest day of the pandemic in the country, take its total fatalities to 2,01,187.\n\nMaruti Suzuki shares traded 0.44 per cent higher at Rs 6,587 after announcing its decision to shut down plants, underperforming the Sensex which was up 1.6 per cent."}, {"Article Image": "https://i.ndtvimg.com/i/2016-12/state-bank-of-india_650x400_81480794411.jpg", "Article's Title": "SBI To Raise $2 Billion Through Bonds; Stock Soars Nearly 3%", "Article's Text": "The shares of SBI ended the day higher by 2.9 per cent at Rs 363.30 on the BSE\n\nState Bank of India (SBI) board, at its meeting held on April 28, has approved the proposal to raise up to $2 billion through bonds in the financial year 2021-22. The bonds will be issued in single or multiple tranches up to US$ 2 billion, through a public offer and private placement mode.\n\nThe board approved \"long-term fund-raising in single / multiple tranches up to US$ 2 Billion (US$ Two Billion) under Reg-S/144A, through a public offer and / or private placement of senior unsecured notes in US Dollar or any other convertible currency during FY 2021-22,\" the public lender said in a regulatory filing to the stock exchanges.\n\nEarlier in January, SBI had raised $600 million (about Rs 4,500 crore) through bonds to fund the expansion of the overseas business.\n\nThe shares of SBI ended the day higher by 2.9 per cent at Rs 363.30 on the BSE, as against the Sensex's gains of 1.6 per cent."}, {"Article Image": "https://c.ndtvimg.com/2018-12/ij20md5c_sensex-nifty-share-market-stock-market_625x300_18_December_18.jpg", "Article's Title": "Jindal Steel And Power To Divest Coal-Fired Power Business, Stock Edges Lower", "Article's Text": "Jindal Steel and Power was last trading 0.91 per cent lower at Rs 445.70 on the BSE.\n\nShare price of Jindal Steel and Power Limited edged marginally lower on Wednesday, April 28, a day after the company's board approved the divestment of its 96.4 per cent stake in subsidiary Jindal Power for an in-all cash offer of Rs 3,015 crore to Worldone Private Limited. On Wednesday, Jindal Steel and Power opened on the BSE at Rs 454.40, touching an intra day high of Rs 454.40, and an intra day low of Rs 436.05, in the trading session so far. According to a regulatory filing by the company to the BSE, the acquirer - Worldone Private Limited is owned by Jindal Steel and Power's promoter group.\n\nAccording to the statement released by the company, as part of the deal, the equity value is an all-cash offer of Rs. 3,015 crores for a 96.42 per cent stake in Jindal Power Limited. It included 3,400 MW coal-fired power plants in Chhattisgarh and other non-core assets owned by Jindal Power. The board of the company approved the divestment of its coal-fired power business.\n\nThe infrastructure conglomerate stated that the divestment plan of the fired power business is aimed at reducing reduce emissions and carbon footprint by almost 50 per cent.\n\nMeanwhile, on the NSE, Jindal Steel and Power opened at Rs 453.80, touching an intra day high of Rs 453.95 and an intra day low of Rs 436.05, in the session so far. It was last trading 0.89 per cent lower at Rs 445.90 on the NSE.\n\nJindal Steel and Power was last trading 0.91 per cent lower at Rs 445.70 on the BSE."}, {"Article Image": "https://c.ndtvimg.com/2020-03/4ajg4eoo_indian-economy-bloomberg_625x300_13_March_20.jpg", "Article's Title": "India's GDP To Grow By 11% In 2021-22 Despite Pandemic: Report", "Article's Text": "India's economy to grow by 11% in the current fiscal\n\nThe Asian Development Bank (ADB) has projected that India's gross domestic product (GDP) will rebound strongly by 11 per cent in 2021-22 due to continued economic recovery boosted by increased public investment, vaccine rollout, and a surge in domestic demand.\n\nThe forecast, which has appeared in its publication titled \"Asian Development Outlook 2021\", assumes that this would happen once vaccines are deployed extensively across the country and the second wave of the coronavirus disease (COVID-19) pandemic is contained.\n\nADB has also predicted that the country's economic growth will to moderate to seven per cent in 2022-23 as base effects will disappear. The economy is expected to have contracted by eight per cent in 2020-21 in line with the Government's second advance estimate.\n\n“India's economy faced its worst contraction in 2020-21 due to the COVID-19 shock. With large government stimulus and the ongoing vaccination drive, we expect economic activity will continue its recovery started from the third quarter of 2020-21 and rebound strongly in the current fiscal year with an uptick in domestic demand, especially in urban services,” said ADB Country Director for India Takeo Konishi.\n\n“The government's boost to public investment through its infrastructure push, incentives for manufacturing, and continued support to boost rural incomes will support India's accelerated recovery,” he added.\n\nAt the same time though, the forecast said that an uncertain pandemic trajectory with a prolonged second wave despite the vaccination push could affect India's economic normalisation.\n\nIt also expects the economic impact of the second wave to be relatively muted compared to the first wave in line with global experience. Other downside risks include further tightening of global financial conditions on fast recovery in developed countries, which would apply pressure on India's market interest rates.\n\nPredicting a positive picture, ADB's forecast said that economic activity will continue to normalise and recover, backed by government measures over the past year, including a large stimulus in the previous fiscal and a steep increase in capital expenditure budget in 2021-22.\n\nIncreased government expenditure on health care, water, and sanitation will also strengthen the country's resilience against future pandemics, the ADB forecast noted further."}, {"Article Image": "https://c.ndtvimg.com/2021-04/9daf72j8_medical-oxygen-plant_625x300_23_April_21.jpg", "Article's Title": "Covid-19 Pandemic: Fertiliser Majors Up Oxygen Production, Supply", "Article's Text": "Fertiliser companies to augment production and supply of medical oxygen\n\nTaking initiative to enhance production and supply of medical oxygen within their existing capacities in order to make it available for hospitals across the country to combat the menace of Covid-19 pandemic, major fertiliser cooperatives and state-level entities like IFFCO, Gujarat State Fertilisers and Chemicals Limited and Gujarat Narmada Valley Fertilisers & Chemicals Limited have begun augmenting its manufacturing.\n\nThe Centre is expecting that approximately 50 metric tonnes of medical oxygen per day can be made available for Corona virus afflicted patients by fertiliser plants situated all over the country.\n\nAt a high level meeting held with Minister of State for Chemicals and Fertilisers Mansukh Mandaviya, IFFCO officials informed that the company is putting up an oxygen plant with a capacity of 200 cubic meters per hour in its Kalol unit in Gujarat and their total capacity would be 33,000 cubic meters per day.\n\nSimilarly Gujarat Narmada Valley Fertilisers & Chemicals Ltd has also started supply of liquid oxygen for medical purpose after commencement of its air separation unit.\n\nGujarat State Fertilisers and Chemicals Limited has also made modifications in their plants and started supply liquid oxygen, official sources said.\n\nBoth the Gujarat-based companies further informed the minister that they have already started the process of enhancing their oxygen production.\n\nOther fertiliser companies' representatives said that they will set up medical oxygen plants in hospitals at selected locations in the country through their corporate social responsibility CSR funding."}, {"Article Image": "https://c.ndtvimg.com/2019-12/lmb0c1g_investment-rupee-money-savings_625x300_06_December_19.jpg", "Article's Title": "Rupee Gains To 74.36 Against Dollar Amid Strong Rally In Domestic Equities", "Article's Text": "Rupee Vs Dollar Today: The rupee settled at 74.36 against the dollar\n\nThe rupee gained 30 paise against the US dollar on Wednesday, April 28, to settle at 74.36 (provisional), extending its gains for the third straight session tracking a strong rally today in domestic equities. At the interbank foreign exchange market, the domestic unit opened at 74.49 against the American currency and registered an intra-day high of 74.29. It witnessed a low of 74.50. In an early trade session, the local unit gained 21 paise to 74.45 against the greenback. The rupee closed at 74.36 against the dollar, recording a gain of 30 paise over its previous closing.\n\nOn Tuesday, April 27, the local unit settled at 74.66 against the dollar. Today, the rupee registered its third straight session of gain, appreciating by 65 paise. Meanwhile, the dollar index, which gauges the greenback's strength against a basket of six currencies, climbed 0.14 per cent to 91.03.\n\n\"It is an eventful day, with Fed policy and Biden's session of Congress. Ahead of both these events, dollar index is showing tentative signs of recovering, however, FII inflows into local stocks are weighing on USDINR spot,'' said Mr. Rahul Gupta, Head Of Research- Currency, Emkay Global Financial Services.\n\n''Technically, USDINR spot has formed a descending channel, and if tonight's Fed message isn't as hawkish as the market is expecting then we may see a further drop in spot. 74.25 is the immediate support, until the spot remains afloat we may see prices moving towards 75 zone amid a severe covid situation,'' he added.\n\n''The rupee's rapid depreciation from 73 to 75 has slowed, reducing the need for RBI intervention in the market. The economic situation has deteriorated, at least in the short term, as the covid-19 cases have impacted employment and development. In these conditions, the Central Bank will accept any gradual weakening of the rupee before it reaches the 75.50 mark,'' said Kshitij Purohit, Lead International & Commodities at CapitalVia Global Research Limited.\n\nOn the domestic equity market front, the BSE Sensex ended 789.70 points or 1.61 per cent higher at 49,733.84, while the broader NSE Nifty climbed 211.50 points or 1.44 per cent to 14,864.55.\n\n\n\nWhat analysts say\n\n“Market sentiment has been boosted by a set of strong results and continuing strong momentum in global markets, which has over-shadowed concerns over economic activity arising from renewed lockdowns and the second wave of COVID-19 infections,'' said Mr. S Hariharan, Head - Sales Trading, Emkay Global Financial Services\n\n''Metals and banking sectors in particular have seen renewed long open interest build-up, while IT sector has lagged in a case of rotation of positioning. Mid-cap out-performance, which is a theme that has been in play for the last 6 months, continues to play out. Barring any further widespread impact of covid infections and resultant lockdowns in tier-2 and tier-3 cities, Nifty can be expected to trade towards its life high in May,'' added Mr Hariharan.\n\n“The benchmark indices extended gains following a stellar intraday rally with the Nifty/ Sensex closing 211 /789 points higher. Today, the market opened on a strong note and maintained the strong momentum throughout the day following robust buying in banking and financial stocks,'' said Shrikant Chouhan, Executive Vice President, Equity Technical Research at Kotak Securities.\n\n''After a long time the index managed to closed above 50 day SMA mark which is broadly positive for the market. However, intraday chart suggest, market is overstretch and it may take a temporary pause near 14925/ 50100 levels. We are of the view that, the larger texture of the market is positive and ideal strategy should be to buy on dips rather than chasing Nifty at higher levels,'' he added.\n\nAccording to the exchange data, the foreign institutional investors were net sellers in the capital market on April 27 as they sold shares worth Rs 1,454.75 crore. Brent crude futures, the global oil benchmark, rose 0.18 per cent to $ 66.54 per barrel."}, {"Article Image": "https://c.ndtvimg.com/2019-10/jqfqjb3g_state-bank-of-india-sbi_625x300_31_October_19.jpg", "Article's Title": "SBI Board To Meet On Wednesday To Consider $2 Billion Bond Issue", "Article's Text": "At 12:45 pm, SBI shares were trading at Rs 362.45, higher by 2.7 per cent, on the BSE\n\nState Bank of India (SBI) said on Tuesday that its executive committee will meet on Wednesday, April 28 to consider raising $2 billion through bonds in the financial year 2021-22. At 12:45 pm, the shares of SBI were trading at Rs 362.45, higher by 2.7 per cent on the BSE, on the back of the news development.\n\nThe Executive Committee will meet \"to examine the status and decide on long term fund raising in single/multiple tranches up to US$2 billion under Reg-S/144A, through a public offer and/or private placement of senior unsecured notes in US Dollar or any other convertible currency during FY 2021-22,\" SBI said in a regulatory filing to the stock exchanges.\n\nThe BSE Sensex was trading higher by 1.37 per cent and NSE Nifty was up 1.22 per cent at the time."}, {"Article Image": "https://c.ndtvimg.com/2018-12/ij20md5c_sensex-nifty-share-market-stock-market_625x300_18_December_18.jpg", "Article's Title": "Britannia Industries Profit Declines 3.3% In March Quarter, Stock Edges Lower", "Article's Text": "Britannia's total revenue from operations registered a growth of 9.2 per cent in March quarter\n\nShare price of Britannia Industries slipped around two per cent on Wednesday, April 28, a day after the country's leading biscuit manufacturer reported its March quarter results for the financial year 2020-21. On Wednesday, Britannia opened on the BSE at Rs 3,487, touching an intra day high of Rs 3,540 and an intra day low of Rs 3,470, in the trading session so far. According to a regulatory filing by the company to the BSE, Britannia reported consolidated profit of ₹ 360 crore in the January-March quarter of fiscal 2020-21, registering a 3.3 per cent decline in profit year-on-year, compared to ₹ 372 crore in the year-ago period. (Also Read: Britannia Industries Profit Declines 3.3% To ₹ 360 Crore In March Quarter )\n\nAccording to the statement, Britannia Industries' consolidated revenue from operations stood at Rs 3,130.7 crore in the fourth quarter of the financial year 2020-21. The operating performance of the company for the quarter was lower than the estimates of analysts.\n\nBritannia's total revenue from operations registered a growth of 9.2 per cent year-on-year in the January-March quarter, compared to ₹ 2,867.70 crore in the corresponding period of the previous fiscal. The company's commodity cost front reported growth as palm oil, dairy products reported steep increases, which helped in managing the rise in costs, during the quarter.\n\nMeanwhile, on the NSE, Britannia Industries opened at Rs 3,488, touching an intra day high of Rs 3,527, and an intra day low of Rs 3,469, in the session so far. It was last trading 1.16 per cent lower at Rs 3,499.95 on the NSE.\n\nBritannia Industries was last trading 1.14 per cent lower at Rs 3,499.70 on the BSE."}, {"Article Image": "https://i.ndtvimg.com/i/2018-03/sbi-mutual-funds_650x400_71522049454.jpg", "Article's Title": "SBI Mutual Fund Launches Nifty Next 50 Index Fund", "Article's Text": "Investors can start with a minimum investment of Rs 5,000 and in multiples of Rs 1 thereafter\n\nSBI Mutual Fund has launched SBI Nifty Next 50 Index Fund, which will track the performance of the Nifty Next 50 Index. The new fund offer (NFO) will open for subscription on April 28 and close on May 11. It is an open-ended scheme, which means that the shares can be redeemed by the investors at any point of time.\n\nThe investment objective of the offer is to provide returns in tune with the total returns of the constituent shares of Nifty-50 index.\n\nSBI Mutual Fund's NFO will invest 95 to 100 per cent in shares belonging to the Nifty Next 50 Index and up to 5 per cent in money market instruments and units of liquid mutual funds.\n\nInvestors can start with a minimum investment of Rs 5,000 and in multiples of Rs 1 thereafter. The investments can be done on a daily, weekly, monthly, quarterly, semi-annual and annual basis.\n\nLaunched in 1996, Nifty Next 50 index has a base value of 1,000 points and is rebalanced on a semi-annual basis."}, {"Article Image": "https://c.ndtvimg.com/2018-10/p71o4fdo_gold-bars_625x300_28_October_18.jpg", "Article's Title": "Gold Prices Today: Yellow Metal Dip Continues, Trading At Rs 47,095", "Article's Text": "Gold prices continued with their decline for the fifth day on Wednesday\n\nGold prices continued with their declining trend and fell for the fifth straight day on Wednesday, as MCX gold June futures were trading at Rs 47,095 per 10 gram against the previous close of Rs 47,303.\n\nMarket watchers indicated that the precious metal's dipping prices were mainly owing to the ongoing meeting of the US Federal Reserve, which is to end today and its decision could impact the markets in general.\n\nMeanwhile MCX May futures plunged Rs 812 or 1.18 per cent to Rs 68,146 per kg. In the previous session, silver futures ended at Rs 68,958 per kg.\n\nMCX gold too has been volatile since it touched an all-time high of Rs 56,191 per 10 gram in August 2020. From a record high, MCX gold prices are down Rs 9,096 per 10 gram. The dollar has started to gain grounds ahead of the Fed policy. Indian rupee is also trading below 75 zone, putting downward pressure on MCX prices.\n\nGlobally, spot gold was down 0.5 per cent at $1,767.76 per ounce. US gold futures were down 0.5 per cent at $1,770.00 per ounce. Benchmark U.S. 10-year Treasury yields rose to their highest since April 15, increasing the opportunity cost of holding non-yielding bullion."}, {"Article Image": "https://c.ndtvimg.com/2020-01/cfv5hqvg_rupee-reuters_625x300_23_January_20.jpg", "Article's Title": "Bajaj Finserv Profit Surges More Than 5 Times To Rs 979 Crore In Q4", "Article's Text": "As of 1:17 pm, Bajaj Finance shares traded 4.2 per cent higher at Rs 10,511\n\nThe Pune-based non-banking finance company - Bajaj Finserv - on Wednesday reported net profit of Rs 979 crore in January-March quarter, that marked an increase of 5 times from profit of Rs 194 crore during the same quarter last year. Its total revenue from operations jumped 16 per cent to Rs 15,385 crore, Bajaj Finance exchange filing showed.\n\n\"Given the impact of the COVID-19 pandemic, FY21 was expected to be an extremely demanding year and so it turned out to be. In fact, the negative growth in GDP was much larger than expected in Q1 FY21 as GDP contracted by 24.4%, followed by a further 7.3% contraction in Q2 FY21. Thankfully, we began to witness resumption of economic activity in the second half of the year wherein Q3 FY21 recorded a GDP growth of 0.4% and Q4 FY21 is expected to show relatively robust growth. The second advance estimates of national income for FY21 released by the Central Statistical Office (CSO) indicates a negative GDP growth of 8% for FY21,\" Bajaj Finance said in a press release.\n\nBajaj Allianz General Insurance Company recorded an all-time high annual profit and continued to deliver robust improvement in its underwriting result and Bajaj Allianz Life Insurance Company registered an all-time high annual gross written premium in FY21 at Rs 12,025 crore. It's Assets Under Management reached an all-time high level of Rs 73,773 crore at year end.\n\nAs of 1:17 pm, Bajaj Finance shares traded 4.2 per cent higher at Rs 10,511, outperforming the Sensex which was up 1.66 per cent."}, {"Article Image": "https://c.ndtvimg.com/2020-02/nt3ob83g_marketssensex-budget-generic_625x300_01_February_20.jpg", "Article's Title": "Sensex Surges Nearly 800 Points, Nifty Ends Above 14,800, Led By Banking, Financial Stocks", "Article's Text": "Bajaj Finance, Bajaj Finserv, ICICI Bank and SBI gained 3-8 per cent each on the BSE\n\nThe benchmark indices surged by over a per cent for the third day in a row, on Wednesday, led by strong buying interest in banking and financial stocks. The BSE Sensex ended the session at 49,733.45, higher by 789.70 points or 1.61 per cent and the NSE Nifty closed at 14,864.55, up 211.50 points or 1.44 per cent. The broader markets also witnessed buying interest, the BS E Midcap index rose 0.9 per cent and BSE Smallcap index advanced 0.7 per cent.\n\nStrong quarterly earnings by financial and banking companies have propelled the markets higher, according to analysts.\n\nBoth the indexes had seen a sell-off in the past couple of weeks as investors fretted over the economic impact from a furious surge in COVID-19 cases and deaths. The markets have, however, rebounded more than 3 per cent thus far this week as they seem to have factored in the worse on the Covid front.\n\nInvestors have also turned their attention to the March-quarter earnings season, with key blue-chip companies such as consumer giant Hindustan Unilever and conglomerate Reliance Industries set to report their results later this week.\n\nThe day clearly belonged to the banking and financials space. Bajaj Finance soared more than 8 per cent at Rs 5,280.90 to top the gainers list on the BSE after its net profit in March quarter jumped 42 per cent to Rs 1,346.64 crore. Bajaj Finserv soared nearly 4 per cent after the Pune-based non-banking finance company reported a net profit of Rs 979 crore in January-March quarter, marking an increase of 5 times from Rs 194 crore during the same quarter last year. IndusInd Bank, State Bank of India, Kotak Mahindra Bank and ICICI Bank also rallied by 2.5 per cent each on the BSE.\n\nOn the other hand, metal stocks saw some profit-booking after recent gains. Hindalco, Tata Steel and JSW Steel lost around a per cent each among Sensex shares.\n\nThe BSE market breadth was strong. Out of 3,144 stocks traded on the BSE, there were 1,784 advancing stocks as against 1,178 declines."}, {"Article Image": "https://c.ndtvimg.com/2019-05/bfn9h0to_sensex-markets-trader_625x300_28_May_19.jpg", "Article's Title": "Sensex Up Over 500 Points, Nifty Reclaims 14,800; Bajaj Finance Top Gainer", "Article's Text": "Sensex rose as much as 525 points and Nifty 50 index moved above 14,800.\n\nIndian equity benchmarks extended gains in noon deals and were on track to close higher for third day in a row on Wednesday led by strong buying interest in Bajaj Finance, HDFC, HDFC Bank, Kotak Mahindra Bank, ICICI Bank and Hindustan Unilever. The Sensex rose as much as 525 points and Nifty 50 index moved above its important psychological level of 14,800. Strong quarterly earnings by financial and banking companies are propelling the equity markets higher, analysts said.\n\nAs of 12:00 pm, the Sensex rose 505 points or 1 per cent to 49,450 and Nifty 50 index climbed 136 points to 14,789.\n\nBoth the indexes fell nearly 2 per cent last week, as investors fretted over the economic impact from a furious surge in COVID-19 cases and deaths. India added over 1.2 million cases and 8,000 deaths in the week to April 23.\n\n\"Over the last two (to) three days, and especially over the weekend, there have been some positives such as... the U.S. allowing supply of COVID-19 materials and resources to India, and a fall in the number of active cases, especially in worst-hit states like Maharashtra,\" Gaurav Garg, head of research at CapitalVia Global Research told news agency Reuters.\n\nInvestors have also turned their attention to the March-quarter earnings season, with key blue-chip companies such as consumer giant Hindustan Unilever and conglomerate Reliance Industries set to report their results later this week.\n\nMeanwhile, eight of 11 sector gauges compiled by the National Stock Exchange were trading higher led by the Nifty Auto index's 2.5 per cent gain. Nifty PSU Bank, Bank, Financial Services and Private Bank indices also rose between 1-2 per cent.\n\nOn the other hand, metal, information technology and realty indices were trading with a negative bias.\n\nMid- and small-cap shares were also witnessing buying interest as Nifty Midcap 100 index rose 1 per cent and Nifty Smallcap 100 index advanced 0.9 per cent.\n\nAmong the individual shares, Info Edge India, which has stake in food delivery service provider Zomato, rose as much as 3.14 per cent to hit an intraday high of Rs 5,100 on the BSE after Zomato filed draft red herring prospectus (DRHP) with Securities and Exchange Board of India (SEBI) to raise up to Rs 8,250 crore through share sale via initial public offering (IPO).\n\nBajaj Finance was top Nifty gainer, the stock rose nearly 7 per cent to hit an intraday high of Rs 5,215 after its net profit in March quarter jumped 42 per cent to Rs 1,346.64 crore.\n\nBajaj Finserv rallied 5 per cent to hit an intraday high of Rs 10,615 ahead of its earnings due later in the day.\n\nEicher Motors, Bajaj Auto, IndusInd Bank, State Bank of India, Kotak Mahindra Bank, Hero MotoCorp, Bharti Airtel and Mahindra & Mahindra also rose 2-4 per cent.\n\nOn the flipside, Hindalco, JSW Steel, Britannia Industries, SBI Life, Tata Steel, Axis Bank, HDFC Life and Nestle India were among the losers.\n\nThe overall market breadth was positive as 1,781 shares were advancing while 928 were declining on the BSE."}, {"Article Image": "https://c.ndtvimg.com/2020-08/2ri8g8i8_zomato_625x300_08_August_20.jpg", "Article's Title": "Info Edge India Shares Rise After Zomato Files Papers For IPO", "Article's Text": "Zomato's offering will comprise a fresh issue of shares worth up to Rs 7,500 crore.\n\nShares of Info Edge India, which has stake in food delivery service provider Zomato, rose as much as 3.14 per cent to hit an intraday high of Rs 5,100 on the BSE after Zomato filed draft red herring prospectus (DRHP) with Securities and Exchange Board of India (SEBI) to raise up to Rs 8,250 crore through share sale via initial public offering (IPO). (Track Info Edge share price here)\n\nThe company said it intends to use the proceeds to fund growth initiatives and general corporate purposes. Top shareholder Info Edge will sell shares worth Rs 750 crore in the IPO. The company, along with domestic rival Swiggy, backed by Accel, dominates the food delivery market, which research firm RedSeer estimates is worth $4.2 billion.\n\nLaunched in 2008, Zomato is one of India's most prominent startups. It is present in 24 countries and employs more than 5,000 people, according to its website. In February, the company had raised $250 million from five investors including hedge fund Tiger Global Management for a post-money valuation of $5.4 billion. According to draft papers submitted to India's market regulator on Wednesday, Zomato's offering will comprise a fresh issue of shares worth up to Rs 7,500 crore.\n\nKotak Mahindra Capital, Morgan Stanley India, Credit Suisse Securities India, BofA Securities India and Citigroup Global Markets India are the lead book running managers for Zomato's IPO. The company has not yet fixed the price band and lot sizes in which investors interested in the sock can bid for its shares in the IPO.\n\nThe date for the IPO was also not announced by the company the DRHP.\n\nIndia has been one of the hottest IPO markets so far in 2021, helped by a flood of foreign money and high interest from retail investors. However, since late March, a second wave of coronavirus infections has dampened investor enthusiasm for stocks and IPOs. Well-known domestic brands and names such as Barbeque-Nation Hospitality and Macrotech Developers saw a muted response to their stock market listings. While, Nazara Technologies and MTAR Technologies witnessed bumper stock market debuts.\n\nAs of 11:32 am, Info Edge shares traded nearly 2 per cent higher at Rs 5,040, outperforming the Sensex which was up 0.95 per cent."}]