[{"Article Image": "https://static.toiimg.com/thumb/msid-82293438,width-1070,height-580,imgsize-161236,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "UoH among 13 Indian institution finding spot in RUR rankings", "Article's Text": "Congratulations! You have successfully cast your vote Login to view result\n\nHYDERABAD: The University of Hyderabad (UoH) is among 13 educational institutions across the country that figured in the Round University Rankings (RUR), released by the RUR Ranking Agency (Moscow, Russia) on Wednesday.The international ranking of leading world universities provides a comparison of 1,150 leading universities from 85 countries around the world for 12 years (2010-2021). The universities are compared on 20 indicators distributed into four key areas: teaching, research, international diversity and financial sustainability.As per the RUR rankings, of the 13 Indian institutions that figured in the list, the UoH is the sixth with 350th rank in 2021, a marked improvement from last year’s 363rd rank. In the teaching category, the UoH was ranked 84th globally.Responding to these rankings, Prof Appa Rao Podile, vice-chancellor, UoH said -- “It’s a great feeling to see that our university is ranked in the top 350 global institutions, and the only Indian university in the top six institutions figuring in RUR. Our faculty have been working on producing excellent research and providing the right motivation for the younger colleagues to emulate in all domains, including teaching.”"}, {"Article Image": "https://static.toiimg.com/thumb/msid-82285217,width-1070,height-580,imgsize-184054,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "CBSE News: CBSE institutes to fill handy internal and practical marks, rest by June 11", "Article's Text": "Congratulations! You have successfully cast your vote Login to view result\n\nPUNE: Schools affiliated with the Central Board of Secondary Education (CBSE) have received an email from the Pune regional office telling them to upload the internal assessment marks of Std X and practical marks of Std XII students by April 28.M D Dharmadhikari, CBSE’s regional director for the Pune region which includes Maharashtra, Goa, Daman & Diu, Dadra & Nagar Haveli, said he is unaware of any such circular. “We don’t know anything about it,” he said. When asked if this circular was issued by him, he said, “It is not.”But principals said the students need no panic. “As far as Std X internal marks are concerned, it is possible to send because we were supposed to do it before the board exam. It was an internal process. Not all students were able to appear for the practical exams because one or two of them tested positive or someone in their family tested positive for Covid-19. Schools uploaded the marks and let it rest. The final submission was not done. CBSE has requested to upload marks of practicals done to date. We have time to conduct the remaining practicals in June. In my school, we have not been able to conduct the economics practical because of a teacher-tested positive. It will be held in June and the scores will be sent offline,” Jayshree Venkatraman, principal at SNBP International School in Rahatani, said.The principal of the Army Public School said they were sticking to the previous circular by the CBSE which says they have to submit the data by June 11. They have students and staff testing positive and have not attended the practicals."}, {"Article Image": "https://static.toiimg.com/thumb/msid-82293974,width-1070,height-580,imgsize-1264299,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "Kerala Samastha public examination results for classes 5, 7, 10, 12 announced", "Article's Text": "Congratulations! You have successfully cast your vote Login to view result\n\nNEW DELHI: Samastha Kerala Sunni Vidyabhyasa Board on Wednesday announced the public examination results for class 5, 7, 10, 12 on its official website.Candidates, who appeared for the public examination for Classes 5th, 7th, 10th and 12th, can check their results online through the official website - https://www.samastha.in/.The Islamic Educational Board had conducted the public examination on April 3 and 4, 2021.Those candidates who are not satisfied with their results can apply online for re-evaluation. For re-evaluation they need to fill up the application form online and need to pay the applicable fee online for re-evaluation.After receiving the application, the Board will do retotaling /rechecking and then will declare the revised result in the PDF format.1) Visit the official Samastha Kerala Sunni Vidyabhyasa Board website - https://samastha.in2) On the Home Page, click on the Result link, given in the LHS of the page.3) Now Click on the Result link, a new page will appear on your screen4) Select your class, enter the registration number5) Download the result, and save it for future reference."}, {"Article Image": "https://static.toiimg.com/thumb/msid-82288832,width-1070,height-580,imgsize-18025,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "wbpsc exam postponed: WBPSC Civil Services prelims, main exams postponed", "Article's Text": "Congratulations! You have successfully cast your vote Login to view result\n\nNEW DELHI: West Bengal Public Service Commission (WBPSC) has postponed the West Bengal Civil Service (Exe.) etc. (Main) Examination, 2020, and West Bengal Civil Service (Exe.), etc. (Preli.) Examination, 2021.West Bengal Civil Service (Exe.) etc. main examination, 2020, scheduled to be held on May 17, 18, 19, and 21, and West Bengal Civil Service (Exe.), etc. preliminary examination, 2021 to be scheduled on May 30 has been postponed.“In view of the recent surge in the number of COVID Positive Cases in the State, the Commission has decided in consultation with the State Government, that all Written Examinations scheduled to be taken by the Commission between 07/05/2021 and 30/06/2021 stands postponed until further orders, to prevent the possibility of any further spread of the pandemic. Fresh dates for the postponed examinations would be announced in due course. Candidates are advised to visit https://wbpsc.gov.in from time to time for updates,” reads a notice issued regarding the postponement."}, {"Article Image": "https://static.toiimg.com/thumb/msid-82291080,width-1070,height-580,imgsize-165406,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "DSSSB answer key 2021 released for JTO, store keeper and other exams", "Article's Text": "Congratulations! You have successfully cast your vote Login to view result\n\nNEW DELHI: Delhi Subordinate Services Selection Board (DSSSB) has released the answer key of online computer-based examination conducted for recruitment of various examination on its official website today, i.e., April 28.The candidates who have appeared for the DSSSB computer-based examination can visit the official website of DSSSB — dsssb.delhi.gov.in — to check and download their DSSSB answer key 2021.Delhi Subordinate Services Selection Board conducted Junior Stenographer (English) and Store Keeper exams on April 19. Fire Operator (only for male) conducted on April 20 and 22. The computer-based exam for Store Keeper and Food Safety Officer on April 22 and Junior Stenographer, Junior Telephone Operator, and Veterinary Livestock Inspector on April 23.Candidates can raise objections against DSSSB answer key 2021 from April 29. The last date to raise objections against DSSSB answer key 2021 is May 3.Candidates can download their DSSSB answer key 2021 either from the official website or from the direct link provided below.Candidates can follow the steps given below to check and download the DSSSB answer key 2021.1. Go to the official website of DSSSB — dsssb.delhi.gov.in2. On the homepage click on the link which reads \"DRAFT ANSWER KEYS FOR ONLINE COMPUTER BASED EXAMINATION HELD ON 19,20,22,23 APR 2021 FOR VARIOUS POSTCODES\"3. It will direct to a new page of the DSSSB website4. Notice on the DSSSB answer key will be displayed on the screen"}, {"Article Image": "https://static.toiimg.com/thumb/msid-82290969,width-1070,height-580,imgsize-1466034,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "cbse evaluation 2021: CBSE revises assessment and evaluation pattern for new academic session", "Article's Text": "Congratulations! You have successfully cast your vote Login to view result\n\nThe Central Board of Secondary Education (CBSE) has released the new assessment and evaluation practices for the academic session 2021-22. The evaluation practice is aimed to boost competency-based education (CBE).In the new assessment pattern, while the overall marks and duration of the examination remain unchanged, a greater number of competency-based questions to assess the application of concepts in real-life situations will be included. “At a time when home-schooling and online education has become relevant, the traditional method of assessment will become redundant, which if continued further can be misinterpreted by both teachers as well as students,” says Biswajit Saha, director, Training and Skill Development, CBSE.For classes IX and X, the percentage of competency-based questions has been increased from 20 to 30, which will be in the form of multiple-choice questions, case-based questions, course-based integrated questions or any other types. Objective type questions will constitute 20% of the question paper, same as last academic and the remaining 50% will be short and long answer type questions.For classes XI and XII, the competency-based questions will be 20%, same as last academic; the objective-type questions have been increased from 10% to 20% and the short answer and long answer type will now be reduced from 70% to 60%.This step of CBSE is in line with the National Education Policy (NEP) 2020 which advocates the need to move from rote to competency-based learning making it more focused on developing the creative and critical thinking capacities of students.“The Board will soon transform the focus from ‘assessment of learning to assessment for learning’. The assessment will shift from testing primarily rote memorisation skills to one that tests students’ higher-order skills, such as analysis, critical thinking, and conceptual clarity,” says Saha. The change, he says, will happen gradually as the teachers and students get adjusted to the new pattern comfortably.The board, meanwhile, is yet to decide on the evaluation and assessment pattern for class X board exams 2021, which were cancelled due to the pandemic. Also, the Board will decide on the dates for class XII board exams would be taken after review in the first week of June."}, {"Article Image": "https://static.toiimg.com/thumb/msid-82292947,width-1070,height-580,imgsize-1306766,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "Why Malaysia opens its doors to foreign universities", "Article's Text": "Congratulations! You have successfully cast your vote Login to view result\n\nIf you do not like it, change it - should be the mantra for students who wish to live in a better world and want to transform the world through their education.Malaysia is the education hub for several students from Southeast Asia and South Asia, who are aspiring to get advanced education and research opportunities. Every university must have a legion of academics working on various research areas and topics, intending to contribute to a better future. Partnerships with key research institutes around the world cement any academic institute’s strength as a leading research innovation and learning centre.Studying in an international university on campus helps the local students. Without moving away from home, the student can get a degree from a university ranking in the top position in various world rankings. Students will make up the future workforce, so we need to make sure that they are prepared for the coming time. We need to prepare them for jobs that have yet to be created. They need to be able to use technologies that have not yet emerged. We need to train them to look for solutions to problems that we have not even begun to imagine.The new-age universities are committed to providing students with flexible skills that will prepare them for future uncertainty and disruption.At the time of the global health crisis, the students need to understand the new normal and prepare accordingly.Teachers and students have adopted new ways of teaching and learning. This is a good sign that we are succeeding in producing agile, innovative and creative graduates.In the coming time, every employer will be looking out for flexibility and adaptability in its employees. Graduates will also be required to possess problem-solving and critical thinking skills. The students here are taught to understand the requirement of the local market and make the educational pattern in sync with the changing demands.More than 80% of job vacancies these days need some digital skills. Knowledge of data science, computer programming and artificial intelligence will help place one’s profile above the rest.Since Malaysia is a growing market, the students are being trained to understand the future of the digital market, data science and artificial intelligence (AI) to contribute to the changing market.Being centrally located, the universities need to create educated youth who would transform the financial, economic and social fabric of the society. The campus was set up 22 years ago and was the first foreign university to grace the shores. A futuristic technology-enhanced Medical Anatomy and Pathology E-Learning Lab in Malaysia is an illustration of this philosophy.The lab is designed to encourage collaborative learning, given that team collaboration is a crucial skill that every student needs to develop. It is integrated with an award-winning networked active learning ecosystem with multi-touch tabletop computers together and an extensive range of anatomy and pathology learning resources. It provides an immersive and engaging learning experience to the medical students."}, {"Article Image": "https://static.toiimg.com/thumb/msid-82288029,width-1070,height-580,imgsize-166712,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "iit guwahati news: IIT Guwahati to set up Mehta Family School of Data Science and Artificial Intelligence", "Article's Text": "Congratulations! You have successfully cast your vote Login to view result\n\nGUWAHATI: The Indian Institute of Technology (IIT-G) on Wednesday signed an MoU with the Mehta Family Foundation (MFF), USA, with the objective of promoting undergraduate and postgraduate studies in the fields of Data Science and Artificial Intelligence.The collaboration to set up the Mehta Family School of Data Science and Artificial Intelligence at IIT-G will usher in new opportunities for students at undergraduate and postgraduate levels. The first batch of B. Tech students for this school will be admitted through JEE in the academic year 2021- 22.The MoU was signed virtually by Prof. TG Sitharam, director of IIT-G, and Rahul Mehta, Chief Executive Officer, Mehta Family Foundation, USA, in the presence of a galaxy of luminaries and Dr. Rajiv I Modi, Chairman Board of Governors, IIT-G, and Prof. Krishnaswamy Vijayraghavan, Principal Scientific Advisor to Government of India, as the chief guests and Prof. Sandeep Verma, Secretary, SERB as the special guest.\"IIT Guwahati has always endeavoured to play a leadership role by diversifying the flavour of its academic programs. Mehta Family School of Data Science and Artificial Intelligence is another important initiative at IIT Guwahati that will bridge the gap of highly skilled personnel that exists in these emerging fields. I take this opportunity to thank Mehta Family Foundation for its enormous support in establishing this school which will offer both undergraduate and postgraduate programs, B. Tech in Data Science and Artificial Intelligence from this academic year,\" said Prof. Sitharam.He was hopeful that the school will be able to attract the best talents in the country to join the program. The school will establish chairs attracting world-class talent.As an outcome of this MoU signing, MFF will provide support for the development of the school’s infrastructure and programs at the IIT-G campus. The school will offer programs for visiting students and faculty between the school and US institutions.Highlighting the collaboration between IIT-G and the Mehta Family Foundation, Rahul Mehta, said, “The explosion of data across all fields of knowledge continues unabated. Just like computer science changed the world, data science and artificial intelligence are posed to do the same. These fields will shape the methods used in education and research across the spectrum of human knowledge.\"\"Global interdisciplinary collaborations as envisioned in this new school will lift our understanding of society and nature. Bringing together global talents such as Professor Shankar Subramaniam, Professor Rajesh Gupta (both Univ. of California, San Diego), and Professor Ananth Grama (Purdue Univ.) can accelerate the expansion in these fields. IIT Guwahati has the vision of the new talent India needs. Together we will build the framework for the future,\" Mehta added.Apart from providing time and expertise for academic and research activities in this new school, these distinguished professors from top US universities will also act as strategic advisors for the Mehta Family School of Data Science and Artificial Intelligence. These distinguished professors from top US universities will also act as strategic advisors. This, an IIT- G spokesperson said is the most unique aspect of this school and is a first in India.While addressing the gathering, Prof. K Vijayraghavan, Principal Scientific Advisor, Govt. of India, mentioned, “I am delighted to know that Mehta foundation has supported setting up of this Mehta Family School of Data Science and Artificial Intelligence at IIT Guwahati while working cooperatively through his time of the pandemic. With the available expertise, I believe, IIT Guwahati will take up this school as a foundation to set up data collection sites in the eastern region of the country for various sectors such as healthcare, climate, transportation, security, and other areas and convert the huge data into effective knowledge and understanding to serve the society in a better way.”Prof. R Bhattacharjee, head of Mehta Family School of Data Science and Artificial Intelligence, IIT-G felt that this new school will be an abode of academic excellence imparting state-of-the-art teaching, supported by research and technology development in frontier areas of data science and artificial intelligence. The curriculum has been developed to provide a strong theoretical foundation as well as an emphasis on different interdisciplinary application areas, he informed. \"One of the objectives of the school is also to take up targeted multi-year interdisciplinary research projects and solve the problems which benefit society at large, a deep-rooted vision of IIT Guwahati. The close association and support from Mehta Family Foundation has added an international flavor to this school from its very inception,\"Bhattacharjee added.All other dignitaries including, Prof. Sandeep Verma, Secretary of Science and Engineering Research Board (SERB), India, Prof. Shankar Subramaniam and Prof. Rajesh Gupta from the University of California, San Diego, USA, Prof. Ananth Grama, University of Purdue, Indiana, Prof. Sashindra Kakoty, Deputy Director, IIT Guwahati, Prof. Chitralekha Mahanta, Dean of Academic Affairs, IIT Guwahati, Prof. T. Punniyamurthy, Dean of Faculty Affairs, IIT Guwahati and Prof. Parameswar K Iyer, Dean PRBR, IIT Guwahati also graced the event with their virtual presence and expressed their enthusiasm and appreciation of the broad activities of this school in their brief statements."}, {"Article Image": "https://static.toiimg.com/thumb/msid-82285584,width-1070,height-580,imgsize-1117969,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "Online Classes: Study tips to score high in exams", "Article's Text": "Congratulations! You have successfully cast your vote Login to view result\n\nCovid-19 pandemic has forced the schools and colleges to shut the doors for traditional offline education and move to the digital mode classroom. There are many advantages and disadvantages of online classes. For some students, online courses may create a sense of isolation. Online learning requires time management skills, self-discipline, willpower, and strong motivation to stay focused.Here are some important tips for students to help them learn better through an online class and improve their grades:Though many online classes give you flexibility of timing, it's better to have a disciplined approach and fix the timing of the class. Treat online classes like in-person classes and have a routine just like you would if you were going to class in-person.Create an online discussion forum where students can post questions, have discussion and solve each others doubts. You can study together over video conferencing to get the benefits of studying in a group and have someone to hold you accountable.Though you don't have access to offline library, you teacher may offer various online study materials that you can use to practice and understand the concept better. And if you have any questions related to the study resources, feel free to ask your tutor.To give you a sense of regular offline classroom or lecture hall, have a dedicated study space to help you stay focused when it’s time to study and disconnect when it isn’t. Just make sure the space you choose is not too comfortable or distracting.Without a tutor overlooking you or classmate siting next to you, it’s easy to get distracted with social media, games, food etc. To eliminate or at least minimize these distractions, log off from your social handles and keep your study space separate from other distractions.It may be tempting to skip taking notes when all the resources are available online and can be accessed any time. While all your study materials may be available online but it's still very important to write down notes to engage with the study material and put it in your own words. It will help boost both your comprehension and retention.Have a deadline reminder for all your assignments and exams. In an online class, you need to be extra diligent about monitoring deadlines. Make sure you complete your syllabus in set deadline to avoid damaging your grades later. Put the reminders on your mobile calendar to make sure you don't forget your assignment or exam dates."}, {"Article Image": "https://static.toiimg.com/thumb/msid-82288020,width-1070,height-580,imgsize-1407689,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "Medical students suffer due to limited practical training at hospitals", "Article's Text": "Congratulations! You have successfully cast your vote Login to view result\n\nMedical students are at a loss as hospitals have exploded with Covid patients. Most medical colleges have shifted practical and clinical learning online in the second phase of Covid crisis.“Unlike the last year, when medical classes were held in a hybrid mode with the theory being conducted online and practical and clinical teaching in offline mode in short batches, this year all the three phases are being held virtually. As per the direction of Rajiv Gandhi University of Health Sciences that regulates all the medical colleges in Karnataka, institutes cannot call MBBS students to colleges for offline classes. The hospital visit for these students is also restricted,” says Dr Somashekhar SP, chairman and HOD Surgical Oncology, Manipal Health Enterprises Pvt Ltd, Bengaluru, Karnataka.The National Medical Commission (NMC) recently released a new module to help the medical colleges in exploring methods to conduct the theoretical, laboratory and clinical learning in virtual mode, he adds. Meanwhile, for postgraduate students, the theoretical and practical classes are suspended, and students are compelled to attend the Covid patients for their clinical learning.The major consequence of the Covid is borne by the postgraduate (PG) students, says Dr SK Jain, HoD, General Surgery, Maulana Azad Medical College (MAMC). \"Practical knowledge and laboratory learning along with real experience of patients is an important aspect of learning at the PG level. However, owing to the ongoing circumstances there are limited patients in the hospital. The situation is hampering the teaching for PG students,” he says.At AIIMS Rishikesh, where the hospital is experiencing an outburst in the number of Covid patients due to the recently held Kumbh, Dr Amit Gupta, additional professor, Surgery, AIIMS, Rishikesh says, “The classes for medical students are being held online. The institute had earlier conducted online exams for PG students and offline exams for MBBS in the last semester, however, this year owing to the circumstances the institute is preparing for online exams for MBBS students as well.“Since April 5, the MBBS classes have again shifted to virtual platforms from April 5. The theoretical lectures are being held on an online platform, in addition to which students are also shown presentations and demonstrations via virtual meetings to fill in for the absence of practical postings. The posting for senior students is also scheduled online where they are shown PowerPoint presentations,” says Amisha Maroo, final year student, MBBS, AIIMS, New Delhi."}, {"Article Image": "https://static.toiimg.com/thumb/msid-82293330,width-1070,height-580,imgsize-1451837,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "Kurukshetra University passes Rs 500 crore budget for 2021-22", "Article's Text": "Congratulations! You have successfully cast your vote Login to view result\n\nKURUKSHETRA: Kurukshetra University (KU) executive council (EC) in its online meeting held under the chairmanship of KU vice-chancellor (VC) Prof Som Nath Sachdeva passed a budget of Rs 500 crores for the financial year 2021-22.While the government grant for recurring expenditure will be Rs 180 crores, for the non-recurring side the government will give Rs 40 crore, told KU director of public relations (DPR) Prof Brajesh Sawhney.The budget and the audit report of KU was earlier approved by the finance committee of the Haryana government in its online meeting on April 23, 2021.The EC also approved the annual report-2020 of KU.Later in the evening, the KU court in its meeting approved the audit report, budget for 2021-22 and the annual report of KU."}, {"Article Image": "https://static.toiimg.com/thumb/msid-82292514,width-1070,height-580,imgsize-1384445,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "FM inaugurates India's first 3D printed house at IIT-Madras", "Article's Text": "Congratulations! You have successfully cast your vote Login to view result\n\nCHENNAI: Union Finance Minister Nirmala Sitharaman on Tuesday inaugurated the country's first 3D printed house at IIT, Madras, conceived by former alumini and built in just five days, and said the nation needs more such young minds, who send 'positivity and showcase India's abilities to the world.\"City based TVASTA Manufacturing Solutions built it on a concept by former IIT-M students.TVASTA Manufacturing was set up as part of the new incubator -- ASHA Incubator -- of the Ministry of Housing and Urban Affairs at IIT Madras.Speaking after inaugurating the 3D Printed House virtually, Sitharaman said the 'housing for all' scheme by 2022 as stated by Prime Minister Narendra Modi was a 'huge challenge' in terms of meeting the deadline.\"With construction of a conventional housing being very complex... and with your concept of building a house in five days, I don't think it will be a massive challenge for building 100 million houses by 2022\", she said.With TVASTA Manufacturing Solutions using indigenous methodologies in design and construction till completion, she said, with an Indian mind, Indian design and Indian creativity involved (in this project), it showcases atma nirbhar.\"It is all Indian, it is amazing. It is the young mind which is delivering this and India needs more of this.(The country's) young minds send positivity and showcase India and its abilities,\" she said.Sitharaman said she was impressed when infrastructure major Larsen and Toubro (L&T) built a two storeyed house with the TVASTA Manufacturing Solutions in Kancheepuram.Referring to the completion of the house on a 600 square foot area at IIT-M, she said, \"India is set for a bright future in terms of meeting the target on affordable housing.We need rapid, scalable models, which is what you have shown us today\".While extending her greetings to the young entrepreneurs, Sitharaman said she was sure that as and when the government looks at such projects (for its welfare programmes), the IIT-M project would be on top of the list.The single-storey house has one bedroom, hall and kitchen, developed w'Concrete 3D Printing\" technology.It was developed in association with Habitat for Humanity's Terwilliger Centre for Innovation in Shelter.TVASTA Manufacturing Solutions co-founder Adithya V S, the concrete 3D printing technology is a 'ready to implement methodology' with no lead time on manufacturing, thereby significantly reducing construction time.\"This technology can enable deep personalisation of construction for the ultimate target segment -- who is the individual.3D Printing can ensure that affordable, good quality housing is available to all Indians,\" he said."}, {"Article Image": "https://static.toiimg.com/thumb/msid-82292355,width-1070,height-580,imgsize-1426121,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "IIT Madras, Anna University postpone exams", "Article's Text": "Congratulations! You have successfully cast your vote Login to view result\n\nCHENNAI: With the second wave of Covid pandemic creating unprecedented surge in cases and fatalities, the premier educational institutions of Chennai, IIT Madras and Anna University have postponed their semester examinations and even online tests.IIT Madras has sent a press release and a circular in this regard and the officials said that the next date of the examinations will be announced at a later date considering how the pandemic situation evolves out.IIT Madras has postponed its end semester exams which were to be held on May 10 and Anna University has postponed its online retest scheduled for May 3. Madras University has also cancelled its examinations following the surge in Covid cases and the second wave of pandemic.IIT Madras had planned to conduct written examinations from May 10 at the Kendriya Vidyalayas which were the January-May semester examinations of the premier institution.Anna university in a press release said that the re-test which was scheduled from May 3 will not happen owing to the pandemic. The university had to plan a conduct retest for students of its four campuses who had faced glitches during exams conducted in February and March.Madras University which had planned to conduct semester examinations from May 17 has also postponed its examinations."}, {"Article Image": "https://static.toiimg.com/thumb/msid-82292728,width-1070,height-580,imgsize-1173633,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "Will conduct 10 and 12 board exams: Andhra CM", "Article's Text": "Congratulations! You have successfully cast your vote Login to view result\n\nAMARAVATI: Amid the spiralling second Covid wave, Andhra Pradesh chief minister Y.S. Jaganmohan Reddy, on Wednesday, insisted that the state will conduct tenth standard and intermediate (class 12) board exams this year.He said that the government is conducting Board examinations to ensure that students have a better future and assured them that he has every student's future in mind while taking this decision.As only pass certificates would be issued by the states which have not conducted the exams, how will our students get admission in good institutions on the basis of a pass certificate alone, he queried.Pointing out that the central government has left it to the state governments to decide whether or not to conduct tests in the current scenario, Reddy noted that examinations are underway in some states following strict measures, a statement issued by the government said.\"SSC and Inter examinations are very important to the students as their future depends on those certificates. The state government will ensure safety of every student in the state,\" the chief minister was quoted in the statement.The chief minister's unequivocal stand comes in the face of a strident campaign by the opposition, especially the TDP, demanding cancellation of the public exams in view of the pandemic.The chief minister attacked the opposition for their criticism on conducting 10th and Inter examinations. Trying to degrade the government even in the times of disaster, is not good, he said."}, {"Article Image": "https://static.toiimg.com/thumb/msid-82286364,width-1070,height-580,imgsize-1220689,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "Assam education news: Assam: Two-week shutdown of edu centres after Covid spike", "Article's Text": "Congratulations! You have successfully cast your vote Login to view result\n\nGUWAHATI: All educational institutions, including coaching centres and hostels, here closed on Tuesday, as the daily count of positive cases crossed the 1,000 mark in Kamrup (Metropolitan) district on Monday.The closure directive will persist till May 11, read the order issued by the Kamrup (Metropolitan) deputy commissioner. It stated that while all government and non-government educational institutions, including colleges and universities, will remain closed in the district, direction has been issued to make online classes available during the period of campus closure.Campuses will be shut in at least 15 other districts from Wednesday, after the state education department issued another order to close down all educational institutions in districts where the cumulative total of positive cases in the last 10 days exceeded 300. In view of the fresh directive to save campuses from the second wave of Covid-19, educational institutions, hostels and coaching institutes will remain closed for 15 days from Wednesday (April 28) till May 12 across Kamrup, Dibrugarh, Sonitpur, Nagaon, Tinsukia, Jorhat, Barpeta, Cachar, Karbi Anglong, Golaghat, Darrang, Hojai, Bongaigaon, Nalbari and Sivasagar districts. All of these areas crossed the 300 figure by Monday night.These closure orders, if not reviewed, may jeopardize the plans to conduct the Class 10 and 12 state board examinations, scheduled to begin on May 11. The new academic session in the schools of Assam began on April 1 and thus, there is little pressure on the state government to restart the offline classes soon. However, sources in the education department said that when campuses remain closed, the conduct of the board examinations may draw flak from the public.The Board of Secondary Education, Assam (Seba) will review the Covid situation in the first week of May, before taking a final decision on the Class 10 boards. Seba chairman RC Jain, however, told TOI that they are willing to go ahead to conduct the exams as per the already announced schedule. “We will review the Covid situation on May 4 in order to take a call on the boards. Everything will depend on the improvement or deterioration of the situation. But I believe that there is a vast difference between conducting regular classes and conducting examinations,” Jain said.Seba recently announced a new sitting arrangement in exam halls to maintain distancing. But Jain informed that the board has also sought the opinion of the health department for conducting the board examination amid the surge.The Assam Higher Secondary Education Council (AHSEC) too, has adopted a wait and watch policy before taking a final decision on the upcoming Class 12 state board examinations. “Very soon we will decide on the exam plans. Closure of the campuses in several districts, as directed by the government, is a new problem,” AHSEC secretary Ramesh Chutia said.All exams under Gauhati University (GU) have been put on hold till further orders. A meeting chaired by GU vice-chancellor Prof. Pratap Jyoti Handique on Tuesday discussed in detail the nature of internet connectivity available to all students. About 2.5 lakh students live in different remote areas. And not all of them have laptops and smart phones. It has been decided that these examinations will be held in the offline mode with 20 days prior notification after the situation reverts to normalcy.“Many of our students are from the remotest corners of the state. For them, the online mode of examination is not feasible at all,” said GU registrar HK Nath. The boarders of all GU hostels have been asked to vacate the hostels at the earliest."}, {"Article Image": "https://static.toiimg.com/thumb/msid-82287206,width-1070,height-580,imgsize-162059,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "CSEET Admit Card 2021 likely to be released today at ICSI website", "Article's Text": "Congratulations! You have successfully cast your vote Login to view result\n\nOpen the official website of ICSI - icsi.edu Click on the 'ICSI CSEET Admit Card 2021' link available on the homepage Enter your login details and click on submit Your ICSI CSEET 2021 admit card will be displayed on the screen Download your admit card and take a print out of the same for further reference\n\nNEW DELHI: The Institute of Company Secretaries of India (ICSI) is likely to release the admit card for the upcoming Company Secretary Executive Entrance Test (CSEET) on the official website on Wednesday, April 28, 2021. Once released, the ICSI CSEET 2021 Admit Card can be downloaded from the official website - icsi.edu.Candidates who have applied for the ICSI CSEET 2021 Examination are advised to keep checking the official website of the Institute - icsi.edu - to get the admit card download link. The direct link to download CSEET 2021 admit card will also be provided below once it's uploaded on the official website of the Institute:As per the schedule released by the ICSI, the CSEET 2021 examination will be held on Saturday, May 8, 2021. As per the information available on the official website of the examination, the ICSI CSEET 2021 Admit Card will be issued 10 days prior to the Test.Candidates can follow the step-by-step guide provided below to check and download their ICSI CSEET 2021 Admit Card:"}, {"Article Image": "https://static.toiimg.com/thumb/msid-82285279,width-1070,height-580,imgsize-111804,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "Jawaharlal Nehru University: 3-day COVID vaccination camp on JNU campus for eligible employees", "Article's Text": "Congratulations! You have successfully cast your vote Login to view result\n\nNEW DELHI: The Jawaharlal Nehru University Tuesday said it will organise a three-day COVID-19 vaccination camp on the campus for its eligible employees and their dependents.The camp will be organised from April 29-May 1 at the Faculty Club, near the railway reservation centre within the campus, and beneficiaries will have to register themselves for taking the shot, the university said.The drive will cover all \"serving employees and their dependents (age group 45 years and above) and all staff working under essential services of the University residing both inside and outside the campus\", the JNU said in a circular.\"The camp will be organised by the District Magistrate, New Delhi, from 9.30 am to 4 pm,\" it said.The circular further said that in order to avoid crowding beneficiaries should intimate the JNU Security Department in advance and also register at http:elfregistration.cowin.gov.in/The security department will provide facility to the vaccination venue in groups of 2-3 individuals, the university said."}, {"Article Image": "https://static.toiimg.com/thumb/msid-82286234,width-1070,height-580,imgsize-198216,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "BRO Recruitment 2021: Apply for 459 vacancies in General Reserve Engineer Force", "Article's Text": "Congratulations! You have successfully cast your vote Login to view result\n\nPost name Vacancies Draughtsman 43 Supervisor Store 11 Radio Mechanic 4 Lab Asst 1 Multi Skilled Worker (Mason) 100 Multi Skilled Worker (Driver Engine Static) 150 Store Keeper Technical 150 Total 459\n\nCategory Fees General candidates\n\nand EWSs including\n\nExservicemen Rs 50 Other Backward Class candidates Rs 50 Scheduled Caste & Scheduled\n\nTribe NIL Physically Handicapped Persons NIL\n\nNEW DELHI: Border Roads Organisation (BRO) has invited applications for the recruitment of various posts in the General Reserve Engineer Force from Indian National. It should be noted that the recruitment is being done for male candidates only.Candidates can visit the official website of BRO — bro.gov.in — to check and download the recruitment notification.Border Roads Organisation conducting this recruitment drive to fill up a total of 459 vacancies. It should be noted that the vacancies are liable to increase/decrease/cancelled without any further notice.Candidates must pay the application fee (Non-Refundable), directly through an online URL link https://www.onlinesbi.com/sbicollect/icollecthome.htm?corpID=1232156 in favour of Commandant, GREF Centre, Pune-411 015. No other mode of payment will be accepted. The Candidate must attach the copy of e-receipt along with his application form. Application fee for each category mentioned as below:1. Only Male candidates need to apply. Female candidates need not to apply.2. A candidate must be either:- (i) a citizen of India, OR (ii) a person in whose favour a certificate of eligibility has been issued by the Government of India.3. Centre for Physical Efficiency Test & Practical Test (Trade Test) and Written Test – All tests would be conducted at GREF Centre, Dighi Camp, Alandi Road, Pune – 411015, however in case of any administrative constraints the tests may be held in an decentralized manner. The candidates would be allocated a centre close to the place of their residence as per address in application (discretion of department would be final for allotment of the centre).4. All applications quoting the Advertisement No, date and post applied for should be submitted to Commandant, GREF CENTRE, Dighi Camp, Pune - 411 015 through Registered post alongwith acknowledgment."}, {"Article Image": "https://static.toiimg.com/thumb/msid-82293695,width-1070,height-580,imgsize-1408917,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "TOP SIX Online CODING classes for kids: Summer 2021", "Article's Text": "Online Coding Classes for kids are no more an extra academic activity rather a necessity in learning syllabus for them. With each passing day, our connect with the technology increases and we move a step ahead towards a digital future. As a result, learning to cope up with this growth is vital for both kids and adults and for the same comes the requirement of learning CODING as a language for everyone.\n\nLearningliterally requires efforts like that of learning a language and researchers say, “Earlier you start learning a language, faster you learn”, Thus, it gets extremely important for the young minds to be channelized towards prepping themselves for the digital future and the best part is Young kids can learn it faster as their developing brains are made for learning, so what can be better than empowering them to be ready for the Future, specially during their\n\nParents may find it difficult to teach Coding to kids if they have experience more on traditional education. Luckily, there are plenty of ONLINE portals, applications, institutes, programs for kids to learn the basics of the Coding and move ahead in learning it all, that too Online, from the comfort of their home.\n\nCODING WEBSITES are a popular choice, considering the new education policy announced and the need of learning the same, But which one is the best for your child?\n\nThere are plenty of Coding platforms for you to explore for your kids, however we have tapered it down to our favorites and best in the industry with the vision to evolve the learning system of kids!\n\nCongratulations! You have successfully cast your vote Login to view result\n\nTABLE OF CONTENT\n\nWhitehatJR: Live Online Coding for kids\n\nMindBox D2H: Evolving Education with Best Designing & Coding Courses For Kids\n\nCampK12: Code. Compete. Win\n\nVedantu: Learn Live Online\n\nCue Maths: The Math Expert\n\nCodeshala: Coding Courses for Kids\n\nWhiteHat Jr:\n\nLive Online Coding For Kids\n\nFocused on teaching Logic, structure and algorithm thinking to young kids, they conduct 1:1 classes taught by experts for kids studying in Grade 1 to Grade 10. Their strong visibility in the industry makes it irresistible to not bring it along with the name Coding. ‌The‌ ‌company‌ ‌has‌ ‌IIT‌ ‌and‌ ‌IB‌ ‌trained‌ ‌professionals‌ ‌and‌ ‌offers‌ ‌a‌ ‌diversity‌ ‌of‌ summer ‌courses‌ online ‌ranging‌ ‌from‌ ‌beginner‌ ‌to‌ ‌professional‌ ‌levels.‌ ‌‌\n\nSummer Courses offered are:\n\nIntroduction to Coding\n\nCourse content: Sequence, algorithms, variables, functions, events.\n\nApp Developer Course\n\nCourse content: Animations, Game design, Advanced App structures.\n\nAdvanced Coding with Space-tech\n\nMindBox:\n\nEvolving Education with Best Designing & Coding Courses For Kids\n\nWith their curriculum, they focus on creating an urge and passion to learn and know more about technology among kids aged between 6 to 16 years and with their fun 1:1 interactive live sessions and Project Based learning they help kids execute their passion towards creating master pieces using the technology and help them become Designers and Coders in early age that too Online. Kids also get an opportunity to experience professional environment through internship opportunities offered and with their hands on Professional tools used in the industry.\n\nTo‌ ‌get‌ ‌an‌ ‌actual‌ ‌experience‌ ‌of‌ ‌the‌ classes,‌ ‌you‌ ‌can‌‌ book your free demo‌ link here.‌ ‌\n\nSummer Courses That Your Child can choose:\n\nGame Design with Coding - 6 to 16yrs\n\nGraphic Design - 6 to 16yrs\n\n3D Design with Animation - 11 to 16yrs\n\nApp Design with Coding - 11 to 16yrs\n\nWeb Design with Coding - 11 to 16yrs\n\nCoding for junior champs - 6 to 10yrs\n\nCoding with JavaScript - 11 to 13yrs\n\nCoding with Python - 14 to 16yrs\n\nCamp K12:\n\nFounded in 2010, by MIT Computer Science graduate treats learning as a continuous process and thus offers year-long courses on different topics. They introduce JS from the 5th grade and allow children to learn Augmented Reality projects, Mobile app development, VR games, Web Development with HTML, CSS. They are known for their Excellent process, guidance and follow up and are trusted by hundreds of schools\n\nVedantu:\n\nVeda meaning 'Knowledge' and Tantu meaning 'Network', They believe in spreading the knowledge around the network of kids by offering interactive learning between a teacher and a student. They offer both individual and group classes. On Vedantu a teacher is able to give personalized teaching using two-way audio, video and whiteboarding tools where both teacher and kids can interact and access. Their program is specifically designed for kids studying in grades 6th to 12th and focus on covering up CBSE, ICSE, IIT, JEE courses too.\n\nCue Maths\n\nIt is the one of the world’s leading live-class platform for math and coding skills. With their curriculum accredited by STEM.org, they have impacted 100,000+ students in 20+ countries. They focus on building logical and mathematical thing in students and offers different coding courses for students studying in grade 1 -12 with their goal for students not just to build apps and games but a deep mastery of computational thinking. Their continuously work on achieving their goals with continuous efforts of expert teachers.\n\nCodeshala\n\nThey offer both online and offline education to kids through their centre, or at student’s home or even Online. Their each course has 3 levels comprising of 6 classes each. With their Belief That Computer Science Should Be A Part Of The Core Curriculum Along With Other Subjects and their dedicated team of professionals they focus on building a community of young Coders\n\nSummer Courses offered are:\n\nGame development\n\nApp Development\n\nWeb Development\n\nPython/ Java\n\nSchool curriculum"}, {"Article Image": "https://static.toiimg.com/thumb/msid-82288972,width-1070,height-580,imgsize-1390923,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "DU Admissions 2021: University plans to complete foreign students' admission by June", "Article's Text": "Congratulations! You have successfully cast your vote Login to view result\n\nDelhi University (DU) which opened the admission portal for foreign students on April 8, is planning to finish the admission process by June. Foreign Students Registry (FSR) is the window for admission of foreign nationals in different programmes of study taught in its various colleges, departments and centres of the University.Speaking to Education Times, Amarjiva Lochan, dean, International Relations and Foreign Students Registry, says that admission process is already delayed for foreign students due to Covid-19. They should not suffer due to delayed board results in India.“Some of the foreign applicants have already passed the qualifying examination in their respective countries. Moreover, DU has the provision of 5% supernumerary seats in its colleges for foreign nationals so it will not impact the enrolment of Indian students,” says Lochan. Earlier, DU used to complete 80-90% foreign admission by the end of April. “Mostly, Foreign Students Registry (FSR) admission starts in February and close to 80-90% admissions get over by April,” says Lochan.“DU has received new applicants from countries such as Argentina, Mexico, the Netherlands, Malaysia,” says Lochan. The university earlier had students from countries including Afghanistan, Nepal, Bhutan, Tibet, Bangladesh etc. “Most students from developing countries prefer courses in Computer Science and Bachelor of Management Studies. Among PG students, Political Science is one of the most sought-after courses,” adds Lochan. Last year, the university took various steps including the extension of the application deadline, easing the administrative process to attract foreign nationals. “With the collective efforts, the university not only retained the foreign enrolments, but surpassed the previous year’s figure. In 2020, DU enrolled 562 students as compared to 556 in 2019,” says Lochan. According to the merit list for the academic session 2020-21, Political Science and Psychology were among the top in the list of the most preferred courses at undergraduate and postgraduate level, respectively. A total of 44 candidates made it to the merit list for BA (H) Psychology and 43 candidates for BA (H) Political Science. For MA Political Science, 29 students made it to the merit list in the academic session 2020-21. For Bachelor of Law programme, 51 students figured in the DU admission list.Students from Afghanistan and Nepal have traditionally been largely representing foreign students on the DU campus. “Availability of scholarships and easy connectivity are major reasons that can be the reason for maximum applications from the two neighbouring countries,” adds Lochan.Other than these two countries, students from Kenya, Ghana, Tanzania, China, Mongolia, Palestine, Mauritius, Sri Lanka, Armenia, Bangladesh, Republic of Korea and Swaziland had applied in the year 2020."}]