[{"Article Image": "https://static.toiimg.com/thumb/msid-82284465,width-900,height-1200,imgsize-423188,resizemode-6.cms", "Article's Title": "Kangana Ranaut's saree looks that we love", "Article's Text": "Cannes 2019\n\nThe actress is the queen of Kanjeevaram sarees and she made heads turn at Festival de Cannes. The plum-tinted gloves added much-needed drama to her overall look."}, {"Article Image": "https://static.toiimg.com/thumb/msid-82292481,width-900,height-1200,imgsize-273369,resizemode-6.cms", "Article's Title": "Dreamy lehengas from Ananya Panday’s closet", "Article's Text": "​Sunshine yellow\n\nThe star kid was seen sporting a yellow lehenga with a stylish blouse that came with mirror work. She opted for a braided ponytail which added extra charm to her overall look."}, {"Article Image": "https://static.toiimg.com/thumb/msid-82293201,width-900,height-1200,imgsize-244879,resizemode-6.cms", "Article's Title": "Prarthana Behere's best ethnic look's", "Article's Text": "​Beauty in ruffled saree\n\nPrarthana looked stunning in this all-back ruffled saree. She completed her look with a gold necklace and straightened hair."}, {"Article Image": "https://ichef.bbci.co.uk/news/1024/branded_news/DF55/production/_118237175_globe.jpg", "Article's Title": "Arts venues urge PM to act over post-Brexit touring 'crisis'", "Article's Text": "\"We are extremely concerned by the lack of progress which has been achieved over the last three months to unravel the mountain of costly bureaucracy and red tape which now faces the creative industries,\" the letter said."}, {"Article Image": "https://ichef.bbci.co.uk/news/1024/branded_news/1795C/production/_118240669_hamilton_new.jpg", "Article's Title": "Hamilton is latest musical to announce West End return", "Article's Text": "Sir Cameron said he was \"moved and inspired by the resilience and camaraderie of so many practitioners from all aspects of our industry who have taken on any job so that they and their families could survive\"."}, {"Article Image": "https://ichef.bbci.co.uk/news/1024/branded_news/12235/production/_118239247_gettyimages-1040917798.jpg", "Article's Title": "Manchester International Festival to go ahead with Covid looming large", "Article's Text": "\"There are probably only a small number of projects that are unaffected, either practically or thematically by the last year, and that's because all of the work is being made new in the moment that we're in,\" he explained."}, {"Article Image": "https://ichef.bbci.co.uk/news/1024/branded_news/23CB/production/_118236190_brits-2021-comp.jpg", "Article's Title": "Brit Awards 2021: Double trophy for winners revealed", "Article's Text": "Devlin said she wanted winners to give their second trophy \"to someone they consider worthy - it might be recognition - or it might be someone that does something entirely unrelated to music\"."}, {"Article Image": "https://ichef.bbci.co.uk/news/1024/branded_news/6E0D/production/_118237182_d13b9da7-e1a0-4b36-8160-3802a42ae641.jpg", "Article's Title": "Britney Spears asks to address court over conservatorship case", "Article's Text": "Exact details of her order have not been made public but a conservatorship is granted by a court for individuals who are unable to make their own decisions, like those with dementia or other mental illnesses."}, {"Article Image": "https://ichef.bbci.co.uk/news/1024/branded_news/DFFE/production/_118224375_order6623_2019ac07308_0.jpg", "Article's Title": "Empty gallery gives space to restore monumental painting", "Article's Text": "\"I've been so privileged to have this space. I have a few weeks left to work and then I'll be sad to leave but all the work we do is to make the paintings accessible, get them out there, get more people to see them."}, {"Article Image": "https://ichef.bbci.co.uk/news/1024/branded_news/7062/production/_112707782_baftaaf_cutp.jpg", "Article's Title": "Bafta Television Awards 2021: The main nominations", "Article's Text": "Here is the list of the nominees in the main categories at this year's Bafta Television Awards, which will be held on 6 June."}, {"Article Image": "https://ichef.bbci.co.uk/news/1024/branded_news/127F/production/_118153740_emiliaclarkeheadshot_creditrobertascroft.jpg", "Article's Title": "Emilia Clarke on the book that helped her to grieve for her dad", "Article's Text": "\"She would really have loved to be a mother of dragons, she was completely taken with that idea. Really good escapist cop shows or something like Game of Thrones, it allows you to clear your mind of the things that are worrying you and anxieties,\" he continued."}, {"Article Image": "https://ichef.bbci.co.uk/news/1024/branded_news/0913/production/_115332320_boyega_low.jpg", "Article's Title": "Bafta TV Awards: Steve McQueen's Small Axe leads nominations", "Article's Text": "\"And that period of time from the 60s to the early 80s, for me, it was a time where things were being contested and stories, which were being sort of swept under the carpet, needed to be spoken about and needed to be seen.\""}, {"Article Image": "https://www.thehindu.com/entertainment/movies/9wselg/article34429778.ece/ALTERNATES/LANDSCAPE_615/allu", "Article's Title": "Allu Arjun tests positive for COVID-19, under home quarantine", "Article's Text": "The Telugu star has multi-lingual action thriller ‘Pushpa’ set to release on August 13 in theatres\n\nTelugu superstar Allu Arjun on Wednesday said he has tested positive for the novel coronavirus and is under home quarantine.\n\nThe 38-year-old actor shared a note on Twitter to inform about his diagnosis.\n\nAlso Read | Get ‘First Day First Show’, our weekly newsletter from the world of cinema, in your inbox. You can subscribe for free here\n\n“Hello everyone! I have tested positive for Covid. I have isolated myself at home and have been following all the protocols. I request all my well wishers and fans not to worry as I am doing fine,” he wrote.\n\nArjun urged all those who came in contact with him to get tested.\n\n“I request those who have come in contact with me to get tested. Stay home, stay safe and get vaccinated when you get the chance,” he said.\n\nWork wise, he has multi-lingual action thriller “Pushpa” set to release on August 13 in theatres. He is also set to team up with “Bharat Ane Nenu” fame director Siva Koratala."}, {"Article Image": "https://static.toiimg.com/thumb/msid-82290053,width-900,height-1200,imgsize-295397,resizemode-6.cms", "Article's Title": "These Pictures of Ileana D'Cruz Will Make You Fall Head-Over-Heels for Her", "Article's Text": "​Hotness alert\n\nThose expressions will make you go crazy for her. We love the way she has styled her outfit, and the subtle makeup look is on point."}, {"Article Image": "https://www.thehindu.com/entertainment/reviews/hvgwop/article34428964.ece/ALTERNATES/LANDSCAPE_615/30tvfduetjpg", "Article's Title": "A fête in Irinjalakuda celebrated the versatility and genius of Swathi Thirunal", "Article's Text": "The four-day festival featured music concerts and a Mohiniyattam recital\n\nA four-day music and dance festival dedicated to Maharaja Swathi Thirunal was held at Irinjalakuda recently.\n\nOn the first day of the programme, Cherthala K N Ranganatha Sharma started with the Kamboji varnam. He then made a precise aalapana of Bahudari followed by the krithi ‘Gurupavanalaya’ of Sundaranarayana. ‘Jalajanabha’ (Kedaragowla) and ‘Paalayamadhava’ (Asaveri), both composed by Swathi, were marked by the beauty of the leisurely pace with which they were delivered. The latter was decorated with an array of swara passages with a judicious mix of Jhanda patterns. ‘Pahitharakshu’ (Anandabhairavi) of Swathi was executed in a slow tempo setting the stage for main piece. A neat alapana of Sreeranjini panning its contours preceded the main piece — ‘Bhavaye Sree Janaki Kantham’, which was decked with niraval and swara passages. Solo essays of Panthuvarali and Sreeranjini by violinist N Sampath were noteworthy. Support by KS Maheshkumar (mridangam) and Vazhappally R Krishnakumar (ghatam) enhanced the concert.\n\nCherthala K N Ranganatha Sharma participating in a music festival in Irinjalakuda to celebrate Swathi Thirunal. He was accompanied by N Sampath (violin), K S Maheshkumar (mridangam) and Vazhappally R Krishnakumar (ghatam) | Photo Credit: Special arrangement\n\nVivek Moozhikulam performed on the second day. ‘Saarasasamamridhu’ in Gowrimanohari with swarakshara phrase in its pallavi was well delineated and the Sudhadhanyasi piece ‘Samodham Chinthayami’ was well received. However, instead of concentrating on the krithis of Swati, he chose to sing several other compositions. The solo presentation of Valachi and Saramathi by violinist Viju S Anand were praiseworthy and the deft handling with delicate touches by Palakkad A M Harinarayanan on the mridangam was commendable. Kottayam Unnikrishnan was on the ghatam.\n\nVivek Moozhikulam in the company of Viju S Anand (violin), Palakkad A M Harinarayanan (mridangam) and Kottayam Unnikrishnan (ghatam) participating in a music programme in Irinjalakuda to celebrate Swathi Thirunal | Photo Credit: Special arrangement\n\nN J Nandini presented a well-structured concert on the third day. She took off with a rarely-heard ‘Sree Ramachandra’ (Thodi) enriched with swara passages followed by ‘Jaya Jaya Padmanabhanujesa’ (Manirangu). Malayamarutham blossomed with a pretty aalapana and the krithi ‘Padmanabhapaalithebha’ was tagged on to it. After the padavarnam ‘Sumasayaka’, she took Hamsanandi for elaboration with full vigour especially in the higher echelons and experimented with sruthibhedam at rishabham to create Hindolam for a while. ‘Paahijagadjanani’ was the krithi rendered. ‘Bhavayami’ was the main piece and she devoted time to elaborate all the seven ragas before garlanding the krithi with several cycles of ragamalika swara phrases. ‘Saramaina’ (Behag) and ‘Panimathi’ (Ahiri) constituted the post-thani session. She was accompanied by Thiruneloor Ajith (violin), Balakrishna Kammath (mridangam) and Harippad Sekhar (ghatam).\n\nNemmara brothers Kannan and Anand along with Kavalam Sreekumar and Thidanad Anu Venugopal on the thavil presented a nadaswaram duet on the fourth evening. Their absolute command and control over the instrument as well as their approach towards the depiction of each and every raga played were evident throughout the concert. Exposition of Lalithapanchamam by Anand before the krithi ‘Paramapurusham’ and Shanmukhapriya by Kannan preluding ‘Maamavakarunaya’ were well portrayed. Chakravakam was detailed before the main piece ‘Sarojanabha’, which was followed by Thani. ‘Aaaye Giridhar’ (Puryadhanasree) and thillana brought their concert to a close.\n\nA Kathakali pada kacheri comprising padams of female characters from select plays was led by P D Narayanan Namboothiri and Kalamandalam Vinod. ‘Sree Neelakanda’ (‘Dakshayagam’) in Neelambari, ‘Anupamagunanakum’ (‘Lavanasuravadham’) in Reethigowla, ‘Saamyamakannoru’ (‘Nalacharitham’) in Panthuvarali were presented. Effervescence of creative experimentation was the highlight as they chose the raga Arabhi instead of Darbar to present the padam ‘Poomadinotha Charuthano’, another piece from the play ‘Nalacharitham’. ‘Kandalathimodam’ (‘Kirmeeravadham’) unfurled in raagamalika with Kamboji, Hamsadwani and Hamirkalyani. Tabla accompaniment by Rathnasree Iyer deserves special mention. Murali Krishnan (veena), Murali Narayanan (flute), Rajnarayanan (madhalam) and P Nandakumar (edakka) were the other accompanists.\n\nA Mohiniyattam recital by Kalamandalam Prasheeja Gopinath was the final event. Starting with ‘Sreevighnarajam Bhaje’ in Gambheeranatta, she portrayed the story of Damayanthi in Charukesi varnam. Her pathos and suffering in the forest after being separated from Nala and their reunion was portrayed. ‘Jalajabandu’ (Surutti) and thillana in Dhanasree were the other pieces presented. Kalanilayam Gopinathan (nattuvangam), Bijeesh Krishna (vocal), Reghunath (flute), Kalamandalam Charudath (mridangam) and Nandakumar (edakka) supported the danseuse.\n\nThe fête was organised by Nadopasana, Irinjalakuda."}, {"Article Image": "https://www.thehindu.com/entertainment/huxsnw/article34432267.ece/ALTERNATES/LANDSCAPE_615/NetflixPlaySomething", "Article's Title": "Netflix’s Play Something feature is here to solve your binge-watching indecision", "Article's Text": "Netflix’s new feature ‘Play Something’ is evocative of traditional TV. Cameron Johnson, Director of Product — TV & Kids, tells us about the UX decisions and the timing of this shuffle feature\n\nOver the last year, binge-watching evolved from something recreational and occasionally addictive to something mediated into our daily routines as we work from home. But one thing remained universal: its ability to dismantle the foundations of traditional television peppered with advertisements and a finite schedule.\n\n(Subscribe to our Today's Cache newsletter for a quick snapshot of top 5 tech stories. Click here to subscribe for free.)\n\nNetflix has obviously pioneered this entertainment revolution, and the streaming company continues to innovate its interface and experience to keep users hooked and in control of what they want to watch. And then there are new features such as Play Something launching globally on April 28 across television interfaces.\n\nIn an exclusive interview over a video call from California, Cameron Johnson, Director of Product — TV & Kids, avers that at the core, Internet TV is all about empowering the user with control. “For the previous 70 years, we were at the whim of what the broadcaster wanted us to watch on, say, a Tuesday evening. Internet TV has broadened that with titles from thousands of channels,” he explains.\n\nHe adds, “However, with so many choices comes the need to make a choice; a lot of times that is straightforward especially when it’s the next episode of a series. But there are other times when the user or users want to watch something new but are not sure what that is. Play Something is a great marriage of our personalisation technologies; we are not choosing something randomly, we are choosing something based on your taste and watch history.”\n\nHow does it work?\n\nThere are three different ways to access Play Something. The first is a specialised button at the profile selection screen; which Johnson says is “ideal for those moments after you’ve just cooked dinner and you want to watch something immediately without having to choose.”\n\nThe second way is to access the app menu which is typically on the left of the screen, where there would be a Play Something option. The last one is a little more intuitive; as the user scrolls and browses further down the films and series options, a tile will come up with an option to Play Something, as if Netflix senses a little indecision.\n\nInto the tech Netflix’s personalisation technologies are powered by Artificial Intelligence, Machine Learning and a family of ranking algorithms. Netflix is accelerating the pace of algorithm innovation by putting together a two-stage online experimentation process. The first stage is a fast-pruning step in which the company identifies the most promising ranking algorithms from a large initial set of ideas. The second stage is a traditional ‘A or B’ test on the pared-down set of algorithms to measure their impact on longer-term member behaviour.\n\nThe user experience (UX) is something Netflix wanted to keep quite simple in terms of design, with as much screen space going to the title playing for a short time. This tile also has left and right arrows so the users can switch between recommendations offered up to them. There may also be an indicator text at the lower part of the Play Something tile, such as ‘We think you’ll like this classic TV show’ or ‘This is a block-buster movie like Spider-Man Homecoming.’\n\n“If the title is for mature audiences, the feature will inform you beforehand so you have the opportunity to make a more informed decision,” adds Johnson, “but after 30 seconds of playing the recommendation, the layer of Play Something fades away. But the user can always exit this feature.”\n\nDesigning the feature entailed a lot of iteration and testing, says Johnson. “We understood early on that the design element should be kept as simple and accessible as possible. The UX journey’s many iterations led to the final decision to ensure users know they’re in a mode where they can switch. It’s meant to be evocative of traditional TV’s channel changing, with the same simplicity.”\n\nJohnson also clarifies it is important the user is given information about why they received a certain recommendation, to draw a basic connect-the-dots.\n\nAccessibility in design is integral; Johnson and his team ensured it was a feature that those who are not very tech savvy would be able to navigate the feature with no fuss. “It is part of the Kids’ section too,” adds Johnson. “One of the things we know about kids is — and I have a 10 year old daughter and a 7 year old son — they tend to watch the same show over and over again. My son loves Pokemon, in particular, so getting them to watch something new can be hard. But my son loves Play Something because of that ‘mystery box’ element, so for him and other kids, it is a form of discovery of new content.”\n\nA cut above\n\nEarlier innovation features within Netflix include Previews, where a user can automatically play ‘trailers’ using autoplay to – literally – get a preview of a TV show or movie. Is Play Something a modification of Previews? “Not exactly,” responds Johnson, “what is most significantly different is Play Something just plays the title. Previews were designed to help the user evaluate and make a choice, but this goes a step forward and makes the choice for you while still leaving the final decision up to the user – you can always opt in or out.”\n\nAdditionally in August 2020, Netflix was also testing a ‘Shuffle Play’ button that also appears on the home screen. The company at the time confirmed they were testing the feature since July, explaining they test such features in different countries for varying time periods. In fact, for some users, Play Something is not entirely new; last year a few of them pointed it out being tested, particularly in the left-side menu of the TV interface.\n\nCameron Johnson, Director of Product Innovation - TV & Kids, Netflix | Photo Credit: Netflix Inc\n\nOwing to the pandemic, bringing Play Something to the television Netflix experience first was a conscious decision, agrees Johnson, as the television is often the unity point for members of a household — more than mobile phones and tablets — or after a day of work, chores, studying and more. But the natural calamity that follows everyone sitting down in front of a television is getting everyone to find a show that they will be happy to watch.\n\nOf course, in this case, it is not just one user’s watch pattern, but multiple. “Play Something actually helps this decision-making faster because you just go through this list and everyone can ask ‘are we okay with this title?’ and the decision is still made by the users at the end of the day in a much shorter time,” he laughs, adding he often experiences these moments of incertitude with his wife and kids in front of the TV.\n\nJohnson assures this is just the first launch of Play Something; time and more interaction with the feature will bring more iterations of the same. Is it a strategy to keep people within the Netflix experience as much as possible? Johnson says Play Something is one of many ways to resolve the frustration users feel trying to find a new title they would enjoy. He concludes, “The best part of my job is I get to make people happy with entertainment; and if that happens Netflix continues to prosper.”"}, {"Article Image": "https://www.thehindu.com/entertainment/movies/7ojpnu/article34428816.ece/ALTERNATES/LANDSCAPE_615/Arvinda-Avinash---Wide-Katte", "Article's Title": "A Kannada OTT platform to promote films from Karnakata", "Article's Text": "Called Katte, this platform will include Konkani and Tulu films along with music, theatre and games from every district of the state\n\nDo we need yet another OTT platform? Yes, say the Jugaari Brothers — actors Arvinda and Avinash Diwakar. The duo, grandchildren of the late Kannada actor, Naramsimharaju, has launched Katte, an OTT platform. “This will promote all the dialects of Karnataka, besides, theatre, cinema, music, games and quizes,” explains Avinash, who is also a successful producer-director-singer-composer.\n\nAlso Read | Get ‘First Day First Show’, our weekly newsletter from the world of cinema, in your inbox. You can subscribe for free here\n\n“The bigger players in OTT do not understand the culture of Karnataka,” says Avinash. “When we did our research, we realised that we had enough content to put out there. Sometimes the person who heads the content division, is from a different region and looks for content that he can relate to. We were also told that the subject must have a huge social media presence. That is when we decided to do something to promote and present content for ourselves and our State, as we are losing our audience in Karnataka itself.”Besides Kannada, there will also be content in Tulu, Konkani, Havyaka Uttara Karnataka, and old Mysore region dialects.”\n\nAnother problem they saw was of most content being urban. “The districts, taluks, and villages are ignored. People end up watching dubbed shows and shows that are not in sync with local sentiments and culture. Katte will bridge that gap, as we will have many in-house productions that will highlight local stories.”\n\nKatte means platform; the ‘ka’ stands for kathe, meaning story, and Kannada. To be launched in May, the app will be available on any device that can connect to the Internet.\n\nThe platform hopes to be a resource for little-seen actors and for directors too. “If a film fails to attract footfalls in the theatre, then it sinks into oblivion and no one outside Karnataka is interested in promoting them online. We will put up their films on Katte, so that they will be virtually available and accessible to all,” says Avinash, who is the Chief Operating Officer.\n\nBreaking up the name, Avinash says, “The ‘ka’ in Katte symbolises, kathe (story), Kannada and Karnataka. Hence in one line we can say that Katte is an OTT platform for anything to do with Karnataka.”\n\n“There is a huge gap in the entertainment sector that needed to be filled. The long-felt need for an OTT platform that exclusively caters to the needs of Karnataka’s entertainment sector, that promotes local artistes will now stand fulfilled,” adds Arvinda, the Chief Operating Officer Katte Entertainment Pvt Ltd\n\nBesides films and web series, bedtime stories, grandfather’s tales, reality shows for children, music, Kannada stand up comedy, will all form a part of the repertoire. For instance, there is Katte Gulli Cricket is planned on the lines of IPL, but to promote local rappers and musicians, where six players from different districts will contest in gully cricket. “We have also started four centres across the State for actors and content creators to connect with us and work locally too. This way they need not travel all the way to Bengaluru,” reveals Avinash, who adds, “We will also promote local rappers and musicians with a programme called Katte Gulli Cricket, where six players will play the game and contest with other districts or gullies. It will be on the lines of IPL, but will feature district or Taluk level gully cricket.”\n\nAs a tribute to their grandfather, the duo has planned a series of comedy shows. Next year they also hope to organise a comedy festival as a tribute."}, {"Article Image": "https://www.thehindu.com/entertainment/movies/5esyz/article34430002.ece/ALTERNATES/LANDSCAPE_615/SEN0013", "Article's Title": "The Joker has a message: How Sendrayan’s latest shoot came about", "Article's Text": "Actor Sendrayan believes that his ‘Comali’ photoshoot by L Ramachandran will grab eyeballs and raise awareness on the ongoing pandemic\n\nThe minute he heard the word ‘Comali’, Tamil actor Sendrayan thought of all the memorable on-screen clowns he has seen. “I remembered English film Joker, Bhagyaraj sir in Rudhra and Kamal Haasan in Apoorva Sagodharargal.”\n\nBut when it came to the day of shoot, he forgot them all. “I posed as myself,” he says. Sendrayan, a familiar face among Tamil movie buffs, is thrilled about his latest photoshoot featuring him as a clown. The photoshoot features not only the actor and a bunch of props, but also a public awareness message about the need to be safe during the second wave of COVID-19.\n\nThe photos are the brainchild of Chennai-based photographer L Ramachandran, who, along with his team comprising creative director Vidya Balaji, costume designer Sukumar and make-up artist Ilangeshwari, set on a task: to make Sendrayan look unique. “We scouted to get some colourful costumes and props,” recalls Ramachandran, who recently worked with actor Vijay Sethupathi for a photoshoot.\n\nIn a bid to acknowledge the second wave of COVID-19, the team incorporated elements that would convey a safety message to viewers. “We are trying to say: the situation is bad outside, so do not be a clown and try to venture out unnecessarily,” he adds.\n\nThat big step\n\nSendrayan hails from Bodinayakkanur in Theni, and came to Chennai armed with a manjapai (a yellow bag used to store personal belongings) and lots of tinseltown dreams. “I remember the day I got down at the bus stand at Parry’s Corner wondering how I would make ends meet in such a big city,” he recalls.\n\nSince then, Sendrayan did many odd jobs before landing up at director’s offices and working in various capacities. “I was a production helper for some time and then became a make-up assistant,” he recalls.\n\nStepping in front of the camera was a big step for Sendrayan whose first prominent outing was in Dhanush-starrer Polladhavan (2007). Since then, he has played a character artiste in many Tamil films, his most recent being Karthi-starrer Sulthan.\n\nHis participation in TV reality show Bigg Boss Tamil a couple of years ago gave him a shot at fame; Sendrayan believes that his latest ‘Comali’ photoshoot too will do something similar. The 38-year-old is currently in talks for half a dozen Tamil projects, one in Malayalam and Telugu, and will feature in TV dance show Jodi Number 1 as well."}, {"Article Image": "https://www.thehindu.com/entertainment/movies/g6hdhj/article34430371.ece/ALTERNATES/LANDSCAPE_615/MPMira-Nair", "Article's Title": "In filmmaking, bravery beats competence, says director Mira Nair", "Article's Text": "While working on artist Amrita Sher-Gil’s biopic, BAFTA jury member Mira Nair talks of the importance of experimenting with different forms of filmmaking\n\nOn Mira Nair’s watchlist tonight is a 1973 Mani Kaul film, Duvidha. Locked in, in Delhi, which has been brought to its knees by the COVID pandemic, the director of A Suitable Boy and The Namesake has turned to movies of the experimental kind.\n\nAs a voting member of the British Academy of Film and Television Arts (BAFTA) and a part of the Indian jury, the filmmaker has been extensively watching others’ work in order to select 10 artistes from India to be mentored under BAFTA’s Breakthrough India initiative.\n\nOver a video call, she says, “The longer I live, the more I realise that creative energy is not limitless. And therefore, I try to do things that give me energy.” Things like going over the work of 30 applicants to BAFTA Breakthrough India to “narrow down original voices that can get lost in our country of many, especially in an industry like ours where it is all about who you know,” she adds.\n\nBreakthrough India is supported by Netflix and aims to select talented people in the film, games and television worlds to take part in a year-long mentoring and guidance programme. The nominees will receive global networking opportunities, free access to BAFTA events and screenings for 12 months, and full voting BAFTA membership.\n\nMira and her fellow jurors, including ambassador AR Rahman, director Shonali Bose, cinematographer Santosh Sivan and producer Siddharth Roy Kapur among others, sat down for three hours to choose the nominees. “The first thing I said was that ‘I am looking for bravery, originality and a distinct voice, not competence, not imitation’.”\n\nCan you speak your truth?\n\nIn Mira’s books, bravery beats competence. “A lot of people can do a good imitation of art, but few have a way of capturing the world which is unique. It is how you choose to tell the story and from what point of view that defines bravery for me. That was something I saw in this lot [the nominees], they were experimental.”\n\nBravery to Mira, is in the intent: “the importance of speaking your truth”, in the craft: “finding new forms to tell a story”, and in not being afraid to be different — “even when no one understands what you are doing.”\n\nThrough her own journey into filmmaking, which started off with documentaries such as India Cabaret — an exploration of female strippers in then Bombay, Children of a Desired Sex, on the abortion of female foetuses, and The Laughing Club of India — Mira’s icons have been Richard Leacock and DA Pennebaker. “They were the pioneers of the Cinéma vérité movement and to this day, remain the barometers of truth for me,” she says.\n\nShe brings up Chris Marker’s La Jetée, a science fiction-ette about post-apocalyptic experiments on humans made entirely using black and white stills. “It told me so many things about how to evoke poetry, violence and surrealism without a big budget, relying on just art and its power.”\n\nAmrita and Awadh\n\nWhile movies like these are what she falls back to, Mira has also been trying to keep up with Netflix, Amazon and other OTT platforms. (Though she confides, “What does OTT mean yaar! Over The Top? Really, it’s that simple? I thought it would be more technical. Okay, I am with it now”, she lets out a short bark of laughter.)\n\nHer first digital release was last year’s A Suitable Boy, an adaptation of Vikram Seth’s 1993 novel set in a newly independent India.\n\nWith the Government of India now stepping in to regulate content on OTT platforms, what does it mean for artistic freedom? Mira pauses thoughtfully, before replying: “The most inventive cinema has been as a response to censorship. So I hope that a lid on our heads will make us dream more.”\n\nIt was when she was in Awadh, shooting A Suitable Boy, that she got her next project which would bring her back to the city. She will be adapting the 2020 Pulitzer finalist, The Jungle Prince of Delhi, a story published by The New York Times on a family living in a decrepit lodge in Delhi, claiming to be Awadh royalty.\n\nIt will be co-produced by Sister Pictures, who bankrolled the hit series Chernobyl. “Of course I was interested in the story; the whole world sent it to me when it came out. I was still in Awadh then, not imagining that I would give three more years of my life to that place. I was talking to the producers to help them and advise them about the place, and they said you must direct it,” she says.\n\nMeanwhile, Mira is also working on a feature film on Amrita Sher-Gil, the Hungarian-Indian painter regarded as one of the country’s greatest modern artists. Her other series National Treasure on Disney+ is a reimagining of the Nicholas Cage franchise with a ‘DREAMer’ child as the protagonist. “National Treasure is in the writers room now, after a brilliant pilot. We will start shooting early next year, in January, and I hope it will be released next summer.”\n\nFor The Jungle Prince however, it is still early days. “It is an operatic and ambitious story and we just found the right writers for it. It is not easy to conceive everything on Zoom, so we are waiting to gather in one place and discuss the shape of the story,” she says.\n\nThe series will be told in eight episodes of an hour each. “It is such a great story. It is our story, one of trauma and exile. If we don’t tell our own stories, someone else will, and mess it up,” she laughs."}, {"Article Image": "https://www.thehindu.com/entertainment/movies/ewsw81/article34428754.ece/ALTERNATES/LANDSCAPE_615/kimppuppet2jpg", "Article's Title": "Nokkuvidya Pavakali’s lone practitioner", "Article's Text": "A documentary film that puts the spotlight on the form of puppet theatre in Kerala that has only one practitioner left\n\nFreelance journalist-filmmaker Reshmi Radhakrishnan first heard about Nokkuvdiya Pavakkali, a form of puppet theatre, in 2017. “What was even more shocking or surprising was, Monipally, where the practitioners live, is barely 15-odd kilometres from my hometown, Ramapuram, in Kottayam district. And I had not heard about it,” she says. Curious, she travelled to Monipally to visit one of the last two surviving practitioners of the art form: Moozhikkal Pankajakshi.\n\nAlso Read | Get ‘First Day First Show’, our weekly newsletter from the world of cinema, in your inbox. You can subscribe for free here\n\nTaken by the performance aspect, she says that the ‘art’ part of it caught her eye. Later, when she thought more about it, she realised its significance. “The art form has sociological importance; it is a Dravidian art form. The artistic aspect aside, there is the cultural part too that makes it imperative that the art form is preserved.” It resulted in her 2020 documentary film Nokkuvidya, recently screened at Kochi. She earlier wrote about it.\n\nReshmi recollects her first impressions. “I felt bad about what I saw there,” she says. The wooden puppets were stored in a box under a bed in the house that Pankajakshi lived in with her daughter and granddaughter. “It did not look easy, looking at their means. Here they were preserving an art form despite the challenges... that struck a chord!” she says.\n\nUnlike other forms of puppetry, where the puppeteer uses his hands, here the puppets are handled on a stick, balanced on the base of the nose of the puppet. Not only does it demand dexterity but also practised eye-hand co-ordination.\n\nIn this case, the puppeteer, a woman, sits on the floor and uses her hands to control the puppets, while the other group members narrate the story, invariably from The Ramayana and The Mahabharata.\n\nA lost art\n\n“It used to be performed as entertainment by members of Kerala’s Velan Panicker community. Once upon a time the repertoire was not limited to puppet theatre, there were other forms such as juggling. But Nokkuvidya Pavakali is of special importance because practitioners are women. Other forms, in the past, did not allow women to touch the puppets,” she says.\n\nReshmi Radhakrishnan\n\nOctogenarian Pankajakshi, a Padma Shri awardee, had been practising the artform for more than 70-odd years. Over time as practitioners dwindled, she hoped to teach to others so that the artform would live on. Unable to find anybody, she convinced her then 13-year-old granddaughter Renjini KS to be her student. Now in her early 20s, Renjini, a college student, is possibly the sole practitioner of the art form.\n\n“Things are slowly changing; the troupe is being invited to perform [before COVID-19 struck]. Under the guidance of Natana Kairali (Irinjalakuda), they have been educated about the significance of the form; besides guidance promoting it,” says Tripunithura-based Reshmi. A research centre for Koodiyattam, Natana Kairali also teaches Mohiniyattam, Pavakathakali, and Nangiarkoothu besides conducting workshops related to the performing arts.\n\nHer interactions with Pankajakshi, during the course of the making of the documentary, showed her another side of the artist. “It showed me how art elevates a woman, I found her very different from her contemporaries [women]. She leads a troupe that comprises men, the income and position from what she does. Her awareness of herself, in the context, was interesting.”\n\nMore than as a documentary, Reshmi sees it as a resource or an archive. She spent time on research, speaking and consulting with experts such as Geetha Devi, professor at Sree Sankaracharya University of Sanskrit, Kalady. As this was her first experience, Reshmi turned to friends to help her with filming and the technical aspects of getting a film ready.\n\nThe documentary has been screened at festivals in India and abroad, and is still doing the rounds at the festival circuit."}, {"Article Image": "https://www.thehindu.com/entertainment/movies/o67fl6/article34421433.ece/ALTERNATES/LANDSCAPE_615/thamira", "Article's Title": "Tamil director Thamira passes away due to COVID-19", "Article's Text": "He was known for his films like ‘Rettaisuzhi’and ‘Aan Devathai’\n\nTamil director Thamira passed away on Monday after suffering from COVID-19 complications at a private hospital in Chennai. He was 53.\n\nThe filmmaker was known for his films like Rettaisuzhi and Aan Devathai. Thamira, whose original name is Sheik Dawood, is survived by three sons and a daughter.\n\nAlso Read | Get ‘First Day First Show’, our weekly newsletter from the world of cinema, in your inbox. You can subscribe for free here\n\nThamira began his career by assisting filmmakers K. Balachander and Bharathiraja. He made his directorial debut in 2010 with Rettaisuzhi, and cast both his mentors in the film in important roles.\n\nDirector Bharathiraja was one of the first to post on social media about Thamira’s death and expressed his condolences to the family, remembering his experiences working with the filmmaker. Several other actors, composers and technicians also shared their condolences on Twitter.\n\nThamira’s second movie was Aan Devathai in 2018, that starred Samuthirakani, Ramya Pandian, Kavin, and Monica. His next project was the web series My Perfect Husband, featuring Sathyaraj and Seetha, that was set to release on Disney+ Hotstar."}, {"Article Image": "https://www.thehindu.com/entertainment/movies/gs9p18/article34422620.ece/ALTERNATES/LANDSCAPE_615/0P3A1551", "Article's Title": "Meet ‘Cook with Comali’ star Ashwin Kumar: The man you know, the journey you don’t", "Article's Text": "In this interview, Ashwin Kumar discusses his long-short journey from Coimbatore, the success of the cooking reality show, and how the industry sees him, now that the spotlight shines brightly\n\nAshwin Kumar Lakshmikanthan left his hometown Coimbatore for Kodambakkam, the once-hub of Tamil cinema and a microcosm for film aspirants in the city’s ever-changing landscape, carrying big city dreams in his eyes. He had a crippling sense of fear when he landed in Chennai for an audition, having no prior experience nor influential people in his phonebook. He played a small part alongside actor Arya, who himself played a guest role in Kathai Thiraikathai Vasanam in 2014. The scene was eventually trimmed from the film, but it gave Ashwin the confidence of making it in the industry, until he was called for an audition for Mani Ratnam’s OK Kanmani (2015).\n\nAshwin had always looked up to three filmmakers: AR Murugadoss, Mani Ratnam and Gautham Menon, and the offer to be part of a Madras Talkies production [Ratnam’s banner] was just the icing on the cake. But the only thing is, it was not. When he arrived for the audition, the set was crowded with over 70 well-groomed models, both male and female, who too were squeezing for space to register their presence on screen. It was only then that it dawned on Ashwin that the dream — of becoming an actor — was a shared one with perhaps hundreds. He could not make a first impression with Mani Ratnam, though he had a photo opportunity and a blink-and-miss role as a background artiste in OK Kanmani.\n\nThe second bout of disappointment hit closer when Ashwin approached Gautham Menon for an acting gig, which left the filmmaker a little miffed — especially in the manner in which he landed up at his office. Having been fooled once for a fake audition call, Ashwin says it was actor Sivakarthikeyan who advised him to look up online for director’s offices and audition calls.\n\nLater, Ashwin was called for an audition and was eventually selected to play the hero’s friend in a film Gautham was making at that point. As fate would have it, two days before the shoot, Ashwin was informed of Gautham’s decision to cast a familiar actor in his place. Somewhere along, that is when Ashwin says he took the call: if he were to act, it would be as hero.\n\nLast year, Ashwin acted in a short-film called Kadhal Ondru Kanden, for which he received praise on social media. It got him the attention he longed for and a well-known filmmaker was ready to cast him in his film — but, as a supporting actor. The director apparently told Ashwin that he could not afford to cast him as the lead, unless he doubles up as a co-producer or has some sort of fame.\n\n“That really broke me. At the end of the day, I realised I cannot make it on my own, even if I have the talent. I kept thinking, what more should I prove to this industry? How much more should I sacrifice?” says Ashwin, over a phone call, just a week after the finale of Cook with Comali, the reality television show that put him on the map.\n\nAshwin shot to fame after appearing in ‘Cook with Comali’ | Photo Credit: Special Arrangement\n\nAshwin turned to cooking purely for survival reasons, when he had no money and was living under the shelter of his friend, while trying auditions and facing rejections. “I took the responsibility to cook while my friend used to do the dishes. You can even cook but dish-washing is the most difficult part,” he says with a laugh. Little did he know then that what started as a basic survival skill would one day fetch him the second runner-up on a cookery show.\n\nIn this interview, Ashwin discusses his long-short journey from Coimbatore, the success of Cook with Comali, and how the industry sees him, now that the spotlight shines brightly on him.\n\nEdited excerpts:\n\nIt has been over a week since Cook with Comali ended. What is your headspace like?\n\nIt was initially hard to adjust to the routine. I went off social media and isolated myself in a room. Then, a week later, I slowly got back to my senses and started accepting things.\n\nWas it a transformative experience for you?\n\nI didn’t change much, as a person. What you saw on TV is who I am in real life. Having said that, it takes time for me to open up...I’m not that fluid, despite having done other shows for Vijay TV. In fact, the camera never used to linger on me because they always thought I was this quiet, shy person. People have ignored me in the past, thinking that I probably had an attitude. And I couldn’t break that perception.\n\nEven on Cook with Comali, I took my own time to warm up. But there were people like Rakshan, Shivaangi, Pugazh and Sharath, who made me feel inclusive. I have to credit Shivaangi for helping me loosen up. They showed a positive vibe and the show’s format itself is light-hearted. Now, I come up with my own set of counters (punchlines), thanks to them.\n\nAshwin Kumar is acting alongside Pugazh in an upcoming Tamil film | Photo Credit: Special Arrangement\n\nLet us take you back in time, when you left your hometown to get into films. Being an outsider, was there a sense of insecurity?\n\nIt wasn’t smooth sailing for sure and my insecurity doubled when I came to Chennai. If not for my friend, who was motivating me and was also taking care of my expenses, I would have given up long time back.\n\nSometimes it’sfrustrating when people randomly call you for auditions with a callous attitude saying, “Be here tomorrow at 10.30 am.” If you don’t make it, it’s a missed opportunity and sometimes, they won’t even tell you whether you got the part or not! For instance, I waited nearly a year for this film and refrained from signing new projects. But only later did I come to know through a friend that shooting was already underway with a different actor.\n\nIt is a crushing feeling for someone starting out young…\n\nYes. This is something beyond depression. Not getting an opportunity is one thing, but living in denial is another. You don’t know whom you should take out all the anger...on the producer? Director? Or assistants? Ultimately, you end up taking it on yourself.\n\nMaybe Cook with Comali happened at the right time.\n\nTrue. Which is why when I got this offer, I felt it was all about food and maybe it’s best if I don’t take part. They [showrunners] told me that I can manage with the basics, but I made sure that I didn’t miss out on this opportunity to prove my salt, and put my heart into it. I was doing a web series, which I cancelled to concentrate on the show. I thought I shouldn’t look like a dummy on TV and improvised a lot, and it paid off. But to be honest, I am not a great cook…\n\nAshwin, let me remind you that you are the show’s second runner-up.\n\n[Laughs] That is because of the efforts I put in. I say this because I know I am not an expert. Both my mom and sister are great cooks; some of the best food I have had were made by them. When I moved to Chennai, I was yearning for good food and one of my friends used to cook. That is when I realised men can cook too.\n\nYou seemed to be challenging yourself on the show. I remember one episode when Venkatesh Bhat was floored when you made Onde Onde [Malaysian snack]...\n\nYes, I wanted to experiment. Getting pandan leaves was a bit difficult here, but I asked the team to get them for me. All my life, I was waiting for that one chance to prove myself and I gave my 100%. My concept was: ‘If I can do it, you too can.’\n\nI will be subjected to hate comments if I don’t ask about Shivaangi, your pair on the show.\n\nYou cannot please someone to be your well wisher. Not just Shivaangi who made me feel at ease, but also the other people I met there. They somehow wanted to uplift me and I have tried to reciprocate that love.\n\nHave you got the chance to think about the show’s success?\n\nWhat you saw was just three hours of content filtered from 300 hours of footage. We have to be grateful to the editors for bringing out the best in us. None of us were camera conscious and nothing was planned. Some of the things were a surprise for us too, when we watched the show.\n\nApart from this, what truly worked in the show’s favour were the tasks given to us. That played a big role. Cooking is not as easy as people think, especially not with those hindrances. If you miss adding one ingredient, it changes the texture of the food.\n\nYou featured in ‘Kutty Pattas’ which went viral and now, are acting with your fellow comali, Pugazh, in a Tamil film. Is your talent being recognised now?\n\nCook with Comali was a rebirth of sorts for me. I never wanted to be on television because I wanted to be an actor. I didn’t have contacts nor did I come from an affluent family. I have faced a lot of insults, rejections and have been pushed to the bottom but I didn’t give up. I was hoping for that one chance. Wherever I went, the producer said they wanted fame and the director wanted money. I had neither. I felt a sense of achievement when I was given an award recently for Most Popular Person.\n\nSome of your fans wanted me to ask if you would open a restaurant and also want you to comment on your female fanbase...\n\nStarting a restaurant has always been a dream. Although I won’t be the cook [laughs]. My goal is to start a restaurant and a sports academy.\n\nAbout fans, I am here because of them. I am getting offers and opportunities because of them. And I owe everything to them. They see their success in mine.\n\nDo you think the industry has changed its perception of you?\n\nI don’t know if I would make it big, but this is something I have always wanted to say. There have been times when words hit me like a bullet. I have been subjected to humiliation while appearing for auditions. Self-respect is something you don’t want to lose at any cost. You don’t have to acknowledge our talent but at least treat us like humans? I don’t want to demotivate aspirants but tell them through this interview that: be prepared."}, {"Article Image": "https://www.thehindu.com/entertainment/movies/4m523u/article34423693.ece/ALTERNATES/LANDSCAPE_615/A-still-from-My-Octopus-Teacher", "Article's Title": "‘My Octopus Teacher’: Swati Thiyagarajan on the Netflix documentary’s Oscars win", "Article's Text": "Filmmaker and environmental journalist Swati talks to us about the award-winning film, that features her husband Craig Foster forging a relationship with an octopus\n\nWhen My Octopus Teacher first debuted on Netflix, viewers were unsure what to make of it from the title. Was it a sci-fi fantasy? An animation film?\n\nBut then, the word-of-mouth began, and the small project quickly grew into one of the most popular documentaries of 2020. Tracing the tender, almost mentor-like relationship between a sea diver and a common octopus in South Africa, the 85-minute long film is a poetic, visual feast that has managed to strike a chord with audiences worldwide.\n\nAlso Read | Get ‘First Day First Show’, our weekly newsletter from the world of cinema, in your inbox. You can subscribe for free here\n\nDirected by Pippa Ehrlich and James Reed, My Octopus Teacher stars naturalist and documentary filmmaker Craig Foster, as he takes us through the wondrous tale in an underwater kelp forest.\n\nFoster’s wife, Swati Thiyagarajan is also a filmmaker, environmentalist and journalist, who served as associate producer and production manager on the project. Originally from Chennai, Swati is renowned for her work as a conservationist, and is a core member of the Sea Change Project, that contributes to the long-term protection of South Africa’s marine environment.\n\nAlso Read: The complete list of winners at Oscars 2021\n\nThis week, My Octopus Teacher bagged the Oscar for Best Documentary Feature at the 93rd Academy Awards, (it also won the BAFTA earlier) and Swati’s contribution to the film has been hailed in India, as an important step towards encouraging documentary filmmakers in the country.\n\nSwati and the team of ‘My Octopus Teacher’ celebrating their BAFTA win earlier this month\n\nTalking to us from South Africa where she currently resides (she virtually celebrated the Oscars win as she couldn’t be in L.A.), Swati and her team are still waiting for the achievement to sink in, as she takes us through how the unique project was made, and what this international recognition means to them. Excerpts from an interview:\n\nHow was such an unique idea for the documentary first conceptualised?\n\nCraig started to dive in the Great African Seaforest — at the southern tip of South Africa — everyday about ten years ago, when he needed to recover from facing burnout at work.\n\nPrior to this, he had made three or four movies back-to-back; all big wildlife films with deadlines, deliverables, shoot schedules etc. By the time he was done, he had pushed himself too far and wasn’t sure if he wanted to be a filmmaker anymore.\n\nThe place where he was most happy was always the ocean. So in the process of doing that, he really immersed himself in the Seaforest ecosystem, and learnt how to track underwater, when he met his “octopus teacher”.\n\nCraig Foster in a still from the documentary | Photo Credit: Netflix/Courtesy Everett Collection\n\nThen began the extraordinary year of being able to observe her life. There was no plan at the time to make a film. The ecosystem slowly revitalised and gave him back energy, and he started filming again really from an exploration study point of view. It was later in the process that we thought we had a story here; Pippa (the co-director) came on board, and it really started to crystallise.\n\nIt was Craig’s authentic, experienced story we wanted to tell; we didn’t design it around how a global audience might react. That there was this unbelievable response was staggering.\n\nWhy do you think the themes in ‘My Octopus Teacher’ have resonated so much with viewers?\n\nI think while it’s a nature documentary in the broad sense, it has also come across as a love letter to nature as a whole, and the octopus being a symbol of that. It is a movie about deep connection, empathy, healing, belonging… and these are universal human emotions. It’s been more pronounced because of this tragic disconnected year we have all had as humans, isolating and distancing ourselves, and losing loved ones.\n\nWere there any challenges faced during the deep underwater shoots?\n\nCraig has been a filmmaker along with his brother for about 30 years now. He has always done his own camera work — and prior to this — he filmed sharks in a film called Sharkman and crocodiles in Into The Dragon’s Lair. So he is very adept at filming underwater.\n\nBeing a free-diver, he can hold his breath for longish periods of time, and also knows where to place a camera, the best angles for the light and picture, etc. We also had Roger, our director of photography, who is one of the world’s best underwater camera persons, go with him on several of the dives.\n\nWhat was your role in the project as the associate producer and production manager?\n\nAs Craig is my partner, and I am involved in conservation and wildlife myself, he would share with me stories from his diving experiences everyday, and discuss the footage and photographs.\n\nSwati with co-director Pippa Ehrlich and Craig Foster\n\nOur executive producer Ellen Windemuth is an old friend of Craig’s, and had earlier made a film called The Great Dance with him. She too advised on the story and then we came up with a rough outline for the doc. The entire editing and filming all happened out of a room in my house, and I was involved through all of the processes.\n\nYour film was the favourite in the category going into the Oscars ceremony; was the win expected?\n\nIt was still a tremendous surprise because our fellow nominees were superb films, and every doc had the right to win. So it was hard to just believe we would succeed. When they first announced the nominees, and we saw our clip up there, and then they announced the winner… we were so excited. It’s still sinking in!\n\nWhat would you want audiences to take away after watching the film, now that it’s getting global exposure?\n\nThat we are wild, that we humans are an intrinsic part of nature... because we are nature. That we belong. That wild places and wild animals are infinitely precious. That our fellow non-human animals on the planet are a gift, and are on this same voyage of life as us. That bio-diversity is tremendously important and we need to rediscover our deep bonds with nature, which is in our DNA. That empathy and connection is key. And of course, that this great African Seaforest ecosystem is wonderful and worth long-term protection.\n\nSwati with other members of the ‘My Octopus Teacher’ documentary team\n\nWhat is next for you and Craig, any more film projects in the pipeline?\n\nNothing for a while, as stories have to flow organically. We are diving and swimming in the Seaforest everyday. The Sea Change Project which Craig co-founded, of which I am a part, is committed to telling stories, based in science and authentic immersive experiences. We will continue to share the joy and healing nature brings us, with as many people as possible.\n\nYour win has created a lot of cheer in India as someone representing the country at the Oscars…\n\nIt’s lovely if it has created cheer. I reside in South Africa now, but most of my life was lived in India. Right now, I am so absolutely heartbroken at the completely awful situation in the country with COVID-19. The pandemic, in a large part, is because of our exploitation of the natural world. It’s most certainly my experiences in India in nature that shaped me, my ideas and thoughts; that’s the part of India I brought with me to this film.\n\nWhat is your take on the support given to documentaries in India, and could a win like this influence it positively going forward?\n\nWe have some of the absolute best filmmakers in India in the documentary field, who are superb storytellers in wildlife, social and political spaces. The work is outstanding, so it’s disheartening to see not much support for documentary films in the country.\n\nThe thing is, we shouldn’t underestimate our audiences either. I remember when I was a student in Delhi at Jamia, all of the film festivals with documentaries ran to packed halls. There is this wilful blindness in the thinking that only commercial projects work.\n\nDocumentaries are dismissed as social subjects, and that’s incredibly short-sighted because they can be anything, from a protest filmed on a phone to a carefully-crafted wildlife film. There are too few grants, too few foundations, and it’s really sad because the talent is amazing and the raw materials for stories in India is limitless.\n\nI don’t know if a win like this could make a difference, but the fact that today audiences consume films differently… it’s not just in theatres, but online, streaming platforms and other mediums. This is exciting because it gives everyone the opportunity to think out-of-the-box, reset things, and create funding for documentaries, because there is opportunity to screen them and reach audiences.\n\nMy Octopus Teacher is currently streaming on Netflix"}, {"Article Image": "https://www.thehindu.com/entertainment/music/4i96mi/article34421199.ece/ALTERNATES/LANDSCAPE_615/ifrscreen2", "Article's Title": "Immortals Fenyx Rising is ‘ancient Greek meets Fantasia’, says composer Gareth Coker", "Article's Text": "From commissioning Greek lyres to writing ‘chicken music’, animation and games composer Gareth Coker chats about how Ubisoft’s Immortals Fenyx Rising does not take itself too seriously\n\nGareth Coker has been gaming since he was three years old. The British composer, now 36, has his name attached to landmark video games such as Moon Studios’ Ori and the Blind Forest, Ori and the Will of the Wisps (both of which he was nominated for a BAFTA Games Award for Best Music), as well as 2020’s Immortals Fenyx Rising. He also won the Excellence In Score Award at 2021’s SXSW Gaming Awards for Ori and the Will of the Wisps.\n\n(Subscribe to our Today's Cache newsletter for a quick snapshot of top 5 tech stories. Click here to subscribe for free.)\n\nSpeaking over a video call from his Los Angeles home on the game’s score and how it helps tell the story for the player, Coker starts with why his favourite parts to score were the boss fights.\n\n“I guess they are like mini-climaxes,” he laughs. “In the case of Immortals, when I would send something to Ubisoft, they would respond, ‘we love it, but can you make it louder?’ (laughs) The game does not have too many epic boss fights, there is a lot of exploration and puzzle-solving. The standard combat is also not like the boss fight combat, so when you hear the boss fight music, it really stands out.”\n\nImmortals Fenyx Rising is one of Ubisoft’s more quirky releases, following a winged demi-god Fenix who embarks on a journey to save her brother who has been turned to stone, and faces off with evil god Typhon.\n\nComposer Gareth Coker during Ori and the Will of the Wisps scoring sessions at Air Studios London | Photo Credit: Benjamin Ealovega\n\nCoker says Immortals Fenyx Rising is certainly one of the less serious games he has worked on since he came on board in April 2019, after Ori and the Will of the Wisps. He also believes in coming on board with a game quite early on to gain a rapport with the storyline.“It also gives you time to fail, which is helpful not just to me in finding what doesn’t work but also to the team working on the game itself.”\n\nFor the saga-like action-adventure game, Coker, a Royal Academy of Music alum, scored more than five hours worth of music, each piece within that identifiable by the region to which Fenix travels. “From Ori and the Will of the Wisps that is generally very dark in tone, to Immortals was refreshing. If you take out the light-hearted banter such as that between Zeus and Prometheus, it is still a fun game which informs how I write the music. When I do hear the voices, it does add to that.”\n\nSpeaking of voices, Coker experienced something with Immortals Fenyx Rising’s dialogue music that was also new in his career. “In each area, there were different suites of music that each had positive, neutral and negative layers. Based on the contour of the conversation, the music changes on the fly. I remember wondering how this would work, but the benefit of being on board early is, I was able to tweak the parameters to suit these needs,” he recalls.\n\nCoker was surprised when the developers said there would even be music during dialogue which he initially considered almost “a dirty word,” and this was prominent during old school games. This custom-cut method for Immortals Fenyx Rising works especially well during positive cut-scenes, including one of the fan favourites where players meet Ares, god of war, for the first time — and he has been turned into a chicken. He laughs, “I thought ‘oh, it is time to make chicken music, whatever that is!’ It is almost like you are playing a Dreamworks game.”\n\nFor Greek sounds\n\nThough it is rooted in Greek mythology, Coker points out the game does not take itself too seriously. “It is high contrast and high saturation. The animation is much more exaggerated, so the overall look of the game is not photo-realistic. If Immortals were so, the score would not work; it is too much and over the top.”\n\nRead More | ‘Immortals Fenyx Rising’ game review: This one’s for the whole family\n\nIt was integral that he get immersed into Greek sounds, he says. So he commissioned two lyres from a Greek luthier and had the fragile instruments shipped all the way to the United States.\n\n“It was necessary. We did not want a hardcore authentic Greek soundtrack. The most ubiquitous ancient Greek instruments are the lyres — many different kinds which I commissioned because they each play a limited number of notes but they really have a unique sound.” Did Coker get to keep the lyres? In response, he spins in his seat and points towards the back of his studio space, “There it is!”\n\nCoker got his hands on an aulos as well, an ancient reed woodwind instrument, for one of the musicians for the game. “It is horrendous and not hugely pleasant sounding,” he grins. “It does have a mysterious and frenetic sound to it.”\n\nCoker used the same musical scales as the ancient Greeks. “I didn’t use them exclusively but rather the flavours of those scales,” he adds, pointing out he was still mindful of not going all-out authentic. “Otherwise the player’s brain is going to switch off as that music would not be accesible and this would not align with the tone of the story and look of the experience. I would describe it as ‘ancient Greek meets Fantasia’ and a soundtrack was born.”\n\nCD Projekt Red’s The Witcher 3 – a game which Coker did not work on but admires – is an example. “The score has a lot of heavy Slavic influences, and it’s amazing. But it is blended with modern sensibilities to make it accessible,” he points out.\n\nPlayer in mind?\n\nCoker says as a composer, he wants the player to “spend as much time in the game as possible” and music is certainly part of that strategy. “One way I would describe Immortals Fenyx Rising is that it is inviting. It has that feel of ‘what’s around the corner?’. It does well with visual landmarks with this custom-built landscape and world that creates space for lots of exploration. I wish there was a book on how to do that – it would sell really well (laughs).”\n\nOther projects Another highly-awaited video game Coker is working on is Halo Infinite (Xbox Game Studios) due to release this year. He is also working on the anticipated Ark: The Animated Series that stars Vin Diesel, Gerard Butler, Michelle Yeoh, Malcolm McDowell, Elliot Page, Ragga Ragnars, David Tennant, Karl Urban, and Russell Crowe. The television series is due to come out in 2022. There is also Studio Wildcard’s coinciding game, Ark II, to which Coker lends his talents.\n\nDo all video games composers come from a point of empathy for the player? Coker considers there to be two schools of game composers out there — one that is very hands-on with a game, and the other that is not. “Both work,” he insists. “The composers who aren’t, and this is key, usually work with amazing music supervisors and audio teams, taking that composer’s work and maybe rearranging it and putting it into the game. But the music will still be beautiful.”\n\nOver the years, Coker has learned both of these methods but says he “likes to be hands-on with the game, which is more holistic. This is why I always like to come on board with a video game early on, as I get to talk more with the developers and get the synergy going. But (laughs) it is a ton of work.”"}, {"Article Image": "https://www.thehindu.com/entertainment/music/pu18ib/article34430654.ece/ALTERNATES/LANDSCAPE_615/sai-shravanam6", "Article's Title": "Sound engineer Sai Shravanam: ‘Views do not define music, intent does’", "Article's Text": "Loved ‘Enjoy Enjaami’ and the tracks from ‘Karnan’? It is the result of several hours put in by sound engineer Sai Shravanam whose latest project is a tribute to India’s rivers\n\nSai Shravanam is playing an aalaap from his recent musical project ‘Rivers of India’ at his state-of-the-art recording studio Resound India in Adyar, a place he calls “my temple”.\n\nHe toggles between computer monitors and a giant recording console to play two tracks — one original and the other he has worked on — and points out the musical difference. “I wanted this portion of the track to be ethereal and the voice to be God-like. Sound engineering is incredibly important to bring the best out of a musician,” he says.\n\nAnd he should know; Sai is the man behind the rich sound of several leading musicians in films and classical music universe. Recently, he received the Kalaimamani award from the Tamil Nadu Government, becoming the first sound recordist to do so. His recent works include the viral hit ‘Enjoy Enjaami’ and tracks from Dhanush’s Karnan, but Sai is pumped at the response for ‘Rivers of India’.\n\n“The song is a tribute to precious water resources in the country and stresses on the need to protect them,” he says.\n\nConceived by Kanniks Kannikeswaran, ‘Rivers of India’ not only features a never-before-seen collaboration between Bombay Jayashri, Kaushiki Chakraborty, Rishith Desikan and Amrit Ramnath, but also has a chorus section by the global IIT alumni. “He [Kanniks] has worked hard for spreading Indian choral music in the US; he called me about this project for IIT-Madras,” recalls Sai.\n\nThe duo realised that there was not a single song that carries the names of all the major rivers in India, and decided to weave them into a song. “Projects like these give me immense happiness as it helps me explore my thirst as a musician and producer. Rivers are something that several generations witness; so we roped in two mother-son duos (Bombay Jayashri and Amrit, and Kaushiki Chakraborty and Rishith Desikan),” he adds.\n\nBombay Jayashri and Amrit Ramnath\n\nA different beat\n\nSai believes sound is precious and that he has earned the sobriquet ‘the man with the golden ear’ because he does not distinguish between genres. “The day I see music as different things, such as classical, films and others, I will be finished. Sound and music are my greatest inspiration irrespective of who the artiste is.”\n\nHis own musicality too plays a big role when he is mixing and mastering songs. “I am not a technician who changes plug-ins. I end up involving myself a lot with the work,” says Sai. His other role is that of a tabla player; he has been playing regularly for AR Rahman and has had many memorable experiences. ‘Tum Ko Paa Hi Liya’ in Rockstar was one. “I was called and I played just once, and was then asked to leave. There were no retakes. I thought that Rahman sir had not liked what I played, but when I heard the song, the entire portion I played was retained. When I asked him about it, he said, ‘What comes first comes from God. What comes next comes from you’. That profound statement changed the way I look at life,” he adds.\n\nKaushiki Chakraborty and Rishith Desikan\n\nScript and sound\n\nSai has a unique way of working with songs; he sequences them in order in his recording console, much like how a storyboard artist would do with a script. “Sequencing is important because I believe that storytelling is an integral part of music,” says Sai, whose upcoming projects including songs with composer C Sathya and singer-composer Sean Roldan.\n\nHe is very much a behind-the-scenes technician who contributes to the final musical output. “Sound engineering is not merely tweaking a few knobs. It is a lifetime dedication towards music because it can make or break a song,” he says.\n\nSai usually works more than 15 hours a day, cocooned in his air-conditioned studio and working on various genres of music that are dished out by composers. “It might sound like a nice job but it comes with challenges; as a sound engineer, we have to keep listening to various versions of a single line multiple times and in various frequencies to see which works and which doesn’t. Only if there is passion and a love for music can one do that. In today’s movies, there is pressure for success. There is always an expectation on it to become hits. But views do not define music, intent defines it,” he adds."}, {"Article Image": "https://static.toiimg.com/thumb/msid-82289149,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-374240/82289149.jpg", "Article's Title": "Rakul Preet Singh wishes Samantha Akkineni on her birthday; says 'Shine on and keep inspiring always'", "Article's Text": "Veteran actor Kabir Bedi’s granddaughter Alaya F, who is an avid social media user, made her Bollywood debut in 2020 with ‘Jawaani Jaaneman’ alongside Saif Ali Khan and Tabu. The star kid managed to leave the audience impressed with her acting chops. However, as is usually the case, right from her first film, fans started comparing her to her peers like Ananya Panday, Janhvi Kapoor, Sara Ali Khan, and more."}, {"Article Image": "https://static.toiimg.com/thumb/msid-82286363,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-108884/82286363.jpg", "Article's Title": "#HowIMadeIt! Vijay Varma: I had reservations before signing up to play the girl-assaulter in 'Pink'", "Article's Text": "Veteran actor Kabir Bedi’s granddaughter Alaya F, who is an avid social media user, made her Bollywood debut in 2020 with ‘Jawaani Jaaneman’ alongside Saif Ali Khan and Tabu. The star kid managed to leave the audience impressed with her acting chops. However, as is usually the case, right from her first film, fans started comparing her to her peers like Ananya Panday, Janhvi Kapoor, Sara Ali Khan, and more."}, {"Article Image": "https://static.toiimg.com/thumb/msid-82291620,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-129297/82291620.jpg", "Article's Title": "Tanuja Chandra: Exclusive! Tanuja Chandra on working with Irrfan Khan: There was a kind of quiet panic in his humor", "Article's Text": "After starting off as a model, Kangana Ranaut bagged a role in Anurag Basu’s much-loved film ‘Gangster’ and left everyone mighty impressed with her solid debut performance. From its storyline to the direction and soothing songs, ‘Gangster’ was a perfect mix. And since then, there has been no looking back for the actress."}, {"Article Image": "https://static.toiimg.com/photo/82292332.cms", "Article's Title": "Five Gujarati actresses who ace their ethnic wear style in an amazing way", "Article's Text": "Deeksha Joshi is a well-known face in the Gujarati industry and her appearances in 'Shubh Aarambh', followed by 'Karsandas Pay & Use', 'Sharato Lagu', and many more is remarkable. The gorgeous artist is also the talk of the D-Town for utter beauty and fashion police. Talking about her traditional post look, Deeksha looks fabulous in a silk saree. The actress kept her entire look simple and elegant. She has paired the saree with a red base flower print blouse and a bindi marking it as a complete traditional look. The set of metallic bangles and the unique earring is adding to the taste of the saree."}, {"Article Image": "https://static.toiimg.com/thumb/msid-82291388,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-145418/82291388.jpg", "Article's Title": "Exclusive Interview! Nawazuddin Siddiqui fondly remembers late Irrfan Khan: He taught me, less is more", "Article's Text": "Veteran actor Kabir Bedi’s granddaughter Alaya F, who is an avid social media user, made her Bollywood debut in 2020 with ‘Jawaani Jaaneman’ alongside Saif Ali Khan and Tabu. The star kid managed to leave the audience impressed with her acting chops. However, as is usually the case, right from her first film, fans started comparing her to her peers like Ananya Panday, Janhvi Kapoor, Sara Ali Khan, and more."}, {"Article Image": "https://static.toiimg.com/thumb/msid-82290010,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-250994/82290010.jpg", "Article's Title": "Kartik Aaryan spreads awareness with a hilarious post as vaccine registration for those above 18 begins today", "Article's Text": "Veteran actor Kabir Bedi’s granddaughter Alaya F, who is an avid social media user, made her Bollywood debut in 2020 with ‘Jawaani Jaaneman’ alongside Saif Ali Khan and Tabu. The star kid managed to leave the audience impressed with her acting chops. However, as is usually the case, right from her first film, fans started comparing her to her peers like Ananya Panday, Janhvi Kapoor, Sara Ali Khan, and more."}, {"Article Image": "https://static.toiimg.com/thumb/msid-82289989,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-121198/82289989.jpg", "Article's Title": "Mira Rajput shares a glimpse of Misha Kapoor’s handwritten letter to grandmother Neelima Azeem", "Article's Text": "Veteran actor Kabir Bedi’s granddaughter Alaya F, who is an avid social media user, made her Bollywood debut in 2020 with ‘Jawaani Jaaneman’ alongside Saif Ali Khan and Tabu. The star kid managed to leave the audience impressed with her acting chops. However, as is usually the case, right from her first film, fans started comparing her to her peers like Ananya Panday, Janhvi Kapoor, Sara Ali Khan, and more."}, {"Article Image": "https://static.toiimg.com/thumb/msid-82294480,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-282232/82294480.jpg", "Article's Title": "Exclusive Interview! “This tribute means a lot to me” says Ranjit Dahiya who painted Irrfan Khan’s famous mural on the street of Bandra, Mumbai", "Article's Text": "It’s almost a year that Bollywood actor and global icon Irrfan Khan has left for his heavenly abode. While fans continue to refer to it as a ‘personal loss’, several of them have paid tributes to the late actor in their own unique ways. Likewise, the city of dreams - Mumbai witnessed one such mesmerising ode in black, white, and yellow hues, standing tall and bright on a wall of a quaint street in the Ranwar village of Bandra, Mumbai. While it has now become one of the attractions in the city, ETimes dialed the artist duo, Ranjit Dahiya and Vikas Bansal from Bollywood Art Project- the mastermind who immortalised Irrfan in everyone’s heart.Mumbai is the city of Bollywood and I thought let’s make it apt for its name as people come here out of curiosity for the industry. This is when we started creating Bollywood-inspired murals.While creating art or a mural, we always think about its social impact. For this case, Irrfan Khan’s mural was apt for Ranwar village of Bandra because the shooting of his film ‘ Lunchbox ’ was done there. The residents of the area are already connected with Irrfan through his film, hence we decided that it was the right place for him. According to me, ‘Lunchbox’ was his best film.Being his fan, I was really shocked for hours when I heard about his demise and then later realised that I need to do something about it and decided to make his mural. This tribute means a lot to me.Like I just mentioned, I was really sad after knowing that Irrfan is no more. Besides being my favorite actor, he was also a great person. While this happened during the lockdown, Vikas was in Mumbai, so we both decided to pay a tribute with whatever paint I had left at my house.It was a little tough, I won’t lie. There was the initial lockdown going on due to the pandemic. So, it was a challenge for us and we used whatever material we had left with us. But I think our love for Irrfan and art kept us going, after all, you only need a piece of charcoal to create art, if not anything else.The building owner Mr. David is a cool person and most importantly, he is also one of Irrfan’s biggest fans. So, right when we called him to seek his permission for painting his walls he was very happy and supportive.Besides, we were only two people out on the streets with all safety precautions. If you ask about getting permission, it isn’t easy usually but we knew the owner so it was fine.I have quite a few celebs on my bucket list. I want to paint Helen ji next.I am from Delhi but Mumbai meri jaan hai! I might visit soon as work demands and the situation improves."}, {"Article Image": "https://static.toiimg.com/thumb/msid-82288826,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-147442/82288826.jpg", "Article's Title": "Suniel Shetty starts an initiative provide free oxygen concentrators", "Article's Text": "Veteran actor Kabir Bedi’s granddaughter Alaya F, who is an avid social media user, made her Bollywood debut in 2020 with ‘Jawaani Jaaneman’ alongside Saif Ali Khan and Tabu. The star kid managed to leave the audience impressed with her acting chops. However, as is usually the case, right from her first film, fans started comparing her to her peers like Ananya Panday, Janhvi Kapoor, Sara Ali Khan, and more."}, {"Article Image": "https://static.toiimg.com/thumb/msid-82288041,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-316809/82288041.jpg", "Article's Title": "Kangana Ranaut's 'Gangster': Exclusive interview! Kangana Ranaut on 15 years of ‘Gangster’: It was a perfect debut for me for sure", "Article's Text": "Read Also\n\nAfter starting off as a model, Kangana Ranaut bagged a role in Anurag Basu’s much-loved film ‘ Gangster ’ and left everyone mighty impressed with her solid debut performance. From its storyline to the direction and soothing songs, ‘Gangster’ was a perfect mix. And since then, there has been no looking back for the actress. The film also starred Emraan Hashmi and Shiney Ahuja in key roles. As the film clocks 15 years of release today, ETimes got in touch with Kangana, who spoke about her inspirational journey. She spilled the beans on how ‘Gangster’ happened, her perfect debut with Anurag Basu 's film, how Javed Akhtar and Shabana Azmi called her after watching the film and more! Excerpts:Oh yes, it’s 15 years now! (smiles) To be honest, it feels great. When ‘Gangster’ happened, I was in desperate need of work and it was seeming like forever. I had left home and stayed in Delhi trying to figure out what I wanted to do and then I was struggling in Mumbai doing ads. I wasn't getting much success in modelling. Even though it was quite quick, within a few months of being in Mumbai I got this break but yet everyday rejections and every day failing in auditions, it just felt so demotivating. But surprisingly when I got this ad, I got another one or two films and one of them was a South film which became quite a big hit. So suddenly it just happened that I was so wanted as a struggling newcomer. People used to say that actresses have a shelf life of 4-5 years and I used to wonder why people say something like this? Are we some product off the shelf? It used to feel so odd, even as a teenager when people used to say something like this to me, especially some Lokhandwala managers I used to have at that time. Everybody used to talk about shelf life and look, it's been 15 years. It feels good and I am on top of my game and I feel that I have a long way to go. So to hell with all those who said that actresses have a shelf life of 3-4 years.It was a perfect debut for me for sure. To be working with Anurag Basu and that school of art…I was trained in theatre, I was not trained in movies and to be working under Anurag was the biggest USP of ‘Gangster’ for me. He is a terrific director and a very instinctive, creative person. At the same time, he has a theatre background so he understood me and where I came from. In addition, he is a very good actor himself. So he told me things about films, how they differ from theatre and how I need to completely internalize my acting as opposed to a very theatrical way of acting. So I would say that it was a perfect break for me but yet, coming from that route it was a struggle also from parallel cinema. During that time, it was a one-of-a-kind film that did well. There was no market for such films and such actors. I was very unconventional for a mainstream actress. Anurag enhanced that about me. I was so skinny and had curly hair and he enhanced all that and that made me even more unfit. So for many years, I was doing those homeless kinds of edgy roles which were very difficult. I was 16 when I started and finally with ‘Tanu Weds Manu’, I was 23 or 24 and had just broken free of those edgy, neurotic characters (laughs). So in a way, it was very good for me to be launched in that way.I was in Mumbai and was sent for some auditions. There were these models who were going to Vishesh films for ‘Gangster’ auditions and I tagged along because I had that look. Even my manager encouraged me. My friend Mohit took my audition. He didn't even audition me actually. I was sitting there and they refused to audition me and basically rejected me before they could audition me. So I left and my pictures reached Anurag and I got a frantic call in a few days that 'you have to come and meet the director'. I replied saying that ‘I have already auditioned and met the director’. They said, ‘No, the director has never met you.’ It was actually the AD's who were doing auditions. So I went to meet them and Anurag started auditioning me for various scenarios like being drunk, crying, being homeless and gave me some lines and then he got a camera and said that I did well. But I didn’t know if I had the job or not. Later I found that there was some conflict internally to cast me as a model in the film as I was a minor myself and it was impossible for me to have a child at that age. But Anurag liked me in a way that I looked for the role and for a long time I was hanging in there.So the funniest thing happened. Before the shooting, we were supposed to go to Seoul, South Korea for the shoot and I was such a kid. The production boy came to the rented apartment I was staying at. He came and told me, ‘we want your passport and I replied 'What is that? '. I didn't know what a passport was. He looked at me horrified and went back to Anurag who later called and said ‘ Ye kya ladki hai tu, pagal hai kya tu? Kaha se aayi hai?” (laughs). He also said that I might lose the role. That time I was not talking to my father, but I called him to ask about the passport. Mukesh (Bhatt) sir had called me and had the same reaction. He told me, ‘ Beta, tumhare pass passport nahi hai, kaha se aayi ho tum?’ (laughs). They started to audition other girls for the role. I pleaded to my father to get the procedure done. At that time it used to take 3-4 months for it. In the end, my father pulled some strings and got the passport. Anurag was the happiest person because they were looking for my replacement. Literally, it was like one of those climax moments in movies that you get it done at the last minute. It is another story where they forgot to write my surname and at every airport, everyone asked me, ‘hey, you don’t have a surname?’ That’s another story for another day.Of course, I remember. It was from Javed Akhtar and Shabana Azmi Ji, who called me after watching the film. They were absolutely stunned and they kept repeating 'who are you? ', ' where are you from? ', ‘you did so well', 'who taught you acting?', 'Are you from here or some other universe? '. That is how they reacted and it felt nice. They were very kind and welcoming of me and my art. It was only later that I realized that when things change, people also change.There is a lot of learning that happened during ‘Gangster’. Of course, filming an entire film, it was shocking that how many shots of one single line can happen, how consistent your performance should be, it shouldn’t drop... things like continuity or building a graph. With every film, you keep learning, but the first film that you do, there are so many technicalities that pour in. So there are a lot of things that have always remained with me. Above everything, I learned cinema acting and that was a big change in my life."}, {"Article Image": "https://static.toiimg.com/thumb/msid-82275202,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-725125/82275202.jpg", "Article's Title": "#OneYearOfMissingIrrfan: Sutapa: There are times I feel Irrfan is around, he is just not physically present", "Article's Text": "Veteran actor Kabir Bedi’s granddaughter Alaya F, who is an avid social media user, made her Bollywood debut in 2020 with ‘Jawaani Jaaneman’ alongside Saif Ali Khan and Tabu. The star kid managed to leave the audience impressed with her acting chops. However, as is usually the case, right from her first film, fans started comparing her to her peers like Ananya Panday, Janhvi Kapoor, Sara Ali Khan, and more."}, {"Article Image": "https://static.toiimg.com/thumb/msid-82289883,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-172922/82289883.jpg", "Article's Title": "WATCH: Siddhant Chaturvedi’s latest song will lift your spirit amid the pandemic", "Article's Text": "Actor Siddhant Chaturvedi has been finding ways to keep fans entertained amid the grim situation due to the COVID-19 pandemic. Summarising that the situation will get back to normal, today the actor crooned a song written and composed by himself that will instantly brighten anyone’s day.In the video, the actor is seen strumming his guitar from his house as he sang in Hindi, “Koi baat nahi mere yaar...Koi bistar pe akela hai, Toh koi bistar ke liye Jhela hai, Koi akhri Cigarette bacha raha hai, Toh koi kisi ki akhri SaansMushkil ghadi hai...Par hum sab saath hain...Hain na? Koi nai...Koi baat nahi mere yaar! Sab theek ho jayega.” He further added, “#MyNotes / S / #HaveFaith”.Watch video here:Meanwhile, Siddhant’s fans and followers are pouring their hearts out in the comment section.Earlier, he had penned a soul-stirring poem on the ongoing situation of the COVID-19 pandemic in India. It read,“Ek khayal aaya, Socha share karun, Guzarti Ambulance.\"On the work front, Siddhant will be next seen in ‘Phone Bhoot’ co-starring Katrina Kaif and Ishaan Khatter. He is also a part of Shakun Batra’s next untitled project with Deepika Padukone and Ananya Panday."}, {"Article Image": "https://static.toiimg.com/thumb/msid-82290196,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-282156/82290196.jpg", "Article's Title": "Saif Ali Khan's Sister: Saba Ali Khan's shares unseen throwback family pictures with Saif Ali Khan, Sharmila Tagore; check out", "Article's Text": "Saif Ali Khan’s sister Saba Ali Khan ’s social media feed is a treasure trove of rare and unseen pictures of her family members that include her mom Sharmila Tagore, late dad Mansoor Ali Khan Pataudi, her brother Saif Ali Khan, sister-in-law Kareena Kapoor Khan , sister Soha Ali Khan , brother-in-law Kunal Kemmu, niece and nephew’s Sara Ali Khan Ibrahim Ali Khan , Taimur Ali Khan and Inaaya Naumi Kemmu Once again, Saba took to her Instagram handle and shared a compilation of black and white childhood pictures featuring her mom, dad, herself. She converted those pictures into an Instagram reel uploaded it with Maroon 5’s famous song 'Memories'.Take a look at her post below:She captioned her post, \"MEMORIES...Childhood memories. Makes a journey beautiful. memorable and cherished. #wednesdayvibes #memoriesforlife #familylove #alwaysandforever.\"Reacting to the post, several fans and followers of Saba dropped heart and fire emojis. A user wrote, “Great pictures!! Memories galore!!”, “Nice memories”, wrote another user. While the third one wrote, “Your family.”Saba had recently shared unseen throwback pictures featuring her grandparents and parents. And had also shared rare childhood pictures of Taimur and Inaaya and captioned it as, “I Wonder... Who are these munchkins ? I know you'll guess it...#😁 Clicked by Me #😘 Love my babies. #💖”Take a look below:A month ago, she had framed her priceless throwback picture of Ibrahim Khan and captioned it as, \"Wonder ....Who's this ??? Clicked by ME. #😎 #❤️\"Take a look at the pictures below:"}, {"Article Image": "https://static.toiimg.com/thumb/msid-82291266,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-239206/82291266.jpg", "Article's Title": "Ajay Devgn joins hands with BMC and hospital to set up COVID-19 ICUs", "Article's Text": "Read Also\n\nFilmmaker and actor Ajay Devgn has been working quietly with the Brihanmumbai Municipal Corporation (BMC) to provide emergency medical facilities for Mumbaikars affected by COVID-19 The actor has joined hands with BMC and Hinduja Hospital to set up ICU (Intensive Care Units).As BMC commissioners, corporators and others frontline workers are working tirelessly on ground zero, round the clock to monitor the emergency services, Devgn, too, is working in close tandem by doing his bit. This time around, the ' Tanhaji ' actor and a few of his esteemed colleagues from the film fraternity have stepped ahead and helped the BMC to set up an emergency medical unit at Mumbai's Shivaji Park.\"It will be an extension of Hinduja Hospital,'' said COO, Joy Chakraborty confirming that they would provide food, linen, medicine and manpower to this emergency unit.Lauding the 'Singham' actor's efforts to help people amid the pandemic, local Shiv Sena corporator Vishaka Raut said,\"It is great that Ajay Devgn supported BMC.\"Local newspapers reported that BMC has converted Bharat Scouts & Guides Hall at Shivaji Park to a 20-bed COVID-19 facility with ventilators, oxygen support and para monitors. Devgn has helped by providing funds to the organization through his social service wing NY Foundations.Sources say that besides the 'Ishq' actor, filmmakers Anand Pandit Luv Ranjan , Rajneesh Khanuja, Leena Yadav and Ashim Bajaj; OTT giants, Sameer Nair(Applause), Deepak Dhar & Rishi Negi (Banijay Asia, Seven Tauras Entertainment Private Limited), entrepreneur Tarun Rathi and Action-Director R P Yadav have reportedly made a contribution of over Rs.1 crore to the 'Smiley Account' which is the business development cell of the BMC."}, {"Article Image": "https://static.toiimg.com/thumb/msid-82291278,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-141169/82291278.jpg", "Article's Title": "Sonu Sood shares a glimpse of receiving help requests from people all over the country, says ‘trying my best to reach out to everyone’", "Article's Text": "After starting off as a model, Kangana Ranaut bagged a role in Anurag Basu’s much-loved film ‘Gangster’ and left everyone mighty impressed with her solid debut performance. From its storyline to the direction and soothing songs, ‘Gangster’ was a perfect mix. And since then, there has been no looking back for the actress."}, {"Article Image": "https://images.indianexpress.com/2020/12/cbse4.jpg", "Article's Title": "Samastha Kerala public exam result declared, here’s how to check", "Article's Text": "Samastha Kerala Sunni Vidhyabhyasa Board has released the result for public examination of class 5, 7, 10 and 12. The result is available at samastha.in. The exam was held on April 3 and 4. The students who are not happy with their score can apply for re-evaluation.\n\nThe board will accept application forms along with fees. After receiving the application, the Board will do retotaling/ rechecking and then will declare the revised result in the pdf format.\n\nTo view score, visit the official website mentioned above. Click on the result section on the homepage. A new page will open. The result link will be displayed. Click on it. It will ask for registration number. Enter the number and view your scores."}, {"Article Image": "https://images.indianexpress.com/2021/04/ajay-devgn-1.jpg", "Article's Title": "Ajay Devgn sets up emergency Covid-19 facility at Mumbai’s Shivaji Park", "Article's Text": "Ajay Devgn has joined hands with BMC and Hinduja facility for this emergency facility. (Photo: Ajay Devgn/Instagram)\n\nBollywood actor Ajay Devgn is doing his bit to help Mumbai in the time of the Covid-19 crisis. The Maidaan actor and a few of his colleagues have joined hands with Hinduja Hospital to set up an emergency facility at Mumbai’s Shivaji Park.\n\nAs per reports, BMC has converted a hall at Shivaji Park into a 20-bed Covid-19 facility equipped with ventilators and oxygen support. Devgn, Anand Pandit, Boney Kapoor, Luv Ranjan, Sameer Nair and many others have also joined forces to contribute over Rs 1 crore to BMC’s “Smiley Account”.\n\nShiv Sena corporator Vishaka Raut said, “It is great that Ajay Devgn supported BMC.”\n\nThe Tanhaji actor has contributed the funds through his social service wing NY Foundations. Joy Chakraborty, COO, said, “It will be an extension of Hinduja Hospital.” The foundation will also be helping with food and medicine.\n\nIn 2020, Ajay Devgn helped by donating ventilators to Mumbai’s Dharavi as the area was badly struck by Covid-19.\n\nOn the work front, Ajay is looking forward to the release of Maidaan, RRR, Gangubai Kathiawadi."}, {"Article Image": "https://images.indianexpress.com/2021/04/tomorrow-war-chris-pratt-1200.jpg", "Article's Title": "The Tomorrow War teaser: Chris Pratt is fighting aliens in this futuristic sci-fi film", "Article's Text": "Chris Pratt is fighting a war 30 years in the future in The Tomorrow War.\n\nStarring Chris Pratt in the lead role, the first teaser of The Tomorrow War is out, and it looks like an intense action film. The teaser of the movie has Pratt fighting against unseen enemies as a city is on fire.\n\nThe teaser also suggests that Pratt and his men “are fighting a war 30 years in the future.”\n\nThe film is directed by Chris McKay. He helmed the 2017 movie The Lego Batman Movie.\n\nThe Tomorrow War also stars Yvonne Strahovski, J.K. Simmons, Betty Gilpin, Sam Richardson, Edwin Hodge, Jasmine Mathews, Ryan Kiera Armstrong and Keith Powers, among others.\n\nThe synopsis of the movie reads, “In The Tomorrow War, the world is stunned when a group of time travelers arrive from the year 2051 to deliver an urgent message: Thirty years in the future mankind is losing a global war against a deadly alien species. The only hope for survival is for soldiers and civilians from the present to be transported to the future and join the fight. Among those recruited is high school teacher and family man Dan Forester (Chris Pratt). Determined to save the world for his young daughter, Dan teams up with a brilliant scientist (Yvonne Strahovski) and his estranged father (J.K. Simmons) in a desperate quest to rewrite the fate of the planet.”\n\nThe Tomorrow War is set to release on Amazon Prime Video on July 2."}, {"Article Image": "https://images.indianexpress.com/2021/04/kangana-ranaut-6.jpg", "Article's Title": "Covid-19 vaccine registration opens for people above 18: Kangana Ranaut says she’ll get the jab on May 1, Kartik Aaryan gives a reminder", "Article's Text": "As the registration for the next phase of the Covid-19 vaccine begins today, Kangana Ranaut, in her latest video message on Twitter, has urged people to register themselves and get vaccinated as soon as possible. The actor said nobody should believe the rumours going around about the vaccine and fight this battle against coronavirus “on a personal level”. Actor Kartik Aaryan also shared a cryptic post, reminding people that registration of vaccine for everyone over the age of 18 has now begun.\n\n“When you’re 45+ but hv to wait till 1st May for vaccine bcoz your wife has told the mohalla you’re 41. Registrations open today #VaccineRegistration,” he tweeted.\n\nWhen you’re 45+ but hv to wait till 1st May for vaccine bcoz your wife has told the mohalla you’re 41 Registrations open today 📝 #VaccineRegistration 👍🏻 pic.twitter.com/dXKaFyGaJY — Kartik Aaryan (@TheAaryanKartik) April 28, 2021\n\nKangana addressed the people who are feeling demotivated and said “this is not the time for self-pity”. The actor said that various generations have faced such a calamity once in their lifetime and this generation is no special. “To people who are overthinking, I must tell you every generation has dealt with diseases like Spanish Flu, Tuberculosis and Plague etc. Why do you think you are special? The population is so huge that the entire world is grappling with this disease. And, India has the largest population in the world. The modernity which we want to enjoy has its drawbacks as well,” the Manikarnika actor opined.\n\nShe added that if people cannot find a solution, they should not become a problem. Kangana added, “If you cannot find a solution, do not become a problem. We should help others but, first of all, we should help ourselves. We should not get infected with the coronavirus.” Emphasising the significance of getting vaccinated, the 34-year-old actor shared, “Until last year, we were all worried about the vaccine, but now we have a vaccine, and doctors are saying 98-99% of people who have taken just the first jab of the vaccine can recover at their home only.”\n\nKangana is planning to get vaccinated on May 1 along with her entire family. She has also got the staff at her house registered for the vaccination. Concluding her message, the actor said, “Do not believe in the rumours going around about the vaccine. Register yourself for vaccination and fight this battle on a personal level.”"}, {"Article Image": "https://images.indianexpress.com/2021/04/Kamal-Haasan.jpg", "Article's Title": "Stalemate on Kamal Haasan’s Indian 2 continues, Madras HC told", "Article's Text": "The stalemate in the production of Tamil film Indian 2, starring actor Kamal Haasan in the lead role, continues as the talks between the contesting parties to arrive at an amicable solution have failed, the Madras High Court was informed on Wednesday.\n\nWhen the matter came up for further hearing today, senior counsel for the director S Shankar told the First Bench of Chief Justice Sanjib Banerjee and Justice Senthilkumar Ramamoorthy that the talks have failed.\n\nOriginally, Lyca Productions, the producers of the film, had moved court with an appeal for a direction to Shankar to complete the film and to restrain him from taking up any other project till then.\n\nHolding that any court order might precipitate the matter, the Bench had, on April 22, directed the parties to sit together and settle the issue amicably.\n\nWhen the matter came up again today, Shankar’s senior counsel P S Raman told the judges that no solution was arrived at the more-than-two hours meeting last Saturday.\n\nWhile Shankar was prepared to give bulk dates after June, for which Kamal Haasan had also agreed, Lyca Productions insisted the director to sign a bond to the effect that he would not take up any other project.\n\nHence, the talks failed, and the Bench posted the matter for further hearing after the summer vacation."}, {"Article Image": "https://images.indianexpress.com/2021/04/admit-card-1200-3.jpg", "Article's Title": "ICSI CSEET 2021 admit card to release tomorrow", "Article's Text": "CSEET 2021 admit card will tentatively be released on April 28, 2021.\n\nCompany Secretary Executive Entrance Test, (CSEET) admit card will release on April 29. Candidates who have applied for the ICSI CSEET 2021 can download the admit card from the official site of ICSI — icsi.edu. The examination is scheduled to be conducted on May 8.\n\nIn view of the pandemic situation, CSEET 2021 shall be conducted through remote proctored mode instead of conducting the same from respective centers.\n\n“CSEET shall be conducted through remote proctored mode instead of conducting the same from test centers. Candidates are allowed to appear for the test through their own laptop/ desktop from home/ such other convenient place. Candidates shall not be allowed to appear through smartphone (mobile)/ tablet etc. ” reads the official notification of ICSI.\n\nHow to download the admit card:\n\nStep 1: Visit the official website of ICSI\n\nStep 2: On the homepage, click on the ‘admit link’\n\nStep 3: Log in necessary credentials\n\nStep 4: Download the admit card and take a printout for further reference\n\nThe CSEET examination will be conducted in a computer-based MCQ-type question pattern. There will be 140 questions in the paper and the total marks will be 200. Candidates will get 120 minutes to solve the entire paper."}, {"Article Image": "https://images.indianexpress.com/2021/04/irrfan-khan-sutapa-1200.jpg", "Article's Title": "Sutapa Sikdar on one year without Irrfan Khan: ‘He is around, just not physically present’", "Article's Text": "Irrfan Khan’s wife Sutapa Sikdar says her cosmic connection with the later actor has continued even after his death. “There are things where I feel suddenly, as if everything is the same. He is around, he is just not physically present,” Sutapa told Times of India.\n\nIrrfan, who died on April 29, 2020, is still fondly remembered by his fans worldwide. But Sutapa said she is taking time to cope with his absence. In the same interview, she said, “The loneliness is very strong. Because we were not very social, we did not have too many friends. We were always that two-people unit. He would come back from shoot and we would see a film or talk. So it so revolved around him. It is very difficult to figure out a life without him.”\n\nSpeaking about a cosmic connection with Irrfan, Sutapa added how she still feels his presence around her. She told TOI, “Both of us loved the rain. And both of us would joke – if it was very hot…and it would rain the next day. When I went to Jaipur, it was a very hot day – and then, that night, it rained! It felt so strange. Then, when I was travelling back on the Jaipur-Mumbai highway, Google Maps told us that there was congestion and suggested an alternate route. It was an unfamiliar road, and then I was like – Oh my God! We are going via Tonk! Tonk is the place he belonged to. I do get hints of him being around,” she shared.\n\nSutapa further revealed that the family wasn’t prepared for the death because his reports showed improvement in the last few months. They were even planning a holiday two-months before Irrfan’s death. “He was not scared of death anymore. Still of course he wanted to live. He wanted to grow a forest, do a lot of social work.”\n\nAlso read | When Irrfan Khan spoke about the two actors who gave direction to his career\n\nThe actor had plans of doing one project a year, and even launching son Babil in a film, which he wanted to either direct or act in. Sutapa said, “I don’t think he wanted to act so much anymore. Because he had started enjoying this time we had. We spent time with the kids and did everything which we had not for a long time because he was so busy.”\n\nSutapa also revealed that Irrfan was not a practicing Muslim, but he wasn’t a non-believer either. He believed in one God. Hence, even she never converted to Islam.\n\n“He was on the journey of a search, of himself, of this world, bigger things than this world, parallel reality, parallel world. Religion for him was spirituality. During this period, he read the Upanishads, Ramakrishna Paramhansa, Vivekananda… but he was never a typically ‘religious’ person,” she added."}, {"Article Image": "https://images.indianexpress.com/2021/04/Shraddha-Kapoor.jpg", "Article's Title": "Siddhanth Kapoor donates plasma, sister Shraddha Kapoor urges fans to do the same", "Article's Text": "Actor Shakti Kapoor is a proud father as his son and actor Siddhanth Kapoor donated plasma on Wednesday. Sharing a picture of Siddhanth on Instagram, Shakti wrote, “Proud Father,” and urged his fans to “#donateplasma today if you are eligible to.”\n\nSiddhanth also shared photos on his Instagram account and wrote, “Donated Plasma today ! Please come ahead amd donate it if you are eligible to ! Please please ! Thank you Dr Joyce and The Reliance Hospital also @aarnavvshirsat and @rahulrohra for always supporting this cause. Come forward and help as much 🙏🙏🙏🙏🙏🙏 it’s not painful at all.”\n\nIn response to Siddhanth’s post, his sister Shraddha Kapoor commented, “So proud.” Later, on her Instagram profile, Shraddha urged her fans to donate plasma. “My bro @siddhanthkapoor just donated plasma. Urge all those who are eligible to do the same please,” she wrote.\n\nAs soon as Siddhanth posted the pictures, many of his friends commented on the post and lauded the actor. While Amyra Dastur wrote, “You lovely human being,” Gurumeet Choudhary mentioned he is proud of Siddhant. Milind Gadagkar commented, “Well done. That is so commendable.” Rajniesh Duggall said he is “super proud.”\n\nLately, celebrities have been urging fans to donate plasma and get vaccinated against Covid-19.\n\nBhumi Pednekar, who was one of the first celebrities to use her social media platforms to help Covid-19 patients, dropped a video on Friday urging Delhiites to donate plasma. In the video, she tried to get the attention of the people of Delhi, and said that they should come forward to donate plasma, so that lives of people can be saved.\n\n“Delhi Wale This is the real time to show your heart. There have been many requests from Delhi-NCR which are in dire need of plasma. Those who have recovered from Coronavirus in the past 28 days should come forward in this battle and donate their plasma,” she said in the video."}, {"Article Image": "https://images.indianexpress.com/2021/04/online-education-1200.jpg", "Article's Title": "Madhya Pradesh govt suspends online classes till May 31 except for Classes 10, 12", "Article's Text": "The classes has been suspended from May 1 to May 31. (Photo credit: pixabay.com)\n\nMadhya Pradesh government Tuesday suspended online classes for all students except those studying in classes 10 and 12. The online classes for government and non-government schools will be discontinued from May 1 to May 31. The decision has been taken amid spike in the Covid-19 cases in the state.\n\nMeanwhile, the school education department has also suspended the ‘online synchronous learning’ programme. Under this, all state schools were conducting online classes since July 2020. However, the online classes for board exam candidates will be conducted as per schedule.\n\nप्रदेश के समस्त शासकीय एवं अशासकीय (CBSE, ICSE, माध्यमिक शिक्षा मण्डल अथवा अन्य किसी बोर्ड से सम्बद्ध) शालाओं में कक्षा 10वीं एवं 12वीं को छोडकर (जिनकी बोर्ड परीक्षाएँ होनी है ) शेष समस्त कक्षाएं दिनांक 1 मई, 2021 से 31 मई, 2021 तक ऑनलाईन संचालित नहीं होगी। pic.twitter.com/H5RuToz03N — School Education Department, MP (@schooledump) April 27, 2021\n\nThe Madhya Pradesh Board of Secondary Education (MPBSE) has also clarified in the circular that the exams for class 10 and 12 have not been cancelled. The exams have been postponed due to the unprecedented rise in the number of COVID-19 cases across the country."}, {"Article Image": "https://images.indianexpress.com/2021/04/priyanka-chopra.jpg", "Article's Title": "Priyanka Chopra joins hands with Global Citizen to help in India’s Covid-19 crisis", "Article's Text": "Priyanka Chopra is working with Global Citizen and she answered some questions regarding how she plans on helping Indian citizens in sourcing the required vaccines. (Photo: Priyanka Chopra/Instagram)\n\nPriyanka Chopra is using her Twitter handle that has over 27 million followers to raise awareness about the Covid-19 crisis in India. Priyanka shared a tweet questioning US authorities on stocking excess vaccines when India is facing a massive shortage.\n\nPriyanka tweeted, “My heart breaks. India is suffering from COVID19 & the US has ordered 550M more vaccines than needed @POTUS @WHCOS @SecBlinken @JakeSullivan46 Thx for sharing AstraZeneca worldwide, but the situation in my country is critical. Will you urgently share vaccines w/ India? #vaxlive.”\n\nMy heart breaks. India is suffering from COVID19 & the US has ordered 550M more vaccines than needed @POTUS @WHCOS @SecBlinken @JakeSullivan46 Thx for sharing AstraZeneca worldwide, but the situation in my country is critical. Will you urgently share vaccines w/ India? #vaxlive — PRIYANKA (@priyankachopra) April 26, 2021\n\nThe actor is now working with Global Citizen, and she answered some questions regarding how she plans on helping Indian citizens in sourcing the required vaccines. When a user asked what she is doing about oxygen shortage in the country, Priyanka wrote, “In addition to working with @Glblctznimpact to ensure these vaccines are sent to India at the earliest, am currently working on some initiatives to help where most needed.”\n\nPriyanka Chopra also shared how she plans to reach rural areas of the country with her vaccine campaign. “Through the #VaxLive campaign we’re supporting COVAX, a global vaccine sharing program that works with partners with lots of experience reaching rural communities. We’re raising funds and calling for dose donations to COVAX,” she wrote.\n\nYes we need all of these tools to save lives. The only way to stop the spread of the virus in India is by building collective immunity through vaccines. https://t.co/LOsNp4sxcH — PRIYANKA (@priyankachopra) April 28, 2021\n\nWhen another user asked her about the fear of side effects and how that fear can be curtailed, Priyanka wrote, “I understand and it’s important people seek more info or speak with a doctor if they have concerns. Vaccines work and throughout history have saved millions of lives and eradicated diseases like Smallpox and Polio in India.”\n\nApart from the vaccines, India needs help in other medical infrastructure as well, and when a user pointed out the same, Priyanka said, “Yes we need all of these tools to save lives. The only way to stop the spread of the virus in India is by building collective immunity through vaccines.”\n\nNaming the countries that can share vaccines, Priyanka Chopra also tweeted, “The US, UK, France, Germany, Italy, Canada and Japan — these are the wealthy countries of the G7 group that we want to see share more doses as soon as possible.”\n\nOn the work front, Priyanka was recently seen in The White Tiger and We Can Be Heroes. The global star recently launched her memoir Unfinished."}, {"Article Image": "https://images.indianexpress.com/2021/04/rahul-vaidya-1-1.jpg", "Article's Title": "Rahul Vaidya slams trolls who accused him of buying followers as he crosses 1.5 million mark on Instagram, watch video", "Article's Text": "Bigg Boss 14 runner up and singer Rahul Vaidya has got a fan following of 1.5 million on the photo-sharing app Instagram. He celebrated the feat by sharing a video where he called out people who claimed that he bought followers on social media to ensure a longer stay on the TV reality show, Bigg Boss.\n\nIn the video, Rahul said, “Some people said it is paid PR, some said I spend lakhs of rupees to buy fans every week. But now even Bigg Boss is over and everything is over. Still, my fandom has reached 1 million. What say public?” In the background, the singer played the theme music of SonyLIV web series Scam 1992 and signed off with a victory sign.\n\nEarlier on Tuesday, the singer also gave a shout-out to all his fans, who call themselves ‘RKvians’, for “becoming the First BB14 Contestant’s fandom & First Indian Singer’s Fandom to cross 1 MILLION hashtags on Instagram”.\n\nView this post on Instagram A post shared by RKV 💫 (@rahulvaidyarkv)\n\nRahul Vaidya had some of the nastiest fights on Bigg Boss 14. His major fallouts happened with contestants Jasmin Bhasin, Nikki Tamboli, Rubina Dilaik, Abhinav Shukla, Pavitra Punia and Eijaz Khan. During the show, a few of them even said that all the support he has been garnering online is paid promotions, and he has hired a team to keep the buzz around him alive.\n\nHowever, the singer, despite his many ugly fights, managed to reach the finale but lost the trophy to TV actor Rubina Dilaik. Ever since then, Rahul has been in the headlines for his relationship with Disha Parmar. Recently, their music video “Madhanya” was released which received a lot of love from their fans."}, {"Article Image": "https://images.indianexpress.com/2020/06/IITGuwahati1200.jpg", "Article's Title": "IIT Guwahati to set-up School of Data Science and Artificial Intelligence, admission through JEE score", "Article's Text": "Indian Institute of Technology-Guwahati will set-up School of Data Science and Artificial Intelligence for students at undergraduate and postgraduate level. The first batch of B Tech students for this school will be admitted through JEE score in the academic year 2021-22. In this reagard, IIT-Guwahati today signed an MoU with the Mehta Family Foundation (MFF), USA.\n\nThe MoU was signed virtually by Prof TG Sitharam, Director, IIT Guwahati, and Rahul Mehta, chief executive officer, Mehta Family Foundation, USA. Rahul Mehta said, “The explosion of data across all fields of knowledge continues unabated. Just like computer science changed the world, data science and artificial intelligence are posed to do the same. These fields will shape the methods used in education and research across the spectrum of human knowledge. Global interdisciplinary collaborations as envisioned in this new school will lift our understanding of society and nature. Bringing together global talents such as Professor Shankar Subramaniam, Professor Rajesh Gupta (both Univ. of California, San Diego), and Professor Ananth Grama (Purdue Univ.) can accelerate the expansion in these fields.”\n\nThrough this MoU, MFF will provide support for the development of the school’s infrastructure and programs at IIT Guwahati campus. The school will offer programmes for visiting students and faculty between the school and US institutions. The school will host conferences and establish chairs attracting world-class talent.\n\nThe school will also have access to distinguished professors from top US universities providing time and expertise for academic and research activities in this new school.\n\nProf R Bhattacharjee, head, Mehta Family School of Data Science and Artificial Intelligence, IIT Guwahati said the curriculum has been developed to provide a strong theoretical foundation as well as emphasis on different interdisciplinary application areas. One of the objectives of the school is also to take up targeted multi-year interdisciplinary research projects and solve the problems which benefits society at large, a deep rooted vision of IIT Guwahati."}, {"Article Image": "https://images.indianexpress.com/2021/04/citizen-kane.jpg", "Article's Title": "Citizen Kane loses its perfect score on Rotten Tomatoes after 1941 negative review resurfaces", "Article's Text": "Citizen Kane or rather its making was the subject of David Fincher's multiple Oscar-nominated and two-time winner Mank.\n\nOrson Welles’ Citizen Kane, widely considered one of the greatest movies ever made, has lost its 100 per cent score on Rotten Tomatoes after the review aggregator website added a negative review from 80 years ago.\n\nThe negative review, published by the Chicago Tribute on May 7, 1941, was the 116th review of the film on the website and became the one to ruin the perfet score of the film.\n\nThe Chicago Tribune’s negative Citizen Kane review was published under the pseudonym Mae Tinee and accompanied with the headline ‘Citizen Kane Fails to Impress Critic as Greatest Ever Filmed’, reported IndieWire.\n\nThe review was published a few days after the film first started rolling out into theaters in 1941. The critic branded the movie “a flop” and wrote that the film’s noir-inspired visuals and use of shadows “gives one the creeps.”\n\n“It’s interesting. It’s different. In fact, it’s bizarre enough to become a museum piece. But its sacrifice of simplicity to eccentricity robs it of distinction and general entertainment value,” the review wrote.\n\nThe review, according to IndieWire, was uploaded on the website in line with the launch of the RT Archives, an archival hub introduced in November 2020 which houses and preserves editorial content related to classic and historic film.\n\nNot just Citizen Kane, classics such as A Night at the Opera, Double Indemnity, Home of the Brave, Victim, Madchen in Uniform, The Dirty Dozen, and Gilda were issued new scores as part of the archival initiative.\n\nCitizen Kane or rather its making was the subject of David Fincher’s multiple Oscar-nominated and two-time winner Mank. The movie, which won Oscars for best cinematography and best production design, focused on Citizen Kane screenwriter Herman J Mankiewicz.\n\nInterestingly, the script of Citizen Kane was the sole Oscar winner as the film famously lost best picture to John Ford’s family drama How Green Was My Valley."}, {"Article Image": "https://images.indianexpress.com/2021/04/Irrfan-Khan-1200-1.jpg", "Article's Title": "Irrfan Khan foretold his death to son Babil: ‘He smiled and said I am going to die’", "Article's Text": "Late actor Irrfan Khan’s wife Sutapa Sikdar has opened up on the death of the actor and how she has been unable to cope with the loss. Sutapa and Irrfan met when they were both students at the National School of Drama. Irrfan died on April 29, 2020, after a long battle with neuroendocrine tumor.\n\nIn an extremely emotional interview with Film Companion, Sutapa described how Irrfan was curious about death and what happens after life. She said that after he was diagnosed with cancer, he felt that maybe he had drawn death towards him.\n\n“He was very curious about death since the day we met. He comes from a Muslim family, I come from a Hindu background but I never had a natal chart. It’s all Irrfan; he made my kundali. His thing for astrology was not to know what will happen to his career but he was curious to know what will happen in the next life. He was immensely curious about it. He messaged Anup in London if he was drawing death towards him. Death had became like his playmate,” Sutapa said.\n\nSutapa said Irrfan needed her around 24/7 as he underwent treatment. She recalled that before going to the hospital, he assured her everything is alright. “He is telling me – ‘nahi theek hai.’ Without any tantrum or anger. His face didn’t reveal any displeasure. I so clearly remember, sitting on the edge of the bed, he had become very weak. I made him wear his trousers, combed his hair. He sat, he held my hand and got up. We hugged each other. There was not even a second of a finality in it. No intuition of him was saying that I will not come back.”\n\n“For him, I don’t think he thought the time has come. He was reading books and planning films with Babil. He was planning every tree we will plant, which I am doing now. Everything. I don’t know, I sometimes feel I guilty that I had so much faith which I instilled in him that ‘kuch nahi hoga, main sambhal lungi’. He believed in me so much,” Sutapa teared up.\n\nBabil also spoke about his last moments with his ‘Baba’ Irrfan Khan. “I was there in the hospital in the last two days. He was losing consciousness. He just looked at me, smiled and said, ‘I am going to die.’ And I said, ‘No, you are not.’ He smiled again and went back to sleep. But I really feel like he had surrendered completely. There are no words to achieve that kind of evolution I think.”\n\nBabil said he learned to love selflessly from his mother Sutapa who gave her 24/7 of two and a half year to Irrfan. Describing her efforts, Babil got emotional and said what she did for Irrfan, no human will ever do for another."}, {"Article Image": "https://images.indianexpress.com/2021/04/rishi-kapoor-neetu-kapoor-kabhi-kabhie.jpg", "Article's Title": "When Rishi Kapoor refused to work with Amitabh Bachchan, Neetu Singh, said ‘Amitabh never gave due credit to actors who worked with him’", "Article's Text": "It’s been almost a year that Bollywood’s evergreen heartthrob Rishi Kapoor passed away. The actor died on April 30, 2020, after battling cancer for two years. His death left his many fans, friends and colleagues heartbroken. Even today he is remembered as the golden boy of Hindi cinema, who won hearts with his singing, dancing and acting on the silver screen. People also remember him for his no-holds-barred attitude which he very well showcased in his biography Khullam Khulla – Rishi Kapoor Uncensored. He was one of those few people in the industry who was not afraid to openly speak his thoughts.\n\nIn his memoir, Kapoor was brutally honest about his personal and professional life. While today many actors prefer to not discuss their personal life, Rishi candidly wrote about his relationship with his wife Neetu Kapoor. He mentioned how she was someone who would ‘put up’ with him despite him being a difficult husband. At times when he was failing at the movies, he blamed his wife. Also, he refused to work on Yash Chopra’s 1976 film Kabhi Kabhie since Neetu had a meatier role than his. He mentioned in his book, “I felt Neetu had a more prominent role than I did. That’s why I had said to Yash Chopra, if you want me to do the film, give me Neetu’s role. Naturally, Yash-ji was confused.” Later, Shashi Kapoor intervened and Rishi did the film.\n\nA poster of Yash Chopra’s Kabhi Kabhie. A poster of Yash Chopra’s Kabhi Kabhie.\n\nFor Rishi Kapoor, the reason for rejecting Kabhie Kabhie was not only Neetu Kapoor. The actor also wrote about a ‘lingering issue’ he had with Amitabh Bachchan.\n\n“To go back to Amitabh, I must confess here is still a lingering issue I have with Amitabh Bachchan. A big disadvantage of working in an all-star movie in those days was that everybody only wanted to make action films, which automatically meant that the star who could carry off action with the most flair would get the meatiest part. That’s how, with the exception of Kabhi Kabhie, which was a romantic film, none of the multi-starrers I featured in had an author-backed role for me. And it wasn’t just me. Shashi Kapoor, Shatrughan Sinha, Dharmendra, Vinod Khanna faced it too,” Rishi Kapoor wrote in Khullam Khulla.\n\n“Amitabh is undeniably a superb actor, immensely talented and, at the time, the number one star who ruled the box-office. He was an action hero, the angry young man. So roles were written for him. Although we may have been smaller stars, we were not lesser actors. Yet, the rest of us had to constantly measure up to him. We had to work hard, really exert ourselves to match up. In my time, the musical/romantic hero had no place. Amitabh was an action hero in an era of action films. As such, writers gave him the lion’s share and he had the authorbacked roles in almost all his films. This gave him an advantage over the rest of us who had to make our presence felt with whatever we got. But this is something that Amitabh has never ever admitted to, in any interview or book. He has never given due credit to the actors who have worked with him. He has always credited his writers and directors, Salim-Javed, Manmohan Desai, Prakash Mehra, Yash Chopra and Ramesh Sippy.”\n\nAmitabh Bachchan and Rishi Kapoor shared the screen in films like Kabhi Kabhie (1976), Amar Akbar Anthony (1977), Naseeb (1981), Coolie (1983) and Ajooba (1991). They came together after 27 years in 2018 film 102 Not Out."}, {"Article Image": "https://images.indianexpress.com/2021/04/Your-Honor.jpg", "Article's Title": "Ludhiana: Actor Jimmy Sheirgill, others booked for violating Covid norms", "Article's Text": "The Ludhiana city police Wednesday booked actor Jimmy Sheirgill, director Eshwar Niwas and 32 others for allegedly violating Covid guidelines and shooting for a web series during curfew hours, at a school in Ludhiana.\n\nPolice said that the team of web series ‘Your Honor’ was found shooting at Arya Senior Secondary School in Ludhiana Tuesday night after 8 pm, in violation of curfew orders which begins 6 pm across the state. As per police, there was a gathering of at least 100-150 persons at the site.\n\nSub-inspector Maninder Kaur from division number 1 police station, said that an FIR was registered against four identified persons — Jimmy Sheirgill, director Eshwar Niwas from Mumbai, two other crew members — Akashdeep Singh from Ludhiana and Mandeep Singh from Zirakpur. Thirty unidentified persons have also been booked.\n\nAn FIR has been registered under Sections 188 (disobedience to the order duly promulgated by public servant), 269 (negligent act likely to spread infection of any disease dangerous to life) of IPC and Section 3 of the Epidemic Diseases Act.\n\nKaur said that Eshwar Niwas, Akashdeep Singh and Mandeep Singh were arrested in the case and granted bail on the spot.\n\nAdapted from an Israeli show ‘Kvodo’, Sheirgill-starrer ‘Your Honor’ is a web series in which he plays the role of a judge based in Ludhiana whose son gets involved in a hit-and-run case. He is then caught between his conscience as a judge and love for his son.\n\nEshwar Niwas directed film ‘Shool’ had won the national award for the best Hindi feature film in 1999."}, {"Article Image": "https://images.indianexpress.com/2021/04/Britney-Spears-1200by667.jpg", "Article's Title": "Britney Spears to speak directly to LA court on her conservatorship", "Article's Text": "Britney Spears has not performed in public since October 2018. (Photo: britneyspears/Instagram)\n\nPop star Britney Spears will personally address the Los Angeles court dealing with her long-running conservatorship in June, a judge agreed on Tuesday.\n\nSpears, 39, has been under a conservatorship since 2008, but rarely takes part in court hearings and has not publicly commented on the legal arrangement where a court-appointed adviser controls her personal and financial affairs, including her medical treatment, security and career.\n\n“My client (Britney Spears) has requested a hearing at which she can address the court directly,” the singer’s lawyer Samuel Ingham told the court on Tuesday. “My client has asked that it be done on an expedited basis.”\n\nThe judge set a June 23 hearing for Spears to speak to the court. It was not known which matters the singer planned to address.\n\nThe singer’s father, Jamie Spears, was appointed his daughter’s conservator in 2008 after the pop star was hospitalized for psychiatric treatment following a widely publicized breakdown.\n\nBritney Spears, who became a teen phenomenon 20 years ago with hits like “…Baby One More Time” and “Toxic,” made clear last year through her lawyer that she no longer wants her father involved in her affairs.\n\nA previous bid to remove him failed in August 2020 and a hearing on Tuesday on a new request to replace him with someone else was postponed until July without discussion.\n\nVivian Thoreen, an attorney for Jamie Spears, said in interviews last month that the pop star had never requested the termination of the legal arrangement.\n\nSpears has not performed in public since October 2018, though she frequently posts photos and videos of herself dancing at her Los Angeles area home. In 2019, she pulled out of a Las Vegas concert residency and briefly entered a mental health facility.\n\nThe release of a television documentary in February brought new scrutiny to the case and to the #FreeBritney movement started by fans.\n\n#FreeBritney supporters, who rallied outside the courthouse on Tuesday, believe Spears is being kept prisoner and she is sending cryptic signals begging to be freed through her social media accounts.\n\n\n\nLoud cheers rang out as some 30 supporters heard the news about her upcoming appearance. One fan had shaved her head in solidarity with Spears, who shocked fans when she took pictures of herself doing the same in 2007 at the height of her health breakdown.\n\n“This is the first time in 13 years we’re getting any sort of word from Britney about her conservatorship and it’s the biggest deal to me. My life is Free Britney and it just changed,” said supporter Jake Yonce, outside the court."}, {"Article Image": "https://images.indianexpress.com/2019/10/prithviraj-new-look-1200.jpg", "Article's Title": "Prithviraj’s Kaduva shooting stopped amid surging Covid-19 cases", "Article's Text": "The shooting of actor Prithviraj’s upcoming film Kaduva has been temporarily suspended. Director Shaji Kailas on Tuesday took to social media to inform that the production of the film has been put on hold in view of growing cases of the coronavirus.\n\n“We are temporarily suspending the shooting of ‘Kaduva, to show solidarity the government’s efforts to contain the Covid-19. We will resume shooting when the situation becomes a little better. Stay safe, stay healthy (sic),” said Shaji Kailas in his Facebook post.\n\nKaduva is billed as a full-fledged mass action entertainer. It is said that the upcoming film is set in the 90s and the story is partially inspired by a real-life incident.\n\nKaduva will mark Prithviraj’s second collaboration with Shaji Kailas after Simhasanam, which came out in 2012. Shaji was known for churning out films that resembled the over-the-top, high-decibel, masala entertainers of mainstream Tamil and Telugu movies. Some of his biggest hits came out in the 90s, including Mohanlal’s Narasimham, Mammootty’s The King and Suresh Gopi Commissioner to name a few. The director’s last Malayalam film was Ginger, starring Jayaram in the lead. Shaji is making a comeback to the Malayalam film industry after a gap of about seven years with Kaduva.\n\nKaduva is being scripted by filmmaker Jinu Abraham, who directed Prithviraj in Adam John (2017) and wrote the actor’s London Bridge (2014). According to reports, it was based on Prithviraj’s recommendation that Jinu approached Shaji to direct the film.\n\nKaduva is being bankrolled by Prithviraj Productions along with Magic Frames. Composer S Thaman will score the music for the upcoming movie"}, {"Article Image": "https://images.indianexpress.com/2021/04/seeti-maar-making-radhe-salman-khan.jpg", "Article's Title": "Seeti Maar making: How Salman Khan impressed Prabhudheva, Disha Patani with his impromptu dance moves, watch", "Article's Text": "Radhe Your Most Wanted Bhai song Seeti Maar is a take on Allu Arjun's song by the same name.\n\nOn Monday, makers of Radhe Your Most Wanted Bhai released “Seeti Maar”, the first song from the Salman Khan-starrer. The recreation, of a popular Telugu song by the same name featuring Allu Arjun, has Salman showing off his inimitable style of dancing with Disha Patani. Earlier today, the team released the making of “Seeti Maar”, and Disha and director Prabhudheva could not stop showering compliments on Salman and his impromptu dance moves.\n\nThe close to three-minute video has footage of Prabhudheva and his team rehearsing with Salman and Disha on set. Salman, who otherwise claims to be a non dancer, is seen at his candid best while filming. The Bollywood superstar shared that “Seeti Maar” is a well-picturised song with a lot of hook steps. “It’s all Prabhudheva,” he exclaims.\n\nChoreographer-filmmaker Prabhudheva then reveals that he really wanted Salman to dance, and given Disha also enjoys dancing, they wanted to have the best moves. He further reveals that the Bajrangi Bhaijaan star gets into the character while performing and often gives suggestions. Sharing that even when there were a lot of difficult steps, Salman did it all effortlessly.\n\nReferring to one of the sequences where Salman Khan is seen holding Disha Patani in his arms, Prabhudheva shares, “He came on set and was like ‘Prabhu, I will pick Disha as in doing weight lifting in this step.’”\n\nDisha also went on to reveal how Salman improvises on set, adding that it was intimidating to shoot with Prabhudheva. “It’s a complete south style number with a lot of hip hop dance moves. It was quite a challenge, but Salman sir never said no to anything,” she reveals.\n\nHeaping praises on the superstar, the actor adds, “It’s always so much fun working with him. When he performs, he doesn’t have a care. He truly dances like no one’s watching. It is part of his swag, and he makes it look so effortless. I think no one can dance like him.”\n\nTowards the end of the video, Salman Khan also credits composer Devi Siri Prasad for the ‘outstanding track’. Prabhudheva, on his part, says that the song is going to be a ‘treat to the eyes’.\n\nWhile sharing “Seeti Maar” on social media platforms, Salman Khan had even thanked Allu Arjun. He wrote, “Thank u Allu arjun for seeti maar absolutely loved the way u have performed in the song, the way u dance, your style, u r simply fantastic.. tk care n b safe. Rgds to ur family .. love u brother.” Allu also replied to the tweet, “Thank you soo much Salman garu . It’s a pleasure to receive a compliment from you . It’s such a sweet gesture. Looking forward for the RADHE magic on screens with fans doing SEETI MAAR for you . Thank you for your love . 🖤AA.”\n\nRadhe Your Most Wanted Bhai will hit theatres in over 40 countries on May 13 2021, on the occasion of Eid. The film will also be available on ZEE’s pay per view service ZEEPlex and all leading DTH operators."}, {"Article Image": "https://images.indianexpress.com/2019/10/Baahubali-1200.jpg", "Article's Title": "As Baahubali 2 turns four, here’s why this Prabhas-starrer could be last of its kind in history of Indian cinema", "Article's Text": "The opening of Baahubali: The Conclusion was nothing short of a carnival. Four years ago today, there was no fear of crowd and viruses, the only thing on the minds of people who headed for early morning shows (6 am or even earlier) of the SS Rajamouli epic was to find their seats on time before the show began. The moment the doors opened, people rushed inside, not afraid to step on toes or others shoving you.\n\nIn these Covid times, it is hard to imagine a world without social distancing but that was the scene in over 6000 theatres across India on April 28, 2017. Everybody in the country wanted to see Baahubali 2 and everyone did, sooner or later. That’s why the film went onto become the highest earner in the history of Indian cinema. We are a deeply diverse country. All of us have different taste in movies, favourite stars and filmmakers. Take south India, for example. The movie fans in Tamil Nadu may not feel as excited about the release of, say, an Allu Arjun film, as they would about an Ajith starrer. And movie fans in the Telugu states may not feel the same level of eagerness for a Vijay movie, that they would normally feel for a Mahesh Babu starrer. The Hindi speaking audiences, meanwhile, have been immune to the charms of films coming from south other than a few exceptions.\n\nHowever, Baahubali did away with those barriers. The images of people forming long queues outside the theatres to buy tickets before the release of the movie are still fresh in the memory. And it was not limited to south Indian states, it was a pan-India phenomenon. And mind you, it was a time when people had the option to buy tickets in advance through online platforms. While some queues were running up to a few kilometres, the online ticketing platforms were also overwhelmed.\n\nA day before the release of director SS Rajamouli’s magnum opus, Bookmyshow sold 12 tickets every second for the film. Within a day, the ticketing platform sold more than one million tickets. It is one of the new business records that the film created close to its release. And naturally, the ticket prices skyrocketed. In the states, where movie ticket prices were not regulated by the government, tickets sold in the excess of Rs 600. And the prices at the luxury screens touched a new high.\n\nAnother one @PrasadsMultiplx, 7 am. From my experience of last time, order goes to toss as gates open! #baahubali2 #BaahubaliTheConclusion pic.twitter.com/b1oY4PcFUX — Pranita Jonnalagedda (@PranitaRavi) April 26, 2017\n\nAt a time, when Bollywood was obsessed with the 100-crore club and big stars waited for days for their films to reach the coveted mark, Baahubali smashed that record within a few hours of its release. The movie collected worldwide more than Rs 100 crore on its opening day. And it became the fastest and the first Indian film to earn Rs 1000 crore from ticket sales within 10 days of its theatrical launch. So on average, the film netted Rs 100 crore every day for 10 days, dwarfing all the previous collection records in the history of Indian cinema.\n\nThe Hindi dubbed version of the movie raked in more than Rs 500 crore a little over 30 days after its release. To put it in context, the highest-grossing film in the history of Bollywood is a Telugu film, starring a regional movie star in lead, Prabhas. The final collection of Baahubali 2 is said to be touching Rs 1800 crore.\n\nHowever, emerging as India’s biggest earner globally was not the only achievement of Baahubali 2. Yes, it showed the members of the Indian film fraternity the true size of the domestic market. It opened up new earning opportunities for regional movies in a big way. Now, “the pan-India movie” is the keyword that drives the mainstream business in regional cinema. It changed the hierarchy of power in Indian cinema. Now, more than ever, Bollywood filmmakers keep close tabs on what south Indian filmmakers are working on.\n\nAnd more importantly, Baahubali 2 mainly united India, cutting across the barriers of language and culture. It was a power that so far remained within the confines of the cricket.\n\nAnd that was four years ago. Today, we are on the brink of a new world, where looking at a crowd of 10 at a supermarket strikes terror in our hearts. When we come out of this pandemic, we don’t know what “normal” would look like. But, we can say with some certainty, India is unlikely to share the mutual excitement over going to the theatre to watch another movie in the foreseeable future. Baahubali 2 could be perhaps the last movie to have received such overwhelming love from people in India. It could mark an important era that has come to an end. Baahubali 2 success could be the last of its kind in the history of India’s cinema-going."}, {"Article Image": "https://images.indianexpress.com/2021/04/allu-arjun-1200by667.jpg", "Article's Title": "Allu Arjun tests positive for Covid-19", "Article's Text": "Telugu superstar Allu Arjun on Wednesday revealed that he has tested positive for Covid-19. In a statement, the 38-year-old actor requested his fans not to worry about his health as he is doing fine. The actor is quarantined at home and is following all Covid protocols.\n\n“Hello everyone! I have tested positive for Covid. I have isolated myself at home and have been following all the protocols. I request those who have come in contact with me to get tested. Stay home, stay safe and get vaccinated when you get the chance. I request all my well-wishers & fans not to worry about me as I am doing fine. Love, ” a statement from Allu Arjun read.\n\nHello everyone!\n\nI have tested positive for Covid. I have isolated myself.\n\nI request those who have come in contact with me to get tested.\n\nI request all my well wishers and fans not to worry as I am doing fine . Stay home, stay safe . pic.twitter.com/CAiKD6LzzP — Allu Arjun (@alluarjun) April 28, 2021\n\nSoon after the statement, his fans trended ‘Get Well Soon Allu Arjun’ and ‘Get Well Soon Anna’ on Twitter. Allu Arjun is the new addition to the list of those who have tested positive for the coronavirus in actor Chiranjeevi’s family. Earlier, Ram Charan, Pawan Kalyan, and Chiru’s son-in-law Kalyaan Dhev were diagnosed with Covid-19.\n\n\n\nAllu Arjun has been shooting for his upcoming film Pushpa. He is also expected to team up with director Sriram Venu of Vakeel Saab fame."}, {"Article Image": "https://images.indianexpress.com/2021/04/kareena-kapoor-khan-1.jpg", "Article's Title": "Kareena Kapoor asks people to spare a thought for doctors and medical staff: ‘They are at a breaking point’", "Article's Text": "Amid the surge in coronavirus cases in India, many celebrities have come forward to aid people monetarily or amplify resource leads through social media. Kareena Kapoor Khan has been asking fans to stay safe and get vaccinated in time. On Wednesday, the Bollywood actor took to Instagram and asked people to spare a thought for the doctors and medical staff.\n\nIn the note, the 3 Idiots actor showed her displeasure at citizens for still not abiding by the safety protocols. “It’s unimaginable for me to know that there are still many people who do not understand the gravity of the situation our country is in,” wrote Kareena. She followed it up by asking everyone to spare a thought for the medical fraternity every time they flout a rule.\n\nShe further wrote, “The next time you step out, or wear your mask under your chin, or flout the rules; spare a thought for our doctors and medical staff. They are at a breaking point both mentally and physically.”\n\nView this post on Instagram A post shared by Kareena Kapoor Khan (@kareenakapoorkhan)\n\nKareena Kapoor ended the note by saying that each one reading her message is responsible for breaking the chain, and the country needs them ‘now more than ever’.\n\nActor Dia Mirza, while sharing the dos and don’ts in the coming days, also asked fans to get vaccinated. In a video, she said that we can help by staying home, wearing a double mask, keeping physical distance, donating plasma and helping each other.\n\nView this post on Instagram A post shared by Dia Mirza (@diamirzaofficial)\n\nJanhvi Kapoor and Kartik Aaryan also promoted the registration for Covid-19 vaccination for everyone above the age of 18, which is set to kickstart from today."}, {"Article Image": "https://images.indianexpress.com/2021/04/Samantha-Akkineni-1200by667.jpg", "Article's Title": "On Samantha Akkineni’s birthday, her 5 most memorable performances", "Article's Text": "Samantha Akkineni is not just an actor anymore. Today, she is a multifaceted personality with a great star value. As she gets ready to debut in Hindi cinema with the second season of The Family Man, it is time to take a dive into her existing body of work. So, on her birthday today, here we bring you her five best performances on the big screen.\n\nOh! Baby (2019)\n\nThis BV Nandini Reddy directorial is a remake of the South Korean hit movie Miss Granny. The film tells the story of an aged woman named Baby, whose soul magically gets trapped in a young woman’s body (Samantha). In the movie, Samantha’s antics as a young woman with orthodox thoughts are super fun to watch from the word go. Her performance received unanimous praise from the critics and the audience alike.\n\nMajili (2019)\n\nMajili is the fourth outing of Samantha and Naga Chaitanya after Manam, Autonagar Surya, and Ye Maaya Chesave. In the film, Samantha portrayed a character named Sravani, a working woman who has immense love for her husband Poorna (Naga Chaitanya). Samantha’s performance as a woman who tries to change her husband was appreciated.\n\nRangasthalam (2018)\n\nSam’s character from this movie remains a unique one. Her performance as Ramalakshmi, a village belle, is a treat to watch indeed. It shows her commitment to choose diverse roles.\n\nA Aa (2016)\n\nA Aa – Anasuya Ramalingam Aanand Vihari is Samantha’s third collaboration with director Trivikram. In the film, she got an author-backed role that differs from the routine heroine tracks in contemporary Telugu dramas. If not for Samantha, the film would have been a routine fare instead of the entertaining and impactful drama.\n\n\n\nYe Maaya Chesave (2010)\n\nFor any heroine, especially in Telugu cinema, it is rare to get a role that gives a solid scope to perform during their debut. Samantha’s first movie, a Gautham Vasudev Menon directorial Ye Maaya Chesave gave her that rare opportunity. Her acting as Jessie is remembered to this day."}, {"Article Image": "https://images.indianexpress.com/2021/04/khatron-ke-khiladi-11.jpg", "Article's Title": "Khatron Ke Khiladi 11 confirmed list of contestants: Rahul Vaidya, Nikki Tamboli, Abhinav Shukla, Divyanka Tripathi join Rohit Shetty’s show", "Article's Text": "Khatron Ke Khiladi 11 would be shot in Cape Town with Rohit Shetty as the host. (Photo: Rahul Vaidya, Nikki Tamboli, Abhinav Shukla and Divyanka Tripathi/Instagram)\n\nThe next season of Khatron Ke Khiladi is all set to go on the floors soon, and the makers have already finalised the contestants. And it appears a Bigg Boss 14 reunion is set to happen on the Rohit Shetty-hosted series.\n\nAs per sources, Khatron Ke Khiladi 11 will see Rahul Vaidya, Nikki Tamboli and Abhinav Shukla competing against each other. While Nikki and Rahul were quite friendly on Bigg Boss, they did not share a warm bond with Abhinav. However, towards the finale of the show, Nikki became close to Abhinav and his wife Rubina Dilaik, who eventually won the season.\n\nApart from these Bigg Boss 14 alumni, popular television star Divyanka Tripathi will also join the team. The actor, last seen hosting Crime Patrol, had earlier enjoyed a non fiction stint when she participated in Nach Baliye 8 with husband Vivek Dahiya.\n\nIndianexpress.com had already confirmed about Arjun Bijlani being one of the contestants this season. Other television faces joining the series are Sana Sayyad (Lockdown Ki Love Story) and Anushka Sen (Apna Time Bhi Aayega).\n\nKhatron Ke Khiladi 11 will be shot in Cape Town, and will have Rohit Shetty return as the host. The team has been working on the final logistics and will fly off in May for a month long schedule. The contestants and crew will undergo a quarantine period before traveling and the shoot will happen amid a strict bio bubble. While the episodes would be filmed now, the show will only go on air later, once Dance Deewane 3 wraps up.\n\nLaunched in India in 2006, Khatron Ke Khiladi is adapted from the popular American game show Fear Factor. Mukul Dev, Akshay Kumar, Priyanka Chopra and Arjun Kapoor have each hosted the show in the past. KKK10 was won by Karishma Tanna. Karan Patel and Dharmesh Yelande ended up as the first and second runners-up, respectively. With restrictions on international travel last year, the makers produced a short season, Khatron Ke Khiladi – Made in India with all former contestants. The show was won by Nia Sharma."}, {"Article Image": "https://images.indianexpress.com/2021/04/Anil-Ravipudi-1200by667-new.jpg", "Article's Title": "F3 director Anil Ravipudi tests negative for Covid-19", "Article's Text": "Director Anil Ravipudi, who tested positive for Covid-19 on April 13, tested negative on Wednesday. The Raja The Great director took to social media to share the news.\n\n“I was detected with Covid-19 on the 13th of April 2021. I personally called up all the people who were in contact with me before that and made sure they isolated themselves and took precautions. I isolated myself since then and followed all prescribed instructions. Today I tested negative and am feeling much better. I just wanted to thank everyone who wished me after knowing about the situation,” Ravipudi said in a statement.\n\n“I request each and every one of you to get vaccinated and protect yourself from this virus,” he added.\n\nOn the work front, Anil Ravipudi is presently shooting F3, starring Venkatesh Daggubati, Varun Tej Konidela, Tamannaah Bhatia, and Mehreen Pirzada.\n\nF3 is scheduled for release on August 27."}, {"Article Image": "https://images.indianexpress.com/2019/11/study-abroad-1200.jpg", "Article's Title": "University of East Anglia announces scholarships starting at £4,000 for Indian students at UG level", "Article's Text": "The University of East Anglia (UEA), United Kingdom has announced a scholarship worth £4000 for undergraduate students across programmes who will be joining UEA in September 2021. For those looking to pursue undergraduate programmes, the varsity is also offering scholarships to students joining in September.\n\nThe International Country Award is an automatic award in which the eligible candidates will receive £4,000 off on their first-year tuition fees once selected.\n\nMoreover, eligible candidates are encouraged to apply to the International Scholarship Scheme which enables them to receive higher scholarship aid up to £ 8,000 a year.\n\nRead | How applying to college abroad is (and isn’t) changing\n\nSubmissions are judged on a monthly basis and successful candidates will have their scholarship applied to three years of full-time study, while superior submissions will be considered for £8,000 per year. The candidates for September 2021 intake can submit their application until July 5, 2021.\n\n“We want that these scholarships to enable deserving students to realise their dream of studying at UEA and this substantial financial support at undergraduate levels will help them to make an outstanding contribution to their chosen field of study, as well as the wider UEA community,” Karen Blackney, associate director, UEA Global said."}, {"Article Image": "https://images.indianexpress.com/2021/04/aashka-brent-.jpg", "Article's Title": "Aashka Goradia, husband Brent Goble test positive for coronavirus: ‘This new strain is a sly devil’", "Article's Text": "TV actor Aashka Goradia and her husband Brent Goble have tested positive for the coronavirus. The couple got themselves tested before leaving for their home in the US. Their first test results came out to be negative but in a couple of days, when they took the test again, they found they were infected with the virus. The Naagin actor shared her health update on social media. In her post, she also requested everyone to pray for people who are ‘debilitated’ with the virus.\n\nTaking to Instagram, Aashka wrote, “In preparation for our trip to my home in the US, @ibrentgoble and I have both tested positive for COVID. We have been reeling from this news since this morning when we were just about to leave Goa. Both of us are feeling fine physically but the test reports say otherwise and that means we have to let the virus run its course.”\n\nBoth Aashka and Brent do not have any “debilitating symptoms” and they are at their home in Goa, “safe, and not in contact with anyone.” Aashka, who practice Yoga and follow a healthy lifestyle feels the new strain of the coronavirus is a “nasty and sly devil” as “it doesn’t matter how healthy you are -everyone, literally everyone, is at risk.”\n\nIn her social media post, the actor, who has decided to quit acting to pursue her entrepreneurial dreams, added, “While we appreciate all the concern and speed recovery wishes, I’d implore everyone reading this to please keep those who are really debilitated in your thoughts and prayer. We will be fine, while so many others may not be. Let’s all hold a space for THEIR recovery, as well as those who are indirectly impacted. So much love from us.”\n\nOn the work front, Aashka now plans to focus on her make-up brand that she started a few years ago. She told indianexpress.com, “This is something that I have always wanted to do. Pursuing an entrepreneurship and working on my cosmetic business has been a passion, and it requires a level of commitment. I knew it all along and it happened the way it would, and so it wasn’t a surprising or shocking time for me.”"}, {"Article Image": "https://images.indianexpress.com/2021/04/gangster-kangana-ranaut-1200.jpg", "Article's Title": "Kangana Ranaut on 15 years of her debut Gangster: ‘Every step was a battle starting with my own father, grandfather’", "Article's Text": "It’s been 15 years Kangana Ranaut made her Bollywood debut playing Simran in Anurag Basu directorial Gangster. Four National Awards later, Kangana has many memorable roles to her credit today. Recalling how she carved her path in films, Kangana tweeted on Wednesday, while also comparing her journey with another ‘success story’, Shah Rukh Khan.\n\nKangana pointed out that while she was a village girl from Himachal Pradesh who did not know English, SRK was a privileged newcomer. In her first tweet, Kangana wrote, “15 years ago Gangster released today, Shahrukh Khan ji and mine are the biggest success stories ever but SRK was from Delhi, convent educated and his parents were involved in films, I did not know a single word of English, no education, came from a remote village of HP.”\n\nEvery step was a battle starting with my own father and grandfather, who made my life miserable, and yet 15 years later after so much success still every day is a fight for survival but totally worth it, thank you everyone 🙏 #15yearsofgangster — Kangana Ranaut (@KanganaTeam) April 28, 2021\n\nThe actor added in a second tweet that her life continues to be a constant ‘fight for survival’. “Every step was a battle starting with my own father and grandfather, who made my life miserable, and yet 15 years later after so much success still every day is a fight for survival but totally worth it, thank you everyone 🙏 #15yearsofgangster,” she tweeted.\n\nKangana Ranaut starred opposite Emraan Hashmi and Shiney Ahuja in the romantic thriller Gangster (2006), which was produced by Mahesh Bhatt. Kangana played a bar dancer who falls in love with a gangster, only to be become a loner due to a personal crisis.\n\nGangster got Kangana several awards for Best Female Debut that year. Pritam scored its music which is still loved by many.\n\nKangana is currently awaiting the release of her much anticipated biopic on J Jayalalithaa, Thalaivi. The film’s theatrical release got postponed this month due to a surge in the coronavirus cases."}, {"Article Image": "https://images.indianexpress.com/2021/04/Michael-B-Jordan-ap-1200by667.jpeg", "Article's Title": "Michael B Jordan on protest, power and Without Remorse", "Article's Text": "Michael B Jordan’s power on screen has taken many forms. His heavyweight force in Creed. His capacity to inspire change as Bryan Stevenson in Just Mercy. His raw fury in Black Panther.\n\nBut Jordan’s potency reaches new, muscular heights in Without Remorse a Tom Clancy adaptation that recasts Jordan as a globe-trotting action star. The film (which debuts Friday on Amazon Prime Video) is an updated origin story of Navy SEAL John Clark, Clancy’s best-known character outside of Jack Ryan. Jordan is hoping it spawns a franchise.\n\nThe project has been around Hollywood for decades; Keanu Reeves and Tom Hardy are among those who have previously flirted with it. But Jordan saw the possibility to not only do a big-budget action thriller and perform a lot of his own stunts, but to retailor the film to today. He’s a producer on the film via his company, Outlier Society Productions, a leading force in making Hollywood more inclusive.\n\nJordan spent much of the past year quarantined with his family and friends, a time he says has that has been reflective.\n\n“The last few years I’ve been blessed to have a kind of non-stop career,” says Jordan, speaking by phone from Los Angeles. “I kind of had a moment to look at myself and family, spend time with my nephew — things that I probably wouldn’t have had as much time to do if I was running from one production to another.”\n\nBut after the pandemic put a slight pause on one of the movies’ biggest stars, Jordan is eager to embark on a new chapter. He recently filmed Denzel Washington’s A Journal for Jordan. He’s prepping his directorial debut with Creed III.\n\nThe 34-year-old spoke with The Associated Press the day after the verdict in the Derek Chauvin trial. Remarks have been edited for brevity and clarity.\n\nLast summer at protests following the death of George Floyd, you challenged Hollywood to commit to Black hiring. Have you seen any progress?\n\nFrom the projects that I’ve been involved with, I’ve seen a response to that. I’m not in the weeds with every production across Hollywood but I think there was a significant or meaningful response from the industry on certain levels to be held accountable. But there’s a lot of work to be done. We’re not content with things we have or things that we see at the moment.\n\nHas anything about the past year changed your priorities?\n\nI went through a rollercoaster of emotions. The pandemic, the protests, this steady increase of police brutality and murders — it’s been tough, man. You have a moment where things went our way yesterday and then hours later, you have another one. This past year has seen so much of that. Recharging my batteries was something that I didn’t know I needed as much as I did. After taking that break, I feel more energized and prepared for the work to come — and that’s in all areas. When it comes to being present for my community, my culture, for my business; in front of the camera, behind the camera; in the streets, in my home. It’s given me an opportunity to be a better version of myself moving forward. I’m motivated. I’m recharged. I’m ready for all tasks at hand.\n\nIn Fruitvale Station, playing Oscar Grant, you acted out a version of a scene that keeps replaying.\n\nWhen you’re Black and brown, it’s something that can become a reality any day. Yeah, I had an opportunity to shine a light on a story, on a young man who had his life taken away from him by the hands of law enforcement. When we shot that movie, I guess it wasn’t being seen as much as it is right now. The volume of what’s been reported has increased, it’s more a part of the popular conversation. But it’s a lot. I think solidarity amongst our community and culture is at the highest point that I’ve experienced. It’s driving us closer together. And people unified is a powerful thing.\n\nDo you ever find it difficult to balance any responsibility you feel and your own interests? Do you sometimes just want to make a movie without worrying about larger issues?\n\nI just made one! Without Remorse and Journal for Jordan. I like all types of movies. From action thrillers to movies with a purpose. I got Creed coming up. I’ve been blessed to have a healthy balance. It allows me to have that comfortable balance between entertainment and activism. That’s life, right? Trying to find a balance. You have moments in your life where you’ve got to do things for yourself, you’ve got to do things that feed your soul. And you’ve got to do things that feed your community, so you know the person looking at you in the morning in the mirror. If you can find a way to balance all those things and be successful and leave an impact — and leave the world a better place. I think making people think is the power of cinema.\n\n\n\nWithout Remorse had been in development hell for years. What drew you to it?\n\nI’m a gamer. I love playing videogames. I grew up playing (Tom Clancy adaptations) Rainbow Six and Ghost Recon before I even got introduced to the films. Man, I got an opportunity to play a character I used to envision myself playing, that I spent hours upon hours (laughs) in my room playing. Being able to step into the Tom Clancy universe and do an action movie where I do my own stunts. I was a kid in the candy store.\n\nYou’ve talked about injecting yourself into a role like a Trojan horse. Was there anything especially that you wanted to bring to Without Remorse?\n\nIt was a great collaboration between the studio, the producers, the director to create an origin story. It was cool to see a character that just is. There’s no extra “This character is Black because of this and that.” It’s a movie about a guy, know what I mean?\n\n\n\nLike another upcoming film of yours, a new Thomas Crown Affair, your character wasn’t originally written as Black and had previously been played by white actors (Willem Dafoe and Liev Schreiber). Do you give any significance to that?\n\nThere’s a business behind this, as well. A lot of people don’t understand the nuances of how movies get made — what (intellectual property) is at what studio, what IP is available, the value of a reboot versus doing something without that title. There’s a lot of different factors to consider when you remake a movie or you do a movie. People would be surprised that race is very low on the totem pole when it comes to making some of those decisions. A lot of people speculate on these movie choices but what I pay attention to is: I really like the movie. The character’s interesting. It’s entertaining and I’m going to have fun making it. And representation is important. Somebody like myself playing a character like that in a world like that is also very progressive and entertaining. It’s a nuanced decision to develop movies like that. Sometimes it’s not that simple. Other times, it’s not that complicated, either."}, {"Article Image": "https://images.indianexpress.com/2021/04/First-of-many-matasha-rastogi-monsoon-wedding-1200.jpg", "Article's Title": "First of Many: Natasha Rastogi revisits Monsoon Wedding", "Article's Text": "Natasha Rastogi might have taken up acting late in her life, but she’s managed to be a part of some noteworthy projects. She says her journey from the stage to films taught her a lot, and a boom in the digital space has turned out to be a blessing for artistes like her.\n\nNatasha recently played mother to Sanya Mahotra in Netflix release Pagglait. Natasha’s body of work also boasts of movies like Khosla Ka Ghosla, Do Dooni Chaar, My Name Is Khan, Ishaqzaade, Amit Sahni Ki List, Talvar, Naam Shabana, Behen Hogi Teri and others. She has been a part of Raat Akeli Hai and Bandish Bandits too.\n\nThough Natasha started with a small role in Monsoon Wedding (2001), she says it was the experience that she holds close to her heart. Here’s what she shared about the first time she faced camera professionally.\n\nWhat was your first acting project? How did the project come to you?\n\nI was a dramatics teacher in Modern School and was doing theatre as well. My close friend Shubha Mudgal told me that Mira Nair is auditioning for her film. I auditioned for a scene where a sangeet ceremony is happening and I have a telephonic conversation. Another scene was where I get down from a car with Neha Dubey who played my daughter, and I tell Naseeruddin Shah, “We’ve got you real scotch. Thank you for taking care of my little Alia.”\n\nI got a call if I had a video recording or pictures of my work. I had none because I hadn’t started acting professionally then. But still I landed the role in Monsoon Wedding. It was shot in 2000, got released in 2001. I was 39 then. I started very late in life.\n\nNatasah Rastogi with co-actor Rahul Vohra in a still from Monsoon Wedding (2001). Natasah Rastogi with co-actor Rahul Vohra in a still from Monsoon Wedding (2001).\n\nWhat do you remember of your first day on set?\n\nSince the film revolved around a wedding, almost all the actors were on set. My first day of shoot was the same that I auditioned for. Its location was in Delhi, at Chattarpur farms or Bijwasan I guess. I shot for 25 days and the film was wrapped up in 30-35 days. That was the time when films took 8 months to complete. So Mira Nair shooting an entire film in such a short time, was another big news back then.\n\nThe first scene I shot for was where Rajat Kapoor takes my daughter for an ice-cream. Shefali Shah comes and asks him where he was taking her. She tells him to get off the car because he had abused Shefali when she was a kid. Rajat Kapoor plays the uncle in it. After Shefali, I enter the scene and hold my daughter close. Mira thought there isn’t a need for two people doing the scene, so my part got slashed.\n\nWhen I went for dubbing, Mira apologised and told me that she had to edit out my one major scene. That’s the first time I got to know that your scene can get chopped off too. Now I feel like I was more like a flower vase in the film.\n\nWere you nervous? How many retakes did you take?\n\nI believe an actor should memorise the lines first, only then you can play with the scene. When you do theatre, you need to perform for even the person sitting in the last row. On camera, you need to hold back. There was no nervousness as such. But it was definitely a learning experience, as compared to theatre. I had small scenes and the film did very well. And then casting people in the circuit started looking at me.\n\nHow was the rapport with your co-stars when you got to meet or work with them again later?\n\nIt was so much fun. I felt the film was a live wedding. We used to shoot the entire night. There was Soni Razdan, Lillete Dubey, we used to sit and chit chat. It was like a family. I used to wonder if they’ll shoot the film or we’ll just keep having fun. So you can say, the entire film was made just like that.\n\nAlso Read | First of Many: Gajraj Rao | Vivek Oberoi | Mohammed Zeeshan Ayyub | Rajpal Yadav | Rajeev Khandelwal | Govind Namdev | Neena Gupta | Pankaj Tripathi | Satish Kaushik | Mohit Raina | Shahid Kapoor | Anang Desai | Jimmy Sheirgill | Tabu | Harsh Chhaya | Gaurav Gera | Saurabh Shukla | Deepak Dobriyal | Seema Pahwa | Annup Sonii | Sayantani Ghosh | Annu Kapoor | Ajay Devgn | Vishal Malhotra | Rahul Khanna | Ashutosh Rana | Jaaved Jaaferi | Ashwath Bhatt | Varun Badola | Renuka Shahane | Taapsee Pannu | Manoj Bajpayee | Milind Soman | Rajkummar Rao | Akhilendra Mishra | Rohit Roy | Suchitra Pillai | Gulshan Grover | Abhay Deol | Ashwini Kalsekar | Adil Hussain | Shweta Tiwari | Purab Kohli | Mita Vasisht | Vipin Sharma | Divya Dutta | Jaideep Ahlawat | Archana Puran Singh | Daya Shankar Pandey | Hina Khan | Rajesh Tailang | Urvashi Dholakia | Manish Chaudhari | Sheeba Chadha | Karanvir Bohra | Bhairavi Raichura | Pratik Gandhi | Konkona Sen Sharma | Gurmeet Choudhary | Lakshmi Manchu | Zakir Hussain | Nimrat Kaur | Hiten Tejwani | Ayesha Raza Mishra | Ali Fazal | Riya Sen | Rakesh Bedi | Samir Kochhar | Shekhar Suman | Piyush Mishra | Neelu Vaghela | Sumeet Vyas | Ayub Khan | Cyrus Sahukar | Vindu Dara Singh | Karan Singh Grover | Amrita Puri | Arjun Mathur\n\nIf given a chance to go back to your debut role, what would you like to change or do better?\n\nNot really, it was all script based. And since it was a small role, today I’ll want it to be longer, with some good scenes. But, that was my first journey towards Bollywood and facing the camera. It was a pleasure working with Mira Nair.\n\nOne film or role that inspired you to become an actor?\n\nI loved Sahib Bibi Aur Ghulam. I wish somebody could cast me for Meena Kumari’s part. I think she was brilliant. Nobody can do what she did. I also loved The Great Indian Kitchen which I saw recently."}, {"Article Image": "https://images.indianexpress.com/2021/04/babbar1200.jpg", "Article's Title": "Prateik Babbar inks mother Smita Patil’s name on chest, writes ‘Smita forever.’ See post", "Article's Text": "Actor Prateik Babbar recently took to Instagram to reveal that he has gotten his mother’s name, Smita, tattooed on his chest. Smita Patil had soon died after giving birth to the actor.\n\nThe said tattoo simply reads ‘Smita’ along with the infinity symbol. Prateik captioned the heartfelt post, “Inked my mother’s name on my heart.. ❤️ smita #4ever ❤️ 1955 – ♾ (sic).” The post almost immediately received a lot of positive feedback, with the likes of Mrunal Thakur, Anup Soni, Ritu Phogat commenting with multiple heart emojis on it.\n\nView this post on Instagram A post shared by prateik babbar (@_prat)\n\nLast year, on Smita Patil’s death anniversary, Prateik had paid a heartwarming tribute to his National Award-winning mother. “34 years ago today my mother left us.. over the years.. iv tried to imagine & create the perfect image of her.. in my mind & heart.. we’ve arrived at a very special place.. a very precious place.. now.. she’s the perfect mother.. the perfect woman.. the perfect role model.. the apple of every little boys eye.. that perfect mother every little boy idolises.. & wants to grow up to be like.. the one that will never leave your side.. & stay with you.. #4ever.. till the end of time..” read a part of the caption.\n\nOn the work front, Prateik was last seen in the mafia movie Mumbai Saga, which also starred Emraan Hashmi and John Abraham. The actor is known for featuring in films like Jaane Tu Ya Jaane Na, Dum Maaro Dum, Ekk Deewana Tha among more."}, {"Article Image": "https://images.indianexpress.com/2021/04/khan1200x.jpg", "Article's Title": "When Irrfan Khan spoke about the two actors who gave direction to his career", "Article's Text": "It has been a year since we lost the supremely talented and versatile actor Irrfan Khan. And while the celluloid and his fans will always miss him, the artiste continues to inspire a great deal of love and respect even today with his performances and journey. In a video of over four years ago, Irrfan Khan and Naseeruddin Shah are seen interacting and sharing ideas, thoughts about cinema and the entertainment industry in general. The duo were speaking at an India Today conclave.\n\nBoth Irrfan and Naseeruddin couldn’t help showering praises at each other. Irrfan shared that it was actors like Naseeruddin and Dilip Kumar that had stirred his passion for the performing arts.\n\n“I was looking for something that could give me a direction. His (Naseer’s) performances, Dilip Saheb’s performance gave me the direction that life is a subject, that it is possible to get work by reflecting life. When I came to Mumbai, parallel cinema was taking its last breath, and then it was all (about the) frontbenchers… Akshay Kumar, Suniel Shetty’s ‘daur’ started,” said Irrfan. Irrfan and Naseeruddin had shared screen space in the Vishal Bhardwaj movie Maqbool.\n\nMeanwhile, Naseeruddin Shah had remembered Irrfan in a touching article he had written for The Indian Express. Likening Irrfan to Mozart, Naseeruddin had penned, “When I used to watch him act, I used to think of Mozart and (Antonio) Salieri. Salieri used to tell God ‘Why am I the patron saint of mediocrity? Is this fellow’s random scribbling superior to my hours and hours of labour in composing music?’ I must say that when I watched Irrfan, that’s how I used to feel. I wished that when I was his age, I had been that good. I really admired him in an unqualified manner. I don’t think there is another actor I admired as much as I admired Irrfan.”\n\nAlso Read | When Irrfan Khan said wife Sutapa had a better understanding of a performance\n\nThe late star also spoke briefly about his stint on television during the India Today conclave, and how he felt that ‘his time’ would never come; “I came here to do cinema, but I was consumed by television and tv was boring. I used to hear things like Subhash Ghai is talking about me — ‘Ye ladka kaun hai?’ (who is this guy?), and I used to wait thinking a call would come but it never happened.”\n\nAnd it might seem unlikely to many, but Irrfan actually thought at one point that his face resembled Mithun Chakraborty’s. The latter has been primarily associated with ‘masala’ movies Irrfan had consciously stayed away from.\n\n“‘I used to wonder mera face kisi se milta hai kya, arey ha Mithun se milta hai to ban jaunga main actor (I used to wonder whether my face resembled anyone, and I thought that it looked similar to Mithun’s so that propelled my thought further of becoming an actor). I also used to imitate Mrigayaa’s dialogue. In Mrigayaa, Mithun was not playing a chocolate boy, he was a Naxalite…I used to make my hair straight in order to look like him,” stated Irrfan as he laughed recounting this little anecdote.\n\nTo think that someone of Irrfan’s talent had self-doubt about his capabilities as a professional like the rest of us is an inspiring and humbling reminder of what a human being can achieve. Irrfan Khan breathed his last in Mumbai on April 29, 2020. The actor was last seen in the Homi Adajania directorial Angrezi Medium."}, {"Article Image": "https://images.indianexpress.com/2021/04/anupam1200.jpg", "Article's Title": "Anupam Kher gives update about wife Kirron Kher’s health as she battles multiple myeloma: ‘She is better but medicines have many side effects’", "Article's Text": "Anupam Kher has given an update about the health of wife, actor and politician Kirron Kher, as she battles multiple myeloma, a type of blood cancer. The actor was speaking to his fans via an Instagram live session and said in answer to a question, “Kirron is improving. She is better but the medicines of multiple myeloma have many side effects. She is in good spirits and hopefully she will come out of it. If your prayers are with her, everything will be fine.”\n\nAnupam had revealed earlier this month that Kirron was being treated for the disease. “Just so that rumours don’t get the better of a situation Sikandar and I would like to inform everyone that Kirron has been diagnosed with multiple myeloma, a type of blood cancer. She is currently undergoing treatment and we are sure she will come out of this stronger than before. We are very blessed that she is being looked after by a phenomenal set of doctors. She’s always been a fighter and takes things head on,” he had written at the time.\n\nAnupam also shared another Instagram post lauding his wife on Wednesday. The actor shared a photo of the letter sent by Kirron to Deputy Commissioner of Chandigarh administration in which the former has asked for allocating Rs 1 crore to the Post Graduate Institute of Medical Education and Research (PGIMER) so that they can buy ventilators.\n\nView this post on Instagram A post shared by Anupam Kher (@anupampkher)\n\n“Dearest @kirronkhermp ! In this hour of need your allocation of Rs. One Crore from MPLADS to the PGI Chandigarh towards the immediate purchase of ventilators for COVID-19 patients will really help. It is a noble gesture especially when you yourself are going through treatment. I am proud of you! May you be fully healthy very soon. 🙏🌺🙏 #Prayers #HelpTheNeedy #Chandigarh (sic),” read Anupam Kher’s full caption.\n\nWhile many in the comments section praised Kirron Kher for this move, one user seemed upset by the post and wrote in response, “Please note that this is not a donation of any kind. Please don’t make it sound like she has done something extraordinary. This is an allocation of budget and it’s her duty to do this. Only if your government had acted in a timely manner earlier, we would have never reached this stage.”"}, {"Article Image": "https://images.indianexpress.com/2021/04/avengers-infinity-anniversary-1200.jpg", "Article's Title": "When Robert Downey Jr surprised Tom Holland on Thanos’ home planet: Russo Brothers share Avengers Infinity War BTS", "Article's Text": "For Marvel fans across the world, the week is turning out to be a nostalgic trip to the studio’s tentpole films — Avengers: Infinity War and Avenger: Endgame. Days after social media got flooded with posts celebrating two years of Endgame, the director duo of the two-part climactic magnum opus, Anthony and Joe Russo, have again shared something from behind-the-scenes of Infinity War, that also marks its third anniversary this week.\n\nThe Russo Brothers took to their Instagram handle on Tuesday and posted some on-set clicks and BTS videos from the filming of Avengers: Infinity War. In one of the videos, the cast and crew including Robert Downey Jr is seen wishing actor Tom Holland aka Spider-Man on his birthday, on what appears to be the set of the Titan in the film.\n\nView this post on Instagram A post shared by The Russo Brothers (@therussobrothers)\n\nThe other three posts showed how the makers created the fight scene outside Doctor Strange’s Sanctum Sanctorum in New York City. Actors Robert Downey Jr, Benedict Cumberbatch, Mark Ruffalo and Benedict Wong also appear in a video. In their caption, the directors wrote, “3 years since the release of Infinity War… Tom’s birthday present was getting dusted…”\n\nRobert Downey Jr, Benedict Cumberbatch, Mark Ruffalo and Benedict Wong in a still from the New York sequence of Avengers: Infinity War. (Photo: Marvel) Robert Downey Jr, Benedict Cumberbatch, Mark Ruffalo and Benedict Wong in a still from the New York sequence of Avengers: Infinity War. (Photo: Marvel)\n\nThis comes two days after the Russo Brothers, along with Downey Jr and Ruffalo shared posts on social media, wishing fans on the second anniversary of Avenger: Endgame. Downey Jr put out a deleted scene, one of the various versions of the final Iron Man snap which he shot for the final movie.\n\nOne the other hand Ruffalo wished fans with the “I love you all 3000” dialogue, while Russos gave a sneak peek into some more BTS stuff from the film’s shooting.\n\nAvengers: Infinity War (2018) is the first installment of the two-film finale of Marvel’s Infinity Saga. The movie was a build-up to Thanos collecting all the Infinity Stones, his snap and half of our superheroes turning to dust. It was a prelude to the ultimate battle we saw in the second outing — Avengers: Endgame (2019)."}, {"Article Image": "https://images.indianexpress.com/2021/04/Prabhas-1200-1.jpg", "Article's Title": "Baahubali The Conclusion turns 4: How SS Rajamouli gave us a memorable hero in Prabhas’ Amarendra Baahubali", "Article's Text": "Baahubali: The Conclusion released on this day four years ago and an entire nation went to the cinemas to find out why Kattappa killed Baahubali. The two-film franchise not only delivered India’s biggest box office success, it also changed the way we look at the monolith that we call ‘Indian cinema’. An audiences brought up on a staple diet of Hindi films rarely stepped out to watch Tamil or Telugu films in theatres across back then. There were successes that were not originally Hindi films, but they were just that — exceptions.\n\nBaahubali, two dubbed Telugu films, changed all that. A pan-India hit that was epic in proportions remains the highest grossing Hindi film till date. It also had an impact the way Indian filmmakers made their films — from frames to larger-than-life vision. Many even tried to recreate the success of SS Rajamouli film but in vain.\n\nAs the film turns four, we look back at the film which gave us memorable moments, stars in Prabhas, Rana Daggubatti, Ramya and Anushka Shetty and more pop influences then we can count. Now, who doesn’t remember when Ramya Krishna as Sivagami Devi introduced baby Mahendra Baahubali as the next king of Mahishmati?\n\nWhile Rajamouli mounted the film at an epic scale with grandeur to spare, he also put a human story at the heart of it which was relatable. What inspires Prabhas’ Mahendra and Amarendra or Rana Daggubati’s Bhallaladeva is as old as our myths and stories Indians have heard when they were children. To add to it, SS Rajamouli gave us strong women characters who came in all shades. If Sivagami was a mix of a mother’s blind faith and the indomitable will of a fearless queen, Anushka Shetty’s Devasena was the epitome of strength and valour.\n\nView this post on Instagram A post shared by Baahubali (@baahubalimovie)\n\nView this post on Instagram A post shared by Baahubali (@baahubalimovie)\n\nBut like millions out there, I fell in love with the character of Amarendra Baahubali, whose story of greatness takes over the screen in Baahubali The Conclusion. From the very first frame of the film when he makes his entry as Amarendra Baahubali with “Saaho” song on the vocals of Daler Mehendi, Prabhas wins over our hearts. He exudes respect for people, especially for women, which makes a connect with us.\n\nIn the scene where he speaks against his mother Sivagami for trying to get Devasena married to Bhallaladeva, Prabhas’ Amarendra Baahubali had set an example about how it is important to be true to your dharma. He doesn’t disrespect his mother but chooses to side with what’s right. Does this mean he valued Sivagami any less? Of course, not. He, without a question, lets go of the right to be Mahishmati’s king. And even leaves the kingdom on Sivagami’s command. He was the perfect son, a perfect friend and a supportive brother.\n\nView this post on Instagram A post shared by Baahubali (@baahubalimovie)\n\nView this post on Instagram A post shared by Baahubali (@baahubalimovie)\n\nBut even after he loses everything, he lives a life of a king as he finds love, respect and his honour in the people of his kingdom. The scene where Amarendra Baahubali beheads Sethupathi for inappropriate behavior with women found connect with the audience. Even after the release of the film, the clip of this particular scene did the rounds on the social media.\n\nView this post on Instagram A post shared by Baahubali (@baahubalimovie)\n\nYes, Amarendra is too good to be true/real but Rajamouli makes you believe in him. You hope he exists. You hope to find his goodness in people around you. That is the magic of cinema."}, {"Article Image": "https://images.indianexpress.com/2021/04/sugandha-mishra-sanket-bhosale-wedding-1.jpg", "Article's Title": "Inside Sugandha Mishra-Sanket Bhosale wedding: The Kapil Sharma Show actor tells husband, ‘your life, my rules’. See photo", "Article's Text": "Actors Sugandha Mishra and Sanket Bhosale tied the knot on Monday. Following all safety protocols, the wedding, which happened in Jalandhar, was attended only by family and very close friends.\n\nSharing the first photo from the wedding, The Kapil Sharma Show actors added their own witty twist to the caption. While Sugandha made it clear who will wear the pants in this marriage, Sanket was happy about his wife’s name getting longer. “Aur isee ke sath … @drrrsanket “Your Life ,My Rules” 😉❤️❤️,” she wrote. Sanket on his part posted, “Aur isee ke sath Teen naam Poore ho gaey ! “Sugandha Mishra Bhosale” 😉❤️❤️❤️🕺💃.”\n\nThe newly weds looked resplendent in their pastel shade outfits. Ditching the usual red, the bride opted for an off white embroidery lehenga, pairing it up with a baby pink dupatta, while Sanket complemented her in a sea-green sherwani.\n\nView this post on Instagram A post shared by 𝐒𝐔𝐆𝐀𝐍𝐃𝐇𝐀 𝐌𝐈𝐒𝐇𝐑𝐀 (@sugandhamishra23)\n\nTheir friends may have missed seeing them become man and wife in person but they were quick to send in their wishes for the newly weds. Gauahar Khan wrote, “👏👏👏👏 yay congratulations god bless ♥️,” while Neha Kakkar posted, “Awwwww.. 😍😍 Congratulations You two!! ♥️🤗😇.” Harshdeep Kaur while congratulating the couple mentioned how they were ‘Made for each other!!’. Others like Bidita Bag, Ridhima Pandit, Abhishek Bajaj, Hiten Tejwani, Hussain Kuwajerwala also wished them on their posts.\n\nEarlier, Sugandha Mishra and Sanket Bhosale also shared photos from their pre-wedding festivities. The mehendi ceremony kickstarted the celebration, and Sugandha was seen flaunting her henna-adorned hands for pictures. Sanket also shared a video of them interacting virtually over a video call. In the same, he was seen blowing kisses at her and even showed his palm, which too had a mehendi design.\n\nThe couple also had an engagement ceremony, where they sported matching yellow and pink outfits, and happily posted with their rings.\n\nSee all photos of Sugandha and Sanket’s pre-wedding events:\n\nView this post on Instagram A post shared by Picberry by Gaurav Sethi (@picberry.in)\n\nView this post on Instagram A post shared by Picberry by Gaurav Sethi (@picberry.in)\n\nView this post on Instagram A post shared by 𝐒𝐔𝐆𝐀𝐍𝐃𝐇𝐀 𝐌𝐈𝐒𝐇𝐑𝐀 (@sugandhamishra23)\n\nView this post on Instagram A post shared by 𝐃𝐫.𝐒𝐚𝐧𝐤𝐞𝐭 𝐁𝐡𝐨𝐬𝐚𝐥𝐞 (@drrrsanket)\n\nView this post on Instagram A post shared by Picberry by Gaurav Sethi (@picberry.in)\n\nView this post on Instagram A post shared by Picberry by Gaurav Sethi (@picberry.in)\n\nWhile rumours of the two dating have been around for a long time, they made their relationship official a few days back. Sharing a loved-up photo with his lady love on Instagram, Sanket Bhosale wrote, “Found My Sunshine❤️😍,” while she shared how the countdown to their wedding on April 26 has begun.\n\nTalking about getting married amid the pandemic, Sugandha, in an earlier interview mentioned how she is shopping for her trousseau online. She also confessed that even when it’s going to be a close knit affair, she wanted to fulfil her dream of wearing a 10 kg lehenga at the wedding.\n\nThe actor-singer further shared how the guests would undergo Covid-19 tests before they attend the functions. “Sanket is very particular. He is going to arrange for a team who will do Rapid Antigen Test before the wedding. Most of the relatives have already taken vaccines and they will also go through RTPCR tests before attending the wedding so that no one is at risk. We are going to follow all the norms set by the government,” she told ETimes."}, {"Article Image": "https://images.indianexpress.com/2021/04/Samantha-Akkineni.jpg", "Article's Title": "Happy birthday Samantha Akkineni: Actor-entrepreneur-Instagram icon, this leading lady means business", "Article's Text": "Samantha Akkineni is not just a pretty face. The actor has different facets to herself. On her 34th birthday, we explore her growth as an actor, her influential social media presence and how, eventually, she has created a brand for herself, which complements her on-screen persona.\n\nUnconventional career choices\n\nWhen Samantha started off her career in 2010 with Ye Maaya Chesave, a Gautham Menon’s directorial, she instantly made a place in the audience’s heart as Jessie. If that was a stepping stone for her, Eega became a film that brought her under limelight. The SS Rajamouli-directorial was just the beginning. Later, her film A Aa amplified audience’s expectations from her. And maybe it is the pressure of the expectations that made her challenge herself and offer variety to her audience.\n\nHer films\n\nIn the past five years, we saw the actor experimenting and taking chances with her films. In 2017, Samantha delivered back-to-back hits with Raju Gari Gadhi 2 and Mersal. She continued the success in 2018 with blockbuster Rangasthalam, Mahanati and U Turn. U Turn, a multi-language thriller film, was perhaps her first thriller and a film that hinged completely on her. While a film being lead by a solo female actor is not new to South’s film industry, for Samantha success of U Turn proved that her popularity is her own and not dependent on a famous male icon. She again went against her image with Super Deluxe and Oh Baby! Her popularity is such that in Majili, when she made her entry in Chaitanya Akkineni’s film, people whistled and threw money, a treatment usually reserved for superstars like Rajinikanth, Vijay and others male A-listers.\n\nOTT debut\n\nIn 2020, Samantha took a leap of faith and made her debut on the OTT platform with a talk show titled Sam Jam. The show, streaming on Aha, was a hit. In fact, the episodes where she hosted Allu Arjun and Naga Chaitanya garnered immense love.\n\nBollywood debut via web series\n\nNot just OTT debut, in 2020, Samantha announced her Bollywood debut with the second season of the much-awaited The Family Man. In the series, which stars Manoj Bajpayee in the lead role, Samantha will be seen performing action, something she did not explore in films till now. “She spent a lot of time working out, chiseling her body and increasing her fitness. In a way, she was getting trained for martial arts,” Raj and DK had said on Samantha’s Sam and Jam show.\n\n“There were days when Nagarjuna used to punch on screen, and we used to think that’s how action should be done. And now, we feel the same about Samantha. So, Sam you are giving competition to the men out there,” they concluded.\n\nTelevision debut\n\nView this post on Instagram A post shared by Samantha Akkineni (@samantharuthprabhuoffl)\n\nSamantha showed off her hosting skills much before Sam Jam started streaming on the digital platform. She was seen filling in for her father-in-law and actor Nagarjuna Akkineni for a special episode of Bigg Boss. “Never thought I’d be on the Big Boss stage as host! Only because I was given this responsibility by my Mamagaru.. I could find the strength to overcome my fears … the fear that I had no experience hosting , the fear of Telugu .. I had never even watched an episode before 😊.. (ended up doing a marathon 3 days before the show) Thankyou mama for helping me overcome my fears and trusting me with this 😁. And I really need to thank all of you for all the love I received after the episode. I was jumping with joy,” she wrote on Instagram.\n\nA woman of voice\n\nThey say, with power comes responsibility, and Samantha sure understands that. The actor, who is at the peak of her career, has never failed to speak her mind on different occasions. For her, her social media platforms are not mere mediums to promote brands or films but also to address the on-going issues. Be it encouraging women to share their MeToo stories or to support co-actor in moments of distress, Samantha makes her point clear.\n\nOne such example is from the time when Indian film industry was shook with MeToo movement. Samantha tweeted in support of all the women who suffered abuse of any sorts. “I am so happy that more and more women are finding the strength to say # MeToo. Your bravery is commendable. I am sorry though that some people, even other women themselves will shame and burden you with the question of proof and doubt. Just know that you are saving many little girls with your voice. Thank you. I support the #MeTooIndia movement,” the actor tweeted.\n\nView this post on Instagram A post shared by Samantha Akkineni (@samantharuthprabhuoffl)\n\nRecently, Samantha also called out people who expect actors to have an opinion on everything. She titled the video as, “We’re entertainers, Not fact-checkers.”\n\nThe Family Woman\n\nSamantha married into Telugu film industry’s biggest family. She married Naga Chaitanya after dating him for a couple of years. Naga Chaitanya is Nagarjuna Akkineni’s son, who is legendary late actor Akkineni Nageshwara Rao’s son. Samantha married Chaitanya in 2017.\n\nView this post on Instagram A post shared by Samantha Akkineni (@samantharuthprabhuoffl)\n\nOn a show, Samantha called Chaitanya “perfect” and narrated how and when she fell in love with him. “He was very very helpful. I think that experience (of working on Ye Maaya Chesave) took me from being very naive, weak and not knowing to be capable, strong and understanding myself better. He was a part of the journey. That experience nobody else shared with me other than Chay, so he just had to be my husband. I fell in love with him there. That is when I decided I will marry him.\n\nHe knew I liked him. I became very dependant on him. So, it took eight years to come on the same space because I really liked him and he was not in that space. There were times when we wanted to work it out, but there were many factors. It took a long time for us to be in the same space.”\n\nOn the other hand, in another talk show, she said Nagarjuna “is the bible on how to live your life.”\n\nBut her life is not just about her husband and her in-laws. Hash, her paw-friend or child (as she calls it), is the most special being in her life, and her social media posts are proof. Here’s a look:\n\nView this post on Instagram A post shared by Samantha Akkineni (@samantharuthprabhuoffl)\n\nView this post on Instagram A post shared by Samantha Akkineni (@samantharuthprabhuoffl)\n\nView this post on Instagram A post shared by Samantha Akkineni (@samantharuthprabhuoffl)\n\nView this post on Instagram A post shared by Samantha Akkineni (@samantharuthprabhuoffl)\n\nBeyond films\n\nSamantha started Pratyusha Support foundation in 2012 to provide medical support for women and children with the help of three doctor friends. She provided the financial support for the programme. She has often involved herself in the philanthropy work. During the 2015 Chennai floods, Samantha was situated in Hyderabad for the shoot of a film, and helped mobilise the Mana Madras Kosam initiative organised by the Telugu film industry. Through the initiative, she participated in gathering relief materials at Ramanaidu Studios and appealed to the Telugu-speaking public to help gather resources to send to Chennai.\n\nView this post on Instagram A post shared by Samantha Akkineni (@samantharuthprabhuoffl)\n\nThe actor also has an online fashion brand and an educational initiative. Earlier this year, Samantha announced her association with Isha Foundation.\n\nView this post on Instagram A post shared by Samantha Akkineni (@samantharuthprabhuoffl)\n\nFitness freak\n\nView this post on Instagram A post shared by Samantha Akkineni (@samantharuthprabhuoffl)\n\nView this post on Instagram A post shared by Samantha Akkineni (@samantharuthprabhuoffl)\n\nView this post on Instagram A post shared by Samantha Akkineni (@samantharuthprabhuoffl)\n\nView this post on Instagram A post shared by Samantha Akkineni (@samantharuthprabhuoffl)\n\nAfter her films, family and philanthropic work comes Samantha’s dedication towards fitness. Not just her roles, we see her experimenting even in the aspect of fitness.\n\nFinally, on a concluding note, it wouldn’t be wrong to call Samantha an all-rounder. Here’s wishing the star a very happy birthday."}]