[{"Article Image": "https://ichef.bbci.co.uk/news/1024/branded_news/17A9A/production/_118222969_woman_mask_getty_976.png", "Article's Title": "Covid-19 in India: Cases, deaths and oxygen supply", "Article's Text": "To try to get supplies to where they are needed, the government has now started an \"oxygen express\", with trains carrying tankers to wherever there is demand. The Indian Air Force is also airlifting oxygen from military bases."}, {"Article Image": "https://ichef.bbci.co.uk/news/1024/branded_news/AFC0/production/_118229944_c1c64304-46ab-4a03-9020-19a66eeb54ab.jpg", "Article's Title": "Covid: One dose of vaccine halves transmission - study", "Article's Text": "He said the study was extra evidence that as many people as possible needed to be vaccinated, even if they are not at risk of developing severe symptoms, in order to get much higher levels of protection across the population and reduce the number of people who get severely ill and die from the disease."}, {"Article Image": "https://static.toiimg.com/thumb/msid-82280016,width-900,height-1200,imgsize-539219,resizemode-6.cms", "Article's Title": "Vijay Devarakonda's grooming evolution over the years", "Article's Text": "Ponytail perfection\n\nHe rocked a ponytail a while ago and we loved it because of the whole ruggedness he added to the look."}, {"Article Image": "https://ichef.bbci.co.uk/news/1024/branded_news/A05C/production/_118225014_gettyimages-1301956646.jpg", "Article's Title": "Covid vaccine: Sore arm and headache most common side effects", "Article's Text": "Confidence in the vaccines has continued to grow since the end of last year, with more than 80% saying they believe the vaccines are safe and effective, compared with about 70% who said the same towards the end of 2020, according to a survey of 5,000 people."}, {"Article Image": "https://ichef.bbci.co.uk/news/1024/branded_news/D703/production/_118234055_hi065198946.jpg", "Article's Title": "Covid: Three cases of Indian variant found in Leicester", "Article's Text": "\"Our advice to everyone remains the same. The best way to stop the spread of the virus is to keep washing or sanitising your hands, wear a face covering in public places, stay apart from those you don't live with, and abide by the restrictions in place.\""}, {"Article Image": "https://ichef.bbci.co.uk/news/1024/branded_news/A5D3/production/_118015424_indiavax1.jpg", "Article's Title": "India coronavirus: Can it make enough vaccines to meet demand?", "Article's Text": "\"Even when [global] demand is very high, new suppliers can't spring up as quickly as they would in some other industries, or at least those new suppliers would not be trusted.\""}, {"Article Image": "https://static.toiimg.com/thumb/msid-82260053,width-900,height-1200,imgsize-1396175,resizemode-6.cms", "Article's Title": "Zodiac signs who make the best husbands", "Article's Text": "Why zodiac signs?\n\nThese are the best way to analyse one’s personality and traits based on all the twelve signs, giving you a clear and concise evaluation of yourself."}, {"Article Image": "https://static.toiimg.com/thumb/msid-82275305,width-900,height-1200,imgsize-109369,resizemode-6.cms", "Article's Title": "COVID-19 symptoms in the first wave vs. second wave", "Article's Text": "COVID symptoms in the second wave\n\nApart from the classic symptoms of COVID-19, the second wave has brought along some new symptoms that are more severe."}, {"Article Image": "https://ichef.bbci.co.uk/news/1024/branded_news/B7CB/production/_118215074_doreen.jpg", "Article's Title": "Miscarriage rates over 40% higher in black women, study suggests", "Article's Text": "Most of the research was carried out in Sweden, Finland and Denmark, some of the few countries that gather statistics, though data from the US, UK, Canada and Norway was also used."}, {"Article Image": "https://static01.nyt.com/images/2021/04/25/us/25virus-briefing-summercamp-cdc1/25virus-briefing-summercamp-cdc1-facebookJumbo.jpg", "Article's Title": "Summer camp advice — keep masks and distancing — gets an update from the C.D.C.", "Article's Text": "Children going to camp this summer can be within three feet of peers in the same-group settings, but they must wear masks at all times, federal health officials say. The only times children should remove their masks is when they are swimming, napping, eating or drinking; they should be spaced far apart for these activities, positioned head to toe for naps and seated at least six feet apart for meals, snacks and water breaks.\n\nThe Centers for Disease Control and Prevention issued the anticipated updated guidance for summer camp operators this weekend, just weeks before many camps resume operations in mid-May. Many parents have been eager to find camps for their children, who had spent months indoors in remote learning classes during the pandemic.\n\nA theme that runs throughout the updated guidance is the emphasis on conducting as many activities as possible outdoors, where the risk of infection in considered much lower than indoors. When activities must be brought indoors, spaces should be well-ventilated and windows should be kept open (windows should also be open on camp buses and vans), the C.D.C. said.\n\nThe guidance urges children not to share toys, books or games. Each camper should have a labeled cubby for their belongings, and nap mats should be assigned to individual children, and sanitized before and after use."}, {"Article Image": "https://static01.nyt.com/images/2021/04/28/multimedia/28sp-hc-social1/28sp-hc-social1-facebookJumbo.jpg", "Article's Title": "Doctors Harness the Power of Human Connections", "Article's Text": "This article is part of our new series on the Future of Health Care, which examines changes in the medical field.\n\nLess than five years ago, Mary Albrecht was a professor of marketing at Maryville University in St. Louis. She gave lectures and led classroom discussions; she advised students; she interacted with her faculty colleagues. In 2017, Ms. Albrecht learned she had Alzheimer’s disease, and she retired that same year — losing a network of students, colleagues and friends that had nourished her for 31 years.\n\nAs her Alzheimer’s advanced, Ms. Albrecht found herself — despite the best efforts of her husband, Jack, and their children — increasingly isolated. Then in 2019 a social worker told Mr. Albrecht about a cognitive stimulation therapy group at Saint Louis University’s Aging and Memory Clinic. The group follows a treatment protocol designed to help engage patients with moderate-to-severe levels of Alzheimer’s and Lewy Body dementia. Ms. Albrecht, 70, who lives with her husband in the St. Louis suburb of Chesterfield, Mo., has now been taking part in the weekly sessions with around eight other dementia patients for about a year and a half.\n\nMs. Albrecht is one of 144 participants in the clinic’s 12 groups, which are funded by a research grant so there is no cost to the patients. During the hourlong group sessions, at first in person but now remote during the pandemic, Ms. Albrecht and the other patients listen to music and participate in group discussions led by a moderator. These discussions vary depending on the level of impairment and include topics such as what animals patients like at the zoo and what movies they’ve seen. The goal is to improve various aspects of cognition and memory in a stimulating, positive social environment where patients engage with one another."}, {"Article Image": "https://static01.nyt.com/images/2021/04/27/us/27virus-briefing-cdc-list2/27virus-briefing-cdc-list2-facebookJumbo.jpg", "Article's Title": "When do we have to wear a mask outside? The C.D.C. says less often, and here’s how and why.", "Article's Text": "The new guidance on mask-wearing from the Centers for Disease Control and Prevention on Tuesday says that masks can be shed for some relatively safe outdoor activities, especially by fully vaccinated people, because the virus does not spread readily outdoors.\n\nBut there are many circumstances where the new guidance still calls for masks to be worn outdoors, especially by unvaccinated people.\n\nHere are some examples from the C.D.C.’s new guidance:\n\nEveryone can do without a mask when …\n\nWalking, running, hiking or biking outdoors, alone or with members of the same household.\n\nAttending a small outdoor gathering with fully vaccinated family and friends.\n\nFully vaccinated people can do without a mask when …\n\nAttending a small outdoor gathering with a mixture of fully vaccinated and unvaccinated people.\n\nDining outdoors at a restaurant with people from several households.\n\nFor these kinds of activities, unvaccinated people should still wear masks and maintain social distance, the C.D.C. says."}, {"Article Image": "https://static01.nyt.com/images/2021/04/28/well/28sci-physed-parents/28sci-physed-parents-facebookJumbo.jpg", "Article's Title": "Parents’ Diet and Exercise Habits, Even Before Birth, May Contribute to Child’s Well-Being", "Article's Text": "The lifestyles of soon-to-be mothers and fathers could shape the health of their unborn offspring in lasting ways, according to a surprising new animal study of exercise, diet, genetics and parenthood.\n\nThe study found that rodent parents-to-be that fatten on a greasy diet before mating produce offspring with sky-high later risks for metabolic problems. But if the mothers stay active during their pregnancies, those risks disappear.\n\nThe study involved mice, not people, but does suggest that when a mother exercises during pregnancy, she may help protect her unborn children against the unhealthy effects of their father’s poor eating habits, as well as her own. The findings add to our growing understanding of the ways in which parents influence children’s long-term health, even before birth, and suggest how physical activity during pregnancy might help to ensure that those impacts are beneficial.\n\nResearchers have known for some time that parents, and especially mothers, begin influencing the health and behavior of their offspring well before conception. Studies involving both animals and people show that mothers with diabetes, obesity, insulin resistance or other metabolic problems before pregnancy tend to have babies with a predisposition to those same conditions as adults, even if the offspring follow healthy lifestyles. Mothers who are lean and physically active during pregnancy, meanwhile, tend to have children who, as adults, are active and metabolically healthy."}, {"Article Image": "https://static01.nyt.com/images/2021/04/27/us/politics/27dc-virus-masks1/27dc-virus-masks1-facebookJumbo.jpg", "Article's Title": "C.D.C. Eases Outdoor Mask Guidance for Vaccinated Americans", "Article's Text": "So far, about 43 percent of Americans have received at least one dose of a Covid-19 vaccine, and 29 percent have received both doses of the two vaccines requiring double shots. The United States is averaging around 55,000 new cases a day, a roughly 20 percent drop from two weeks ago, according to a New York Times database.\n\n“I know the quarantine and shutdowns throughout the pandemic have been exhausting,” Dr. Walensky said. “I know we all miss the things we used to do before the pandemic, and I know we all want to do the things we love and soon. Today is another day we can take a step back to normalcy of before.”\n\nHer remarks, and those of the president, got a welcome reception even from some of the Biden administration’s fiercest Republican critics in Congress, many of whom have complained that coronavirus restrictions were an intrusion on their personal freedoms.\n\n“It’s about time,” said Representative Jim Jordan, Republican of Ohio, who recently excoriated Dr. Anthony S. Fauci, the federal government’s top infectious disease specialist, at a hearing on Capitol Hill. “Now when do we get the rest of our liberties back?”\n\nSenator Ron Johnson, Republican of Wisconsin, who has spread fringe theories and given a platform to vaccine skeptics, called the guidance “long overdue.”\n\nSenator Ted Cruz, Republican of Texas, who quit wearing masks indoors after he was vaccinated, said he was “glad the C.D.C. finally acknowledged what has been obvious for a long time, which is that wearing a mask outside is silly and not remotely justified by the science.”\n\nIn fact, the science behind the C.D.C.’s new guidance is not comprehensive. A growing body of research indicates that the odds of the virus spreading outdoors are far lower than they are indoors, but that the risk is not zero and is hard to quantify."}, {"Article Image": "https://static01.nyt.com/images/2021/05/02/magazine/02mag-long-maurizio/02mag-long-maurizio-facebookJumbo.jpg", "Article's Title": "How Long Can We Live?", "Article's Text": "While a few scientists from the more pessimistic tradition applauded the study, many researchers sternly critiqued its methods, in particular the bold generalization based on what one commentary called a “limited, noisy set of data.” Nearly a dozen rebuttals appeared in Nature and other journals. James Vaupel, the founding director of the Max Planck Institute for Demographic Research and a staunch critic of the idea that the human life span has reached its limit, called the study a travesty and told the science journalist Hester van Santen that the authors “just shoveled the data into their computer like you’d shovel food into a cow.”\n\nRobine remembers the furor well. He was one of several peer reviewers whom Nature recruited to evaluate the study by Vijg and his co-authors before publication. The first draft did not satisfy Robine’s standards, because it focused only on the United States and relied on data he considered incomplete. Among other changes, he recommended using the more comprehensive International Database on Longevity, which he and Vaupel developed with colleagues. Van Santen reported in a peer-review post-mortem that, based on the substantial criticism by Robine and one of the other reviewers, Nature initially declined to publish the study. After Vijg and his co-authors sent Nature a thoroughly revised version, however, Robine conceded that the study was sound enough to publish, though he still disagreed with its conclusions. (Vijg stands by the methodology and conclusions of the study.)\n\nTwo years later, in 2018, the equally prestigious journal Science published a study that completely contradicted the one in Nature. The demographers Elisabetta Barbi of the University of Rome and Kenneth Wachter of the University of California, Berkeley, along with several colleagues, examined the survival trajectories of nearly 4,000 Italians and concluded that, while the risk of death increased exponentially up to age 80, it then slowed and eventually plateaued. Someone alive at 105 had about a 50 percent chance of living to the next year. The same was true at 106, 107, 108 and 109. Their findings, the authors wrote, “strongly suggest that longevity is continuing to increase over time, and that a limit, if any, has not been reached.”\n\nMany of the disputes over human longevity studies center on the integrity of different data sets and the varying statistical methods researchers use to analyze them. Where one group of scientists perceives a clear trend, another suspects an illusion. Robine finds the debate exciting and essential. “I’m not convinced by my colleagues’ suggesting that life is or is not limited,” he told me. “I think the question is still here. We don’t yet know the best kind of analysis or study design to use to tackle this question. The most important thing to do today is to keep collecting the data.”\n\nOn their own, however, life-span statistics can tell us only so much. Such data have been available for centuries and have clearly not settled the debate. The number of supercentenarians may still be too small to support unequivocal conclusions about mortality rates in extreme old age. But in more recent decades, scientists have made considerable progress toward understanding the evolutionary origins of longevity and the biology of aging. Instead of fixating on human demographics, this research considers all species on the planet and tries to derive general principles about duration of life and timing of death.\n\n“I’m a little surprised that anyone today would question whether or not there is a limit,” S. Jay Olshansky, an expert on longevity and a professor in the School of Public Health at the University of Illinois at Chicago, told me. “It doesn’t really matter whether there is a plateau of mortality or not in extreme old age. There are so few people that make it up there, and the risk of death at that point is so high, that most people aren’t going to live much beyond the limits we see today.”\n\nOlshansky, 67, has argued for decades that life span is obviously limited and that the mathematical models of feuding demographers are secondary to the biological realities of aging. He likes to make an analogy to athletics: “Could someone run a two-minute mile? No. The human body is incapable of moving that fast based on anatomical limitations. The same thing applies to human longevity.”"}, {"Article Image": "https://static01.nyt.com/images/2021/04/27/nyregion/27virus-briefing-NY-walk-in1/merlin_186101916_c3e7145c-12d2-41df-a4dc-1109e06b5991-facebookJumbo.jpg", "Article's Title": "Any eligible adult in New York will be able to walk in for vaccination at state-run sites.", "Article's Text": "All state-run mass coronavirus vaccination sites in New York will allow anyone 16 or older to walk in without an appointment and get their first dose, beginning on Thursday, Gov. Andrew M. Cuomo announced on Tuesday.\n\nWalk-in vaccinations will be available at state-run sites in New York City, like the Javits Center in Manhattan and Yankee Stadium in the Bronx, as well as on Long Island and in upstate cities like Albany and Syracuse, the governor said.\n\nSecond doses will still be given by appointment, which will be scheduled after the first dose is administered.\n\n“Just show up, and roll up your sleeve, and the mass vaccination sites have the capacity to handle it,” Mr. Cuomo said at a news conference on Tuesday."}, {"Article Image": "https://static01.nyt.com/images/2021/04/27/well/00well-damour-teens-eating/00well-damour-teens-eating-facebookJumbo.jpg", "Article's Title": "Eating Disorders in Teens Have ‘Exploded’ in the Pandemic", "Article's Text": "As a psychologist who cares for adolescents I am well aware of the prevalence of eating disorders among teenagers. Even still, I am stunned by how much worse the situation has become in the pandemic.\n\nAccording to the psychologist Erin Accurso, the clinical director of the eating disorders program at the University of California, San Francisco, “our inpatient unit has exploded in the past year,” taking in more than twice as many adolescent patients as it did before the pandemic. Dr. Accurso explained that outpatient services are similarly overwhelmed: “Providers aren’t taking new clients, or have wait-lists up to six months.”\n\nThe demand for eating disorder treatment “is way outstretching the capacity to address it,” said the epidemiologist S. Bryn Austin, a professor at the T.H. Chan School of Public Health and research scientist in the Division of Adolescent and Young Adult Medicine at Boston Children’s Hospital. “I’m hearing this from colleagues all across the country.” Even hotlines are swamped. The National Eating Disorders Association helpline has had a 40 percent jump in overall call volume since March 2020. Among callers who shared their age over the last year, 35 percent were 13 to 17 years old, up from 30 percent in the year before the pandemic.\n\nWhat has changed in the pandemic?\n\nThere are several possible explanations for this tsunami of eating concerns in teenagers. When adolescents lost the familiar rhythm of the school day and were distanced from the support of their friends, “many of the things that structured a teenager’s life evaporated in one fell swoop,” said Dr. Walter Kaye, a psychiatrist and the founder and executive director of the eating disorders program at the University of California, San Diego. “People who end up with eating disorders tend to be anxious and stress sensitive — they don’t do well with uncertainty.”"}, {"Article Image": "https://static01.nyt.com/images/2021/04/26/world/26virus-india-aid1/26virus-india-aid1-facebookJumbo.jpg", "Article's Title": "Amid Second Covid Wave, World Responds to India’s Distress Call", "Article's Text": "NEW DELHI — Oxygen generators from Saudi Arabia and the United Arab Emirates. Raw material for coronavirus vaccines from the United States. Millions in cash from companies led by Indian-American businessmen.\n\nAs a second wave of the pandemic rages in India, the world is coming to the rescue.\n\nBut it is unlikely to plug enough holes in India’s sinking health care system to fully stop the deadly crisis that is underway, and the health emergency has global implications for new infections worldwide, as well as for countries relying on India for the AstraZeneca vaccine.\n\n“It’s a desperate situation out there,” said Dr. Ramanan Laxminarayan, the founder and director of the Center for Disease Dynamics, Economics and Policy, adding that donations will be welcome, but may make only a “limited dent on the problem.”\n\nIn the early months of 2021, the government of Prime Minister Narendra Modi acted as if the coronavirus battle had been won, holding huge campaign rallies and permitting thousands to gather for a Hindu religious festival."}, {"Article Image": "https://static01.nyt.com/images/2021/04/25/multimedia/00XP-VACCINE-PROOF/00XP-VACCINE-PROOF-facebookJumbo.jpg", "Article's Title": "A Look at Covid-19 Vaccine ‘Passports,’ Passes and Apps Around the Globe", "Article's Text": "Isn’t the European Union also developing a system? Yes. On June 21, the E.U. is expected to introduce a certificate called a Digital Green Pass, with the aim of allowing people who have been vaccinated against the coronavirus to travel more freely. Under the proposed rules, each nation within the bloc could decide which travel restrictions, such as obligatory quarantine, to waive for Digital Green holders. But many countries, including Denmark, say they cannot afford to wait for the Digital Green Pass and are developing their own versions.\n\nIsrael\n\nImage Israel’s Green Pass app features a gif of a family headed on a trip. Credit... Isabel Kershner\n\nName of card: The Green Pass\n\nCould it get you an indoor table? Yes.\n\nHow about entry to a concert or sports game? That, too.\n\nAnything else? The pass allows you to enter many businesses, including swimming pools, gyms, theaters and wedding halls, as well as cultural events, such as concerts, sports games and religious gatherings. Having the pass may also mean that you may not have to quarantine for 10 to 14 days after international travel.\n\nHow does it work? In late February, Israel’s ministry of health began offering the Green Pass to fully vaccinated residents and individuals who have recovered from Covid-19. When booking a table at a restaurant, many of the businesses began to ask, “Do you have a Green Pass?” Israelis can print their certificates containing a QR code, download the code onto their phones or flash the app itself.\n\nWhat’s with that family? The app and other Green Pass materials feature an animated illustration of a family of three. The man is wearing shorts, a backpack and a camera around his neck, suggesting he’s on vacation. His son and wife are wearing masks, but their postures are relaxed as they pull their suitcases.\n\nAparna Nair, a professor of science history at the University of Oklahoma who maintains a collection of vaccination certificates going back to the 1820s, said that this detail was noteworthy: “They are using the design of the vaccine passport to form visual connections with life after the pandemic, essentially, the vaccine as a literal passport to the rest of the world.”"}, {"Article Image": "https://static01.nyt.com/images/2021/04/23/business/00Virus-Doses-01/merlin_186604812_a38b6576-e784-4bf0-985f-293733bfddb0-facebookJumbo.jpg", "Article's Title": "Millions Are Skipping Their Second Doses of Covid Vaccines", "Article's Text": "Ms. Ruel managed to get the Pfizer dose at yet another Walgreens the next day. But she said many people in her situation probably wouldn’t have tried so hard. “All you need is hassles like this,” she said.\n\nIn the Chicago area, for example, pharmacists at two Walgreens locations said the problem was causing headaches. They said that Walgreens’ appointment system was sending each pharmacy anywhere from 10 to 20 customers a week who need a second Pfizer shot, even though both pharmacies stock only the Moderna vaccine.\n\nIt is not clear how widespread the Walgreens dose-matching problem has been or how many people have missed their second doses because of it.\n\nJim Cohn, a spokesman for Walgreens, said that the problem affected “a small percentage” of people who had booked their appointments online and that the company contacted them to reschedule “in alignment with our vaccine availability.” He said that nearly 95 percent of people who got their first shot at Walgreens have also received their second shots from the company.\n\nWalgreens has also come under fire for, until recently, scheduling second doses of the Pfizer vaccine four weeks after the first shot, rather than the three-week gap recommended by the C.D.C. Pharmacists have been besieged by customers complaining, including about their inability to book vaccine appointments online.\n\nIn other cases, though, access to vaccines is not the sole barrier; people’s attitudes contribute, too.\n\nBasith Syed, a 24-year-old consultant in Chicago, nabbed a leftover Moderna vaccine at a Walgreens in mid-February. But when the time came for his second shot, he was busy at work and preparing for his wedding. After the first shot, he had spent two days feeling drained. He didn’t want to risk a repeat, and he felt confident that a single dose would protect him."}, {"Article Image": "https://www.thehindu.com/life-and-style/food/wluz0v/article34431235.ece/ALTERNATES/LANDSCAPE_615/29MPImpasta-4", "Article's Title": "These Chennai restaurants take you to Japan, Italy and Turkey, via their takeaway box", "Article's Text": "Despite a bleak year, there are a burst of feisty openings, determined to keep staff employed in the hope of a better tomorrow. Now, stay home, stay safe and explore the world\n\nOyama\n\nSleek and elegant, Oyama welcomed its first customers in March. Less than a month later, it is shifting its menu to delivery-only bento boxes. Nevertheless, Andrew Rex is excited about the opportunity to serve Chennai.\n\n“I have had restaurants in Thailand for years, but I am from here, so for a long time I wanted to start something here,” he says, adding that after some thought he decided on serving Japanese cuisine, instead of Thai, which may have been an easier choice. “Everyone with lemon grass in their hand is making Thai food here,” he chuckles. “I wanted to do something different.”\n\nWith Sadiq Hussain, who manages the restaurant, Andrew decided to create a space that feels authentically Japanese, without being intimidating to people who are unfamiliar with the cuisine.\n\nHence, although the menu includes popular classics, from donburi to katsu, and of course a wide range of sushi, it is also encouragingly flexible. There is, for example, a wide range of vegetarian food, and the chefs are also working on increasing their vegan options, in response to requests from customers.\n\nPortions are generous, and the restaurant is experimenting with a range of bento boxes to provide colour and variety.\n\nThey have one more secret weapon: dessert. “In most Japanese restaurants here, they serve only fruit at the end of the meal,” says Andrew. “We are working on expanding our dessert menu...” For now, there is mochi ice cream and creamy, wobbly Annin tofu, a reassuringly sweet ending.\n\n28/61, VNS Vaibhav Apartment, 1st floor, 3rd Main Road, Gandhi Nagar, Adyar. Call Sadiq at 9841113001\n\nOttoman’s Turkish Baklava & Kunafa\n\nSevki Ozertugrul could not go home, so he started making baklava. At least, it tasted like home.\n\nWhen the national lockdown to slow the ongoing pandemic began in March last year, Sevki, who has been working in India for four years, realised that it would be a while before he could return to Konya, in Turkey. “Suddenly, I decided, I will make baklava,” he says, walking through his first store, set beside Buva House on Khader Nawaz Khan Road.\n\nThere was just one catch: he had no idea how to do it.\n\nOver the past one year, a combination of YouTube classes and determination, have resulted in “Ottoman’s Turkish Baklava & Kunafa,” which began as an Instagram start-up, then gathered enough steam, and confidence, to launch a store on Chennai’s most buzzy high street.\n\n“Baklava is a 40-layered dessert made of phyllo pastry, filled with chopped nuts and sweetened with syrup,” Sevki says, adding that it was developed in the kitchens of Topkapi Palace in İstanbul.\n\nAfter a year of patient tweaking, he says his version tastes “almost perfect”. He adds, “We source everything locally — but we need pistachios from Gaziantep for proper Turkish baklava. In the future, we will add that too.”\n\nPistachios, walnuts and cashew nuts are encased in translucent layers of crisp phyllo, that is generously brushed with ghee. Syrup is added judiciously, so the pastry stays crunchy, ensuring it is rich, yet deceptively light.\n\nThe new space will open with baklava and kunafa, then expand into Turkish coffee. Sevki also holds out a tray of cookies, made by his wife. “I’ve forgotten what they are called,” he says, sprinting outside to ask her. He returns in a minute, smiling. “She says it was a favourite of the empire… So let’s call it Ottoman’s sweet. The taste of Turkey.”\n\nOttoman’s is at 8, Khader Nawaz Khan Road, Srirampuram, Thousand Lights West, Nungambakkam\n\nImpasta\n\nAlthough their newly opened restaurant, which was bustling with cheer last week, is silent, Aarnav Merchant and Alagu Vignesh are undeterred.\n\nWith the Tamil Nadu Government announcing new restrictions to prevent the spread of COVID-19, now only takeaway service is allowed. So, instead of serving their signature fresh pasta at the restaurant’s tables, they are thinking of ways to help you stay home safe and stock your fridge.\n\nThe young chefs, who graduated from IHM Mumbai (The Institute of Hotel Management) are determined to be as self sufficient as possible, focussing on making everything from the sauces to fresh gnocchi in-house, in a compact, but well-equipped kitchen.\n\nAfter IHM, Aarnav went on to do the Culinary Arts programme at Kendall College in Chicago, while Alagu went to Le Cordon Bleu in Ottawa. “We have been friends for a long time,” says Alagu, explaining how they agreed on a simple menu focussing on freshness and quality.\n\n“It’s a pasta bar more than a restaurant,” he adds, “So we do homestyle, hearty soups, lasagne, and of course fresh pasta.”\n\nAlthough the menu is deliberately short, the pasta section is like a driving holiday through Italy: pesto gnochetti, squid capellini, doppio agnolotti…\n\n“Keeping the menu small helps us play creatively with the food,” says Aarnav, as Alagu packs a portion of light, fluffy potato gnocchi, to be served with a pumpkin cream sauce. He adds, “We don’t buy anything frozen, and try to make every thing in-house. So, we butcher and break down the meat ourselves, then use the bones for stock so there is no wastage. We shell shrimp for our tortellini, and use the heads for shrimp oil.”\n\nThe takeaway menu includes white Bolognese chicken lasagna, with red sauce on the side, as well as a vegetarian ratatouille-inspired version. “We keep tweaking recipes,” says Aarnav, adding that their tiramisu is popular and they are now working on creating a mango cheesecake.\n\n“People have started dropping by for takeway,” he states, adding with a chuckle, “Yesterday a customer came and picked up his order, then couldn’t wait to drive home, so he ate in his car.”\n\n6A, Nawab Habibulla Avenue, 1st Street, Off Anderson Road, Nungambakkam. Call Aarnav on 8939511200"}, {"Article Image": "https://static01.nyt.com/images/2021/04/27/us/27virus-briefing-masks-outdoors-cdc1/27virus-briefing-masks-outdoors-cdc1-facebookJumbo.jpg", "Article's Title": "New York State Will Stop Requiring That Food Must Be Ordered With Alcohol", "Article's Text": "New York State Will Stop Requiring That Food Must Be Ordered With Alcohol The C.D.C. has eased its guidance for wearing masks outdoors. Because the risk of infection is much lower outdoors, U.S. health officials also relaxed advice for those who haven’t gotten their shots. In Brazil, Russia’s Sputnik V vaccine isn’t recommended. Follow our latest coverage of the coronavirus pandemic.\n\nNo more ‘Cuomo chips’: New York’s legislature will suspend a rule that required food to be ordered with alcohol. People dining outdoors at a restaurant in Manhattan in July. New Yorkers will soon be able to drink at bars and restaurants without the requirement of ordering food. Credit... Karsten Moran for The New York Times The leaders of the New York State Legislature said Tuesday they would move on the next day to suspend a pandemic directive that required customers to order food when purchasing alcohol at bars and restaurants. The food directive was originally imposed by Gov. Andrew M. Cuomo in July 2020 in an attempt to keep patrons seated at tables and reduce mingling that could lead to large crowded gatherings, fueling the spread of the virus. The repeal of the rule would go into effect after passing both legislative chambers in Albany, which could happen this week. The rule had been criticized by many, including the restaurant industry and many Republican lawmakers, as arbitrary and an unfair business regulation economically detrimental to bars that weren’t accustomed to serving food. While some bars and restaurants had begun to eschew the directive in recent months, others were using creative workarounds to comply with the rule, providing the bare minimum and cheapest option that would count as “food” under the governor’s directive. For months, New Yorkers were compelled to pair their beer or cocktail order with microwaveable hot dogs, barely cooked grilled cheeses, hastily-prepared peanut butter and jelly sandwiches and, of course, “Cuomo chips.” On Tuesday, many on social media were in a jocular and nostalgic mood as they bade farewell to the restriction and the eclectic food items they had been forced to order to enjoy an alcoholic drink over the past nine months. “Rest in peace to the Cuomoritos (a $1 bag of Doritos) the place near us has been selling,” wrote one person. Another user wrote: “I’m gonna miss you, random bag of lays chips.” The announcement was the latest in a series of restrictions that officials have eased as more people in the state are vaccinated and government officials increasingly turn their attention to New York’s economic recovery. Last month, Mr. Cuomo, a third-term Democrat, expanded indoor dining capacity for New York City restaurants to 50 percent, up from 35 percent. And earlier this month, he extended the curfew for bars and restaurants from 11 p.m. to 12 a.m. The restaurant industry welcomed the announcement, while calling for other restrictions to also be lifted. “The public health justification for the food rule was always questionable, so this is good news because it is past time to repeal it,” said Andrew Rigie, the executive director of the New York City Hospitality Alliance, an industry group. “But the state also needs to repeal the rule prohibiting customers from sitting at a bar in New York City, which doesn’t make sense when you can sit at a table six feet away, and they should modify the midnight curfew.” The move by the legislature comes a few months after it curtailed Mr. Cuomo’s emergency powers, a sharp rebuke to the governor that gave lawmakers additional oversight over the pandemic response. Rich Azzopardi, a senior adviser to Mr. Cuomo, said on Tuesday that, given the state’s coronavirus data, “lifting this Covid-related restriction was something we were in the process of implementing in the coming days.”\n\nVaccinated Americans don’t need masks outdoors in small groups or when biking and running, the C.D.C. says. Video transcript Back bars 0:00 / 1:14 - 0:00 transcript Biden Speaks Following C.D.C. Easing Mask Guidelines President Biden spoke on Tuesday about the Centers for Disease Control and Prevention’s new guidance about when masks should be worn outdoors. Cases and deaths are down, down dramatically from where they were when I took office on Jan. 20, and continuing to fall. This is particularly true for a group of Americans that we were most worried about when it came to the virus, senior citizens. When I took office in January, we were losing literally tens of thousands of our seniors each week, grandparents who were loved so dearly, moms and dads, pillars of every community. We have given 215 million shots. And that — anyone 16 years of age or older is now eligible to get the vaccine now, today, immediately. And because of the extraordinary progress we made in fighting this virus and the progress our scientists have made in learning about how it gets transmitted, earlier today, the C.D.C. made an important announcement: Starting today, if you’re fully vaccinated and you’re outdoors, you need — and not in a big crowd — you no longer need to wear a mask. President Biden spoke on Tuesday about the Centers for Disease Control and Prevention’s new guidance about when masks should be worn outdoors. Credit Credit... Stephanie Keith for The New York Times The Centers for Disease Control and Prevention took a major step on Tuesday toward coaxing Americans into a post-pandemic world, relaxing the rules on mask wearing outdoors as coronavirus cases recede and people increasingly chafe against restrictions. The mask guidance is modest and carefully written: Americans who are fully vaccinated against the coronavirus no longer need to wear a mask outdoors while walking, running, hiking or biking alone, or when in small gatherings, including with members of their own households. Masks are still necessary in crowded outdoor venues like sports stadiums, the C.D.C. said. But President Biden hailed it as a landmark moment in the pandemic, wearing a mask as he approached the lectern on a warm spring day on the White House grounds — and pointedly keeping it off as he walked back into the White House when he was done. “Go get the shot. It’s never been easier,” Mr. Biden said. “And once you’re fully vaccinated, you can go without a mask when you’re outside and away from big crowds.” The C.D.C. stopped short of telling even fully vaccinated people that they could shed their masks outdoors altogether — citing the worrying risk that remains for transmitting the coronavirus, unknown vaccination levels among people in crowds and the still-high caseloads in some regions of the country. The guidance also cautioned even vaccinated people against going without masks in medium-size outdoor gatherings. But even the C.D.C.’s director, Dr. Rochelle Walensky, emphasized a more expansive interpretation, telling reporters at a White House briefing, “We no longer feel that the vaccinated people require masks outdoors,” outside “large public venues, such as concerts, stadiums and things like that.” Image Credit... Centers for Disease Control and Prevention On Capitol Hill, a group of Republican lawmakers who are also medical professionals released an advertisement on Tuesday encouraging vaccination, in which they appeared wearing white coats with stethoscopes draped around their necks. Senator Roger Marshall, a freshman Republican from Kansas and a medical doctor, told viewers that the reason to get vaccinated was simple: “So we can throw away our masks, and live life as free as before.” Mr. Marshall, who organized the effort, said it was based on research conducted by Frank Luntz, a Republican pollster working to reduce vaccine hesitancy among conservatives. In an interview, Mr. Luntz said Mr. Biden’s announcement was a positive step, and could give people who are reluctant to get vaccinated a reason to get their shots. For Mr. Biden, who will address Congress on Wednesday and mark his 100th day in office on Thursday, the C.D.C.’s announcement was a moment to bask in what he called the “stunning progress” Americans had made since he took office. Next week, he said, he will outline a plan “to get us to July 4 as our target date to get life in America closer to normal and begin to celebrate our independence from the virus.” Americans have been whipsawed on the issue of mask wearing since the beginning of the pandemic, when top health officials said people did not need them — in part because of severe shortages of protective gear for health care workers on the front lines. Masks became the centerpiece of the culture wars that surrounded the pandemic, especially after President Donald J. Trump insisted that they were optional and that he would not wear one. Roni Caryn Rabin, Emily Anthes and\n\nAdvertisement Continue reading the main story\n\nWhen do we have to wear a mask outside? The C.D.C. says less often, and here’s how and why. Video transcript Back bars 0:00 / 1:16 - 0:00 transcript C.D.C. Eases Outdoor Mask Guidelines Dr. Rochelle P. Walensky of the Centers for Disease Control and Prevention remarked on Tuesday on the agency’s new guidance about when masks should be worn outdoors. Today, C.D.C. is updating our recommendations for fully vaccinated people, and providing guiding principles and sample activities to give people who are fully vaccinated a way to assess their own risk for Covid-19, and determine what situations are safe. If you are fully vaccinated, things are much safer for you than those who are not yet fully vaccinated. If you are fully vaccinated, and want to attend a small outdoor gathering with people who are vaccinated and unvaccinated or dining at an outdoor restaurant with friends from multiple households, the science shows if you are vaccinated, you can do so safely unmasked. On the C.D.C. website, we have posted examples of numerous outdoor activities that are safe to do without a mask if you are fully vaccinated. For vaccinated people, outdoor activities without a mask are safe. However, we continue to recommend masking in crowded outdoor settings and venues, such as packed stadiums and concerts, where there is decreased ability to maintain physical distance and where many unvaccinated people may also be present. Dr. Rochelle P. Walensky of the Centers for Disease Control and Prevention remarked on Tuesday on the agency’s new guidance about when masks should be worn outdoors. Credit Credit... Rosem Morton for The New York Times The new guidance on mask-wearing from the Centers for Disease Control and Prevention on Tuesday says that masks can be shed for some relatively safe outdoor activities, especially by fully vaccinated people, because the virus does not spread readily outdoors. But there are many circumstances where the new guidance still calls for masks to be worn outdoors, especially by unvaccinated people. Here are some examples from the C.D.C.’s new guidance: Everyone can do without a mask when … Walking, running, hiking or biking outdoors, alone or with members of the same household.\n\nAttending a small outdoor gathering with fully vaccinated family and friends. Fully vaccinated people can do without a mask when … Attending a small outdoor gathering with a mixture of fully vaccinated and unvaccinated people.\n\nDining outdoors at a restaurant with people from several households. For these kinds of activities, unvaccinated people should still wear masks and maintain social distance, the C.D.C. says. Everyone should still wear a mask when … Attending a crowded outdoor event, like a parade, sporting event or live performance.\n\nDoing almost anything indoors that involves contact with people who are not members of your household. Examples include dining indoors at a restaurant; going to the movies, an indoor concert or theatrical performance; attending full-capacity worship services; traveling on an airline flight or riding mass transit; singing in a chorus indoors; taking part in an indoor exercise class; visiting a shopping mall or museum; getting a haircut or manicure; or attending an indoor social gathering. Though most of these activities are much safer for fully vaccinated people than for the unvaccinated, the C.D.C. guidance says that everyone should still wear a mask to protect themselves and others. People are not likely to know the vaccine status of those around them, the guidance says, and it is not yet clear whether fully vaccinated people can still spread the virus while not becoming ill themselves. Unvaccinated people should also maintain social distance, the guidance says.\n\nDespite new C.D.C. mask guidance, the U.S. patchwork of mandates will take time to unravel. Customers donning masks to pay their bill at a cafe in San Diego, California, on Tuesday. Credit... Ariana Drehsler for The New York Times As the Centers for Disease Control and Prevention offered on Tuesday new guidance about when masks should be worn outdoors, people across the United States are living under an often confusing patchwork of limits, one that could continue for some time. Before the C.D.C.’s changes on Tuesday, 25 states had some form of statewide mask mandate, as did the District of Columbia and Puerto Rico, according to a New York Times tracker of coronavirus restrictions across the country. In 24 other states there was no statewide mask mandate, while in Colorado masks could be required depending upon the number of cases diagnosed in a county. But even within a state, mask mandates can vary based upon county or city. Kansas has no statewide mask mandates, but a number of cities and counties have their own orders. In Colorado, masks must always be worn in specific indoor locations — like schools, hospitals and government buildings — but in some counties with a high rate of new cases, they must also be worn in all public indoor settings with 10 or more people. After the C.D.C.’s announcement on Tuesday, a handful of governors said they would relax their outdoor mask mandates. In Massachusetts, masks won’t be required unless it is not possible to social distance. Maine recommends wearing a mask outdoors when it’s difficult to stay distanced, and Gov. Gavin Newsom of California said on Tuesday that “if you’re fully vaccinated, outdoors and not in a large crowd — you do not need to wear a mask.” Some outdoor mask requirements are even more specific, especially as a number of states have recently loosened orders. Masks are now only required outdoors in Kentucky at events with more than 1,000 people. Delaware recently removed a mask mandate for outdoor low-risk and medium-risk youth sports. Gov. Andrew M. Cuomo said on Tuesday that New York would adopt the C.D.C.’s guidance on outdoor mask wearing for vaccinated people. “That is liberating, especially now that the weather is getting warmer,” he said at a news conference. Gov. Bill Lee of Tennessee announced the end of statewide public health orders and issued an executive order that ends the authority of local officials to issue mask requirements in the 89 counties directed by the state health department. He also asked larger counties with their own health departments to lift restrictions like mask requirements by Memorial Day. The mayor of Knox County, which includes Knoxville, said Tuesday afternoon he would end a county mask mandate effective at midnight Tuesday. Louisiana will lift its mask requirement for private businesses like restaurants and bars, Gov. John Bel Edwards said on Tuesday, but will keep the mask mandate for schools, universities and public transit. Mr. Edwards said mask requirements by businesses and local governments should still be adhered to. At a White House news conference on Tuesday, Dr. Rochelle Walensky, the director of the C.D.C., stopped short of calling for states to end outdoor mask mandates. “States that have mask requirements outdoors, if people are vaccinated, we no longer feel the vaccinated people require masks outdoors,” she said. She said she continued to worry about protecting unvaccinated people at large outdoor public venues like concerts and sports stadiums. As more than half of all American adults have received at least one dose of a coronavirus vaccine, mask mandates are often the last widespread public health order still in effect. Stay-at-home orders and forced business closures, measures sometimes used to try and stop the spread of the virus, have mostly been lifted across the country, though they persist in a few states. See Coronavirus Restrictions and Mask Mandates for All 50 States The rules for businesses and residents remain a patchwork across the country as governors balance curbing the virus with boosting local economies. Kevin Draper and\n\nU.S. pharmacies are told to offer second vaccine doses to people who got first shots elsewhere. A man receiving a vaccine dose in a pharmacy in New York City earlier this month. Credit... James Estrin/The New York Times Federal health officials said on Tuesday that they were directing nearly all drugstores and grocery-store pharmacies to offer second doses of Covid-19 vaccines to people who received their first shot from a different provider. Growing numbers of Americans who received a first shot of the two-dose Pfizer-BioNtech or Moderna vaccine are not getting their second shots, in part because of challenges with access. The Centers for Disease Control and Prevention estimates that more than 5 million people, or nearly 8 percent of those who were partially vaccinated, have missed getting their second dose. Though that is not a high rate compared with those seen for multidose vaccines against other conditions, some states have been taking steps to prevent it from rising. The new federal directive is aimed especially at encouraging college students who got their first shots on or near campus to get their second doses at home, according to Andy Slavitt, the White House’s senior adviser for Covid-19 response. To accomplish that, he said, pharmacies participating in a federal vaccine distribution program will set aside any residency requirements for vaccine recipients. College students are a challenging group to get fully vaccinated. Many who became eligible recently got their first shot while still on campus, but will have left for the summer by the time they are due for their second shot. Other recipients may have been unable to get a second appointment at their original provider or had an appointment that was canceled. Many pharmacies were already giving out second vaccine doses to people who got first shots elsewhere. CVS stores, in particular, have become a destination for people scrambling to find a second shot, and a spokeswoman for Walgreens said her company was offering second doses without regard to where the first was administered. New York City officials said on Tuesday that the city has taken a similar approach, allowing people to receive second shots at any city-run site. The problem is less pronounced in the city than it is nationally, with only about 5 percent of city residents missing their second dose, officials said. People can schedule appointments at city sites in advance, or they can walk in. They need to bring proof of their first dose, like a C.D.C. vaccination card or an electronic record, to ensure that they receive the right vaccine within the recommended time. “Our goal here is to keep reminding people to get that second dose however works best,” Mayor Bill de Blasio said at a news conference. “We’re going to accommodate them and keep this progress moving.” Dr. Dave Chokshi, the city’s health commissioner, said that getting a second dose at a different location than the first should be a last resort. “We want people to keep their second-dose appointments if they’ve already made them,” he said. Rebecca Robbins and\n\nAdvertisement Continue reading the main story\n\nCoronavirus cases are surging in Oregon. Crowds gathered at the Portland Farmers Market at Portland State University in Portland, Ore., this month. Credit... Kristina Barker for The New York Times While coronavirus cases are falling in much of the United States, infections are spiking in Oregon, where a new wave is set to push a third of counties into the most severe level of restrictions. In the past two weeks, virus cases have risen 54 percent and hospitalizations are up 39 percent, according to a New York Times database. A total of 15 counties, including some in the Portland metro area, will move back into the fourth and most extreme level of restrictions by Friday, after meeting the state’s threshold, the governor’s office said on Tuesday. In these counties, indoor dining will be prohibited and businesses such as gyms and movie theaters must significantly reduce capacity. The new limits are likely to prompt a political backlash. Some states that have endured recent surges, like Michigan, where cases have leveled off but still remain high, have chosen not to tighten restrictions again and instead asked residents to take greater precautions in an effort to halt the spread of the virus. “This is not a step I take lightly,” Oregon’s governor, Kate Brown, said at a news conference last week. “However, it could be the last time we need to impose this level of restrictions given our vaccination trends and the virus’ behavior.” Public health experts have suggested a combination of factors could be driving the surge, including more contagious variants, increased travel during spring break and the loosening of state guidelines before vaccination rates had risen sufficiently. As of Tuesday, nearly 30 percent of the state’s population was fully vaccinated and 43 percent had received at least one dose, according to a New York Times database. “We didn’t get down far enough,” Ken Stedman, a biology professor at Portland State University, told local news outlet KATU, “and now we seem to be going back up again.”\n\nNo Burning Man festival again this year because of the pandemic, organizers say. Participants at Burning Man climbed onto an art installation titled “Night of the Climb” in 2018. Organizers said on Tuesday that the annual festival would resume in 2022. Credit... Andy Barron/The Reno Gazette-Journal, via Associated Press Burning Man, the annual countercultural arts event that typically draws tens of thousands of people to Nevada’s Black Rock Desert, has been canceled again this year because of the pandemic, but will return in 2022, organizers announced on Tuesday. The decision to forgo building the event’s makeshift temporary metropolis, known as Black Rock City, in late August came after months of deliberations among organizers, who sought feedback from past participants on issues like vaccination requirements and racial diversity. With vaccinations mounting across the nation, expectations were high that the festival, which began in San Francisco in 1986 and moved to the Black Rock Desert in 1990, would resume this year after being called off in 2020. “But, although here in the United States we may be feeling the weight lifting and the light at the end of the tunnel brightening, we are still in the pandemic, and the uncertainties that need to be resolved are impossible to resolve in the time we have,” organizers said on their website, The Burning Man Journal. The return of Burning Man — with its towering art installations, all-night dance parties under the stars, and desert-roaming vehicles shaped like Pac Man ghosts and fire-spewing sea creatures — had for many participants become a litmus test in the nation’s collective journey back to some semblance of normalcy. Some groups of attendees who camped together at the event had already announced that they would not return in 2021 because of concerns about public health and about affordability, given the economic pain the pandemic has inflicted on many people. But many others were planning to attend, and certain camps were told as recently as Monday by organizers that they would be eligible for specific quantities of tickets, which only added to the sense of disappointment on Tuesday. Emily Nicolosi, a research assistant professor at the University of Utah who has attended Burning Man, said she had been working for months to build a collection of large sculptures for display at the event this year. “I’m pretty devastated,” she said on Tuesday, though she noted that organizers have allowed artists to keep the grant money they received for art projects. Ms. Nicolosi said she did not fault the organizers for making the difficult decision to hold off until 2022. “It’s a hard choice, but I think they did the right thing to wait,” she said.\n\nBrazil’s health authority rejects importing Russia’s Sputnik V vaccine. A Sputnik V vaccine production line in Saint Petersburg, Russia in February. Credit... Emile Ducke for The New York Times RIO DE JANEIRO — Brazil’s health authority said late Monday that it would not recommend importing Sputnik V, the Covid-19 vaccine developed by Russia. The need for vaccines is urgent in Brazil: The country has been battered by one of the world’s worst outbreaks, driven by the highly contagious P. 1 virus variant. But the health authority, Anvisa, said that questions remained about the Russian vaccine’s development, safety and manufacturing. All five of Anvisa’s directors voted against importing the vaccine. Data about Sputnik V’s efficacy was “uncertain,” Gustavo Mendes Lima Santos, Anvisa’s manager of medicine and biological products, said in a lengthy late-night presentation. He noted that “crucial questions” had gone unanswered, including those about potential adverse events. Russia is using Sputnik V in its own mass vaccination campaign, and the vaccine has been approved for emergency use in dozens of countries. A peer-reviewed study published in The Lancet in February said the vaccine had an efficacy rate of 91.6 percent. Brazil’s decision prompted a response at the highest level of the Russian government, which has been energetically promoting Sputnik V in Latin America at a time when the United States has limited its vaccine exports to reserve doses for its own citizens. The Kremlin spokesman, Dmitri S. Peskov, said on Tuesday that the Russian government would try to win over the Brazilian regulators’ minds about the vaccine’s safety. “Contacts will continue,” Mr. Peskov said on a conference call with journalists. “If data is missing, it will be provided. There should be no doubt in this.” The official Sputnik V Twitter account have also pushed back, with a post in Portuguese on Monday saying that the vaccine’s developers had shared “all the necessary information and documentation” with Anvisa. In another tweet, it said Anvisa’s decision “was of a political nature” and had “nothing to do with access to information or science.” It alleged that the United States had persuaded Brazil to deny approval. Anvisa officials were under immense pressure to deliver a decision on Sputnik V, because Brazilian states had contracts to buy almost 30 million doses. The Supreme Court ordered Anvisa to make a decision. “The days of yes to the vaccine and to treatments are celebrated,” Alex Machado, an Anvisa director, said. “There will inevitably be days of no.” Gov. Camilo Santana of Ceará, one of the states with a Sputnik V contract, said on Twitter that he respected Anvisa’s decision but found it strange, given that Sputnik V is being used in other countries. “I will keep fighting for this authorization, in a safe manner, following all the rules,” he said. The Gamaleya Research Institute, part of Russia’s Ministry of Health, developed the vaccine, also known as Gam-Covid-Vac. The shot has been entangled in politics and propaganda, with President Vladimir V. Putin announcing its approval even before late-stage trials had begun. Ana Carolina Moreira Marino Araújo, the general manager of the Anvisa department that inspects vaccine development, said at the meeting that Brazilian officials could not perform a full inspection of the Russian facilities. She said officials who were in Russia last week were denied access to the Gamaleya Institute and inspected only two factories, finding problems in one of them. She also said Russian officials had tried to cancel the agency’s visit. “At this moment, the inherent risk in manufacturing couldn’t be overcome,” Ms. Araújo concluded. How Gamaleya’s Vaccine Works Two adenoviruses help prime the immune system to fight the coronavirus. Manuela Andreoni and\n\nAdvertisement Continue reading the main story\n\nGlobal Roundup Eyeing summer tourist season, Greece exempts more travelers from quarantine. Walking near the Acropolis in Athens last month. Credit... Byron Smith for The New York Times Greece lifted quarantine requirements on Monday for arrivals from seven more countries, including Russia and Australia, continuing an easing of rules for foreign visitors before a formal reopening to tourists on May 15. Last week, Greece ended quarantine restrictions for visitors from European Union member states as well as the United States, Britain, Serbia and the United Arab Emirates. The steps were similar to those put in place in March for arrivals from Israel, which has been far ahead of most of the world in vaccinations. Greece is also stopping restrictions this week for visitors from New Zealand, South Korea, Thailand, Rwanda and Singapore. Greece had previously required arrivals to quarantine themselves for seven days. It is waiving that rule for passengers from the listed countries as long as they produce a vaccination certificate or the results of a negative PCR test conducted within 72 hours of their arrival. After heavy economic losses in 2020, the Greek authorities are determined to save this year’s summer tourist season despite experiencing a severe third wave of coronavirus infections. Health officials have said the infection rate is stabilizing, though slowly. Greek health officials have reported more than 334,000 infections and more than 10,000 deaths from the virus, according to a New York Times database. A new concern is the appearance of the coronavirus variant that is believed to be fueling the worsening outbreak in India. On Sunday, health officials recorded the second case of that variant in Greece, found in a 33-year-old foreign woman who had traveled to Dubai in early April. Greece’s high infection rate remains a worry for some governments. The U.S. State Department has advised against travel to Greece, citing a “very high level” of coronavirus cases. Greek health officials have expanded testing in recent weeks as they gradually lift lockdown restrictions, with bars and restaurants scheduled to reopen on May 3 after a six-month hiatus. In other updates from around the world: With Thailand struggling to bring its worst coronavirus outbreak under control, Bangkok made it compulsory for residents to wear masks in public beginning on Monday. One of the first to break the new rule? The country’s prime minister, Prayuth Chan-ocha, who was seen maskless at a government meeting in a photo published on his official Facebook page. As a first-time offender, he agreed to pay a fine of about $190.\n\nNew Zealand said it would allow quarantine-free travel from Western Australia to resume on Wednesday, after a three-day pause prompted by two coronavirus cases in the Australian city of Perth. Travelers who have been identified as contacts of the infected Australians — a man believed to have been infected in hotel quarantine, and a woman he later stayed with — will have to self-isolate and test negative for the virus before departure, according to New Zealand’s Covid-19 response minister, Chris Hipkins.\n\nThe authorities in Portugal said they might lift a state of emergency as early as the end of this month after reporting zero deaths from the virus on Monday. It was the first such day since August. The infection rate in Portugal has recently fallen to one of the lowest levels in Europe. Portugal’s president, Marcelo Rebelo de Sousa, is giving a televised address on the subject Tuesday evening.\n\nAt first, getting the vaccine itself was the prize for older people in Russia seeking protection from the coronavirus. But with vaccinations slowing in Moscow, the city government began a program on Tuesday to encourage turnout with gift certificates. Residents over 60 will receive a voucher for 1,000 rubles, or about $13, redeemable at stores and restaurants. The Russian government has blamed widespread vaccine hesitancy for a slow start to its campaign. A shortage has also slowed the effort, with Russia exporting some of its doses. About 5 percent of Russians are now fully vaccinated; in the United States, it’s 27 percent. Niki Kitsantonis , Shashank Bengali, Raphael Minder and"}, {"Article Image": "https://www.thehindu.com/life-and-style/motoring/rfcbkj/article34429386.ece/ALTERNATES/LANDSCAPE_615/Royal-Enfield-Classic-350", "Article's Title": "Q & A with Hormazd", "Article's Text": "Style and substance\n\nI am planning to buy the Royal Enfield Classic 350 Chestnut red. Is it worth buying or should I go for the Benelli Imperial 400? My priorities are low running costs and resale value.\n\nVinu, Bengaluru\n\nThe Benelli is a better choice than the current Classic 350. However, we would recommend that you wait a little more for the next-gen Classic 350. Its launch is due soon and it is based on the Meteor 350 platform, which is a huge improvement over the current Classic 350. The new platform has proven to be quite reliable so far, so running costs should be kept under check. The Classic 350 also commands decent resale value, so that should hold true for the next gen bike as well.\n\nTall order\n\nI want to purchase a bike that can deliver high performance, good efficiency, offers a comfortable highway performance and serves as a good city commuter. I have shortlisted the Royal Enfield Meteor 350, Honda CB 350 RS and BMW G 310 R , but I am not sure which to go for. Budget is not a concern.\n\nHitesh Kulkarni, Ahmedabad\n\nIt’s going to be very hard to find a bike that meets all those criteria — if you want high performance, you have to give up some efficiency. The Meteor and CB are both quite refined, but they are not exactly ‘high performance’. Of the two, the CB is more efficient.\n\nThe Interceptor is a great choice, but it is a heavy bike. Expect no more than 25kpl on city commutes with the RE. The BMW is another good all-rounder, but it doesn’t have the smoothest motor out there and service costs are high. We would recommend you also consider the KTM 390 Duke and 390 Adventure. They have the best performance here, but expect no more than 25-28kpl in real world riding.\n\nHormazd Sorabjee is the editor of Autocar India. Mail your feedback and queries to roadshow@thehindu.co.in"}, {"Article Image": "https://www.thehindu.com/life-and-style/motoring/odkd6h/article34429411.ece/ALTERNATES/LANDSCAPE_615/Bajaj-launches-new-Pulsar-NS125", "Article's Title": "Bajaj launches new Pulsar NS125", "Article's Text": "Bajaj has launched the new Pulsar NS125 at ₹93,690. The NS125 is the third model from the NS range and the 10th Pulsar model to now be on sale.\n\nThe NS125 looks identical to its larger siblings with the same smooth-flowing naked bike lines and it most likely shares some body panels with the larger models. The fuel tank appears to be the same unit and the spec sheet reveals that it has an identical capacity of 12 litres.\n\nPower comes from a 124.4cc, air-cooled, two-valve unit that makes 12hp and 11Nm of torque.\n\nThe NS125 uses a perimeter frame that uses a telescopic fork and monoshock for suspension. It also uses a 80/100-17 at the front and 100/90-17 tyre at the rear. Braking is carried out by a 240mm disc up front and 130mm drum at the rear. Unlike the larger NS160, the NS125 can’t be optioned with a disc brake at the rear."}, {"Article Image": "https://www.thehindu.com/life-and-style/motoring/8nc49s/article34429263.ece/ALTERNATES/LANDSCAPE_615/DSC5695", "Article's Title": "Mercedes’ AMG A35 is a treat on wheels", "Article's Text": "The vehicle offers sharper handling, a richer cabin and more kit, plus better performance\n\nThe A35 sedan packs a whopping 306 hp turbo-petrol engine, all-wheel drive and a number of suspension and chassis upgrades over the regular A-Class Limo to make it sportier. So, what is it like?\n\nStarting with the engine, this 2.0-litre, four-cylinder petrol engine is a development of Merc’s M260 unit, and it uses a twin-scroll turbocharger to boost torque at low speeds. Power is sent to all four wheels via Merc’s own 7-speed dual-clutch automatic, and the four-wheel-drive system allows up to 50% of the power to be sent to the rear.\n\nThe A35 even gets uprated suspension components to help deal with the power better. Up front, it now gets the addition of a lower wishbone along with a custom strut brace used to enhance stiffness, and the shell of the car even gets underfloor stiffening. At the rear, AMG uses a new subframe to stiffen up the rear suspension mounting points.\n\nAll these upgrades certainly make a massive difference to the driving experience. The steering feels beautifully weighted, very direct and delivers a fair amount of connect. There is plenty of grip, the nose is keen to change direction and with the four tyres turning and clawing in, it even inspires confidence over wet patches.\n\nYou cannot really tell when the rear axle chips in, or if it does at all, but it does manage to feel quite neutral and balanced. The body control is very good, with the A35 feeling well poised even when you hurl it around.\n\nPlenty of energy\n\nProd the throttle and responses are immediate, sharp and wonderfully addictive; keep your foot in and the tacho needle climbs with plenty of energy. In fact, flatten the accelerator in second or third, with the engine spinning at around 3,000 rpm, and the A35 will leave you grinning.\n\nThrottle responses aren’t as feral as the full blown V8, but this is still deeply addictive. Even flat-out performance is strong; we managed to record 0-100 kph in 5.6 sec without the use of launch control. The A35 is also a great tool for fast highway commutes; the stability is great, the brakes have a good amount of bite, and the twin-clutch gearbox works well.\n\nIn fact, the gearbox works particularly well when you are ‘on it’ — it shifts up crisply and it allows downshifts even when you are high up in the powerband. The gearbox, however, does pause and feel grabby at low speeds.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe A35’s adaptive AMG suspension also rounds off bumps on the road nicely, although larger bumps do catch it out occasionally; the short-travel suspension is not ideal.\n\nComing to the styling, Mercedes has given the A35 sedan flowing lines and spot-on proportions. On the inside, the A35 gets plenty of typical AMG touches — very supportive sports seats, a flat-bottomed steering wheel, aluminium sport pedals, and AMG-specific graphics for the digital instrument panel. What lifts the ambience considerably is the colour-matching ambient lighting in yellow.\n\nRear passengers also get a lot more space and comfort than the earlier CLA. Legroom is much improved, headroom is good for regular-sized passengers, and though you are seated a bit low, the rear seat isn’t uncomfortable for two, even over long-ish journeys. The boot isn’t too large at 420 litres, but it will carry a weekend’s worth of bags quite easily or swallow three large suitcases.\n\nLaunched at ₹56.24 lakh (ex-showroom, India), the locally assembled AMG A35 is clearly more expensive than the stock models, but then it delivers much more car as well. A lot more performance, sharper handling, a richer cabin, more kit and, not to be dismissed, the look of a higher-end AMG performance car.\n\nThe A35 isn’t as exciting as a C63 and it won’t be as practical on an everyday basis as something like a C-Class. Still, if you want the best of both worlds, the charming and fun-to-drive A35 certainly hits the spot."}, {"Article Image": "https://www.thehindu.com/life-and-style/motoring/ahd5ue/article34429339.ece/ALTERNATES/LANDSCAPE_615/RAC1534", "Article's Title": "TVS Apache RTR 160 4V assures greater fuel efficiency", "Article's Text": "TVS’ Glide Through Technology, or GTT, makes it an easy motorcycle to ride in slow moving traffic too\n\nIt is almost as if TVS does not rest when it comes to rolling out little updates for its motorcycles, the Apache line-up in particular. In late 2019, the manufacturer introduced the facelifted iterations of the popular Apache RTR 160 4V and the RTR 200 4V. A few months ago, the latter got another, rather substantial, improvement; and now, it is the smaller 160’s turn.\n\nAt the midst of it all\n\nFor starters, there is the updated engine. TVS has managed to churn out an additional 1.61 hp making it the most powerful engine in its class. Peak torque is impressive as well with 14.73 Nm produced at 7,250 rpm. Our performance tests showed that the Apache is also one of the quickest bikes in its segment.\n\nIt is outpaced to 60kph (by just 0.05sec) by its rival from Bajaj, but it is the quickest motorcycle to 100kph, getting there in 15.93sec. These numbers, combined with a smooth and free-revving engine, result in a rather sprightly motorcycle. It is only towards the very upper limit of the rev band that you can feel, and hear, vibrations from the foot pegs and the front end. The throttle response is crisp, too, and that improves the overall riding experience.\n\nAs was the case with the 2020 model, the 160 4V features TVS’ Glide Through Technology, or GTT, making it a very easy motorcycle to ride in slow moving traffic. The GTT, essentially, works like the creep function in an automatic transmission equipped car, allowing the rider to keep moving without the need to feed any throttle. It is a natural feeling system that works in the first three gears, with each subsequent gear offering a slightly higher ‘cruising’ speed.\n\nSpeaking of cruising, the 160 4V will sit comfortably between 90-95 kph all day long, and while it can stay at a constant 115kph, it does feel a little stressed at those speeds. If you are a stickler for good fuel efficiency, this Apache will not disappoint. In our tests, the bike returned 43.24 kpl in the city and 50.76 kpl on the highway.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOn its toes\n\nThe RTR 160 4V has always been a capable and easy bike to ride fast. The bike uses a conventional telescopic fork and monoshock that offer a plush ride. This setup is also quite adept at going around corners very well, in a manner that feels intuitive. With the 2021 model, TVS also managed to shave off two kgs. While it is not a difference you will immediately notice, it does play a part.\n\nThe only downside to the comfort is the ergonomics. The Apache has a predominantly relaxed riding position, but the foot pegs are a little rear-set and sit high up. It is not something that will bother you over short distances, but if you are over 5ft 10in, this does feel a little cramped over longer stints.\n\nThe Apache RTR 160 4V is one of TVS’ most popular motorcycles, and there is good reason to see why. It offers impressive performance, everyday practicality, and with prices starting at ₹1.08 lakh, it is also great value for money.\n\nDespite being part of a heavily competitive segment, the RTR 160 4V remains one of the top contenders. Is it at the very top though? That is a question we hope to answer soon."}, {"Article Image": "https://www.thehindu.com/sci-tech/technology/obl1xn/article34413276.ece/ALTERNATES/LANDSCAPE_615/LMVH-Reutersjfif", "Article's Title": "Luxury brands use blockchain to promote product transparency", "Article's Text": "The companies will use blockchain to match product ID with client ID, enabling customers to access product history and authenticity by tracking manufacturing process right from raw materials stage to the point of sale\n\n(Subscribe to our Today's Cache newsletter for a quick snapshot of top 5 tech stories. Click here to subscribe for free.)\n\nA consortium of luxury brans like LVMH, Prada and Cartier have come together to use blockchain to share information about their products’ authenticity with customers. The move aims to streamline sourcing and categorise goods in a single, digital format, according to LVMH.\n\nThe brands will use blockchain to match product ID with client ID, enabling customers to access product history and authenticity by tracking manufacturing process right from raw materials stage to the point of sale. The infrastructure will consist of a chain of secure, non-reproducible, digital blocks. The private blockchain will be secured by ConsenSys technology and Microsoft.\n\nAlso Read | Blockchain transaction tested in space\n\nFour luxury companies, LVMH, Bvlgari, LVMH Maisons and Hublot, are already active on the platform. Luxury watchmaker Hublot has launched a digital e-warranty which will be stored in the blockchain system. It allows customers to verify the authenticity of their watch by taking a photo on their mobile phones.\n\nThe system will adhere to client privacy and the information cannot be changed or tampered with, the company noted."}, {"Article Image": "https://www.thehindu.com/life-and-style/zarfgx/article34428346.ece/ALTERNATES/LANDSCAPE_615/26tvmfleamarket3jpg", "Article's Title": "Trivandrum Flea Market — An all-Women Initiative has been connecting women entrepreneurs and buyers", "Article's Text": "More than a dozen virtual exhibitions and Facebook live sales have been organised through the online initiative\n\nIt is a flea market with a difference. Not only is it online but it is meant only for women entrepreneurs. An idea born out of necessity, the popularity of the flea market among buyers and sellers has enthused entrepreneur and flea market organiser Mamtha Pillai.\n\nMamtha, who owns Meraki Home Garden, a niche outlet in Thiruvananthapuram, dealing with plants and planters, like many others, suffered a setback on account of the pandemic and lockdown.\n\nSome of the products made by vendors participating in the virtual flea market for women entrepreneurs, which is organised by Trivandrum Flea Market – An all-Women Initiative | Photo Credit: Special arrangement\n\n“All of us with small businesses suffered a blow because of the restrictions imposed to curb the pandemic. Many of us used to participate in sales, big and small, in Thiruvananthapuram and elsewhere. When all that got cancelled, some of us had no clue what to do with stocks, especially those with perishables like food,” says Mamtha.\n\nShe knew that her plants could be kept aside for sale at another time but that was not the case with everyone one else. So, Mamtha came up with the idea of an online flea market on their dedicated Facebook page, Trivandrum Flea Market – An all-Women Initiative’, to help the women entrepreneurs market their products. “Although Instagram could have been a better platform for such sales, I realised that for many first-time social media users, especially senior citizens, Facebook would be an easier platform,” she says.\n\nSome of the products sold by vendors participating in the virtual flea market meant for women entrepreneurs, which is organised by Trivandrum Flea Market – An all-Women Initiative | Photo Credit: Special arrangement\n\nThe first one was conducted in July 2020 and the Facebook Live flea market turned out to be a huge hit among vendors and buyers. That boosted their confidence. More than 12 such virtual exhibitions have been conducted and Facebook live sales are organised frequently.\n\n“We managed to sell a wide range of products, such as pickles, snacks, cakes, desserts, clothes, handicrafts, home linen, art works, jewellery and so on. That convinced us that this was the way forward during these troubled times. Vendors come from different places in India and they have all found customers,” says Mamtha.\n\nFinally, on March 14, they organised their first physical exhibition and sale in a heritage space, House of Roses, in Thiruvananthapuram, which had been renovated by its owner, Cindu Vijay, an architect residing in Kozhikode. Twenty vendors participated in the exhibition and sale. As with their virtual sale, this too turned out to be successful and helped Cindu showcase her space among potential clients.\n\nChocolate biscuit pudding made by Kasthuri Rajasegaran, one of the vendors participating in the online flea market | Photo Credit: Special arrangement\n\nKasthuri Rajasegaran, a home-cook who specialises in Sri Lankan cuisine and eggless cakes, was one among the vendors at the sale. She says she was quite disappointed with the response to her Instagram account that begun in October 2020. “I participated in the Vishu event on March 14 and since then I have been flooded with orders. It has been a great encouragement because I am completely new to the city and have no friends or relatives here. The flea market has given me a strong helping hand,” she says.\n\nWith the surge in COVID numbers, the vendors have reverted to sales through Facebook Live sessions and online exhibitions.\n\nTo coincide with Mother’s Day, ‘Celebrating Mom’, a virtual sale will take place on May 7, 8 and 9. “Even after the pandemic is tamed and live exhibitions become popular again, we plan to continue with online events. It has broad-based our vendors and given customers more choices,” says Mamtha."}, {"Article Image": "https://www.thehindu.com/life-and-style/fashion/b6bv38/article34422386.ece/ALTERNATES/LANDSCAPE_615/hym26jhop3", "Article's Title": "Fashion start-up JHOP makes women’s clothes with functional pockets", "Article's Text": "Friends and mompreneurs Anisha Gopinath and Anupama Srinivasan hope their JHOP line will make women go hands-free\n\nFriends and mompreneurs Anisha Gopinath and Anupama Srinivasan have launched a fashion line called JHOP (@JHOP_INDIA on Instagram), derived from the Tamil reference to pockets. JHOP works towards fashion equality.\n\n“You don’t have to look far to find Twitter-rants, memes, articles and videos in which women either complain about not having pockets or rejoice over a dress with pockets. We want to bridge this gap,” says Anisha, a former communications professional, now living in Belgium.\n\nAnisha Gopinath and Anupama | Photo Credit: Special arrangement\n\nAnupama, from the banking sector, lives in Chennai.The friends connect over video calls to manage the manufacturing business set up in Coimbatore. “It took a pandemic for us to realise that distance doesn’t matter, as long as there is passion,” adds Anupama. Their decade-long friendship, during which period the friends even had their first children around the same time, helps to identify strengths and allocate tasks while juggling operations, marketing, and finance.\n\nThe duo began working on the idea in March 2020. Four year ago, at lunch, they realised that they had to find a place for their belongings, even in public restrooms. “We understood why moms waited for dads to wash their hands and come back to guard their handbags,” recollects Anisha. While this was the inspiration, the duo also wanted to show their daughters that “if we need something, we have to work on solutions ourselves.”\n\nMonths of research led to the brand that uses cotton and rayon sourced from Ahmedabad, Mumbai and Erode; they simply share the idea online with tailors. “The pandemic has enabled our tailors to work effectively over video calls,” shares Anisha.\n\nDress with functional pockets | Photo Credit: Special arrangement\n\nJHOP’s designs reflect their personal styles: breezy and comfortable. The western and traditional outfits comprising dresses, kurta sets, jumpsuits and shirts, all have functional pockets. “We want to bridge the existing gap between men’s and women’s pockets. Research confirms that women’s clothes have significantly smaller pockets than men’s and that pockets in women’s jeans were 48% smaller and 6.5% narrower than those in men’s jeans.”\n\nJHOP’s pockets are deep and can hold all essentials — mobile phone, keys, lip balm, sanitary napkin, a small wallet and sanitiser, mask, eyeliner and even a small chocolate bar! Its models are bankers, lecturers and artists. “We wanted models who represent all of us — inspirational women, real people and relatable body types,” adds Anupama.\n\nKurta with functional pockets | Photo Credit: Special arrangement\n\nThe focus now is to stay afloat and find ways to work in the new normal. With the costs of raw materials and textile prices shooting up in the pandemic, the duo compensates it with travel costs. “We invested all our savings in JHOP. While a few people thought that was irresponsible to do during a pandemic, especially now that we are new parents, we truly believed in our idea.”\n\nThe brand adopts earth-friendly measures like using cloth bags and recycled covers for shipment. They also reduce waste by making scrunchies, coin purses, and masks with leftover fabric."}, {"Article Image": "https://static.toiimg.com/photo/82289279.cms", "Article's Title": "Why Kadhi should be a part of our summer diet", "Article's Text": "According to her post, appetite drops during summer and the heat can take a toll on the skin and the gut. The abdomen feels cramped, constipation & gas become frequent and even periods get painful. In such cases, consuming Kadhi is helpful as it is rich in nutrients that help soothe the digestive system and also helps control dehydration.\n\n\n\nIn summer loss of appetite means diminishing vitamin B12 and the best way to improve that is to consume food items like dahi, which is good for the stomach and skin as well. In the early days, our dadi and nani used to make it more nutritious by adding pulses like besan and tempering it with spices and curry leaves and that’s how Kadhi became the ultimate savior for the summer heat. It is best consumed with rice and turns out to be a perfect combo of pre + pro-biotic and with a complete amino acid profile. (Image: istock)"}, {"Article Image": "https://static.toiimg.com/photo/82275971.cms", "Article's Title": "Ranked: Most to least financially successful zodiac signs", "Article's Text": "Everybody wants to get filthy rich. Whether it’s the ability to finally buy something you’ve wanted for long or just gallop into faraway foreign lands, being financially successful is a feat we all aim to achieve. But only a few become successful with their determination, hard work and perseverance. Astrology critically analyses people’s personalities based on the twelve zodiac signs. In account of this, we bring to you the most and least financially successful zodiac signs."}, {"Article Image": "https://static.toiimg.com/photo/82277772.cms", "Article's Title": "Herbs For Weight Loss: 5 herbs that can help you lose weight", "Article's Text": "Herbs and spices not only add flavours and aroma to your meal, they are loaded with nutrients that can help to keep you healthy and also aid weight loss. Our pantry is packed with different kinds of herbs and spices, we just have to use them efficiently to boost the metabolism and speed up the fat-burning process. Some herbs can also help to fight cravings and prevent unhealthy munching. Here are 5 herbs that you must add to your diet when trying to shed kilos.\n\n"}, {"Article Image": "https://static.toiimg.com/thumb/msid-82278809,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-1224202/82278809.jpg", "Article's Title": "Five ways to rock ethnic wear this summer", "Article's Text": "Summer is synonymous with comfort. You need clothes that beat the summer heat while making you look chic! Here is what we think will strike the perfect balance between style and comfort this season.Palazzos with straight or A-line Kurtis are perfect, irrespective of the occasion. Cigarette or straight pants paired with either Anarkalis, short tunics or straight Kurtis are perfect for a more formal look. From a design perspective, ¾ roll-up or full sleeves, with front button-down pattern and mandarin collar are great for your virtual work calls.The cool airiness that whites bring to our lives in summer is incomparable to anything else. Having said that, too much white can make Jill a dull girl. We need colors and prints to pump up the summer spirit. Pastels and florals highlight summer like nothing else. The very ‘look’ makes you think of a cool summer evening breeze! Another trend we see is color blocking. Sometimes, you just need some bright, happy, and contrasting colors coming together seamlessly to set a happy tone to your day. Then we have the geometric or abstract prints for that fun yet, formal touch.Too many accessories will make you uncomfortable. Pair your ethnic wear with finger or toe rings and earrings, while keeping your neck and wrists bare.Drop the heels, stick with Juttis or Kolhapuris. Embellished juttis add the extra zing to your outfit and colored Kolhapuris bring out the “summeriness” of your ensemble.High-low kurtis look great with cigarette or straight pants. Asymmetrical kurtas with printed culottes. Fit and flare dresses in Indian prints are great for the summer. Shararas with short kurtas are also perfect for a summer brunch with family."}, {"Article Image": "https://static.toiimg.com/photo/82275061.cms", "Article's Title": "Coronavirus: Signs & Symptoms COVID-19 is affecting other parts of your body, besides lungs", "Article's Text": "Given that the SARs-COV-2 virus enters and infects the respiratory tracts, causing coughing, shortness of breath, and difficulty in breathing, it can lead to severe damage to your lung health. The deadly virus infects your body by entering healthy cells and multiplies in number, causing inflammatory changes to the lungs and negatively impacting the lung tissues and sacs.\n\nHowever, in addition to the wide range of lung injuries, the novel coronavirus can take a toll on other parts of the body too."}, {"Article Image": "https://static.toiimg.com/thumb/msid-82277013,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-660880/82277013.jpg", "Article's Title": "Coronavirus during pregnancy: Tested COVID positive during pregnancy? Here is what you should do", "Article's Text": "There have been various inconclusive conversations about the risk associated with testing Covid positive while pregnant. Here is everything you need to know about testing corona positive during pregnancy and what you can do.As per a recent study by Oxford University, pregnant women infected with COVID-19 and their newborn babies might face a higher risk of complications than previously known. Though this does not hold for all pregnant women.The study done by Oxford University was a smaller one and needs more research for concrete results. But as per experts, one has to be more careful as they are dealing with two lives. Though there is nothing to panic about if there are no complications involved.Experts say, there is nothing to panic about as mild cases can be easily cured at home with proper diet, rest and exercise. Though during the advanced stages of pregnancy, there could be some complications as the immunity of the would-be mother is compromised at this time.It's best that pregnant women limit their hospital visit in order not to get exposed to the virus.During the first wave, not many pregnant women got infected with the COVID virus, while in the second wave the number is just increasing. Women who have comorbidities are at more risk. In many cases, COVID affects the baby by reducing the amniotic fluid around the baby.Experts say the new strain is responsible for the increase in the number of COVID cases among pregnant women. The virus this time is much more transmissible and sometimes even escapes the RT-PCR test.The good news is there are no birth complications involved due to Covid. It depends on the severity of cases. If the oxygen levels are fine and there are no comorbidities, there is no risk involved.- We all know prevention is better than cure, make sure to follow all the Covid safety protocols. Do not step out until necessary.- Keeping taking your vitamins and zinc along with a healthy diet and rest. Moderate exercise is also recommended.- If you test positive, do not panic and rush to the hospital. Most Covid cases can be managed at home with phone consultations with the doctor.- Do not self-medicate. Always talk to your doctor, even before taking any supplements.- Isolate yourself. Keep checking your temperature and oxygen levels every 6 hours.If your temperature does not subside even after taking paracetamol for four days and at any time your oxygen level goes below 94, you must talk to your doctor. If you have severe chest pain, blueness of the nails, you might need hospitalisation.Normally, there is no mother to child transmission in the womb, although it is possible. Breastfeeding must be done with proper sanitisation and masking. One can also extract the milk and give it to someone else to feed the baby through the bottle.Doctors say there it is important to be more careful during the third trimester as the breathing is compromised and immunity is low."}]