[{"Article Image": "https://static.toiimg.com/thumb/msid-82291100,width-1070,height-580,imgsize-156998,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "Experience of Argentina tour will help me to become a much better player: Shamsher Singh", "Article's Text": "Shamsher Singh (Getty Images)\n\nBENGALURU: Indian men's hockey team forward Shamsher Singh believes the recent tour of Argentina has given him a chance to test his skills against the best and the exposure will only make him a better player.\n\nThe 23-year-old was part of the Indian team which defeated Olympic champion Argentina twice in the FIH Pro League earlier this month.\n\n\"One can practice a lot during training sessions, but a player's actual ability can be judged only during matches and therefore I was delighted to play in a big tournament like the FIH Hockey Pro League ,\" Singh said in a release issued by Hockey India .\n\n\"To be among the best, we have to constantly test ourselves against the best and I was very happy with the way I performed in the FIH Hockey Pro League matches against Argentina.\"\n\nIndia won the first match via a penalty shoot-out, before thumping the hosts 3-0 win in the second game of the two-leg FIH pro league.\n\n\"The matches certainly gave me a good idea about the level at which a hockey athlete plays in a big tournament.\n\n\"The competition certainly gave me great exposure and I am sure the experience will help me become a much better player for India.\"\n\nShamsher said the performances put in by the youngsters augurs well for the national side.\n\n\"The best part about our team is that there is a good mix of experience and youth in our side,\" he said.\n\n\"The experienced players have been performing consistently for many years and therefore the brilliant contributions made by youngsters, such as Rajkumar Pal and Vivek Sagar Prasad , in the tour of Argentina has increased the confidence and the belief in our side tremendously.\n\n\"We just have to keep fine-tuning our game and hit our peak by the time we travel for the Olympics,\" said the Forward.\n\nShamsher said he has thought about a few aspects of his game on which he needs to improve.\n\n\"One has to keep improving with every training session and that's what I look to do. I have thought about a few techniques which I need to work on, and I am working on them one by one at the SAI campus.\"\n\n"}, {"Article Image": "https://static.toiimg.com/thumb/msid-82294722,width-1070,height-580,imgsize-119051,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "Saina, Srikanth's Olympic hopes threatened by Malaysia's travel ban", "Article's Text": "Saina Nehwal and Kidambi Srikanth\n\nNEW DELHI: Malaysia putting a temporary ban on flights from India may just prove to be the death knell for Kidambi Srikanth and Saina Nehwal's hopes of qualifying for this year's Tokyo Olympics .\n\nThe travel ban, which has been implemented in response to the worsening Covid-19 situation in India, has put doubts over whether the Indian contingent will be able to take part in the Malaysian Open , which will be held from May 25 to 30.\n\nThe tournament is the last major event in the Olympic qualification calendar which means that not being able to participate would prove to be the end of any chances that Srikanth or Saina have of making into the top 16 of the men's and women's Race to Tokyo rankings respectively. Srikanth is currently 20th on the standings while Saina is 22nd.\n\nThe Badminton World Federation , Badminton Association of Malaysia or the Badminton Association of India are yet to comment on to what extent the travel ban will affect the chances of Indians participating in the tournament.\n\nReigning world champion PV Sindhu , 2019 World Championships bronze medallist B Sai Praneeth and men's doubles pair Satwiksairaj Rankireddy and Chirag Shetty have the ranking that will earn them qualification to the Tokyo Olympics.\n\nIndians aspiring to qualify for the Games were earlier delivered a blow when the Indian Open, which was scheduled to be held in New Delhi from May 11 to 16, was postponed because of the surge in Covid-19 cases. New dates for the tournament are yet to be announced but it will no longer be an Olympic qualifier.\n\n"}, {"Article Image": "https://static.toiimg.com/thumb/msid-82294784,width-1070,height-580,imgsize-73832,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "Spotify CEO says he has 'secured funds' to buy Arsenal from owner Kroenke", "Article's Text": "Spotify CEO and founder Daniel Ek said on Wednesday that he has secured funds to test the resolve of Arsenal owner Stan Kroenke in a bid to buy the Premier League club from the American billionaire.\n\nKroenke and his son and director Josh put out a joint statement on Tuesday saying that they remain \"100% committed to Arsenal\" and were not interested in selling a stake in the club despite furious backlash from the fans.\n\nThousands of fans protested outside Emirates Stadium last week after the club's failed attempt to form a breakaway Super League with 11 other top European sides, leading Ek, an Arsenal fan of 30 years, to throw his hat in the ring to buy the club.\n\n\"I want to establish trust with fans and I want to engage the fans again,\" Ek told business channel CNBC.\n\n\"I'm very serious (about the offer to buy Arsenal). I have secured the funds for it and I want to bring what I think is a very compelling offer to the owners and I hope they hear me out.\n\n\"I certainly didn't expect that this would happen overnight and I'm prepared that this could be a long journey. All I can do is prepare what I think is a very thoughtful offer and bring it to them and hope they hear me out.\"\n\nArsenal, valued at $2.8 billion according to Forbes , were among six English clubs who signed up for the proposed European Super League project before withdrawing amid a storm of protest from fans, players and the British government.\n\nThe north London club are 10th in the Premier League standings and in the semi-finals of the Europa League .\n\n\n\nFacebook Twitter Linkedin EMail"}, {"Article Image": "https://static.toiimg.com/thumb/msid-82291245,width-1070,height-580,imgsize-169552,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "Jaydev Unadkat: Clarity of mind, plans has helped me, says Jaydev Unadkat", "Article's Text": "Jaydev Unadkat (PTI photo)\n\nNEW DELHI: Rajasthan Royals pacer Jaydev Unadkat said clarity of mind has helped him to make a good start to this IPL season and he wants to build on the momentum going forward.\n\nThe 29-year-old from Gujarat has so far snared four wickets in his three games this season.\n\n\"I feel I've had a good start. I've had clarity of mind and clarity of plans this season, something that has worked for me so far,\" Unadkat was quoted as saying in a release issued by his franchise on Wednesday.\n\n\"It is only a couple of games for me and is still early days, something I'm looking to build on as we move forward.\"\n\nRajasthan Royals will take on Mumbai Indians at the Feroz Shah Kotla ground here on Thursday in an afternoon game and Unadkat said the defending champions have always been a \"tough\" opponent.\n\n\"I think it'll be a good match. We've done well against them in the recent past and both teams I feel are evenly matched and have a lot of quality,\" said the left-arm pacer.\n\nRR has won two and lost three games so far in the tournament and Unadkat feels a couple of more wins will give them the momentum.\n\n\"It's been a decent start to the tournament for us. The first game was a narrow defeat, the second game was a good team display and a wonderful win for us,\" Unadkat said.\n\n\"We did sort of lose our way for a couple of games in between but now that we are back to winning ways, we'd like to continue this and build on this run.\n\n\"I personally feel that a couple more wins on the trot and we can get the right momentum going for us. We haven't had that sort of a run yet but I feel it's the right time for us to get back that momentum.\"\n\nUnadkat expects the Kotla track to be \"flatter\" and exuded confidence that Rajasthan have a balanced squad, which can do well in a variety of conditions.\n\n\"It'll be a good pitch. I guess the pitches are likely to be flatter, especially in the first few games here,\" he said.\n\n\"We have a balanced squad overall and I think adapting to new surfaces won't be a problem. We've got the squad to do well in a variety of conditions and surfaces.\"\n\n"}, {"Article Image": "https://static.toiimg.com/thumb/msid-82293358,width-1070,height-580,imgsize-177319,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "Tokyo 2020 organisers delay decision on local spectators until June", "Article's Text": "Overseas fans have already been barred and organisers had intended to set a domestic attendance limit this month. (AP photo)\n\nTOKYO: Tokyo Olympics organisers Wednesday said they won't decide how many spectators -- if any -- can attend the Games until June, as coronavirus surges raise fresh uncertainty.\n\nThey also announced athletes will have daily coronavirus tests, increased from an initial plan for tests every four days, as they firm up virus rules in a bid to build support for the postponed 2020 Games.\n\nWith less than three months until the opening ceremony, parts of the country including Tokyo are under a state of emergency following several spikes in infections.\n\nOverseas fans have already been barred and organisers had intended to set a domestic attendance limit this month.\n\nBut that has now been put back and a decision could come just a month before the opening ceremony on July 23.\n\n\"As we look into the evolving situation with the domestic infections status involving new strains, we have agreed that a decision regarding spectator capacity at the Olympic and Paralympic venues will be made in June,\" Olympic officials said after top-level talks Wednesday.\n\nMore details are expected soon on other virus rules for athletes as organisers update their \"playbooks\" for the Games.\n\nBut among those announced after the meeting was the daily test requirement for all athletes \"and those in close proximity... to minimise the risk of undetected positive cases\".\n\n\"We are ready with you to take all the necessary measures to minimise the risks to make the Japanese people feel safe,\" International Olympic Committee chief Thomas Bach said at the start of the talks.\n\n\"Our top priority is health and safety for everyone -- not only for the participants of the Olympic Games but, first and foremost, also of our gracious hosts, the Japanese people.\"\n\nWith the Games looming, Japan faces what some experts have called a fourth wave of the virus.\n\nA new state of emergency was imposed on Tokyo and three other areas on April 25, and the government's top medical advisor warned Wednesday that discussions should start soon on how the Games could be held if infections remain high by the summer.\n\n\"What's very important is the situation of the infections and how overwhelmed the medical system is,\" Shigeru Omi told parliament in response to a question from an opposition lawmaker.\n\n\"I think it is time to discuss the Olympics,\" he added, while stopping short of calling for either a postponement or cancellation.\n\nPolls show most Japanese oppose holding the Games this summer, backing either another delay or scrapping the event altogether.\n\nBut Olympic officials insist it can be held safely, with Tokyo 2020 chief Seiko Hashimoto last week saying that organisers are \"not thinking about cancellation\".\n\n\"There are so many people who are looking forward to the Games,\" she said on Wednesday.\n\n\"But, on the other hand, there are a lot of people who are anxious. That's the reality, and we need to look at both sides.\"\n\nOlympic chiefs took the unprecedented decision to ban overseas fans in March, in a bid to reduce virus risks.\n\nDomestic ticket sales have not yet resumed after last year's postponement. Organisers said around 4.48 million tickets had been sold in Japan, and nearly a million for the Paralympics .\n\nTickets purchased by overseas fans are being refunded, and organisers have also said that anyone who bought tickets in Japan is eligible for a refund if crowd numbers are cut.\n\n"}, {"Article Image": "https://static.toiimg.com/thumb/msid-82292789,width-1070,height-580,imgsize-218937,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "Virat Kohli remains static at 5th in T20I rankings, Mohammad Rizwan enters top-10", "Article's Text": "Virat Kohli (Getty Images)\n\nDUBAI: India captain Virat Kohli and senior opener KL Rahul maintained their fifth and seventh places respectively in the latest ICC's ranking for T20 batsmen.\n\nPakistan's Mohammad Rizwan made an entry into top-10.\n\nThe 28-year-old wicketkeeper-batsman's unbeaten knocks of 82 and 91 in the first and third matches have helped him gain five slots to reach 10th position, overtaking the likes of England captain Eoin Morgan and India opener Rohit Sharma .\n\nRizwan is the second-highest ranked Pakistan batsman in the list, only behind captain Babar Azam , who is now in third place.\n\nThe list is still topped by England's Dawid Malan with 892 points while Aaron Finch is placed second with 830 points.\n\nHowever India has no representation in the top-10 of either bowlers or all-rounder's list.\n\nIn the list of Test batsmen, Kohli is again placed fifth while Rohit Sharma is tied seventh at the moment.\n\nKane Williamson is still holding the pole position among Test batsmen while Pat Cummins (908) has a significant (48 points) lead at the top among bowlers over India's Ravichandran Ashwin (850).\n\nAmong Test all-rounders, Ravindra Jadeja is placed third with Ashwin a notch below. The list is topped By Jason Holder.\n\nEarlier, India captain Kohli had lost his top rank in ODI charts to his Pakistani counterpart Babar Azam.\n\n"}, {"Article Image": "https://static.toiimg.com/thumb/msid-82293181,width-1070,height-580,imgsize-119148,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "Sneakers from Michael Jordan's rookie season up for sale at Sotheby's", "Article's Text": "(AP Photo)\n\nGENEVA: A pair of red sneakers worn by NBA champion Michael Jordan in 1984-85, at the start of his Chicago Bulls career, is expected to fetch over $100,000 and possibly much higher at an online auction next month, Sotheby's said on Wednesday.\n\nThe auction house has estimated the red and white \"Air Jordan 1\" sneakers at 100,000-150,000 Swiss francs ($110,000-$164,000). Another pair, identical but bearing Jordan's autograph, was sold for $560,000 at an auction last year.\n\n\"They are obviously a pair of iconic design and something that really collectors focus on as one of the (Holy) Grails and one of the 'must-have' pieces,\" said Josh Pullan, managing director of Sotheby's global luxury division.\n\n\"We hope we see them fly,\" he told Reuters.\n\nBilled \"Gamers Only\", the sale will be the first Swiss auction devoted to sneakers. Jordan's shoes are the star lot among 13 pairs from former NBA stars including Kareem Abdul-Jabbar, Patrick Ewing, Stephen Curry and Scottie Pippen.\n\nJordan's shoes, of which one is a size 13 and the other 13.5, were designed by Nike 's creative director Peter Moore, Sotheby's said.\n\nJordan played 13 seasons with the Bulls, winning six championships, and is currently the owner of the Charlotte Hornets .\n\n\"There is a new generation of collectors, generally 20 to 30 years old, who are participating in the sneakers market, but we also see that often times, they are also collectors of contemporary art or even Old Masters,\" Pullan said.\n\n"}, {"Article Image": "https://static.toiimg.com/thumb/msid-82289676,width-1070,height-580,imgsize-542057,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "New Zealand cricketers may travel to UK for WTC final with Indian players: Players' union chief indicates", "Article's Text": "Virat Kohli and Kane Williamson (AFP Photo)\n\nAUCKLAND: New Zealand cricketers in the ongoing IPL might travel with the Indian Players for the World Test Championships final in June as they can't come back home and then depart for England due to strict quarantine protocols, the country's players' union chief has indicated.\n\nThe likes of captain Kane Williamson , Trent Boult, Kyle Jamieson and Mitchell Santner are among 10 New Zealand players in the different franchises of the IPL.\n\nNew Zealand has named a 20-member team for the two-match Test series in England starting on June 2 and the squad will be trimmed to 15 for the WTC final against India, starting on June 18 at Southampton.\n\n\"...they can't very well come home, do the two weeks isolation and then go to England, so they're going to have to be there (India) until the round-robin finishes, or the final series,\" NZ Cricket Players Association chief executive Heath Mills said when asked about the possibility.\n\n\"Then we've got other players who are coming home - logistically there's not a lot of flights. It's not easy to sort out the logistics. We're working closely with NZ Cricket and they're in touch with the BCCI and the ICC,\" Mills was quoted as saying by stuff.co.nz.\n\nNot all the 10 players in the IPL are in the New Zealand squad bound for England. Scott Kuggeleijn, Jimmy Neesham, Adam Milne, Finn Allen, Lockie Ferguson and Tim Seifert are not in the team.\n\nMills said New Zealand Cricket has been in close contact with the players, their respective IPL teams, the BCCI, ICC and also with the England and Wales Cricket Board.\n\nHe said the NZ players in the IPL are certainly anxious after the ban on flights from India in the wake of the unprecedented surge in COVID-19 cases, but no one has indicated any desire to return home. The flight ban, which began on April 11, ends Wednesday midnight.\n\n\"There's no doubt they're certainly anxious about what is happening in India and what they're witnessing,\" Mills said.\n\n\"Whilst they're anxious, they're ok. No one has indicated yet that they want to go home.\"\n\nMills said the players feel they are well looked-after by their IPL franchises and safe in their bio-bubbles.\n\n\"There's four teams in a hotel and the hotel is locked down. The challenge is when they transfer from city to city, then they need to put on the PPE gear and that's when they're probably most at risk.\n\n\"The players are in the safest place in India, in the team bubbles, which is the most important thing from my perspective.\"\n\nThere are seven support staff members from New Zealand in different IPL franchises.\n\nThey are Stephen Fleming (CSK head coach), Brendon McCullum (KKR head coach), Mike Hesson (RCB director of cricket), Shane Bond (MI bowling coach), James Pamment (MI fielding coach), Kyle Mills (KKR bowling coach), Chris Donaldson (KKR strength and conditioning).\n\n"}, {"Article Image": "https://static.toiimg.com/thumb/msid-82293063,width-1070,height-580,imgsize-138530,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "English cricket joins social media boycott over online abuse", "Article's Text": "The England and Wales Cricket Board will be joined by all 18 first-class counties and the MCC in boycotting the platforms. (Photo credit: ECB Twitter)\n\nLONDON: English cricket bosses announced on Wednesday they would join football's boycott of social media in a show of solidarity against racism and discrimination.\n\nA coalition of football organisations including the Football Association and Premier League revealed they would go silent on their channels from 1400 GMT on Friday until 2259 GMT on Monday.\n\nA number of high-profile footballers have been racially abused online in recent months, prompting calls for tougher action from social media giants.\n\nBroadcasters BT Sport and Talksport have announced they will be taking part in the protest along with Adidas, which manufactures more than a third of Premier League kits.\n\nThe England and Wales Cricket Board will be joined by all 18 first-class counties and the MCC in boycotting the platforms.\n\n\"As a sport, we are united in our commitment to fight racism and we will not tolerate the kind of discriminatory abuse that has become so prevalent on social media platforms,\" said ECB chief executive Tom Harrison.\n\n\"Social media can play a very positive role in sport, widening its audience and connecting fans with their heroes in a way that was never possible before.\n\n\"However, players and supporters alike must be able to use these platforms safe in the knowledge they do not risk the prospect of facing appalling abuse.\"\n\nThe weekend's boycott, also being implemented by the Lawn Tennis Association, follows social media blackouts by Swansea, Birmingham and Rangers football clubs in recent weeks.\n\nGerman Bundesliga club Hoffenheim said on Monday they would also be joining the boycott.\n\n"}, {"Article Image": "https://static.toiimg.com/thumb/msid-82291909,width-1070,height-580,imgsize-68035,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "CSK vs SRH Live Score, IPL 2021: Warner, Pandey steady SRH after Bairstow dismissal", "Article's Text": "LIVE NOW\n\nCSK vs SRH Live Score, IPL 2021: Warner, Pandey steady SRH after Bairstow dismissal\n\nSunrisers Hyderabad have brought in Sandeep Sharma and Manish Pandey in place of Abhishek Sharma and Virat Singh. For Chennai Super Kings, Lungi Ngidi and Moeen Ali are back in place of Dwayne Bravo and Imran Tahir. Stay with TOI to get IPL live score, playing 11, scorecard, highlights and ball by ball score updates of 23rd IPL match between Chennai Super Kings and Sunrisers Hyderabad"}, {"Article Image": "https://static01.nyt.com/images/2021/04/27/sports/27ncaa-emmert/27ncaa-emmert-facebookJumbo.jpg", "Article's Title": "N.C.A.A. Extends President’s Contract Amid Turmoil in College Sports", "Article's Text": "Emmert, a veteran university administrator, became the N.C.A.A.’s president in 2010. But while Emmert has come under sustained criticism, the board’s decision to renew his contract will assure some stability atop the N.C.A.A.\n\nJust last week, the White House said that President Biden had decided to nominate Donald M. Remy, the N.C.A.A.’s second-ranking executive, to serve as the deputy secretary of veterans affairs. Several other executives have also left the N.C.A.A. or its Washington lobbying operation in recent months.\n\nAll the while, questions have swirled over how long Emmert might remain in his job, for which he earned more than $2.6 million in 2018, the most recent year for which the association’s tax returns were publicly available. Even though Emmert has frustrated and outraged a mix of conference commissioners, athletic directors, players, coaches and fans, he has remained a favorite of board members, some of whom have recently expressed unqualified support for him.\n\nNow he will have to try to steer the N.C.A.A. through one of the most consequential periods in its history. Beyond the defiance from statehouses around the issue of athletes’ ability to benefit from the use of their names, images and likenesses, the Supreme Court is considering the N.C.A.A.’s appeal in a crucial antitrust case, with a ruling expected in the coming months."}, {"Article Image": "https://static01.nyt.com/images/2021/04/28/sports/27nhl-turner-print/27nhl-turner-web-1-facebookJumbo.jpg", "Article's Title": "N.H.L. and Turner Sports Reach 7-Year Media Rights Deal", "Article's Text": "The N.H.L. solidified its future on television and multimedia platforms in the United States on Tuesday with the announcement of a second broadcast rights deal that will take effect after its agreement with NBC expires after this season.\n\nTurner Sports made a seven-year commitment, matching the length of the contract the Walt Disney Company, which owns ESPN and ABC, signed with the N.H.L. in March. The networks, including TBS and TNT of Turner, will begin broadcasting games in the 2021-22 season and continue through the 2027-28 campaign.\n\nThe specific terms of the deal with Turner Sports, a division of WarnerMedia, were not disclosed, but Turner will pay north of $225 million per year, according to a person familiar with the agreement who was not authorized to speak publicly.\n\nThe sum from the two deals represents more than double the approximately $300 million that the N.H.L. had been receiving from NBC and ESPN, which had been paying $100 million for various rights — including the ability to show games on its streaming service — before last month’s deal."}, {"Article Image": "https://static01.nyt.com/images/2021/04/28/sports/28marcelo1/28marcelo1-facebookJumbo.jpg", "Article's Title": "Real Madrid’s Marcelo May Miss Chelsea Game for Election Duty", "Article's Text": "Real Madrid could be without one of its best defenders for a semifinal match in the Champions League next week because he was randomly selected to work a shift at the polls during local elections in Madrid.\n\nMarcelo, a fullback who started the first leg of Real Madrid’s semifinal against Chelsea on Tuesday in Spain, was randomly selected by the Spanish government to work at the polls on May 4, when there will be elections for seats in the Madrid Assembly, El Mundo reported. A second Madrid player, Victor Chust, was also selected, but is injured and will not be missed by the team.\n\nAll registered voters in Spain are eligible to be randomly selected to work at the polls. Though Marcelo, 32, was born in Brazil, he has played for Real since 2007 and has been a Spanish citizen for a decade.\n\nSpanish law allows for exemptions, which may be given for “professionals who must participate in public events to be held on the voting day that are scheduled before the electoral call when the party cannot be replaced and his nonparticipation forces suspension of the event, producing economic damages.”"}, {"Article Image": "https://static01.nyt.com/images/2021/04/23/sports/00nhl-panthers/00nhl-panthers-facebookJumbo.jpg", "Article's Title": "The Florida Panthers Are Winning, Both On and Off the Ice", "Article's Text": "He continued to tinker at the trade deadline, landing forward Sam Bennett in a deal with Calgary. Bennett made an immediate impact, with five points in his first three games.\n\nWhen Zito was hired, he also asked the organization to invest in building out his staff. The extensive group of new hires included three executives with past experience as N.H.L. general managers — Rick Dudley, Les Jackson and Paul Fenton.\n\nWhile some teams had cut back amid the pandemic — at least 17 of the 31 N.H.L. teams had reduced pay in their hockey operations by September 2020 — the Panthers saw a chance to add, Caldwell said.\n\nThe organization has also hired former players into management roles.\n\nAfter he retired at the end of the 2018-19 season, goalie Roberto Luongo was named special adviser to Zito’s predecessor, Dale Tallon.\n\nSince then, his management career has advanced rapidly. Last week, he assumed Canada’s general manager role for the men’s world championship scheduled for next month in Latvia, and he’ll be an assistant general manager for Team Canada for the 2022 Games.\n\nThis season, Zito and Luongo have collaborated to establish a goaltending excellence department. The objective is to create a consistent approach to instruction and support for all of the netminders in the organization, from their earliest days as prospects through the minor leagues and to the N.H.L.\n\nBefore becoming an N.H.L. executive, Zito was a player agent. His clients included the star goalies Tim Thomas, Tuukka Rask and Antti Niemi."}, {"Article Image": "https://static01.nyt.com/images/2021/04/27/sports/27draft-h2w-1/27draft-h2w-1-facebookJumbo.jpg", "Article's Title": "How to Watch the 2021 N.F.L. Draft", "Article's Text": "The guessing will soon be over.\n\nAfter months of projections and rumors, the N.F.L. draft begins with the first round on Thursday, and with it comes a chance for all 32 teams to add new talent to their rosters. The coronavirus pandemic altered this year’s player evaluation process, but the end result will remain the same: More than 200 college players will formally be welcomed into the league during the three-day spectacle. Here’s what you need to know about it.\n\nWhat time is the draft?\n\nThe first round of the N.F.L. draft starts Thursday at 8 p.m. Eastern time.\n\nESPN, ABC and NFL Network will broadcast the event. It can be streamed through services like Hulu, Sling TV, fuboTV and the ESPN and N.F.L. apps.\n\nWhere is the draft?\n\nUnlike in 2020, it won’t be held in N.F.L. Commissioner Roger Goodell’s basement. The league. will convene in Cleveland this season for a hybrid model — some remote segments, some in-person — after Covid-19 forced the league last year to conduct the ceremonies virtually.\n\nThirteen prospects will be on site to hug a vaccinated Goodell, if they so choose, after he calls their names. Others, including the presumed No. 1 pick Trevor Lawrence, a quarterback out of Clemson, will participate remotely. The N.F.L. also organized in-person musical performances and other events for fans in attendance."}, {"Article Image": "https://www.thehindu.com/sport/football/orh8c6/article34426680.ece/ALTERNATES/LANDSCAPE_615/image-7", "Article's Title": "UEFA Champions League | Benzema volley pegs back Chelsea to leave semi-final in the balance", "Article's Text": "Eden Hazard was given 24 minutes off the bench against his former club but despite some twinkling touches, he was unable to add a late twist\n\nKarim Benzema came to Real Madrid's rescue again on Tuesday, his acrobatic volley earning them a 1-1 draw against an impressive Chelsea side in the first leg of the Champions League semi-final.\n\nChristian Pulisic grabbed Chelsea an away goal in a soaking wet contest at Valdebebas but Madrid will be satisfied too, after recovering from a chastening opening half an hour before Benzema's brilliance left the tie in the balance.\n\nEden Hazard was given 24 minutes off the bench against his former club but despite some twinkling touches, he was unable to add a late twist.\n\nBy the time the Belgian entered the contest, it was drifting, the early adrenaline lost, with both teams seemingly content to defer to the return leg at Stamford Bridge next Wednesday.\n\nBenzema's goal was his 71st in the Champions League, making him the joint-fourth top scorer in the competition's history with Raul, behind only Cristiano Ronaldo, Lionel Messi and Robert Lewandowski.\n\nWhen Real Madrid were suffering, and in the absence of Sergio Ramos, who was shouting from the stands, Benzema was the one dragging his team back into this match, at times through sheer force of will.\n\nWith Chelsea's Timo Werner still struggling for confidence, and missing good chances again here, the Frenchman's precision at the other end could yet prove the difference.\n\nThese two teams were both among the Super League's 'Dirty Dozen', with Madrid president Florentino Perez, the face and voice of the breakaway project, watching on at the Alfredo di Stefano Stadium.\n\nDespite stirring scenes of protests outside Premier League stadiums last weekend, Real Madrid's - admittedly remote - training ground was untouched by any sign of discontent with the club.\n\nAnd there was no Real Madrid revolt against UEFA either, with the Champions League anthem ringing out as normal and the stadium announcer loyally declaring: \"The UEFA Champions League brings together the best teams in Europe.\"\n\nChelsea were electric in the first half an hour, their passing slicker and their movement quicker than Madrid, who were unable to keep up.\n\n- Werner misses sitter -\n\nWerner should have scored when Mason Mount's clipped ball to the back post was headed across by Pulisic but he missed from six yards, his volley blocked by the right leg of Thibaut Courtois.\n\nBut Chelsea's dominance was such that another chance never felt far away, in the 14th minute Pulisic taking advantage.\n\nAntonio Rudiger was given time to float a delightful ball over the top for the darting American, whose first touch took him left but he recovered his poise, nipping past Courtois and firing between Marcelo and Raphael Varane on the line.\n\nChelsea were rampant but as the rain began to pour, Madrid found a way back. Benzema led the resistance, one shot from distance shaving the post before another from close drew Madrid level.\n\nA short corner worked its way to Marcelo on the edge of the area and his cross was headed back in via Casemiro and Eder Militao. Benzema, with his back to goal and surrounded by blue shirts, tamed the ball with his forehead before throwing his body into the air and volleying in before his markers could react.\n\nMarcelo and Jorginho were both guilty of sloppy passes early in the second half but neither Werner nor Benzema could capitalise.\n\nAnd for 20 minutes the game drifted, both sides nervous of opening up. Four substitutes came on just after the hour, Hazard and Kai Havertz among them.\n\nHazard was making his third appearance in three months.\n\nBut Benzema's shot was blocked, Hakim Ziyech's free-kick curled into the hands of Courtois and a late Madrid cross flashed past the far post. A draw was a fair result."}, {"Article Image": "https://static01.nyt.com/images/2021/04/27/sports/27mlb-roundup-kluber/27mlb-roundup-kluber-facebookJumbo.jpg", "Article's Title": "Corey Kluber ‘Set the Tone’ in Win Over Orioles", "Article's Text": "BALTIMORE — Corey Kluber got his first win in two years, Kyle Higashioka homered again as he gains playing time from Gary Sanchez and the Yankees beat the Baltimore Orioles, 5-1, Tuesday night.\n\nAaron Judge and Giancarlo Stanton also homered — the Yankees are 9-0 when they go deep in the same game, including the playoffs. The Yankees stopped a four-game skid at Camden Yards and at 10-13 moved into a tie with the Orioles for last in the A.L. East.\n\n“Corey set the tone,” Yankees Manager Aaron Boone said. “Obviously, he threw the ball really well and was in command most of the night. I thought our offense did a lot of really good things. We still didn’t breakthrough with a lot of runs, but we’ll certainly take five.”"}, {"Article Image": "https://static01.nyt.com/images/2021/04/28/sports/28derby-carmouche1-print/28derby-carmouche-facebookJumbo.jpg", "Article's Title": "Running for the Roses, the Record Books and His Father", "Article's Text": "Kendrick Carmouche’s education began when he was a little boy sitting alongside his father as they drove in the pre-dawn mist through southwest Louisiana. They talked balance, pace and soft hands. They talked horses.\n\nSylvester Carmouche was a jockey. A good one.\n\nHe won nearly 700 races at big-time tracks like the Fairgrounds in New Orleans and Louisiana Downs near Shreveport. As Kendrick was growing up, however, the Carmouches were vagabonds, traveling to bush tracks cut from sugar-cane fields and fronted by honky-tonks with names like The Quarter Pole and Cajun Downs.\n\nSylvester Carmouche had lost his license to ride at the sanctioned racetracks after pulling an audacious, ill-advised stunt during a fog-shrouded race. But Kendrick Carmouche — who on Saturday will try to become the first Black jockey in 119 years to win the Kentucky Derby — never thought of his father as “The Fog Jockey,” as many others did. He thought of him as a Ph.D. in horse racing and as the “Pops” who took him everywhere and taught him everything.\n\nHe still does. And he says that before he gets a leg up on a colt named Bourbonic for the Derby, he will hug his father and thank him for making him the jockey and the man that he is today."}, {"Article Image": "https://www.thehindu.com/sport/cricket/grv5ps/article34429045.ece/ALTERNATES/LANDSCAPE_615/NUWAN-ZOYSA", "Article's Title": "Former Sri Lankan cricketer Nuwan Zoysa banned for 6 years for trying to fix matches", "Article's Text": "The ban on the left-arm seamer, is backdated to October 31, 2018, when he was provisionally suspended.\n\nFormer Sri Lanka seamer and coach Nuwan Zoysa was on Wednesday banned from all cricket for six years after being found guilty of trying to fix matches and failing to disclose corrupt approaches from a suspected Indian bookie.\n\nThe ban on Zoysa, a left-arm seamer, is backdated to October 31, 2018, when he was provisionally suspended.\n\n\"In his role as a national coach, he should have acted as a role model. Instead, he became involved with a corrupter and attempted to corrupt others,\" Alex Marshall, ICC General Manager – Integrity Unit said in a release.\n\n\"Contriving to fix a game betrays the basis of sporting principles. It will not be tolerated in our sport.\" The 42-year-old, who played 30 Tests and 95 ODIs for Sri Lanka, was originally charged in 2018 after his stint as bowling coach of Team Sri Lanka in a T10 tournament organised in the UAE in 2017.\n\nIn its full judgement, the ICC said Zoysa was introduced to the Indian suspect in Colombo in 2017 during his time as Sri Lanka A's bowling coach.\n\nAfter a few interactions, the former bowler became aware that the man, referred to as Mr W in ICC documents, \"was involved in fixing matches, or aspects of matches\" and wanted to have Zoysa on board because, \"as a coach he knew players and would be able to get them to fix matches\".\n\n\"At (Mr W)'s request, Mr Zoysa approached (Player A) late in 2017 and asked him whether, in connection with Sri Lanka's then upcoming series against Bangladesh and/or Zimbabwe, he would be willing to give away 12-15 runs in an over while bowling, or to get out deliberately when batting,\" the ICC judgement said.\n\n\"Mr Zoysa told (Player A) that he could get good money if he under-performed in this way. (Player A) immediately refused that approach and told Mr Zoysa that he wouldn't agree to do that,\" it added.\n\nFollowing full hearings and arguments, the Tribunal found Zoysa guilty of breaching articles relating to trying to fix matches, enticing others to breach the code of conduct and failing to report approaches by corrupt individuals.\n\nZoysa was also charged by the ICC on behalf of the Emirates Cricket Board for breaching three counts of their ECB Anti-Corruption Code for the T10 League and these proceedings are ongoing.\n\nHe had worked as a bowling coach of Sri Lanka A team in the past.\n\nZoysa is the latest in a long line of Sri Lankan cricketers who have been banned by the ICC for corruption.\n\nEarlier this month, former pacer Dilhara Lokuhettige was banned from all cricket for eight years after being found guilty of breaching the ICC Anti-Corruption Code.\n\nIn 2019, Sanath Jayasuriya was banned for failing to co-operate with an Anti-Corruption Unit (ACU) investigation.\n\nIn 2016, former Sri Lanka offspinner Jayananda Warnaweera was suspended under the code."}, {"Article Image": "https://www.thehindu.com/opinion/columns/69mh9r/article34425148.ece/ALTERNATES/LANDSCAPE_615/viratkb", "Article's Title": "Millions of reasons why the IPL needs to rethink priorities", "Article's Text": "How many of us can watch the IPL without revulsion and guilt? Revulsion, at the insensitivity of continuing with a tournament amidst the pain and suffering in the country. And guilt at contributing, in whatever measure, to its profits by watching it on television.\n\nIt is easy to confuse IPL with sports, but it is in fact a highly leveraged television serial ideal for selling products where people happen to play a version of a popular game. And television is unlikely to put its golden goose to sleep. There is another month to go — a month when there will be more cases, more deaths and greater anxiety, all matched by the triumphalism and crassness of the tournament being played in a bubble — in more senses than one. What price the 78-metre six or the fast yorker that hits middle stump when around you people are dying in horrific ways and hope is being sucked out of so many lives?\n\nMeaningless activity\n\nSport is essentially a meaningless activity which we infuse with significance in normal times. Its artificiality allows us to pour into it the highest qualities we aspire to as human beings: compassion, honesty, fair-mindedness, kindness, respect, empathy, charity, everything that elevates us. But when it displays instead selfishness, indifference, and a lack of concern for the suffering of others, then it is no longer sport, but something that diminishes us.\n\nPublic celebration (admittedly in near-empty stadiums), pointless statistics and excited commentary make it all so surreal. Even the ‘official’ figures of the dead and suffering in India are frightening. Over a million people are affected every three days. These are now widely believed to be grossly under-counted. To adapt what Bob Dylan said all those years ago: How many deaths will it take till they know that too many people have died?\n\nHospitals are overcrowded, crematoriums too; there is a national medical emergency, yet ‘maximums’ are being hit on the cricket fields. There is something repugnant about this.\n\nTeams have arrived in the Capital — surely someone noticed during the drive from the airport that things aren’t normal? That the smoke rising in the distance is not announcing the election of a new pontiff, but the desperation of citizens?\n\nDistraction\n\nThe yea-sayers will insist the IPL is a distraction in troubled times. Yes it is a distraction — from the ineptitude of the authorities who hope that if they close their eyes long enough, the situation will get better. In any case, neither the three-and-a-half lakh people who contract the virus daily nor their struggling families are likely to be interested how many deliveries Virat Kohli took for his latest fifty. Football, said the coach Bill Shankly, is not a matter of life and death, it is more serious. The IPL sees itself as more serious too.\n\nA friend sent me this prediction recently: “After playing on and being absolutely silent through the suffering, once the IPL is done, the players and managements will talk of how their heart bleeds and how they will now generously open their purses, via a collective cheque handed over to PM and his fund by Ganguly (since Jay Shah will be too obvious), the pictures being discussed for hours on end in sections of the media, followed by tweets from Sachin, Virat, et al.”\n\nThe Australian Pat Cummins became the first player known to make a donation, with 50,000 dollars towards oxygen supplies to hospitals in India. “I encourage my fellow IPL players to contribute,” he tweeted. It will be interesting to see how many will.\n\nIts own insurance\n\nSome players, most recently India’s R. Ashwin, have pulled out, citing personal reasons. The Board of Control for Cricket in India does not see the IPL as a mere cricket tournament. It is a weapon to hold over the heads of players and other cricket boards. Displease the BCCI and there goes your income for the cricketing year! However much individual boards might like to recall their players during the crisis, it is unlikely any of them will do so. The players are only too aware which side their bread is buttered on, and grateful they can earn significant amounts of money when many avenues have dried up. The IPL is its own insurance.\n\nPerhaps if players like Kohli and Rohit Sharma decided to withdraw, there might be a cascading effect. But not everyone would want to take on the BCCI, so perhaps not.\n\nThe IPL has its place in the scheme of things. In normal times, you have the option of turning off the TV if you don’t fancy it. But it’s different now. Turning off the TV will not turn off the feeling of the inappropriateness of its rude health and larger-than-life images being beamed across homes in India when the country is struggling with both health and life."}, {"Article Image": "https://static01.nyt.com/images/2021/04/28/sports/28olympics-playbooks01/28olympics-playbooks01-facebookJumbo.jpg", "Article's Title": "Olympics Lays Out Ground Rules for Games: Daily Tests and Dining Restrictions", "Article's Text": "TOKYO — Athletes will be tested daily, but they will not need to quarantine. Visitors will be asked to stay off public transit. And members of the news media, along with other officials, will be urged to eat takeout meals alone.\n\nHoping to assuage a Japanese public jittery about the possibility that the rescheduled Summer Olympics could turn into a Covid superspreader event, organizers of the Games released a second round of so-called playbooks on Wednesday, with updated protocols for those taking part in the world’s largest sporting event this July.\n\nEven without overseas spectators, whom organizers barred from the Games last month, tens of thousands of people will enter Japan this summer after nearly a year in which the country’s borders have been mostly closed to nonresidents. In several public polls in Japan, a majority said they would prefer the Olympics be postponed again or canceled altogether, and some public health experts have questioned whether the Games are safe to stage under current pandemic conditions.\n\nThe new rules were unveiled after a meeting between leaders of the International Olympic Committee, the International Paralympic Committee, the Tokyo organizers, Tokyo’s metropolitan government and the government of Japan. In opening remarks, Thomas Bach, the I.O.C. president, said the revised protocols were “based on the best scientific and medical expertise” and the experience of hundreds of sports events over the last year, involving thousands of athletes."}, {"Article Image": "https://static01.nyt.com/images/2021/04/28/sports/27draft-needs1-print/27draft-needs1-facebookJumbo.jpg", "Article's Title": "2021 N.F.L. Draft: Trades Hint at Team Needs", "Article's Text": "The top of the N.F.L. draft quaked late last month when the Miami Dolphins, the San Francisco 49ers and the Philadelphia Eagles swung what amounted to a three-team trade. The bottom of it shuddered on Friday when the Baltimore Ravens acquired another first-round pick.\n\nIn March, the Dolphins sent the No. 3 pick in the draft to San Francisco for the No. 12 pick this year, first- and third-round picks in 2022 and a first-round pick in 2023. Then they shipped the No. 12 pick and a fourth-rounder this year and a first-rounder in 2022 to the Eagles, who gave Miami the No. 6 pick and a fifth-round selection.\n\nThose teams have not tipped off their draft targets — though 49ers Coach Kyle Shanahan faces questions nearly every day about his team’s quarterback position — but here are their needs ahead of Thursday night’s first round:\n\nNo. 3 Pick: San Francisco 49ers (From Miami)"}, {"Article Image": "https://static01.nyt.com/images/2021/04/25/sports/25draft-qbs/25draft-qbs-facebookJumbo.jpg", "Article's Title": "2021 N.F.L. Draft: After Trevor Lawrence, Pick Another Quarterback", "Article's Text": "There is no drama as to who will be the No. 1 pick in this year’s N.F.L. draft. The only question had been which team would get the chance to draft Clemson quarterback Trevor Lawrence. The Jacksonville Jaguars secured that honor by way of the Jets’ seemingly not understanding that they were supposed to keep losing.\n\nSo with the knowledge that Lawrence, a Peyton Manning-like sure thing of a quarterback prospect, is going to Jacksonville to be paired with Coach Urban Meyer in a college-meets-pros marriage, here is a look at the other four quarterbacks likely to go in the top 10 of this year’s draft, which will begin on Thursday with the first round held in Cleveland.\n\nZach Wilson: The Gunslinger"}, {"Article Image": "https://www.thehindu.com/news/cities/chennai/t0316a/article34429912.ece/ALTERNATES/LANDSCAPE_615/MPCSK1", "Article's Title": "IPL 2021: Business nosedives for Chepauk’s famous sports stores without spectators", "Article's Text": "Amid a raging pandemic and voices of dissent, the IPL continues. However, there is a slightly stranger case to be made for the people and businesses that depend on cricket...\n\nPublic disquiet over IPL games continuing to be held whilst bodies pile up at crematoriums across the country has been growing louder on social media. Cricket diehards will not make that case, however; they call it “a distraction” amid the din.\n\nNevertheless, it has been a strange season off the pitch, especially for the over two dozen sports good stores on Wallajah Road, which leads to the MA Chidambaram Stadium in Chepauk. The road and the insides of these stores, much like the galleries at the stadium, are deserted these days.\n\nNo demand\n\nSyed Shahbaz of Dhoni Sports, one of the prominent sporting good stores on Wallajah Road, says, “We did think at the start of this year that we would be able to cope when the IPL season started. But our calculations went wrong. Compared to 2019, I think we have only been able to do 10-20% of the numbers [of sales]. What’s worse is that even our foreign orders have gone down to nil since lockdown last year.”\n\nSyed Shahbaz | Photo Credit: Special Arrangement\n\nHe adds: “Friday, Saturday and Sunday are usually the days when business is at its peak but the store is almost always empty now.”\n\nLast year, when the first national lockdown was enforced, there was a surge in demand for indoor games. Even though it meant sales of cricket bats and accessories of other outdoor sports went down, retailers like Syed were only too happy to meet the demand. “People used to buy carrom and chess boards like crazy and we were running out of stock constantly. This year, we have the stocks but there is no demand,” he says.\n\nFor Mohammed T Vakharia, partner in Tamil Nadu Sports Emporium, another sporting goods store on Wallajah Road, the items that he has been selling of late are related to physical fitness: “Dumbbells, rods, plates, resistance bands,” he says, as row-upon-row of unsold cricket bats and other sports accessories deck the wall behind him.\n\nMohammed T Vakharia | Photo Credit: Special Arrangement\n\n“We used to sell to Government agencies and educational institutes too. Even that has dried up now because nobody is holding corporate tournaments,” he says, adding that more than IPL, it is the lack of amateur sporting action that is hitting retailers like him hard. “The cricket fever actually picks up when an event like IPL or the World Cup concludes.”\n\nHowever, total lockdown on Sundays dents such hopes since it is on this day when most amateur cricketers in the city usually gather for a game or tournament. Still, people like Ajay S find a way to satiate their passion. “I have moved my matches to Saturdays now. Anyway, most people are still working from home, and so we are able to find time off [to play],” says Ajay.\n\nCheering from home Saravanan Hari is a well-known superfan among Chennai Super Kings supporters. The man who goes so far as to paint himself yellow for CSK games too is playing safe this year. In a video he posted to his Twitter account, he says: “Some seem to think that they may not catch the virus. I know what COVID-19 does to people. I managed to recover from it but it wasn’t easy. So, stay home and stay safe.” In another video, Saravanan can be found waving the yellow flag inside his home and showing support for his favourite IPL team.\n\nThat is not however the case with Anandakrishnan S; it was only recently that he had formed a motley crew team of 30-somethings to play cricket tournaments on the weekend. The survival of this team — ironically named Survivors — is up in the air, he admits. “We had just started practising regularly and preparing for tournaments before the lockdown happened. Now if people can’t get together for another month or so, I fear all that effort will go to waste,” he says.\n\nIn any case, he has a backup plan. “We can always play underarm cricket in my apartment parking lot. Every Sunday evening, a few of us gather to play, including my grandfather and uncle. When they relax Sunday lockdown restrictions, we can play again, and after everyone is vaccinated... we may all even be able to go back to normal,” he adds, hopefully."}, {"Article Image": "https://static01.nyt.com/images/2021/04/28/sports/28nba-stein-westbrook-1/28nba-stein-westbrook-1-facebookJumbo.jpg", "Article's Title": "Russell Westbrook Makes Triple-Doubles Look Easy. They’re Not.", "Article's Text": "It’s true that this front office will ultimately be judged on its ability to sign or trade for at least one certifiable star to pair with Randle, which means persuading an established player to embrace the challenge of playing in New York as heartily as Randle did. Rose and his management team also have to brace for ongoing second-guessing about their first draft pick if the rookie guard Tyrese Haliburton continues to blossom in Sacramento, since they could have drafted Haliburton at No. 8 rather than Obi Toppin.\n\nThe Rose regime, though, has done many good things in its first year. The Knicks appear to have hired the right coach in Tom Thibodeau, helped usher Randle to All-Star status and can point to promising development from RJ Barrett and the rookie Immanuel Quickley to offset the injuries that have derailed Mitchell Robinson’s third season.\n\nThere have been whispers for weeks that the Knicks’ flirtation with the East’s No. 4 seed has helped restore their reputation to the point that star players are finally prepared to consider them a destination franchise again. If that proves true, they will have multiple pathways to address the concerns you raised, whether it’s by trying to sign a savvy former All-Star like Kyle Lowry or DeMar DeRozan on a short-term deal as a bridge to free-agent classes more star-laden than this summer’s, or by using future draft picks (perhaps packaged with Toppin) to construct a meaningful trade.\n\nThings could always go askew if the Knicks rush into the wrong deal, as they have been known to do over the years, or if the team’s owner, James L. Dolan, decides he needs to get involved after abiding by the organization’s plan to let Thibodeau and on-court results do all the talking. But I would say that the Knicks have certainly earned a grace period through the end of this surprising season. This is a time for Knicks fans, surely, to revel in what’s going right.\n\nQ: Do they really get the Oscar itself? Kobe Bryant was very involved in co-creating his film, which is why he was given an Oscar. Executive producers frequently provide financing and aren’t involved as hands-on producers. In any case, good for them. — @FromMeadows from Twitter\n\nStein: In my exuberance Sunday night, I tweeted that Kevin Durant, Mike Conley Jr. and Rich Kleiman, Durant’s business manager, joined Bryant as Oscar winners from the N.B.A. because they were listed as executive producers for “Two Distant Strangers,” which won the best live action short film category at Sunday’s Academy Awards. That’s incorrect.\n\nThey were part of an Oscar-winning film, but did not get awards themselves. Kobe took home an Oscar trophy in 2018 for the animated short film “Dear Basketball,” which was based on a poem Bryant wrote in 2015 to announce his retirement at the end of the 2015-16 season."}, {"Article Image": "https://www.thehindu.com/sport/cricket/xk3msp/article34428162.ece/ALTERNATES/LANDSCAPE_615/----CRICKETASUTRALIA-TOUR-IN-INDIA2ND-ODI", "Article's Title": "Pulled out of IPL 2021 for mental health, says Adam Zampa", "Article's Text": "It's definitely a financial sacrifice, says the Australian crickter who played for Royal Challengers Bangalore\n\nAdam Zampa cut his Indian Premier League season short to prioritise mental health over money, the Australia spinner said, amid a surge of COVID-19 cases in India.\n\nZampa is one of three Australian cricketers to pull out of the lucrative Twenty20 tournament which has ploughed on despite the steepening health crisis in the south Asian nation.\n\nThe 29-year-old, who plays for IPL side Royal Challengers Bangalore (RCB), said a confluence of factors had led to his withdrawal but he ultimately decided the extra pay was not worth the risk for his wellbeing.\n\n\"I feel like for anyone leaving halfway through a tournament, it's definitely a financial sacrifice,\" he said in comments published Nine Network newspapers.\n\n\"But from my point of view I wanted to put my mental health first.\n\n\"Obviously the COVID situation over here is pretty dire. I just felt, rocking up to training and stuff, obviously, I wasn’t playing in the team as well, I was going to training and I wasn't finding the motivation.\n\n\"(There were) a few other things like bubble fatigue and the chance to get home, once all the news broke about the flights and everything. I thought this was the best time to make the call.\"\n\nThe two other Australian cricketers who headed home were Kane Richardson, who plays for RCB, and Andrew Tye, who was with the Rajasthan Royals.\n\nAustralia on Tuesday suspended direct flights from India until at least May 15 to prevent more virulent COVID-19 strains entering the country.\n\nThe nation's cricketers will not be allowed to jump the queue for repatriation flights when they resume, Australian Prime Minister Scott Morrison said.\n\nDozens of Australians remain involved in the tournament as players, coaches, officials and commentators.\n\nThe regular IPL season ends on May 23, with playoffs to follow before the final on May 30.\n\nGoverning body Cricket Australia said in a statement late on Tuesday it would continue to \"liaise\" with the Australian government and monitor the situation."}, {"Article Image": "https://www.thehindu.com/sport/cricket/wozhte/article34428461.ece/ALTERNATES/LANDSCAPE_615/vbk-Todd-Greenberg-twitter", "Article's Title": "Australian players’ union chief says chartered flight for Oz players after IPL under consideration", "Article's Text": "Australian Cricketers’ Association (ACA) chief Todd Greenberg said Cricket Australia will talk to the IPL franchise owners on this arrangement but conceded that it will not be a simple thing\n\nA chartered flight to bring back Australian cricketers after the IPL in India is under consideration, the country’s players union said on April 28 even as Sports Minister Richard Colbeck made it clear that such a move has not yet been cleared by the government down under.\n\nAustralian Cricketers’ Association (ACA) chief Todd Greenberg said Cricket Australia will talk to the IPL franchise owners on this arrangement but conceded that it will not be a simple thing.\n\n“That’s one of the conversations we’re having with Cricket Australia at the moment about whether or not that’s something that’s available to us,” Greenberg said on 2GB radio as quoted by ‘Sydney Morning Herald’.\n\n“We can also work with all the owners of the Premier League franchises who are effectively contracting the players. There’s certainly a conversation to be had about that,” he added.\n\n“They’re not simple things to organise, as you’d imagine. If we can try to find a seamless approach to get them home safely that’s something between us and CA and our players that we’ll work on.” The BCCI has already assured the IPL’s foreign recruits that their safe return home will be its responsibility once the tournament ends on May 30. India is facing an explosion of COVID-19 cases and the nation’s health infrastructure has been severely strained dealing with lakhs of daily new cases.\n\n“Be rest assured that the tournament is not over for BCCI till each one of you has reached your home, safe and sound,” the Indian Board’s COO Hemang Amin said on April 27 in a letter addressed to the players.\n\nAny such chartered flight would require the approval of the Australian government and Colbeck said no decision has been taken on this matter as yet.\n\n“There aren’t any decisions that have been made yet with respect to [approval for a charter flight for] the cricketers,” Colbeck told ABC radio.\n\n“One of the reasons for the pause was to give our hotel quarantine a little bit of space because of the load we’ve seen out of India,” he said.\n\nAs a second wave of COVID-19 infections battered India, the Australian government on April 27 suspended air travel with the country besides asking players to make their “own arrangements” for return.\n\nEven before that announcement, the fear of being locked out drove the likes of Andrew Tye to take an early flight back to Australia along with Kane Richardson and Adam Zampa.\n\nMumbai Indians’ Australian batsman Chris Lynn had also said that he hoped Cricket Australia to arrange a chartered flight for those who have stayed back.\n\nAs of now, the IPL still has 14 Australian players, including big names like Steve Smith (Delhi Capitals), David Warner (SunRisers Hyderabad) and Cummins.\n\nRicky Ponting (DC) and Simon Katich (Royal Challengers Bangalore) are among the high-profile Australian coaches, while iconic former players such as Matthew Hayden, Brett Lee and Lisa Sthalekar are part of the tournament’s commentary team.\n\nThe ACA chief, however, said that the players will not ask for any preferential treatment and jump the queue if and when the Australian government evacuates its citizens from India. About 9,000 Australians are in India trying to return home.\n\n“One thing I can tell you is our players are under no expectations to look for specific favours,” Greenberg said.\n\n“There’s no free rides or any expectations from our players. What they are looking for is the right information so they can plan accordingly.\n\nGreenberg said the majority of players feel “really comfortable” in the tournament’s bio-security bubble and intend to finish their commitment.\n\nHowever, they remain understandably uneasy about what will happen beyond the final.\n\n“They’re all pretty anxious. They’re in one of the biggest hotspots we’ve seen since COVID-19. They’re very anxious about getting home at the end.\n\n“But also anxious about what a beautiful place India has been... and they’re seeing such devastation.”"}, {"Article Image": "https://www.thehindu.com/sport/cricket/knghgu/article34421687.ece/ALTERNATES/LANDSCAPE_615/Dhoni-Warner", "Article's Title": "IPL 2021, SRH vs CSK | Sunrisers Hyderabad opts to bat against Chennai Super Kings", "Article's Text": "SRH made two changes, bringing back Manish Pandey in place of Virat Singh and seamer Sandeep Sharma replacing Abhishek Sharma.\n\nDavid Warner-led Sunrisers Hyderabad opted to bat against Chennai Super Kings in the IPL match in New Delhi on Wednesday.\n\nSRH made two changes, bringing back Manish Pandey in place of Virat Singh and seamer Sandeep Sharma replacing Abhishek Sharma.\n\nFor CSK, Lungi Ngidi is back in the XI in place of Dwayne Bravo while all-rounder Moeen Ali comes in at the expense of Imran Tahir.\n\nThe Teams:\n\nSunrisers Hyderabad: David Warner (C), Jonny Bairstow, Kane Williamson, Manish Pandey, Kedar Jadhav, Vijay Shankar, Rashid Khan, Jagadeesha Suchith, Sandeep Sharma, Khaleel Ahmed and Siddarth Kaul.\n\nCSK: MS Dhoni (C), Ruturaj Gaikwad, Faf du Plessis, Moeen Ali, Suresh Raina, Ambati Rayudu, Ravindra Jadeja, Sam Curran, Shardul Thakur, Lungi Ngidi and Deepak Chahar."}, {"Article Image": "https://www.thehindu.com/sport/cricket/a3k1bo/article34430720.ece/ALTERNATES/LANDSCAPE_615/Wt20kb", "Article's Title": "COVID-19 surge | Women's T20 challenge unlikely to happen: BCCI sources", "Article's Text": "None of the Australian, English, South African or West Indies cricketers will be able to travel to India due to air travel restrictions\n\nThe three-team Women's T20 challenge, which is held during the IPL, is unlikely to go ahead this year given the current restrictions imposed by countries on air travel with India due to the massive spike in COVID-19 cases here.\n\nWhile the BCCI was planning a camp for the Indian women, the tournament has hit choppy waters as none of the Australian, English, South African or West Indies cricketers will be able to travel to India because of the unprecedented \"health crisis\".\n\n\"Getting Indian players quarantined is not an issue even now but no foreign player is keen to travel in the current climate. We can find a window later when things get better,\" a top BCCI source told PTI on conditions of anonymity.\n\nLast year with the IPL shifted to UAE, none of the Australian cricketers participated in the women's T20 challenge as it coincided with the Women's Big Bash League.\n\nHowever, with UK, Australia, and New Zealand suspending flight operations due to the pandemic, it is practically impossible to hold the tournament comprising Supernovas, Velocity and Trailblazers.\n\n\"Women's T20 challenge was supposed to be entirely held in Delhi. Right now, everyone is scared to come to Delhi and you can't fault them,\" said another source."}, {"Article Image": "https://www.thehindu.com/sport/cricket/jq1b2f/article34429027.ece/ALTERNATES/LANDSCAPE_615/kkr", "Article's Title": "KKR's floundering batting faces strong DC test", "Article's Text": "First-up, Morgan will have to fix the Gill conundrum.\n\nKolkata Knight Riders' floundering batting will be put to test once again as they look to build a winning momentum against a star-studded Delhi Capitals in their Indian Premier League match here on Thursday.\n\nKKR's batting woes emanate right from the top with the highly talented Shubman Gill continuing his poor run – 89 runs from six outings.\n\nWhile their bowling, especially the 'master-apprentice' spin duo of Sunil Narine and Varun Chakravarthy, have done an excellent job in restricting the oppositions, KKR's top-order batting has hurt them the most.\n\nChasing an easy 124 against Punjab Kings in their last match, KKR's top-order cut a sorry figure to be at 17 for 3 inside three overs before skipper Eoin Morgan led from the front to snap their four-match losing streak.\n\nAgainst a DC batting line-up boasting tournament's leading run getter Shikhar Dhawan (265 runs), Prithvi Shaw, Steve Smith and the dangerous Rishabh Pant, KKR can't afford any more slip-up if they want to continue their ascent in the IPL points table.\n\nFirst-up, Morgan will have to fix the Gill conundrum. With scores of 15, 33, 21, 0, 11 and 9, the opener has failed to impress, extending his poor run of form from the England Test series.\n\nIt would not be a bad ploy to drop Gill down the order and bring back Narine to open with Rahul Tripathi, something that was suggested by the legendary Sunil Gavaskar.\n\nThe top-order reshuffle may be the way forward as the likes of Morgan, Andre Russell and Dinesh Karthik looked to have found their mojo in the middle.\n\nThursday's clash will see a mini battle between the Caribbean duo of Russell and Shimron Hetmyer who will be anxious to do well after the Capitals suffered an agonising one-run defeat against Royal Challengers Bangalore here on Tuesday.\n\nChasing 172 for a win, the Capitals were struggling at 92 for 4 but Hetmyer upped the ante in company of his captain and another left-hander Pant as the duo smashed explosive half-centuries but only to go down in a last-ball thriller.\n\nRussell too looked in his elements when he smashed Chennai Super Kings bowlers all around the park in his 22-ball 54 but only in a losing cause. It remains to be seen who among the Caribbean duo wins the battle on Thursday.\n\nAfter Ravichandran Ashwin's pulling out, the Capitals' bowling got a boost from Ishant Sharma who cleaned up the in-form Devdutt Padikkal with a peach of a delivery en route to a tidy 1/26.\n\nKKR batting will be put to test against the likes of Ishant, Kagiso Rabada and young gun Avesh Khan, while the spin duo of Amit Mishra and Axar Patel will also look to make an impact.\n\nThe Teams (From):\n\nDelhi Capitals: Rishabh Pant (c/w), Shikhar Dhawan, Prithvi Shaw, Ajinkya Rahane, Shimron Hetmyer, Marcus Stoinis, Chris Woakes, Shams Mulani, Amit Mishra, Lalit Yadav, Pravin Dubey, Kagiso Rabada, Anrich Nortje, Ishant Sharma, Avesh Khan, Steve Smith, Umesh Yadav, Ripal Patel, Vishnu Vinod, Lukman Meriwala, M Siddarth, Tom Curran, Sam Billings and Aniruddha Joshi.\n\nKolkata Knight Riders: Eoin Morgan (c), Dinesh Karthik, Shubman Gill, Nitish Rana, Tim Seifert, Rinku Singh, Andre Russell, Sunil Narine, Kuldeep Yadav, Shivam Mavi, Lockie Ferguson, Pat Cummins, Kamlesh Nagarkoti, Sandeep Warrier, Prasidh Krishna, Rahul Tripathi, Varun Chakravarthy, Shakib Al Hasan, Sheldon Jackson, Vaibhav Arora, Harbhajan Singh, Karun Nair, Ben Cutting, Venkatesh Iyer and Pawan Negi.\n\nMatch starts at 7.30 p.m. IST."}, {"Article Image": "https://www.thehindu.com/sport/tennis/pu7wxk/article34425402.ece/ALTERNATES/LANDSCAPE_615/th28tennis", "Article's Title": "Wimbledon to become 14-day tournament", "Article's Text": "Matches will be played on ‘Middle Sunday’ also from 2022\n\nThe Wimbledon Championships will become a 14-day tournament from 2022, with matches set to be played on ‘Middle Sunday’, traditionally a day off at the grasscourt Grand Slam, the All England Lawn Tennis Club (AELTC) said on Tuesday.\n\nThe first Sunday of Wimbledon is normally a rest day, on which tournament organisers work to get the courts back into top shape for the latter rounds, resulting in a packed “Manic Monday” schedule.\n\nIn another massive change, Wimbledon village bars and restaurants, which host the world’s best players once a year, will be out-of-pocket as organisers have, in a break with long-held tradition, banned players from renting private houses near the grounds."}, {"Article Image": "https://www.thehindu.com/sport/other-sports/wjz0wf/article34430632.ece/ALTERNATES/LANDSCAPE_615/komkb", "Article's Title": "COVID-19 surge | Asian Boxing Championship moved from Delhi to Dubai", "Article's Text": "The tournament was to be held at the Indira Gandhi Indoor Stadium from May 21 to 31 in the national capital\n\nThe Asian Boxing Championship which was scheduled to be held in Delhi next month was on Wednesday moved to Dubai because of the deepening COVID-19 crisis in India but the national federation will remain a co-host along with its UAE counterpart.\n\nThe tournament was to be held at the Indira Gandhi Indoor Stadium from May 21 to 31 in the national capital, which is recording over 20,000 daily cases right now.\n\n\"In the wake of international travel restrictions to India, the Boxing Federation of India (BFI), in consultation with Asian Boxing Confederation (ASBC), has decided to conduct the upcoming 2021 edition of the ASBC Asian Elite Men and Women Boxing Championships in Dubai,\" the BFI said in a statement.\n\n\"The event will now be organised by BFI in association with UAE Boxing Federation.\n\nThe daily addition of over 3 lakh new cases has led to several countries imposing bans on flights to and from India.\n\n\"...with the newly-imposed international travel restrictions from many countries due to the prevailing pandemic situation, BFI and ASBC jointly took a decision to relocate the tournament,\" the BFI said.\n\nThe national body's President Ajay Singh said it was a difficult decision but one that had to be taken.\n\n\"It's unfortunate that we have to shift the venue out of India. We were very keen to host the championships in Delhi but we are left with no options,\" he said.\n\n\"Boxers' safety is the most important concern for us and hence we had to take this decision. We closely monitored the situation and after deliberation with ASBC as well as the Government of India, we decided to conduct the tournament in Dubai,\" he added.\n\nIn a communication to all the member national federations, ASBC informed that the upcoming edition of the championships will now take place between May 21 to June 1.\n\nThe Indian men's team for the event is yet to be announced but the women's team has been named and will be spearheaded by the iconic M.C. Mary Kom (51kg)."}, {"Article Image": "https://static.toiimg.com/thumb/msid-82292083,width-1070,height-580,imgsize-115441,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "Novak Djokovic withdraws from Madrid Open", "Article's Text": "Novak Djokovic will not be playing in the Mutua Madrid Open.\"Sorry that I won’t be able to travel to Madrid this… https://t.co/1V6FkBv31x — #MMOPEN (@MutuaMadridOpen) 1619605398000\n\nWorld number one Novak Djokovic will not defend his Madrid Open title next week as he decided against travelling for the ATP Masters 1000 event, organisers said on Wednesday.The 33-year-old was last seen in action on his home soil at the Serbia Open last week, where he reached the semi-finals before losing to Russia's Aslan Karatsev.\"Sorry that I won't be able to travel to Madrid this year and meet all my fans,\" Djokovic said in a message shared by the Madrid Open organisers.\"It's been two years already, quite a long time. Hope to see you all next year!\".The COVID-19 pandemic had forced the 2020 edition of the Madrid Open to be cancelled, which means 2019 winner Djokovic is still the last champion at the event.Djokovic is still expected to feature at next month's Rome Masters and Belgrade Open in the lead up to the claycourt major in Paris, which begins on May 30."}, {"Article Image": "https://static.toiimg.com/thumb/msid-82293581,width-1070,height-580,imgsize-176426,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "Tokyo 2020 athletes to get daily COVID tests", "Article's Text": "TOKYO: Olympic athletes will be given daily tests for the coronavirus during their time in Tokyo for the delayed 2020 Games, organisers said on Wednesday, introducing a number of tighter countermeasures to show the event was still on track.Spectators from overseas have already been ruled out, and a decision on whether to allow domestic spectators will be taken in June, a few weeks before the Games begin on July 23.The organisers, who include the Tokyo 2020 organising committee, the International Olympic Committee (IOC), the Japanese government and the International Paralympic Committee , said in a joint statement that they would \"deploy all possible countermeasures and place the highest priority on safety\".With less than three months to go to the Games, and the Japanese public increasingly sceptical about their viability, the organisers were finalising a second edition of the \"playbooks\" that will set the rules for the staging of the event.Athletes and those in close contact with them will be tested every day, while all participants will be required to record two negative tests before arrival.Participants will not be allowed to use public transport, and will have to eat in specific locations with special hygiene measures.Parts of Japan including the capital were put under a new state of emergency at the weekend, and most of the Japanese public think the Games, postponed from 2020 because of the pandemic, should be cancelled or postponed again.The emergency, which is due to last until May 11, requires restaurants and bars serving alcohol to close along with large stores, cinemas and other commercial facilities; asks firms to let staff work from home; and excludes spectators from big sports events.Thomas Bach, the head of the IOC, told the organisers that he fully understood the decision to declare the emergency.Speaking by video-link, he said the playbooks would be strictly enforced, and that the IOC was \"fully committed to the successful and safe delivery of the Olympic and Paralympic Games\".An earlier edition of the rules, which came out in February, banned singing and chanting during events and mandated that participants wear masks at all times except when outdoors, or sleeping or eating.Even without foreign spectators, more than 10,000 athletes, coaches and support staff are expected to arrive in Japan in July.Though Japan has not suffered as badly from COVID-19 as many other countries, the infection rate has risen back to levels not seen since January, and more and more are from new variants of the virus. On Wednesday, Tokyo reported 925 new cases.The Games run from July 23 to Aug. 8."}, {"Article Image": "https://static.toiimg.com/thumb/msid-82293391,width-1070,height-580,imgsize-93301,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "I have total control in team and selection matters: Babar Azam", "Article's Text": "Babar Azam interacts with media ahead of the Test series.Full Video: https://t.co/Pca70BPKk5#ZIMvPAK… https://t.co/Yl5LkC968O — Pakistan Cricket (@TheRealPCB) 1619607256000\n\nKARACHI: Pakistan 's top batsman Babar Azam on Wednesday dismissed criticism that he was a powerless captain, who took dictation from head coach, Misbah-ul-Haq .The top ODI batsman frequently faces accusations of being a captain without authority and recently former skipper Shoaib Malik in tweets inferred that Babar was not taking independent decisions.Some other former captains and players have also advised Babar to be more authoritative as captain.Babar said in a virtual press conference that the debate over whether he was a captain with authority should end now.\"I don't understand but frequently it is said in press conferences and in the media that I don't have authority and don't take independent decisions,\" Babar said.\"I want to make it clear once and for all that I have total control and say in team selection and other matters. I handle everything on the field and I decide the playing eleven with the management giving their input. I know what my responsibilities are as captain,\" he said.Babar also made it clear he had no issues with the head coach and whether Pakistan needed a white ball coach was the domain of PCB .\"The team management is fully supporting every player, so I am happy,” he said.The Pakistan captain also said that the two-Test series that starts in Harare against Zimbabwe from Thursday would not be an easy assignment for his team.He said they would more or less go with the same combination that was played in the home series against South Africa.Babar said that Zimbabwe might be low in Test rankings but no team could be taken lightly at the top level and that the African nation would have the advantage of playing at home.The Test batsman also said he was not worried about the frequent middle order failures in the white ball series.Asked about the absence of seasoned leg-spinner, Yasir Shah from the series due to an injury, Babar said experience is always missed but Pakistan had other good spinners in Nauman Ali Nawaz and Zahid Mahmood.Yasir since his debut in 2014 has missed a series only once when Pakistan played a lone test in Ireland and a two Test series in England in 2018.Responding to a question that many people felt he was a selfish player, Babar said he does not agree.Babar also said he was working hard on getting into the mode of finishing off matches and also try to convert 50s into 100s and 100s into bigger scores."}, {"Article Image": "https://static.toiimg.com/thumb/msid-82294255,width-1070,height-580,imgsize-62011,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "Covid-19 travel ban leads to cancellation of India's relay teams' trip to World athletics meet in Poland", "Article's Text": "NEW DELHI: India's women’s 4x100m and men’s 4x400m relay teams have been left stranded at home after several countries imposed a fresh flying ban on Indian travellers owing to the scary Covid-19 situation.The Indian squad will be missing from action at the World Athletics Relays Silesia 21 on May 1 and 2 at Chorzow in Poland after the Royal Dutch Airlines (KLM) that was to fly the runners intimated that it would be unable to let them board the flight from Mumbai in the wake of the Netherlands government's ban on passenger flights from India.India was set to field the men’s 4x400m and women’s 4x100m relay squads at the Silesia 21.Adille Sumariwalla, AFI President, said, “We are very disappointed at this moment. There are no direct flights between Indian airports and Warsaw, Poland. This meant that despite the best efforts, the squad could not be rerouted on another airline.\"\"For the last 24 hours, we have been consistently trying to find alternatives, we have used all the resources to sort this out, we have been constantly speaking to the organisers, the World Athletics, various consulates and airlines to reroute them. Under the present scenario nobody has obliged,” Sumariwala added.The women’s 4x100m team includes India’s top sprinters such as Hima Das Dutee Chand , Dhanalaxmi Sekhar, Archana Suseentran, Daneshwari TA and Himashree Roy while men’s 4x400m squad is comprised of Muhammed Anas Yahiya , Arokia Rajeev, Amoj Jacob, Nirmal Noah Tom and Sarthak Bhambri."}, {"Article Image": "https://static.toiimg.com/thumb/msid-82291228,width-1070,height-580,imgsize-195935,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "table tennis: Olympic preparations hit by Covid but Sharath Kamal promises won't be underprepared", "Article's Text": "Preparations underway for our mixed doubles event! Fully focused on improving our footwork and better our coordinat… https://t.co/FZrCJ5OkMI — Sharath Kamal OLY (@sharathkamal1) 1619093322000\n\nIt was great being a part of Launch of 100 days to @Tokyo2020 event. Thank you @KirenRijiju Sir for your motivating… https://t.co/FRVlAWMbHz — Sharath Kamal OLY (@sharathkamal1) 1618412638000\n\nAfter the jog time for some prehab at @Sports_Dynamix. 💪🏼💪🏼 #TableTennis #Workout @Media_SAI @IndiaSports… https://t.co/FbzAGlQ4Iz — Sharath Kamal OLY (@sharathkamal1) 1617280135000\n\nNEW DELHI: Ace Indian table tennis star Sharath Kamal says it is not the best way to prepare for Tokyo Olympics when the country is in the midst of a deadly Covid-19 pandemic but assured that the players will not be underprepared in their quest for a first-ever Olympic medal.India's health care system is struggling to cope with an unprecedented second wave of Covid-19, with the country reporting 3 lakh new cases and 2000 deaths on daily basis in the last few days.\"It is not the way we should prepare for Olympics, but we have to find a way to focus on our performance and work towards it. We are trying to keep ourselves afloat and try to achieve the goal,\" said Sharath during a virtual press-conference arranged by Sports Authority of India (SAI).Gearing up for his fourth Olympics, Sharath said he is \"mentally better\" as compared to last year when India was hit by Covid-19 for the first time.\"Last year we were scared, afraid of everything, there was only negativity. I didn't feel like playing with so many people dying. Now we have a job at hand, we have some sort of direction and goal to look at,\" he said.\"It is not easy to have a clear plan and travelling is also an issue. Earlier I could go for two weeks to China or Korea; it was a lot easier. We were thinking of inviting a few foreign players but now it is really tough.\"India produced a good show at Asian Olympic Qualifiers in Doha last month with Sharath and Manika becoming the first Indian mixed doubles pair to qualify for Tokyo Games by winning the event.Sharath and Manika also booked their respective singles berth, as did G Sathiyan and Sutirtha Mukherjee.\"I don't think we are going to be underprepared. In Doha, we all did very well. We had stayed in India and had trained with the resources we had,\" said the nine-time national champion.\"I felt my levels didn't dip, which means preparation is fine, We can make use of what we have in hand. I don't think we will have any regrets about preparation,\" said the 38-year-old from Chennai.Talking about the safety protocols during the Doha event, he said, \"We were tested every third day, we had to maintain protocols. There is a lot of stuff that is going on in the head other than the game.\"\"I started in September after the lockdown. It has been like this since then. We don't know how to handle it. We still have to do our fitness, everything has to go on and we don't know how much of this distraction and negativity will affect our performance.\"Sharath said it is not going to be a \"social\" Olympics this time in Tokyo with strict health and safety protocols.\"It is not going to be a festival. Olympics is the largest event across the world, that festivity and celebration...this time, in a social way, it won't be the best Olympic Games .\"Sharath said he is aiming high this time as his singles ranking has been good. The Asian Games bronze in mixed doubles has also given him the self-belief to win an Olympic medal.\"Last five years we have been dreaming about it, so now there is a situation where winning a medal is a reality,\" said Sharath, who, along with Manika, managed a short five-day training stint in Chennai last week.Sharath had become the highest-ranked Indian paddler when he claimed the 31st spot following his title-winning performance at Oman Open.He said he does not \"know how long he would continue\" and is just \"hoping to be around for a while\"."}, {"Article Image": "https://static.toiimg.com/thumb/msid-82289364,width-1070,height-580,imgsize-620387,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "Avesh Khan: Rishabh Pant's batting has always been an X-factor, but he is also an aggressive captain, says Avesh Khan", "Article's Text": "Image credit: BCCI/IPL\n\nPhoto credit: BCCI/IPL Photo\n\nNEW DELHI: A quick look at the highest wicket takers list of IPL 2021 will show a very interesting trend.Six of the top 10 highest wicket takers this season are all under the age of 30. The current purple cap holder, RCB's Harshal Patel (17 wickets) narrowly misses the cut for that category, being 30 years and 156 days old.Right behind Harshal on that list is 24 year old right arm fast medium bowler from Madhya Pradesh, Avesh Khan , who is playing for the Delhi Capitals .Avesh in fact was also part of India's 2016 Under-19 World Cup squad, which also had Rishabh Pant , his current IPL captain. The bonhomie between Pant and Avesh at Delhi Capitals is pretty evident. There is a sense of understanding between the two. For Avesh, Pant, who was included as a wicket-keeper batsman in the U-19 World Cup campaign and scored 267 runs in 6 outings at an average of 44.50, has come a long way and has matured like fine wine.\"Rishabh was aggressive since the under-19 days. His approach was different from others. He always wanted to win and do something different. His batting has always been an X-factor. Whenever he bats, there is pressure on the opposition team. He is a mature player now. He understands the game, situations and conditions well and he bats according to those,\" Avesh told Timesofindia.com in an exclusive interview.What Pant brings to the table as a batsman is no secret. Not only has he bounced straight back into the limited overs sides for India, he is also the number one contender for the wicket-keeper's position in Test cricket, after his exploits Down Under not too long ago.But what about Pant the captain? The 23 year old was handed the reins of the Delhi Capitals franchise at the last minute ahead of IPL 2021, because regular captain Shreyas Iyer injured his shoulder and was ruled out of the entire tournament.\"Rishabh is an aggressive captain. He is a bowler's captain. Whenever a captain is a bowler's captain, his team does well. Pant always backs his bowlers. Whenever a bowler leaks runs and is hit for boundaries, he (Pant) goes up to the bowler and speaks with him. He gives bowlers time. If he has to change any plan, he does it at that moment. Whenever the match starts to go in the favour of the opposition, he always comes forward and speaks with bowlers to break that momentum. He discusses the plans with the bowlers. This is his (Pant's) best quality,\" the Delhi Capitals pacer further said.Last season, Shreyas Iyer was in tremendous form for DC. He finished as the fourth highest run-getter overall, with 519 runs in 17 innings, with three fifties.Is the team badly missing Iyer this time?\"We are missing Iyer badly because he was our captain and was a vital cog in our batting lineup. It was unfortunate that he got injured. Injuries are part and parcel of a player's life. We are missing Iyer. Pant is our new captain and we want to win as many games under his leadership (as possible) and make it to the play offs and then the final. We will try our best to win the title this time,\" Avesh told TimesofIndia.com.Avesh himself has been grabbing a lot of headlines recently, thanks to his regular wickets this IPL season. He currently has 12 wickets in 6 matches, at an economy rate of 7.31. He is five wickets behind Harshal Patel.Avesh incidentally was also the highest wicket-taker for India in their 2016 u-19 World Cup campaign, with the exact same figures - 12 scalps in 6 matches.Playing DC's opening match of the season against Chennai Super Kings, Avesh claimed two big wickets. He dismissed Faf Du Plessis for a duck and then handed the same fate to Mahendra Singh Dhoni (duck), as he rattled the former India captain's furniture.After Delhi won the match by 7 wickets, Avesh called Dhoni's wicket a 'dream come true moment'.\"After the match, Mahi bhai came to me and said 'well bowled'. He also said keep bowling the way you are (right now)\", the 24-year-old told TimesofIndia.com.\"I have got the rhythm. I am enjoying my bowling a lot. I am getting wickets for my team which is a big thing for me. The coaches are backing me a lot. I am getting a lot of support from them. I got to learn a lot from Ishant and Umesh. I have put in my 100 percent so far whenever I have got the opportunity. I am really happy about my performance,\" Avesh further said.DC so far have 8 points from 6 games and are third on the points table, behind CSK, only on NRR. But CSK have a game in hand."}, {"Article Image": "https://static.toiimg.com/thumb/msid-82292949,width-1070,height-580,imgsize-118283,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "Delhi Capitals skipper Rishabh Pant urges Covid survivors to donate plasma", "Article's Text": "Important: Through #ProjectPlasma, we aim to urge COVID-19 survivors to donate Plasma to help those battling from t… https://t.co/0BJLyljUcW — Delhi Capitals (Stay Home. Wear Double Masks😷) (@DelhiCapitals) 1619523900000\n\nNEW DELHI: Indian Premier League ( IPL ) team Delhi Capitals (DC) skipper Rishabh Pant on Wednesday appealed to Covid-19 survivors to come forward and donate their blood plasma so that the lives of the critically ill patients could be saved.In a video message posted on the franchise's website, the wicketkeeper-batsman said, \"In the last few months, the number of Covid-19 cases in India has gone up. If you have recovered from Covid , please go and donate your plasma.\"Pant also requested people not to spread misinformation about the disease.\"I request everyone to not take this lightly and strictly follow the guidelines issued by the government and experts. It is important that you verify any information related to Covid relief and only then share it further,\" the DC skipper added.Plasma therapy is one of several treatments given to critically ill patients where the plasma from a fully recovered Covid survivor is extracted and injected into the bloodstream of an infected patient.Research has shown that the antibodies in the plasma of recovered patients when injected into the bloodstream of critically ill patients, helps them recover from the diseases faster.DC opener Shikhar Dhawan had, in a video posted on his Instagram on Tuesday, said, \"So many people are running around in blood banks and hospitals to save their loved ones. If you are a Covid survivor, you have a superpower to save a life. Do not let it go waste. Connect with Fever FM and join the Project Plasma if you wish to donate and earn blessings.\"\"In these tough times, we all need them the most. With your help, we can defeat the virus and save lives. Donate plasma,\" Dhawan added.DC, in a joint initiative with Fever FM, are connecting survivors who reach out to them with patients in need of plasma at various hospitals in Delhi.\"The most valuable thing right now is your plasma. If you have defeated the virus, you have the superpower to save lives. Please contact the FeverFM team and donate your plasma,\" urged DC pace bowler Ishant Sharma"}, {"Article Image": "https://static.toiimg.com/thumb/msid-82292759,width-1070,height-580,imgsize-152439,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "Shimron Hetmyer: We have a lot to learn from RCB match, says Shimron Hetmyer", "Article's Text": "TOI POLL:\n\nContinuing with IPL is greed or much-needed relief?\n\n1 / 10 IPL 2021, Match 22: RCB edge out Delhi in last-ball cliffhanger to go top Previous Next Show Captions <p>Another AB de Villiers special proved to be the difference as RCB edged Delhi Capitals by one run in a cliffhanger (ANI/BCCI/IPL Photo)</p> <p>De Villiers smashed a 42-ball 75* to power RCB to 171/5 before their bowlers restricted DC to 170/4 (PTI/BCCI/IPL Photo)</p> <p>Harshal Patel (2/37), Mohammed Siraj (1/44), Kyle Jamieson (1/32) kept Delhi short by just a run - PTI/BCCI/IPL Photo</p> <p>Needing 14 off the final over bowled by Siraj, Rishabh Pant (58*) couldn't do enough despite hitting back-to-back fours - PTI/BCCI/IPL Photo</p> <p>Batting with Pant, Shimron Hetmyer (53*) displayed some sensational hitting but the duo couldn't take DC over the line - PTI/BCCI/IPL Photo</p> <p>The victory propelled RCB to the top of the table while DC slipped to the third spot (ANI/BCCI/IPL Photo)</p> <p>Earlier, Delhi bowlers, inspired by the return of Ishant Sharma, (1/26) put up a collective effort to restrict RCB - PTI/BCCI/IPL Photo</p> <p>Devdutt Padikkal (17) and RCB skipper Virat Kohli (12) scored 30 runs in the first 3.5 overs but fell in quick succession - PTI/BCCI/IPL Photo</p> <p>Other than de Villiers, Rajat Patidar (31) and Glenn Maxwell (25) got starts but couldn't kick on - PTI/BCCI/IPL Photo</p> <p>The final push for RCB came in the last over, in which de Villiers took 23 runs off Marcus Stoinis (ANI/BCCI/IPL Photo)</p>\n\nAHMEDABAD: Delhi Capitals batsman Shimron Hetmyer , who played a brilliant unbeaten knock of 53 from 25 balls against Royal Challengers Bangalore ( RCB ) on Tuesday, has expressed that it was a heart-breaking loss for the team but added that the side tried hard to take the match as close as possible.Mohammed Siraj defended 14 runs in the final over as RCB registered a thrilling one-run win over Delhi Capitals at the Narendra Modi Stadium in Ahmedabad. Rishabh Pant and Hetmyer remained unbeaten on 58 and 53 for Delhi Capitals.\"I felt we were in the game throughout the time I was in the middle. I felt very good tonight (against RCB). I thought we could've gotten past whatever they threw at us. We tried our best to take the game as close as we could have, but I guess, it just wasn't our night. It was heart-breaking, to be honest. I really think we could have gotten there, but that's how cricket goes. You win some and you lose some and tonight just wasn't ours to cross the line. I think we have a lot to learn from this match,\" the 24-year-old said in the Delhi Capitals release.Hetmyer, who strung an unbeaten 78-run partnership with Rishabh Pant, said that he hopes to get more chances of batting with the skipper in the upcoming games.\"It's much easier to bat with someone who's game is just the same as yours and we run well between the wickets. We had batted together during a match simulation as well. It's always nice to bat with Rishabh and I hope that we continue to get a chance to bat with each other,\" he said.The West Indian, who scored his first fifty for the Delhi Capitals, said that he was satisfied with his personal performance.\"It was a pretty satisfying performance for me. I have been trying to get a fifty for the team since last season and trying to do something spectacular for the team. We almost got there tonight. With having the backing of the team to go out there and explode and do my thing, I'm just looking to continue to play the way I know,\" Hetmyer said.Delhi Capitals is set to take on Kolkata Knight Riders in their next match at the Narendra Modi Stadium in Ahmedabad on Thursday."}, {"Article Image": "https://static.toiimg.com/thumb/msid-82291669,width-1070,height-580,imgsize-117279,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "IPL Live Score 2021, CSK vs SRH: Sunrisers Hyderabad lose Jonny Bairstow early", "Article's Text": "A delayed signal but Time-Out has been called for! Manish Pandey has looked good and will now look to ut his foot on the gas and take the charge here. Warner has not looked his usual self as he has struggled for timing and rhythm. He though will look to put that behind him and hope that he can find his touch again. As their assistant coach said, anything under 170 will be disappointing but looking at how true this track has stayed, even 170 might not be enough. Chennai have been very good so far. Dhoni has been spot on with his field placement while the bowlers have done a good job keeping things relatively quiet."}, {"Article Image": "https://timesofindia.indiatimes.com/photo/47529300.cms", "Article's Title": "TOI POLL: Continuing with IPL is greed or much-needed relief?", "Article's Text": "Please select responses for all the questions and submit again.\n\nIPL should continue only if star players and BCCI fund the Covid relief measures generously and openly\n\n2. IPL should continue only if star players and BCCI fund the Covid relief measures generously and openly\n\nIPL should do more to spread awareness about COVID-appropriate behaviour\n\n3. IPL should do more to spread awareness about COVID-appropriate behaviour\n\n4. Would it have been better if the IPL was held in the UAE this time as well?"}, {"Article Image": "https://images.indianexpress.com/2018/09/india-relay-pti-fb.jpg", "Article's Title": "India’s relay teams on verge of missing Olympic qualifiers in Poland due to flight suspension", "Article's Text": "The AFI was hopeful of the women's 4x100m relay team qualifying for the upcoming Olympics in Tokyo. (File Photo/PTI)\n\nStar sprinters Hima Das and Dutee Chand might miss the Olympic qualifying World Athletics Relays in Poland on May 1 and 2 as the Indian team’s connecting flight to Amsterdam has been suspended following the record-shattering spike in the country’s COVID-19 case load.\n\nThe women’s 4x100m and the men’s 4x400m relay teams were to board a KLM flight to Amsterdam in the wee hours on Thursday but the Dutch government has suspended flights from India effective Monday evening.\n\nThe Athletics Federation of India is trying to book an alternate flight available to any European city en route to Silesia in Poland where the event will be held. There is no direct flight to Poland from India.\n\n“There is a serious doubt that our team may not be able to take part in the World Relays. Many European countries have suspended flights from India. So, we may be stuck and there is a high possibility that the team may not go for the event,” a top AFI official told PTI.\n\n“But still we are trying, talking to the government and to our embassies if they can help our athletes to fly in any European city like Frankfurt from where they can proceed to Poland. We are also trying for any connecting flight to Dubai or any other West Asian city.”\n\nS Dhanalakshmi, who had beaten Dutee in the final of women’s 100m sprint in the Federation Cup last month, was also named in the team, along with Archana Suseendran, Himashree Roy and AT Daneshwari.\n\nIndia will also field teams in the men’s 4x400m in the event to be held in Chorzow, Silesia, in Poland.\n\nThe top eight teams from the World Athletics Relays will automatically qualify for the Tokyo Olympics.\n\nThe women’s 4x400m relay team has pulled out of the event as more than two members are unfit.\n\nThe Indian mixed 4x400m relay team has already qualified for the Tokyo Olympics after reaching the final during the 2019 World Championships in Doha.\n\nThe AFI was hopeful of the women’s 4x100m relay team qualifying for the upcoming Olympics in Tokyo.\n\nThe World Relays will be the first major international event for Indian sprinters since the Asian Athletics Championships in Doha in April 2019."}, {"Article Image": "https://images.indianexpress.com/2020/10/chennai-ipl-csk-srh.jpg", "Article's Title": "IPL 2021 CSK vs SRH Live Cricket Streaming: When and where to watch", "Article's Text": "IPL 2021 CSK vs SRH Live Cricket Score Streaming Online: With four straight wins, MS Dhoni’s CSK are on a roll and hoping to continue the same winning streak here at Firoze Shah Kotla. All-rounder Ravindra Jadeja has been the driving force behind CSK’s impressive run so far. His blistering assault on Harshal Patel in the final over shut out RCB on Sunday. He has been among the wickets with his accurate left-arm spin apart from effecting stunning run-outs.\n\nOn the other hand, Sunrisers rely heavily on their foreign recruits, led by skipper David Warner, opener Jonny Bairstow, Kiwi great Kane Williamson and Rashid, which is a cause for concern. Their biggest weakness is a fragile batting order and over-reliance on the top order.\n\nWhat time will the IPL 2021 match between Chennai Super Kings and Sunrisers Hyderabad begin?\n\nThe IPL 2021 match between Chennai Super Kings and Sunrisers Hyderabad will begin at 7:30 PM IST on Wednesday. The toss will take place at 7:00 PM IST.\n\nWhich channel will telecast IPL 2021 match between Chennai Super Kings and Sunrisers Hyderabad in India?\n\nThe IPL 2021 match between Chennai Super Kings and Sunrisers Hyderabad will be telecast by the Star Sports network on TV.\n\nHow to watch the live streaming of the IPL 2021 match between Chennai Super Kings and Sunrisers Hyderabad?\n\nThe IPL 2021 match between Chennai Super Kings and Sunrisers Hyderabad can be streamed live on Hotstar and Star Sports Network’s platforms. You can catch live updates on indianexpress.com."}, {"Article Image": "https://images.indianexpress.com/2021/03/AI_5454-e1615733912567-980x530-1.jpg", "Article's Title": "Virat Kohli remains static at 5th place in T20 list, Rizwan enters top 10", "Article's Text": "Virat Kohli gestures to the umpire during the T20I series vs England (BCCI)\n\nIndia captain Virat Kohli and senior opener KL Rahul maintained their fifth and seventh places respectively in the latest ICC’s ranking for T20 batsmen.\n\nPakistan’s Mohammed Rizwan made an entry into top-10.\n\nThe 28-year-old wicketkeeper-batsman’s unbeaten knocks of 82 and 91 in the first and third matches have helped him gain five slots to reach 10th position, overtaking the likes of England captain Eoin Morgan and India opener Rohit Sharma.\n\nRizwan is the second-highest ranked Pakistan batsman in the list, only behind captain Babar Azam, who is now in third place.\n\nThe list is still topped by England’s Dawid Malan with 892 points while Aaron Finch is placed second with 830 points.\n\nHowever India has no representation in the top-10 of either bowlers or all-rounder’s list.\n\nIn the list of Test batsmen, Kohli is again placed fifth while Rohit Sharma is tied seventh at the moment.\n\nKane Williamson is still holding the pole position among Test batsmen while Pat Cummins (908) has a significant (48 points) lead at the top among bowlers over India’s Ravichandran Ashwin (850).\n\nAmong Test all-rounders, Ravindra Jadeja is placed third with Ashwin a notch below. The list is topped By Jason Holder.\n\nEarlier, India captain Kohli had lost his top rank in ODI charts to his Pakistani counterpart Babar Azam."}, {"Article Image": "https://images.indianexpress.com/2021/04/ED12.jpg_0-1024x682-1.jpg", "Article's Title": "Asian Boxing Championship moved from India to UAE due to Covid-19 crisis", "Article's Text": "The Asian Boxing Championship which was scheduled to be held here next month was on Wednesday moved to Dubai because of the deepening COVID-19 crisis in India but the national federation will remain a co-host along with its UAE counterpart.\n\nThe tournament was to be held at the Indira Gandhi Indoor Stadium from May 21 to 31 in the national capital, which is recording over 20,000 daily cases right now.\n\n“In the wake of international travel restrictions to India, the Boxing Federation of India (BFI), in consultation with Asian Boxing Confederation (ASBC), has decided to conduct the upcoming 2021 edition of the ASBC Asian Elite Men and Women Boxing Championships in Dubai,” the BFI said in a statement.\n\n“The event will now be organised by BFI in association with UAE Boxing Federation.\n\nThe daily addition of over 3 lakh new cases has led to several countries imposing bans on flights to and from India.\n\n“…with the newly-imposed international travel restrictions from many countries due to the prevailing pandemic situation, BFI and ASBC jointly took a decision to relocate the tournament,” the BFI said.\n\nThe national body’s President Ajay Singh said it was a difficult decision but one that had to be taken.\n\n“It’s unfortunate that we have to shift the venue out of India. We were very keen to host the championships in Delhi but we are left with no options,” he said.\n\n“Boxers’ safety is the most important concern for us and hence we had to take this decision. We closely monitored the situation and after deliberation with ASBC as well as the Government of India, we decided to conduct the tournament in Dubai,” he added.\n\nIn a communication to all the member national federations , ASBC informed that the upcoming edition of the championships will now take place between May 21 to June 1.\n\nThe Indian men’s team for the event is yet to be announced but the women’s team has been named and will be spearheaded by the iconic MC Mary Kom (51kg)."}, {"Article Image": "https://images.indianexpress.com/2021/04/Screenshot-2021-04-28T182302.792.png", "Article's Title": "I have total control in team and selection matters: Babar Azam", "Article's Text": "Babar Azam has been advised by some former Pakistan captains to be a more authoritative leader. (File Photo/PCB)\n\nPakistan’s top batsman Babar Azam on Wednesday dismissed criticism that he was a powerless captain, who took dictation from head coach, Misbah-ul-Haq.\n\nThe top ODI batsman frequently faces accusations of being a captain without authority and recently former skipper Shoaib Malik in tweets inferred that Babar was not taking independent decisions.\n\nSome other former captains and players have also advised Babar to be more authoritative as captain.\n\nBabar said in a virtual press conference that the debate over whether he was a captain with authority should end now.\n\n“I don’t understand but frequently it is said in press conferences and in the media that I don’t have authority and don’t take independent decisions,” Babar said.\n\n“I want to make it clear once and for all that I have total control and say in team selection and other matters. I handle everything on the field and I decide the playing eleven with the management giving their input. I know what my responsibilities are as captain,” he said.\n\nREAD | Former players slam Pakistan management after defeat to Zimbabwe\n\nBabar also made it clear he had no issues with the head coach and whether Pakistan needed a white ball coach was the domain of PCB.\n\n“The team management is fully supporting every player, so I am happy,” he said.\n\nThe Pakistan captain also said that the two-Test series that starts in Harare against Zimbabwe from Thursday would not be an easy assignment for his team.\n\nHe said they would more or less go with the same combination that was played in the home series against South Africa.\n\nBabar said that Zimbabwe might be low in Test rankings but no team could be taken lightly at the top level and that the African nation would have the advantage of playing at home.\n\nThe Test batsman also said he was not worried about the frequent middle order failures in the white ball series.\n\nAsked about the absence of seasoned leg-spinner, Yasir Shah from the series due to an injury, Babar said experience is always missed but Pakistan had other good spinners in Nauman Ali Nawaz and Zahid Mahmood.\n\nYasir since his debut in 2014 has missed a series only once when Pakistan played a lone test in Ireland and a two Test series in England in 2018.\n\nResponding to a question that many people felt he was a selfish player, Babar said he does not agree.\n\nBabar also said he was working hard on getting into the mode of finishing off matches and also try to convert 50s into 100s and 100s into bigger scores."}, {"Article Image": "https://images.indianexpress.com/2021/04/Untitled-design-5-4.jpg", "Article's Title": "Aus players’ union chief says chartered flight for Oz players after IPL under consideration", "Article's Text": "\"That's one of the conversations we're having with Cricket Australia at the moment about whether or not that's something that's available to us,\" Greenberg said on 2GB radio as quoted by 'Sydney Morning Herald'. (FILE)\n\nA chartered flight to bring back Australian cricketers after the IPL in India is under consideration, the country’s players union said on Wednesday even as sports minister Richard Colbeck made it clear that such a move has not yet been cleared by the government Down Under.\n\nAustralian Cricketers’ Association (ACA) chief Todd Greenberg said Cricket Australia will talk to the IPL franchise owners on this arrangement but conceded that it will not be a simple thing.\n\n“That’s one of the conversations we’re having with Cricket Australia at the moment about whether or not that’s something that’s available to us,” Greenberg said on 2GB radio as quoted by ‘Sydney Morning Herald’.\n\n“We can also work with all the owners of the Premier League franchises who are effectively contracting the players. There’s certainly a conversation to be had about that,” he added.\n\n“They’re not simple things to organise, as you’d imagine. If we can try to find a seamless approach to get them home safely that’s something between us and CA and our players that we’ll work on.”\n\nThe BCCI has already assured the IPL’s foreign recruits that their safe return home will be its responsibility once the tournament ends on May 30. India is facing an explosion of COVID-19 cases and the nation’s health infrastructure has been severely strained dealing with lakhs of daily new cases.\n\n\n\n“Be rest assured that the tournament is not over for BCCI till each one of you has reached your home, safe and sound,” the Indian Board’s COO Hemang Amin said on Tuesday in a letter addressed to the players.\n\nAny such chartered flight would require the approval of the Australian government and Colbeck said no decision has been taken on this matter as yet.\n\n“There aren’t any decisions that have been made yet with respect to (approval for a charter flight for) the cricketers,” Colbeck told ABC radio.\n\n“One of the reasons for the pause was to give our hotel quarantine a little bit of space because of the load we’ve seen out of India,” he said.\n\nAs a second wave of COVID-19 infections battered India, the Australian government on Tuesday suspended air travel with the country besides asking players to make their “own arrangements” for return.\n\nEven before that announcement, the fear of being locked out drove the likes of Andrew Tye to take an early flight back to Australia along with Kane Richardson and Adam Zampa.\n\nMumbai Indians’ Australian batsman Chris Lynn had also said that he hoped Cricket Australia to arrange a chartered flight for those who have stayed back.\n\nAs of now, the IPL still has 14 Australian players, including big names like Steve Smith (Delhi Capitals), David Warner (SunRisers Hyderabad) and Cummins.\n\nRicky Ponting (DC) and Simon Katich (Royal Challengers Bangalore) are among the high-profile Australian coaches, while iconic former players such as Matthew Hayden, Brett Lee and Lisa Sthalekar are part of the tournament’s commentary team.\n\nThe ACA chief, however, said that the players will not ask for any preferential treatment and jump the queue if and when the Australian government evacuates its citizens from India. About 9000 Australians are in India trying to return home.\n\n“One thing I can tell you is our players are under no expectations to look for specific favours,” Greenberg said.\n\n“There’s no free rides or any expectations from our players. What they are looking for is the right information so they can plan accordingly.\n\nGreenberg said the majority of players feel “really comfortable” in the tournament’s bio-security bubble and intend to finish their commitment.\n\nHowever, they remain understandably uneasy about what will happen beyond the final.\n\n“They’re all pretty anxious. They’re in one of the biggest hotspots we’ve seen since COVID. They’re very anxious about getting home at the end.\n\n“But also anxious about what a beautiful place India has been … and they’re seeing such devastation.”"}, {"Article Image": "https://images.indianexpress.com/2021/03/stokes-buttler.jpg", "Article's Title": "English cricket to join football in social media boycott", "Article's Text": "Ben Stokes in action with Jos Buttler during England's ODI against India. (Twitter/ECB)\n\nEnglish cricket will join football’s social media blackout this weekend in response to continued online racist abuse of professional players in the country, the England and Wales Cricket Board (ECB) said on Wednesday.\n\nThe ECB with all 18 first-class county teams, the eight women’s regional teams and the Professional Cricketers’ Association (PCA) will join the football community in switching off their social media accounts from 3 p.m. local time (1400 GMT) on Friday to 11.59 p.m. on Monday May 3.\n\n“As a sport, we are united in our commitment to fight racism and we will not tolerate the kind of discriminatory abuse that has become so prevalent on social media platforms,” ECB chief executive officer Tom Harrison said in a statement.\n\n“Social media can play a very positive role in sport, widening its audience and connecting fans with their heroes in a way that was never possible before.\n\n“However, players and supporters alike must be able to use these platforms safe in the knowledge they do not risk the prospect of facing appalling abuse.”\n\nCricketers have not been immune to online abuse, with England fast bowler Jofra Archer revealing last year that he received racist messages on social media after breaching bio-bubble protocols during the test series against West Indies.\n\nEarlier this month, England seam bowler Stuart Broad said the national team players were willing to take a stand against online abuse.\n\nThe Lawn Tennis Association (LTA) has also backed the campaign, which aims to encourage social media companies to do more to eradicate online hate.”British and international tennis players frequently suffer abuse online, simply for losing a match or even a point. This abuse is often especially targeted at female players,” the LTA said in a statement."}, {"Article Image": "https://images.indianexpress.com/2021/04/rohit-sharma-mi.jpg", "Article's Title": "Mumbai Indians look to overcome middle-order woes, return to winning ways against Rajasthan Royals", "Article's Text": "Defending champions Mumbai Indians will look to sort out their middle-order woes and bring their campaign back on track when they take on an inconsistent Rajasthan Royals in an IPL game on Thursday.\n\nMI are coming into the match after suffering back-to-back losses, the last one being a nine-wicket defeat against Punjab Kings in Chennai and need to start the Delhi leg afresh.\n\nThe Sanju Samson-led Rajasthan have lost thrice in the tournament so far and will seek to build on the six-wicket win over Kolkata Knight Riders in the previous match.\n\nMumbai skipper Rohit Sharma (201 runs) has got starts but hasn’t played a big knock and the Mumbaikar would be itching to get one as would be his opening partner Quinton De Kock (47 runs).\n\nBut Mumbai’s middle-order, which boasts of hard-hitting batsmen like Suryakumar Yadav (154 runs), Ishan Kishan (73 runs), Hardik Pandya (36 runs), Krunal Pandya (29 runs) and Kieron Pollard (65 runs), hasn’t fired in unison so far.\n\nThe middle-order can pummel any good attack into submission on any given day and Sharma would hope for their batting to click on Thursday when the action shifts to the Feroz Shah Kotla ground here.\n\nIn the bowling department, pace duo of Trent Boult (6 wickets) and Jasprit Bumrah (4 wickets) have been exceptional, particularly at the death.\n\nLeg-spinner Rahul Chahar (9 wickets) and Krunal (3 wickets) have also been impressive and will again need to play their parts to perfection.\n\nPollard is used as the fifth or the sixth bowler even as Hardik plays solely as a batsman.\n\nMumbai, however, might play Adam Milne in place of Jayant Yadav.\n\nRajasthan, on the other hand, have a lot of issues to ponder over, particularly in the absence of key foreign players � Jofra Archer, Ben Stokes, Liam Livingstone and Andrew Tye.\n\nRR are yet to have a settled opening combination. They tried Manan Vohra (42 runs) and Yashasvi Jaiswal (22 runs) at the top but both failed to convert their starts.\n\nEnglishman Jos Buttler would need to score big to compliment his skipper Sanju Samson, who is the team’s leading run-scorer (187) despite being inconsistent.\n\nAnd the likes Shivam Dube, David Miller and Riyan Parag, would have to support the top-order by chipping in with much-needed contributions.\n\nAll-rounder Chris Morris (9 wickets and 48 runs) has blown hot and cold and will again be under pressure to deliver his high price tag.\n\nLeft-arm pacer Chetan Sakariya (7 wickets) has been a revelation, while the experienced duo of Jaydev Unadkat (4 wickets) and Mustafizur Rahman (4 wickets) have been decent. The three left-arm pacers along with Morris, however, need to be consistent.\n\nLeg-spinner Rahul Tewatia has got just one wicket from five games, while Shreyas Gopal, another leggie, has gone wicket-less in the two games he has played.\n\nTewatia’s role would be crucial if the Royals aim to contain the MI batting line-up, keeping in mind Amit Mishra’s performance for Delhi.\n\nThe dew won’t be a factor on Thursday as it is an afternoon game.\n\nTeams (From): Mumbai Indians: Rohit Sharma, Adam Milne, Aditya Tare, Anmolpreet Singh, Anukul Roy, Arjun Tendulkar, Chris Lynn, Dhawal Kulkarni, Hardik Pandya, Ishan Kishan, James Neesham, Jasprit Bumrah, Jayant Yadav, Kieron Pollard, Krunal Pandya, Marco Jansen, Mohsin Khan, Nathan Coulter-Nile, Piyush Chawla, Quinton De Kock (WK), Rahul Chahar, Saurabh Tiwary, Suryakumar Yadav, Trent Boult, Yudhvir Singh.\n\nRajasthan Royals: Sanju Samson (c & wk), Jos Buttler (wk), Yashasvi Jaiswal, Manan Vohra, Anuj Rawat, Riyan Parag, David Miller, Rahul Tewatia, Mahipal Lomror, Shreyas Gopal, Mayank Markande, Jaydev Unadkat, Kartik Tyagi, Shivam Dube, Chris Morris, Mustafizur Rahman, Chetan Sakariya, KC Cariappa, Kuldip Yadav, Akash Singh.\n\nMatch starts at 3.30 PM."}, {"Article Image": "https://images.indianexpress.com/2021/04/Untitled-design-2-6.jpg", "Article's Title": "Owner Stan Kroenke says ’100% committed’ to Arsenal, won’t sell club", "Article's Text": "Fans protest against Arsenal owner Stan Kroenke before the English Premier League match against Everton, at the Emirates Stadium in London, Friday April 23, 2021. The fans want owner Stan Kroenke to leave the club over its bid to join the failed Super League. (Kirsty O'Connor/PA via AP)\n\nArsenal owner Stan Kroenke said Tuesday he is “100% committed” to the Premier League club and will not be selling it, amid interest from the founder of music streaming service Spotify.\n\nArsenal fans have called for Kroenke to leave after he was one of the instigators of the ill-fated European Super League project.\n\nDaniel Ek, the Swedish businessman who founded Spotify and is an Arsenal supporter, has said on Twitter he would be “happy to throw my hat in the ring” if Kroenke wanted to sell and reportedly has enlisted the help of former Arsenal players Thierry Henry, Dennis Bergkamp and Patrick Vieira.\n\n“In recent days we have noted media speculation regarding a potential takeover bid for Arsenal Football Club,” read a statement by Stan Kroenke and his son, Josh, on Tuesday.\n\n“We remain 100% committed to Arsenal and are not selling any stake in the club. We have not received any offer and we will not entertain any offer.”\n\nThe Kroenkes said their ambition “remains to compete to win the biggest trophies in the game.”\n\n“Our focus remains on improving our competitiveness on the pitch to achieve this,” they said.\n\nArsenal was one of 12 founding members of the Super League, along with English clubs Manchester United, Manchester City, Liverpool, Chelsea and Tottenham. All six withdrew their from the league last week, two days after it was officially announced.\n\nMore than 1,000 Arsenal fans protested outside Emirates Stadium on Friday, before the Premier League match against Everton, calling for Kroenke to quit. Liverpool and United fans have also voiced discontent with their American owners.\n\nArsenal is 10th in the 20-team Premier League."}, {"Article Image": "https://images.indianexpress.com/2021/04/wankhede-1200.jpg", "Article's Title": "‘Tone deaf’, ‘terribly wrong’: What the world has to say about IPL 2021", "Article's Text": "The IPL 2021 season has rolled into its second leg, with matches being staged in Ahmedabad and Delhi. However, the prevailing Covid-19 crisis in India has prompted many voices from around the world to speak about the tournament being incongruent with the situation in the country.\n\nFormer England footballer and television commentator Gary Lineker said it is “terribly wrong” for the IPL to continue amidst such a “catastrophe”. “People are dying faster than runs are being scored for crying out loud,” he exclaimed in a tweet.\n\nI love the @IPL as much as any cricket fan, but it seems so terribly wrong for it to continue given the Covid catastrophe that’s currently occurring in India. People are dying faster than runs are being scored for crying out loud. — Gary Lineker 💙 (@GaryLineker) April 26, 2021\n\n“Cricket is irrelevant,” said British television host Piers Morgan.\n\nThe Indian Premier League should not continue given the horrific Covid crisis in India due to Prime Minister @narendramodi‘s woefully irresponsible leadership. The country’s sole focus should be on the raging pandemic. Cricket is irrelevant. #IPL — Piers Morgan (@piersmorgan) April 26, 2021\n\nSeveral publications from around the world, while reporting on the status of players from their countries currently in India playing in the IPL, questioned the need for the IPL 2021 season to be staged in present circumstances.\n\nAn editorial in The Guardian noted that in India, “there are certain cash cows that cannot be criticised, but even more protected are the holy cows, such as the IPL. The BCCI is run by Jay Shah, the secretary, and he reports not so much to the president of the BCCI, Sourav Ganguly, as to Amit Shah, the home minister of India and one of most powerful men in the country. Jay also happens to be Amit’s son.\n\nThe email sent to the 8 IPL teams by the BCCI earlier this week was called a “charm offensive” by The Guardian. An editorial in the Sydney Morning Herald had a sarcastic take on the notion that the players in the IPL were “playing for humanity”. “The Covid crisis in Australia was never nearly as acute as it is in India right now, but we shut down all sport and somehow bumbled through… Yeah, but humanity,” it said.\n\nREAD | Cricketers can’t be totally deaf or blind to whatever is going on outside: Abhinav Bindra\n\nThe Daily Mail reported that pressure is growing on the England Cricket Board to bring back their players from India. In a separate editorial titled ‘Surely, the IPL show cannot go on after Chris Lynn’s jab revelation’, the publication noted that it is “absurd that fit, young cricketers protected by a bio-secure bubble are jumping the vaccine queue in Covid-ravaged India” and that staging the tournament now is “tone-deaf”.\n\nA number of players, including the likes of Ravichandran Ashwin, Kane Richardson, and Adam Zampa have pulled out of the tournament midway. Richardson and Zampa had been lucky with their timing, announcing their decision to leave India 24 hours before Australia announced a three-week pause on all direct flights from India.\n\nAndrew Tye, one of the overseas players to have walked out of the tournament, said: “I just thought I’d get on the front foot and get home before I got locked out of the country… Looking at it from an Indian view, how are these companies and franchises, and the government, spending so much money on the IPL when there are people not being able to get accepted into hospital?”\n\nREAD | ‘Misguided moral outrage to call for an end to the IPL’\n\nAustralian PM Scott Morrison has said there would be no special consideration given to Australian cricketers contracted by the IPL franchises to play in the event because they are not on national duty.\n\nIndia has recorded more than a million Covid-19 cases in the last few days. Ambulances, medical oxygen, intensive care unit (ICU) beds and life-saving medicines are all in short supply."}, {"Article Image": "https://images.indianexpress.com/2021/04/Untitled-design-5-3.jpg", "Article's Title": "We have always got depth in batting but now we got it in bowling too: Virat Kohli", "Article's Text": "Royal Challengers Bangalore skipper Virat Kohli on Tuesday said that the luxury of having depth in the bowling department is faring well for the team this season.\n\nRCB pipped Delhi Capital by one run to notch up their fifth win of the season. Kohli used six bowlers in the game and also had the option of handing the ball to all-rounder Glenn Maxwell.\n\n“For the most part I think we were top in this game with our bowlers. We felt 160-165 was par. It was a bit two-paced,” Kohli said at the post match presentation.\n\n“There wasn’t any dew tonight thanks to that little sandstorm in the middle and we ended up bowling with a dry ball. If you look at our bowling line-up, Maxi’s still not bowling, he’s the 7th option. As a captain I can bowl guys at different stages, take the load off one another.\n\n“And Maxi is yet to bowl. We’ve always had batting but now bowling as well,” Kohli added.\n\n\n\nMeanwhile, Delhi Capitals skipper Rishabh Pant lauded the whirlwind innings by West Indies’ Shimron Hetmyer.\n\n“Obviously feeling disappointed, specially when you are on the losing side. They got 10-15 runs extra on this wicket. Hetty (Hetmyer) played a brilliant innings, because of him we got close to the target,” Pant said.\n\nIn an unsual move Pant handed the ball to all-rounder Marcus Stoinis, who hadn’t bowled in the entire match, in the last over which went for 23 runs.\n\nAsked the reason behind the decision, Pant said: “In the last over, we were thinking whoever gets the ball has to finish the job for the team.\n\n“That’s what we were planning, in the end we were one run short. We counted the overs really well, in the end the spinners weren’t getting the help which we thought they might get. In the end, I had to give the ball to Stoinis.”"}, {"Article Image": "https://images.indianexpress.com/2020/10/CSK-vs-SRH-1-1.jpg", "Article's Title": "CSK vs SRH Playing 11, IPL 2021: Dhoni’s in-form men vs Warner’s inconsistent army", "Article's Text": "IPL 2021, CSK vs SRH Live: Sunrisers Hyderabad will need more than just their in-form overseas personnel. (IPL/FILE)\n\nIPL 2021, CSK vs SRH Team Playing 11 for Today Match: The second leg of the ongoing Indian Premier League (IPL2021) is kickstarting from Wednesday when a well-oiled Chennai Super Kings (CSK) to take on inconsistent Sunrisers Hyderabad in Delhi’s Arun Jaitley Stadium.\n\nCSK vs SRH Live Scorecard, Live Updates\n\nWith four straight wins, MS Dhoni’s CSK are on a roll and hoping to continue the same winning streak. All-rounder Ravindra Jadeja has been the driving force behind CSK’s impressive run so far. His blistering assault on Harshal Patel in the final over shut out RCB on Sunday. He has been among the wickets with his accurate left-arm spin apart from effecting stunning run-outs. On the other hand, Sunrisers rely heavily on their foreign recruits, led by skipper David Warner, opener Jonny Bairstow, Kiwi great Kane Williamson and Rashid Khan, which is a cause for concern. Their biggest weakness is a fragile batting order and over-reliance on the top order.\n\nPlaying XI:\n\nCSK: Ruturaj Gaikwad, Faf du Plessis, Moeen Ali, Suresh Raina, Ambati Rayudu, MS Dhoni(w/c), Ravindra Jadeja, Sam Curran, Shardul Thakur, Lungi Ngidi, Deepak Chahar\n\nSRH: David Warner(c), Jonny Bairstow(w), Kane Williamson, Manish Pandey, Kedar Jadhav, Vijay Shankar, Rashid Khan, Jagadeesha Suchith, Sandeep Sharma, Khaleel Ahmed, Siddarth Kaul"}, {"Article Image": "https://images.indianexpress.com/2020/11/nuwan-zoysa.jpg", "Article's Title": "Former Sri Lanka bowler Nuwan Zoysa banned for six years for trying to fix matches", "Article's Text": "Nuwa Zoysa Zoysa is the latest in a long line of Sri Lankan cricketers who have been banned by the ICC for corruption. (Reuters/FILE)\n\nFormer Sri Lanka seamer and coach Nuwan Zoysa was on Wednesday banned from all cricket for six years after being found guilty of trying to fix matches and failing to disclose corrupt approaches from a suspected Indian bookie.\n\nThe ban on Zoysa, a left-arm seamer, is backdated to October 31, 2018, when he was provisionally suspended.\n\n“In his role as a national coach, he should have acted as a role model. Instead, he became involved with a corrupter and attempted to corrupt others,” Alex Marshall, ICC General Manager- Integrity Unit said in a release.\n\n“Contriving to fix a game betrays the basis of sporting principles. It will not be tolerated in our sport.”\n\nThe 42-year-old, who played 30 Tests and 95 ODIs for Sri Lanka, was originally charged in 2018 after his stint as bowling coach of Team Sri Lanka in a T10 tournament organised in the UAE in 2017.\n\nIn its full judgement, the ICC said Zoysa was introduced to the Indian suspect in Colombo in 2017 during his time as Sri Lanka A’s bowling coach.\n\n\n\nAfter a few interactions, the former bowler became aware that the man, referred to as Mr W in ICC documents, “was involved in fixing matches, or aspects of matches” and wanted to have Zoysa on board because, “as a coach he knew players and would be able to get them to fix matches”.\n\n“At (Mr W)’s request, Mr Zoysa approached (Player A) late in 2017 and asked him whether, in connection with Sri Lanka’s then upcoming series against Bangladesh and/or Zimbabwe, he would be willing to give away 12-15 runs in\n\nan over while bowling, or to get out deliberately when batting,” the ICC judgement said.\n\n“Mr Zoysa told (Player A) that he could get good money if he under-performed in this way. (Player A) immediately refused that approach and told Mr Zoysa that he wouldn’t agree to do that,” it added.\n\nFollowing full hearings and arguments, the Tribunal found Zoysa guilty of breaching articles relating to trying to fix matches, enticing others to breach the code of conduct and failing to report approaches by corrupt individuals.\n\nZoysa was also charged by the ICC on behalf of the Emirates Cricket Board for breaching three counts of their ECB Anti-Corruption Code for the T10 League and these proceedings are ongoing.\n\nHe had worked as a bowling coach of Sri Lanka A team in the past.\n\nZoysa is the latest in a long line of Sri Lankan cricketers who have been banned by the ICC for corruption.\n\nEarlier this month, former pacer Dilhara Lokuhettige was banned from all cricket for eight years after being found guilty of breaching the ICC Anti-Corruption Code.\n\nIn 2019, Sanath Jayasuriya was banned for failing to co-operate with an Anti-Corruption Unit (ACU) investigation.\n\nIn 2016, former Sri Lanka offspinner Jayananda Warnaweera was suspended under the code."}, {"Article Image": "https://images.indianexpress.com/2021/04/IPL-2021-match-23.jpg", "Article's Title": "IPL 2021, CSK vs SRH Live Cricket Score Online: Manish Pandey hits 20th IPL fifty", "Article's Text": "IPL 2021, CSK vs SRH Live Score: Sunrisers Hyderabad need a big win to enter the top four on the points table\n\nIPL 2021, CSK vs SRH Live Cricket Match Score Online Updates: In the 23rd match of the season, an in-form Chennai Super Kings will take on a struggling Sunrisers Hyderabad in Delhi. MS Dhoni’s CSK need a win to dethrone Royal Challengers Bangalore (RCB) from the top of the table whereas SRH need a win to rise from the bottom of the table. A big win can even help SRH to climb to the fourth spot. David Warner’s side has been impressive in the previous two games including a win and a loss in super over to Delhi Capitals (DC). Kane Williamson has provided a major boost to the top order but middle order woes continue to haunt them.\n\nIf fit, Manish Pandey and Bhuvneshwar Kumar can walk into the side. Pandey can replace Virat Singh as the uncapped player played a slow inning in the run chase. Bhuvneshwar can replace Khaleel Ahmed as the left-arm pacer was expensive in the previous game. Jagadeesha Suchith is likely to stay in the team for his all-round performance helping SRH take the game into super over. Priyam Garg is another option SRH can try in the midde order. On the other hand, CSK may bring back Moeen Ali in the side replacing Dwayne Bravo especially if Ambati Rayudu is injured. Robin Uthappa or Krishnappa Gowtham can also make their way into the squad if Rayudu is injured."}, {"Article Image": "https://c.ndtvimg.com/2021-04/rhl6f02k_ryan-giggs-manchester-united_625x300_28_April_21.jpg", "Article's Title": "Wales Manager Ryan Giggs Denies Assault Charges In Court Appearance", "Article's Text": "Wales manager and former Manchester United star Ryan Giggs on Wednesday denied charges of assaulting two women and controlling or coercive behaviour as he appeared in court. Giggs pleaded not guilty to an allegation he was violent and engaged in behaviour towards his ex-girlfriend including isolation, belittling, humiliation, harassment, degradation and abuse during a short hearing at Manchester Magistrates' Court. Giggs, 47, also entered a not guilty plea of actual bodily harm relating to PR executive Kate Greville, 36, at his home in Greater Manchester on November 1 last year.\n\nHe has also been charged with the common assault of Emma Greville, understood to be Greville's younger sister, during the same alleged incident.\n\nThe charge of controlling and coercive behaviour in an intimate relationship alleges the abuse lasted almost three years, between December 2017 and November 2020.\n\nPromoted\n\nGiggs appeared in the dock for his first court appearance as the three charges against him were read out and he entered his not guilty pleas.\n\nGiggs, who spoke only to confirm his name, address and enter his not guilty pleas, has been bailed to appear at Manchester Crown Court on May 26."}, {"Article Image": "https://images.indianexpress.com/2021/04/ponting-ipl-dc.jpg", "Article's Title": "Travelling back home is a small issue compared to situation outside IPL bubble: Ricky Ponting", "Article's Text": "Australian players might be a bit apprehensive following the suspension of flights from India but Delhi Capitals’ head coach Ricky Ponting said it’s a “small issue” when compared to the chaos triggered by the second wave of COVID-19 infections here.\n\nAustralia on Tuesday suspended all direct passenger flights from India until May 15 due to the “very significant” spike in COVID-19 cases in India.\n\nAustralian Prime Minister Scott Morrison also made it clear that cricketers competing in the IPL will have to make their “own arrangements” to return home.\n\n“There have been revelations that our government has made as far as Australians in India returning to Australia. No doubt there have been few distractions, but the travel side for us and Australians who are here is only a small issue,” Ponting said in a virtual press conference after his side lost to Royal Challengers Bangalore by one run.\n\n“On daily basis, we are thinking about what’s happening outside and we understand how blessed we are to be doing what we are doing. Hopefully, there are a number of people in India who got enjoyment by watching IPL cricket.”\n\nThree Australian players have exited the tournament amid the escalating health crisis, while Mumbai Indians batsman Chris Lynn requested Cricket Australia to arrange for a chartered flight to take them home after the event is over.\n\nThe BCCI has already assured that it will make arrangements for the return of the foreign players once the tournament ends.\n\nA second wave of COVID-19 pandemic has swept India and the country is recording over 3 lakh daily cases for the past few days, leaving the health infrastructure in shambles.\n\n\n\nIn the wake of the unprecedent health crisis, India and DC spinner Ravichandran Ashwin decided to take a break from the tournament to be with his family.\n\n“It is a really strange feeling amongst our team right now. We are very aware of what’s happening outside and in India at the moment. Obviously, our hearts go out to every single person that’s struggling with COVID-19 in the Indian society,” Ponting said.\n\n“We have had our one player leave as well, Ravichandran Ashwin left to be with his family so that is affecting, we are talking about it more than most teams are.”\n\nOn the one-run defeat to RCB, Ponting said, “Our last game went to a Super Over and against RCB, we lost by one run. That can only hold you in good stead when the bigger comes at the backend. We have got three games in four days, we have to take our learnings.\n\n“The team is disappointed but also proud how boys fought. We will not overanalyse.”\n\nDC will next take on Kolkata Knight Riders (KKR) here on Thursday.\n\nNew Zealand pacer Kyle Jamieson, who was bought by RCB for 15 crore, said he didn’t handle the pressure that comes with a high price tag too well initially.\n\n“I kind of ignored it a little bit in my mind and thought it would be fine, and I tried to focus on things I could control…in the first couple of weeks going through the Australia series we were playing, I didn’t handle the magnitude of the situation as best I could,” he said.\n\n“It (the price tag) certainly isn’t on my mind anymore. Yeah the first month, probably six weeks after the auction were tough and I guess I have learnt from that which will hold me in good stead.”"}, {"Article Image": "https://edata.ndtv.com/twittergft/sport_automated_story/big_637552388753053819.png", "Article's Title": "Chennai Super Kings vs Sunrisers Hyderabad live score over Match 23 T20 11 15 updates", "Article's Text": "Get the latest updates on IPL 2021 live score . Like us on Facebook or follow us on Twitter for more sports updates. You can also download the NDTV Cricket app for Android or iOS"}, {"Article Image": "https://c.ndtvimg.com/2021-04/bq5iebvc_ipl-rishabh-pant-delhi-capitals_625x300_28_April_21.jpg", "Article's Title": "DC vs KKR Preview, Indian Premier League: Delhi Capitals Face Kolkata Knight Riders After Royal Challengers Bangalore Disappointment", "Article's Text": "Kolkata Knight Riders' (KKR) floundering batting will be put to test once again as they look to build a winning momentum against a star-studded Delhi Capitals (DC) in their Indian Premier League (IPL) match in Ahmedabad on Thursday. KKR are batting issues right from the top with the highly talented Shubman Gill continuing his poor run, 89 runs from six outings. While their bowling, especially the 'master-apprentice' spin duo of Sunil Narine and Varun Chakravarthy, have done an excellent job in restricting the oppositions, KKR's top-order batting has hurt them the most.\n\nChasing an easy 124 against Punjab Kings (PBKS) in their last match, KKR's top-order cut a sorry figure to be at 17 for 3 inside three overs before skipper Eoin Morgan led from the front to snap their four-match losing streak.\n\nAgainst a DC batting line-up boasting tournament's leading run getter Shikhar Dhawan (265 runs), Prithvi Shaw, Steve Smith and the dangerous Rishabh Pant, KKR can't afford any more slip-up if they want to continue their ascent in the IPL points table.\n\nFirst-up, Morgan will have to fix the Gill conundrum. With scores of 15, 33, 21, 0, 11 and 9, the opener has failed to impress, extending his poor run of form from the England Test series.\n\nIt would not be a bad ploy to drop Gill down the order and bring back Narine to open with Rahul Tripathi, something that was suggested by the legendary Sunil Gavaskar.\n\nThe top-order reshuffle may be the way forward as the likes of Morgan, Andre Russell and Dinesh Karthik looked to have found their mojo in the middle.\n\nThursday's clash will see a mini battle between the Caribbean duo of Russell and Shimron Hetmyer who will be anxious to do well after DC suffered an agonising one-run defeat against Royal Challengers Bangalore (RCB) here on Tuesday.\n\nChasing 172 for a win, the DC were struggling at 92 for 4 but Hetmyer upped the ante in company of his captain and another left-hander Pant as the duo smashed explosive half-centuries but only to go down in a last-ball thriller.\n\nRussell too looked in his elements when he smashed Chennai Super Kings (CSK) bowlers all around the park in his 22-ball 54 but only in a losing cause.\n\nAfter Ravichandran Ashwin's pulling out, DC's bowling got a boost from Ishant Sharma who cleaned up the in-form Devdutt Padikkal with a peach of a delivery en route to a tidy 1/26.\n\nKKR batting will be put to test against the likes of Ishant, Kagiso Rabada and young gun Avesh Khan, while the spin duo of Amit Mishra and Axar Patel will also look to make an impact.\n\nThe Teams (From):\n\nDelhi Capitals: Rishabh Pant (c/w), Shikhar Dhawan, Prithvi Shaw, Ajinkya Rahane, Shimron Hetmyer, Marcus Stoinis, Chris Woakes, Shams Mulani, Amit Mishra, Lalit Yadav, Pravin Dubey, Kagiso Rabada, Anrich Nortje, Ishant Sharma, Avesh Khan, Steve Smith, Umesh Yadav, Ripal Patel, Vishnu Vinod, Lukman Meriwala, M Siddarth, Tom Curran, Sam Billings and Aniruddha Joshi.\n\nPromoted\n\nKolkata Knight Riders: Eoin Morgan (c), Dinesh Karthik, Shubman Gill, Nitish Rana, Tim Seifert, Rinku Singh, Andre Russell, Sunil Narine, Kuldeep Yadav, Shivam Mavi, Lockie Ferguson, Pat Cummins, Kamlesh Nagarkoti, Sandeep Warrier, Prasidh Krishna, Rahul Tripathi, Varun Chakravarthy, Shakib Al Hasan, Sheldon Jackson, Vaibhav Arora, Harbhajan Singh, Karun Nair, Ben Cutting, Venkatesh Iyer and Pawan Negi.\n\nMatch starts at 7.30pm IST"}, {"Article Image": "https://c.ndtvimg.com/2020-11/bi4r24ig_womens-t20-challenge-twitter_625x300_03_November_20.jpg", "Article's Title": "Women's T20 Challenge Unlikely To Happen: Report", "Article's Text": "The three-team Women's T20 Challenge, which is held during the IPL, is unlikely to go ahead this year given the current restrictions imposed by countries on air travel with India due to the massive spike in COVID-19 cases in the country. While the BCCI was planning a camp for the Indian women, the tournament has hit choppy waters as none of the Australian, English, South African or West Indies cricketers will be able to travel to India because of the unprecedented \"health crisis\".\n\n\"Getting Indian players quarantined is not an issue even now but no foreign player is keen to travel in the current climate. We can find a window later when things get better,\" a top BCCI source told PTI on conditions of anonymity.\n\nLast year with the IPL shifted to UAE, none of the Australian cricketers participated in the Women's T20 Challenge as it coincided with the Women's Big Bash League.\n\nPromoted\n\nHowever, with UK, Australia, and New Zealand suspending flight operations due to the pandemic, it is practically impossible to hold the tournament comprising Supernovas, Velocity and Trailblazers.\n\n\"Women's T20 challenge was supposed to be entirely held in Delhi. Right now, everyone is scared to come to Delhi and you can't fault them,\" said another source."}, {"Article Image": "https://c.ndtvimg.com/2021-04/jqcok2o8_nuwan-zoysa-twitter_625x300_28_April_21.jpg", "Article's Title": "Sri Lanka's Nuwan Zoysa Banned For Six Years For Trying To Fix Matches", "Article's Text": "Former Sri Lanka seamer and coach Nuwan Zoysa was on Wednesday banned from all cricket for six years after being found guilty of trying to fix matches and failing to disclose corrupt approaches from a suspected Indian bookie. The ban on Zoysa, a left-arm seamer, is backdated to October 31, 2018, when he was provisionally suspended. \"In his role as a national coach, he should have acted as a role model. Instead, he became involved with a corrupter and attempted to corrupt others,\" Alex Marshall, ICC General Manager - Integrity Unit said in a release.\n\n\"Contriving to fix a game betrays the basis of sporting principles. It will not be tolerated in our sport.\"\n\nThe 42-year-old, who played 30 Tests and 95 ODIs for Sri Lanka, was originally charged in 2018 after his stint as bowling coach of Team Sri Lanka in a T10 tournament organised in the UAE in 2017.\n\nIn its full judgement, the ICC said Zoysa was introduced to the Indian suspect in Colombo in 2017 during his time as Sri Lanka A's bowling coach.\n\nAfter a few interactions, the former bowler became aware that the man, referred to as Mr W in ICC documents, \"was involved in fixing matches, or aspects of matches\" and wanted to have Zoysa on board because, \"as a coach he knew players and would be able to get them to fix matches\".\n\n\"At (Mr W)'s request, Mr Zoysa approached (Player A) late in 2017 and askedhim whether, in connection with Sri Lanka's then upcoming series againstBangladesh and/or Zimbabwe, he would be willing to give away 12-15 runs in an over while bowling, or to get out deliberately when batting,\" the ICC judgement said.\n\n\"Mr Zoysa told (Player A) that he could get good money if he under-performed in this way. (Player A) immediately refused that approach and told Mr Zoysa that he wouldn't agree to do that,\" it added.\n\nFollowing full hearings and arguments, the Tribunal found Zoysa guilty of breaching articles relating to trying to fix matches, enticing others to breach the code of conduct and failing to report approaches by corrupt individuals.\n\nZoysa was also charged by the ICC on behalf of the Emirates Cricket Board for breaching three counts of their ECB Anti-Corruption Code for the T10 League and these proceedings are ongoing.\n\nHe had worked as a bowling coach of Sri Lanka A team in the past. Zoysa is the latest in a long line of Sri Lankan cricketers who have been banned by the ICC for corruption.\n\nPromoted\n\nEarlier this month, former pacer Dilhara Lokuhettige was banned from all cricket for eight years after being found guilty of breaching the ICC Anti-Corruption Code.\n\nIn 2019, Sanath Jayasuriya was banned for failing to co-operate with an Anti-Corruption Unit (ACU) investigation. In 2016, former Sri Lanka offspinner Jayananda Warnaweera was suspended under the code."}, {"Article Image": "https://c.ndtvimg.com/2021-04/1s14v40g_jofra-archer-bouncer-twitter_625x300_28_April_21.jpg", "Article's Title": "Watch: Jofra Archer's Nasty Bouncer During Training Leaves Batsman On All Fours", "Article's Text": "England fast bowler Jofra Archer, after undergoing a finger operation, returned to training recently and seems like he has already started bowling in full rhythm, as if he never went away from the game. In a video tweeted by county side Sussex, the Rajasthan Royals pacer can be seen bowling with full force during a net session. Archer, known for his well-directed bumpers, bowls a nasty bouncer in the beginning of the video, leaving the batsman on all fours. Luckily, not much damage was done as the batsman was able to get away from the line of the ball just in time. However, while doing that the batsman lost his balance and was seen lying on the pitch.\n\nHow many runs would you get off this @JofraArcher over? pic.twitter.com/rWx3bkSpbo — Sussex Cricket (@SussexCCC) April 27, 2021\n\nArcher, who won the Most Valuable Player of the season award in IPL last year, pulled out of the ongoing edition after undergoing an operation to remove glass fragments from his middle finger on right hand.\n\nLast week, the England and Wales Cricket Board released a statement to inform about Archer's withdrawal from the IPL 2021, currently taking place in India. The England cricket board said that they along with Sussex medical teams will continue to monitor his progress.\n\n\"Archer will now step up his training regime starting next week and will be in full training with Sussex. It is expected that he will return to cricket in the next fortnight if he can continue to bowl and prepare pain-free,\" the ECB said in a statement.\n\n\"The ECB will confirm which matches he is expected to play in due course.\"\n\nPromoted\n\nArcher had suffered a cut to his hand while cleaning at his home in January shortly before flying to India to prepare for the Test series earlier this year.\n\nBattling with the injury, Archer played in the two Test matches and five T20Is against India last month. However, he was ruled out of the three-match ODI series and returned to England for his operation."}, {"Article Image": "https://c.ndtvimg.com/2021-04/3lh1bia8_gaikwad-kishore-twitter_625x300_28_April_21.jpg", "Article's Title": "Indian Premier League 2021: CSK's Ruturaj Gaikwad And Sai Kishore Play Interesting Game. Watch", "Article's Text": "Chennai Super Kings' Ruturaj Gaikwad and Sai Kishore, on Tuesday, went head-to-head with each other during a 'you laugh, you lose' challenge. Chennai Super Kings (CSK) shared a clip on its official Twitter handle, where Gaikwad and Kishore were reading out jokes from a cue card. According to the rules of the game, if a person is laughing at a joke read by other contestants, he would lose a point. \"Strictly not for laughing! Si-rut-cha pochu ft. with our Lion to add some smiles to your day,\" CSK captioned the video on Twitter.\n\nStrictly not for laughing!\n\nSi-rut-cha pochu ft. with our to add some smiles to your day. #WhistlePodu #Yellove @saik_99 @Ruutu1331 pic.twitter.com/h5nvSiDjXX — Chennai Super Kings - Mask Pdu Whistle Pdu! (@ChennaiIPL) April 27, 2021\n\nBoth Gaikwad and Kishore asked each other a series of silly questions and then gave a comical answer to make each other laugh. However, in the end, Gaikwad won the challenge 2-0 as he was able to make Sai Kishore laugh on two occasions. On the other hand, Kishore was not able to get Gaikwad to smile even once at his jokes.\n\nAfter explaining the rules of the game, Kishore asked Gaikwad the first question, \"why was the stadium so hot?\" In response, Gaikwad said, \"Maybe, because I was there.\" Kishore then explained to him, \"it was hot because there were no fans.\"\n\nDuring their challenge, Gaikwad even made fun of Kishore by calling him a \"bad-tail-ender\" and comparing him with a \"racing car\", saying \"you blink and you miss them\".\n\nPromoted\n\nIt seems Gaikwad and Kishore shared an excellent rapport, and their camaraderie was on full display in the video.\n\nMS Dhoni's Chennai Super Kings will next take on David Warner's Sunrisers Hyderabad in the 23rd match of the Indian Premier League (IPL) on Wednesday in New Delhi. Chennai are placed at the second spot in the IPL table with eight points from five games. On the other hand, SRH are sitting at the bottom of the table with one win from five games."}, {"Article Image": "https://c.ndtvimg.com/2021-04/v4954neg_mumbai-indians-instagram_625x300_28_April_21.jpg", "Article's Title": "MI vs RR Preview, Indian Premier League 2021: Mumbai Indians Aim To Return To Winning Ways Against Lowly Rajasthan Royals", "Article's Text": "Defending champions Mumbai Indians will look to sort out their middle-order woes and bring their campaign back on track when they take on an inconsistent Rajasthan Royals in an IPL game, on Thursday. MI are coming into the match after suffering back-to-back losses, the last one being a nine-wicket defeat against Punjab Kings in Chennai and need to start the Delhi leg afresh. The Sanju Samson-led Rajasthan have lost thrice in the tournament so far and will seek to build on the six-wicket win over Kolkata Knight Riders in the previous match.\n\nMumbai skipper Rohit Sharma (201 runs) has got starts but hasn't played a big knock and the Mumbaikar would be itching to get one as would be his opening partner Quinton De Kock (47 runs). But Mumbai's middle-order, which boasts of hard-hitting batsmen like Suryakumar Yadav (154 runs), Ishan Kishan (73 runs), Hardik Pandya (36 runs), Krunal Pandya (29 runs) and Kieron Pollard (65 runs), hasn't fired in unison so far.\n\nThe middle-order can pummel any good attack into submission on any given day and Sharma would hope for their batting to click on Thursday when the action shifts to the Feroz Shah Kotla ground. In the bowling department, pace duo of Trent Boult (6 wickets) and Jasprit Bumrah (4 wickets) have been exceptional, particularly at the death.\n\nLeg-spinner Rahul Chahar (9 wickets) and Krunal (3 wickets) have also been impressive and will again need to play their parts to perfection. Pollard is used as the fifth or the sixth bowler even as Hardik plays solely as a batsman. Mumbai, however, might play Adam Milne in place of Jayant Yadav.\n\nRajasthan, on the other hand, have a lot of issues to ponder over, particularly in the absence of key foreign players - Jofra Archer, Ben Stokes, Liam Livingstone and Andrew Tye. RR are yet to have a settled opening combination. They tried Manan Vohra (42 runs) and Yashasvi Jaiswal (22 runs) at the top but both failed to convert their starts.\n\nEnglishman Jos Buttler would need to score big to compliment his skipper Sanju Samson, who is the team's leading run-scorer (187) despite being inconsistent. And the likes Shivam Dube, David Miller and Riyan Parag, would have to support the top-order by chipping in with much-needed contributions.\n\nAll-rounder Chris Morris (9 wickets and 48 runs) has blown hot and cold and will again be under pressure to deliver his high price tag. Left-arm pacer Chetan Sakariya (7 wickets) has been a revelation, while the experienced duo of Jaydev Unadkat (4 wickets) and Mustafizur Rahman (4 wickets) have been decent.\n\nThe three left-arm pacers along with Morris, however, need to be consistent. Leg-spinner Rahul Tewatia has got just one wicket from five games, while Shreyas Gopal, another leggie, has gone wicket-less in the two games he has played. Tewatia's role would be crucial if the Royals aim to contain the MI batting line-up, keeping in mind Amit Mishra's performance for Delhi. The dew won't be a factor on Thursday as it is an afternoon game.\n\nThe match starts at 3:30 PM.\n\nTeams (From):\n\nPromoted\n\nMumbai Indians: Rohit Sharma, Adam Milne, Aditya Tare, Anmolpreet Singh, Anukul Roy, Arjun Tendulkar, Chris Lynn, Dhawal Kulkarni, Hardik Pandya, Ishan Kishan, James Neesham, Jasprit Bumrah, Jayant Yadav, Kieron Pollard, Krunal Pandya, Marco Jansen, Mohsin Khan, Nathan Coulter-Nile, Piyush Chawla, Quinton De Kock (WK), Rahul Chahar, Saurabh Tiwary, Suryakumar Yadav, Trent Boult, Yudhvir Singh.\n\nRajasthan Royals: Sanju Samson (c & wk), Jos Buttler (wk), Yashasvi Jaiswal, Manan Vohra, Anuj Rawat, Riyan Parag, David Miller, Rahul Tewatia, Mahipal Lomror, Shreyas Gopal, Mayank Markande, Jaydev Unadkat, Kartik Tyagi, Shivam Dube, Chris Morris, Mustafizur Rahman, Chetan Sakariya, KC Cariappa, Kuldip Yadav, Akash Singh."}, {"Article Image": "https://c.ndtvimg.com/2021-04/pc44qdog_ipl-2021-csk-chennai-super-kings_625x300_28_April_21.jpg", "Article's Title": "Indian Premier League, CSK vs SRH: Fantasy Team Predictions", "Article's Text": "Delhi will host Match 23 of the ongoing Indian Premier League (IPL) between Chennai Super Kings (CSK) and SunRisers Hyderabad (SRH) on April 28. Three-time winners CSK are on a four-game winning streak after losing their opener to Delhi Capitals (DC) by seven wickets, MS Dhoni's men will be eager to keep the winning momentum with them as they face a struggling SRH captained by David Warner, who have only one victory under their belt this season.\n\nBoth teams possess an epic bunch of hard-hitters and wicket-takers like Sam Curran, Ravindra Jadeja, Jonny Bairstow, Rashid Khan and Faf du Plessis who have the ability to win games single-handedly on their won on a given day. Fans can depend on picking such match-winners in their fantasy teams.\n\nTop IPL 2021 Fantasy Picks for CSK vs SRH Match:\n\nRavindra Jadeja (Credits - 9.5): The stylish all-rounder has taken IPL 2021 by storm with his world-class all-round display in the starting five matches. So far, he has scored 102 runs and taken five wickets and inflicted crucial runouts and catches to help his team in all the three departments of the game.\n\nLooking at the 37 runs he scored in one over against Purple Cap Holder Harshal Patel, Jadeja is a must pick for fans in their fantasy teams.\n\nJonny Bairstow (Credits - 10): The Englishman has been one of the few in the SRH side that looked comfortable in all the five games played so far.\n\nHis quick starts at the beginning of the innings are yet to be capitalized upon by the SRH middle-order, but that hasn't distracted focus of the batter from scoring 211 runs at an average of over 50.\n\nFaf du Plessis (Credits - 10): The dependable South African hit a purple patch as soon as the tournament began. His 214 runs in five games have been scored at a phenomenal average of over 71 and a strike-rate nearing almost 140.\n\nHis maturity and experience have made him a pillar of consistency and a must take in any fantasy side.\n\nDavid Warner (Credits - 10.5): The SRH possess the highest fantasy rating between the two teams but is yet to prove his hitting abilities this season.\n\nPromoted\n\nTill now, he has a single fifty and an average below 30 which has been a problem of concern for his side, but known for strong comebacks, Warner needs only one big innings to turn it around for himself and his side.\n\nNote: Price of the players are mentioned beside their names as provided by iplt20.com"}, {"Article Image": "https://c.ndtvimg.com/2021-04/fiv9qae8_rashid-khan-david-warner-bcciipl_625x300_14_April_21.jpg", "Article's Title": "CSK vs SRH, Indian Premier League 2021: SunRisers Hyderabad Players To Watch Out", "Article's Text": "SunRisers Hyderabad (SRH) are not in a happy place, and that is an understatement. With just one win out of five matches, SRH are struggling to find the right formula and a winning combination. It is very strange that the side, with enough talent to beat anyone, should be struggling so badly. Their cause wasn't helped by the Super Over loss to Delhi Capitals, and now they face the confident Chennai Super Kings in a battle that they must win to stay in the race.\n\nHere are some key players for SRH:\n\nDavid Warner\n\nThe SRH skipper may not quite be the batsman he used to be, but Warner needs to really come good if he wants his team to realistically have any chance of improving their showing.\n\nWarner is languishing at the 17th position on the run-scorers' list, with an average of 27.20 and a strike rate of 113.33, both of which he needs to improve exponentially.\n\nKane Williamson\n\nKane Williamson, in spite of all his heroics for country and franchise, never ever seems to be really considered to be a decisive player for SRH, and that is a mystery.\n\nThe New Zealand star has 82 runs from two innings and has yet to be dismissed in IPL 2021. But his strike rate of 117.14 also reflects the lethargy in the SRH batting.\n\nRashid Khan\n\nPromoted\n\nWherever he plays, Rashid Khan is always a key bowler, be it for Afghanistan or the slew of franchises he represents. But he too has been a little off the boil this time around.\n\nWith six wickets from five games, Rashid is as always quite stingy, averaging 5.60, but since SRH don't always pose a challenge in terms of the number of runs, rivals have learned to play the leggie out, something that Rashid will have to address."}, {"Article Image": "https://images.indianexpress.com/2021/04/Untitled-design-14.jpg", "Article's Title": "Leicester’s Wesley Fofana thanks EPL for allowing him to break fast mid-game", "Article's Text": "Leicester's Wesley Fofana runs during the English Premier League match between Leicester City and West Bromwich Albion at the King Power Stadium in Leicester, England, Thursday, April 22, 2021. (AP Photo/Rui Vieira, Pool)\n\nLeicester defender Wesley Fofana has thanked the English Premier League for allowing him to break his fast during Ramadan in the middle of a match.\n\nLeicester’s game against Crystal Palace on Monday evening was briefly stopped in the first half to allow Fofana and Palace defender Cheikhou Kouyate to take a drink after the sun had gone down.\n\nDuring the month of Ramadan, which runs from April 12 to May 12 this year, fasting Muslims do not eat or drink during daylight hours.\n\n“That’s what makes football wonderful,” Fofana said in a post on Twitter after the match in which he thanked the league as well as Palace, and Palace goalkeeper Vicente Guaita, who delayed taking a goal kick on the half-hour mark to allow the fast to be broken.\n\nThe stoppage was agreed pre-match with referee Graham Scott. It is thought to be the first time it has happened in Premier League history.\n\nFofana was substituted during the second half of Leicester’s win over West Bromwich Albion last week to allow him to rest and take on food. Leicester manager Brendan Rodgers described the defender’s performances as “remarkable” considering the circumstances.\n\n“I’ve worked with lots of players with devotion to their faiths and for a lot of the guys it gives them strength,” Rodgers said after the West Brom game.\n\n“He’s finding an incredible strength to play continuously and train during Ramadan. He’s a special talent and a big player for us.”"}, {"Article Image": "https://edata.ndtv.com/twittergft/sport_automated_story/big_637552381071430161.png", "Article's Title": "Chennai Super Kings vs Sunrisers Hyderabad live score over Match 23 T20 6 10 updates", "Article's Text": "Get the latest updates on IPL 2021 live score . Like us on Facebook or follow us on Twitter for more sports updates. You can also download the NDTV Cricket app for Android or iOS"}, {"Article Image": "https://c.ndtvimg.com/2021-04/3n9na65g_neymar-instagram_625x300_28_April_21.jpg", "Article's Title": "PSG vs Manchester City, UEFA Champions League: When And Where To Watch Live Telecast, Live Streaming", "Article's Text": "Last year's runners-up Paris Saint-Germain face Manchester City in their upcoming semi-final first leg of the ongoing UEFA Champions League 2020-21 season, at the Parc des Princes on Thursday. PSG will be hoping to reach their second consecutive UCL final, following their defeat to Bayern Munich in last year's title showdown. In doing so, the Ligue 1 outfit will become the ninth side to do so in back-to-back campaigns, while only Atletico Madrid and Valencia failed to lift the trophy in either of their first two final appearances. It is also worth mentioning that Manchester City eliminated PSG in their only previous knockout tie meeting in European football, winning 3-2 on aggregate in the UCL quarter-final in 2015-16. Kevin De Bruyne scored the winner in the second leg at the Etihad.\n\nWhere will the PSG vs Manchester City Champions League semi-final first leg match be played?\n\nThe PSG vs Manchester City Champions League semi-final first leg match will be played at the Parc des Princes.\n\nWhen will the PSG vs Manchester City Champions League semi-final first leg match be played?\n\nThe PSG vs Manchester City Champions League semi-final first leg match will be played on Thursday, April 29.\n\nWhat time will the PSG vs Manchester City Champions League semi-final first leg match begin?\n\nThe PSG vs Manchester City Champions League semi-final first leg match will begin at 12:30 AM IST.\n\nWhich TV channels will broadcast PSG vs Manchester City Champions League semi-final first leg match?\n\nThe PSG vs Manchester City Champions League semi-final first leg match will be broadcasted live on Sony Network.\n\nWhere to watch the live streaming of PSG vs Manchester City Champions League semi-final first leg match?\n\nPromoted\n\nThe live streaming for PSG vs Manchester City Champions League semi-final first leg match will be available on Sony Liv.\n\n(All telecast and streaming timings are as per the information received from the host broadcasters)"}, {"Article Image": "https://c.ndtvimg.com/2021-04/otjjkka8_yuriko-koike-afp_625x300_28_April_21.jpg", "Article's Title": "Tokyo Games: Full Venues At Olympics \"Very Difficult\", Says Organisers", "Article's Text": "Full stadiums will be \"very difficult\" at the Tokyo Olympics, the head of the Games warned Wednesday, as a decision on how many domestic fans can attend was pushed back until June. Overseas spectators have already been barred from the Games for the first time, and a ruling on Japan-based fans was expected by the end of this month. But less than three months before the opening ceremony, parts of the country including Tokyo are under a coronavirus state of emergency and organisers said they needed more time. The opening ceremony is on July 23.\n\n\"As we look into the evolving situation with the domestic infections status involving new strains, we have agreed that a decision regarding spectator capacity at the Olympic and Paralympic venues will be made in June,\" Olympic officials said after top-level talks Wednesday.\n\nTokyo 2020 chief Seiko Hashimoto said it was now unlikely that fans would be filling the venues as in the Olympics past.\n\n\"We have to watch the situation and consider accordingly. As of now, full venues is very difficult, I understand that,\" she said.\n\nOrganisers also announced new virus rules for athletes including daily testing, up from a previous plan for tests every four days, as they try to hold the giant sporting event safely.\n\nBoth athletes \"and all those in close proximity with athletes will be tested daily to minimise the risk of undetected positive cases that could transmit the virus,\" Olympic officials said.\n\nOther rules for Olympic participants will include a ban on the use of public transport and avoiding restaurants.\n\nOlympic organisers hope that bolstering the rules will help build support for the 2020 Games in Japan, where polls show most people back either a cancellation or further delay.\n\n\"We are ready with you to take all the necessary measures to minimise the risks to make the Japanese people feel safe,\" International Olympic Committee chief Thomas Bach said at the start of the talks.\n\n\"Our top priority is health and safety for everyone -- not only for the participants of the Olympic Games but, first and foremost, also of our gracious hosts, the Japanese people.\"\n\n- 'People are anxious' -\n\nJapan has seen a comparatively small virus outbreak, with just over 10,000 deaths, but it is now battling what experts call a fourth wave of the virus.\n\nA new state of emergency was imposed on Tokyo and three other areas on April 25, and the government's top medical advisor warned Wednesday that discussions should start soon on how the Games could be held if infections remain high by the summer.\n\n\"What's very important is the situation of the infections and how overwhelmed the medical system is,\" Shigeru Omi told parliament in response to a question from an opposition lawmaker.\n\n\"I think it is time to discuss the Olympics,\" he added, while stopping short of calling for either a postponement or cancellation.\n\nOlympic officials insist the Games can still be held safely, Hashimoto last week saying that organisers are \"not thinking about cancellation\".\n\n\"There are so many people who are looking forward to the Games,\" she said on Wednesday.\n\n\"But, on the other hand, there are a lot of people who are anxious. That's the reality, and we need to look at both sides.\"\n\nOlympic chiefs took the unprecedented decision to ban overseas fans in March, in a bid to reduce virus risks.\n\nPromoted\n\nDomestic ticket sales have not yet resumed after last year's postponement. Organisers said around 4.48 million tickets had been sold in Japan, and nearly a million for the Paralympics.\n\nTickets purchased by overseas fans are being refunded, and organisers have also said that anyone who bought tickets in Japan is eligible for a refund if crowd numbers are cut."}, {"Article Image": "https://c.ndtvimg.com/2021-04/nd4n23so_dhoni-family-instagram_625x300_28_April_21.jpg", "Article's Title": "MS Dhoni Captured With Daughter Ziva In Vibrant Photographs. See Pics", "Article's Text": "MS Dhoni was photographed with his daughter in two adorable pictures, posted on Instagram. The pictures were uploaded via Ziva's Instagram account, and Dhoni can be seen holding his daughter with a picturesque background. The former India captain is married to Sakshi Singh Dhoni, and the duo have a daughter. Dhoni is currently playing in the ongoing Indian Premier League (IPL) 2021 season with Chennai Super Kings (CSK), for whom he also serves as skipper. CSK are currently second in the league table after four wins from five games, and have registered eight points. They are behind Royal Challengers Bangalore (RCB), who have won five fixtures in six matches.\n\nHere are the pictures:\n\nDespite CSK's consistent form this year, Dhoni hasn't really been able to show his cricket skills to its fullest pedigree. He has scored 37 runs in six games, with four fours and a six. The paltry amount of runs is due to his low position in CSK's batting order.\n\nHe is eighth in the list of most runs scored in IPL history. In 210 games, he has registered 4669 runs, with an unbeaten 84-run knock as his highest score in the tournament's history.\n\nCSK are currently up against SunRisers Hyderabad (SRH) in Match 23, on Wednesday. SRH are eighth in the league table, with only one win in five matches.\n\nPromoted\n\nIn their previous game, Dhoni skippered CSK to a huge 69-run win over RCB. Ravindra Jadeja was in hot form, helping CSK set a target of 192 runs, with an unbeaten knock of 62 runs off 28 deliveries.\n\nThe all-rounder also took three wickets as RCB crashed to 122 for nine in 20 overs."}, {"Article Image": "https://images.indianexpress.com/2020/03/Sharath-Kamal-1200-2.jpg", "Article's Title": "Amidst Covid disruption, Sharath Kamal confident ahead of Tokyo", "Article's Text": "Sharath Kamal has been building up the confidence for the past few years.\n\nFor the second time in as many years Achanta Sharath Kamal has entered a period of uncertainty. There are no plans to travel abroad for training camps as numerous table tennis destinations have shut their borders to Indians as the Covid-19 wave sweeps through the country. In the build up to his fourth Olympics, travel within India too has been a problem.\n\nHis mixed doubles partner Manika Batra had to travel to Chennai last week to train with him. The original plan was for him to practice at her training venue in Pune. The lockdown in Maharashtra resulted in change of plans\n\nAnd then, he says “I don’t know if (the Olympics) will happen.”\n\nTraining and preparation has continued, yet amidst the uncertainty, he says this is the most confident he has been ahead of an Olympic Games.\n\n“My ranking does the talking for that,” says the World No.32 during a SAI-organised press conference. “This is the best ranking I’ve had going into an Olympics. In 2004 I was just entering the international field. In 2008 I first broke into the top 100. In 2016, I was just coming back from an injury and even the qualifying stage took a toll on my body.”\n\nHe’s been building up the confidence for the past few years. Bronze medals at the 2018 Asian Games in Jakarta certainly had a lot to do with it.\n\nSharath Kamal spearheaded the men’s team to a bronze medal finish, the country’s first Asian Games medal in the sport, beating a star-studded Japanese team along the way. A day later the 38-year-old paired up with Batra to pick up an unexpected bronze medal in the mixed doubles event, beating the South Korean World No.5 duo of Sangsu Lee and Jihee Jeon enroute.\n\nIt’s in the mixed doubles event where India’s biggest chance of a medal lies at the Olympics.\n\n“The main reason (for the confidence) is the medal we won at the Asian Games, where Manika and I were paired up for the first time,” says Sharath, a TOPS-supported athlete.\n\n“We started to believe that if we can do it at the Asian Games, it can happen at the Olympics too. That is because Asia is the powerhouse of table tennis. The best teams are from here – China, Japan, South Korea. And then there are the subsidiaries of China – Hong Kong, Chinese Taipei and Singapore. When you can medal at the Asian Games, you have that confidence.”\n\nThe Indian pair were in Doha over a month back, competing at a mixed doubles tournament where only the winner would earn one of the 16 spots available for the event in Tokyo. They overcame the Singaporean duo of Lin Ye and Pang Yew En Koen 4-2 in the semi-final before drawing up against the top seeded Korean team they had beaten in Jakarta.\n\nThey started slow, losing the first two sets before taking the next four to pull-off another famous win.\n\n“That gives us a lot of confidence and faith that this is going to be the best Olympic Games in terms of performance and results,” he says.\n\nThe pair has continued to try and carry that momentum forward ever since. The recent training sessions in Chennai were the first part of many scheduled.\n\n“We’re hoping to have at least five-six days of good practice every month where we completely focus on mixed doubles,” he explains. “We’ve worked on a lot of aspects and training is divided into a few parts. The first is to work on footwork and coordination, the second is a bit more tactical.”\n\nThe contrasting styles make them an impressive pair.\n\n“She can slow down the game when needed, and I can speed it up. That way we can complement each other really well, and the opponent is not comfortable playing us. They want to finish the rally quickly, but we try to prolong the rally and make the opponent move much more than what they like,” Sharath adds.\n\nHe puts vicious power and spin on the ball. Batra, with the long pimpled rubber on her backhand side – which she switches mid-rally – plays a deceptive game that can frustrate the toughest opponents. But the World No.62, the highest ranked women’s player from India, also has a powerful forehand that makes a difference.\n\n“When Sharath hits his forehand, he opens up the opponent,” 2008 Olympian Neha Aggarwal had told The Indian Express. “But you need to have a partner who can hit the next shot with just as much power to finish off the rally. He’s never had that kind of partner for a while. But Manika’s new forehand complements his. She can match his intensity.”\n\nThey’ve been doing all they can amidst the chaos and uncertainty. With just 16 teams competing in the mixed doubles event, they need to win only three matches to secure a medal. The journey began for them three years ago, when the quietly confident pairing returned with India’s first mixed doubles medal at the Asian Games. Now that the mixed event is making its debut at the Olympics, they hope to repeat their success."}, {"Article Image": "https://images.indianexpress.com/2021/04/Liverpool-1.jpeg", "Article's Title": "Liverpool reports losses of $64M as pandemic takes effect", "Article's Text": "In March 2020, Liverpool announced a profit of 42 million pounds ($58 million), the fifth time in the previous six years the club had been in the black under its American ownership, Fenway Sports Group. (AP/FILE)\n\nLiverpool reported a pre-tax loss of 46 million pounds ($64 million) for the last financial year, mainly because of the impact the coronavirus outbreak had on the English champion’s media revenue and matchday income.\n\nThe losses for the financial year ending May 2020, a period covering the first three months of the pandemic when the Premier League was suspended, equated to a negative swing of 88 million pounds ($122 million) from Liverpool’s position a year ago.\n\nMedia income dropped by 59 million pounds ($82 million) and the four fewer Premier League home games during this period saw matchday revenue decrease by 13 million pounds ($18 million).\n\nCommercial revenue rose by 29 million pounds ($40 million) to 217 million pounds ($300 million) on the back of eight new partnerships being announced.\n\nIn March 2020, Liverpool announced a profit of 42 million pounds ($58 million), the fifth time in the previous six years the club had been in the black under its American ownership, Fenway Sports Group.\n\n“We were in a solid financial position prior to the pandemic and since this reporting period we have continued to manage our costs effectively and navigate our way through such an unprecedented period,” Liverpool managing director Andy Hughes said. “We can now look ahead to the conclusion of this season and hopefully a more normal start to next season.”\n\nFSG, which has been heavily criticized by Liverpool fans for its involvement in helping to form the ill-fated European Super League, sold a 10% share of its business to private investment firm RedBird Capital for 543 million pounds ($750 million) last month."}, {"Article Image": "https://images.indianexpress.com/2021/04/Untitled-design-3-6.jpg", "Article's Title": "Bayern Munich appoints Leipzig coach Julian Nagelsmann to replace Hansi Flick", "Article's Text": "Leipzig's head coach Julian Nagelsmann reacts during the German Bundesliga soccer match between RB Leipzig and TSG 1899 Hoffenheim in Leipzig, Germany, Friday, April 16, 2021. (Jan Woitas/Pool via AP)\n\nBayern Munich hired Leipzig coach Julian Nagelsmann on Tuesday to replace the departing Hansi Flick starting next season.\n\nThe 33-year-old Nagelsmann will move to Bayern on July 1 with a contract that runs through 2026.\n\nBayern said it agreed to terminate Flick’s contract after he asked to be released early.\n\nLeipzig CEO Oliver Mintzlaff said Bayern agreed to its demand for a high fee for Nagelsmann, without specifying a sum.\n\nNagelsmann grew up near Munich and came through the youth system at another club in the city.\n\n“There were some inquiries from other clubs. I told Oli (Mintzlaff) that I wouldn’t want to end my contract for any other club but this one,” Nagelsmann said.\n\nHe added the first contact from Bayern came on April 16 after Leipzig’s game against Hoffenheim. That was after Flick told Bayern management he wanted to leave but a day before he went public.\n\n\n\nNagelsmann has been with Leipzig for three years and led the team to the Champions League semifinals in 2020. Leipzig is in second place behind Bayern in the Bundesliga, and will play Werder Bremen on Friday for a place in the final of the German Cup.\n\nNagelsmann was the youngest head coach in league history when he took over at Hoffenheim at 28 in 2016. The team then qualified for the Champions League for the first time in its history.\n\nNagelsmann was a professional player but moved into coaching when his career ended early because of knee injuries.\n\n“Julian Nagelsmann signifies a new generation of coaches,” Bayern president Herbert Hainer said. “Despite his young years, he has already built an impressive career. We are convinced that we will build on the great successes of recent years together with Julian Nagelsmann.”\n\nNagelsmann will join up again with defender Dayot Upamecano, who is also moving to Bayern from Leipzig at the end of the season.\n\nBayern was forced to look for a new coach after Flick said this month he wanted to leave the club despite having a contract through 2023. Flick won the league, German Cup and Champions League last season with Bayern and is on the verge of bowing out with another league title.\n\nBayern will secure the Bundesliga title if it wins its next game on May 8 against Borussia Mönchengladbach or if Leipzig loses to Borussia Dortmund the same day.\n\nBayern initially appointed Flick in 2019 as an interim coach when Niko Kovac was fired. He was supposed to step in for a few weeks but the team’s winning run meant he was given an extension, first until the end of the 2019-20 season, then until 2023.\n\nFlick has not been able to celebrate any trophies in front of the team’s fans because of the pandemic. Only the European Super Cup in Hungary and Club World Cup in Qatar were won in front of small numbers of supporters."}, {"Article Image": "https://images.indianexpress.com/2021/04/Untitled-design-4-4.jpg", "Article's Title": "Madrid and Chelsea draw 1-1 in Champions League semifinals", "Article's Text": "Chelsea's head coach Thomas Tuchel, 2nd right, reacts as Chelsea's Christian Pulisic, left, celebrates after scoring the opening goal during the Champions League semifinal first leg match between Real Madrid and Chelsea at the Alfredo di Stefano stadium in Madrid, Spain, Tuesday, April 27, 2021. (AP Photo/Bernat Armangue)\n\nWith a dominant start and a milestone goal by Christian Pulisic, Chelsea showed its strength against Real Madrid in the Champions League semifinals.\n\nChelsea took control early in Tuesday’s first leg to hold the Spanish powerhouse to a 1-1 away draw, with Pulisic becoming the first U.S. international to score in the tournament’s last four. He also surpassed DaMarcus Beasley to become the top American scorer in Champions League history with five goals.\n\nA red-hot Karim Benzema equalized for a lackluster Madrid squad on a rainy night at the Alfredo Di Stéfano Stadium in the first Champions League match since the controversial Super League folded last week amid widespread criticism.\n\nThe largely closed breakaway competition would have had Real Madrid as one of its leaders, and Chelsea also was among its founding members before dropping the idea along with the other English clubs. Madrid didn’t officially back out of the Super League but had downplayed the possibility of retaliation by UEFA in its Champions League matches. There were no refereeing controversies in Tuesday’s match.\n\nReal Madrid’s Karim Benzema celebrates with Toni Kroos, left, after scoring his side’s first goal during the Champions League semifinal first leg match between Real Madrid and Chelsea at the Alfredo di Stefano stadium in Madrid, Spain, Tuesday, April 27, 2021. (AP Photo/Bernat Armangue) Real Madrid’s Karim Benzema celebrates with Toni Kroos, left, after scoring his side’s first goal during the Champions League semifinal first leg match between Real Madrid and Chelsea at the Alfredo di Stefano stadium in Madrid, Spain, Tuesday, April 27, 2021. (AP Photo/Bernat Armangue)\n\nThe second leg is on May 5 in London. Manchester City hosts Paris Saint-Germain in the other semifinal on Wednesday.\n\nChelsea got off to a fast start and had chances to add to its lead after Pulisic opened the scoring with a nice finish in the 14th minute off a high pass by Antonio Rudiger inside the area. Pulisic calmly got past goalkeeper Thibaut Courtois before hitting the net past the Madrid defenders trying to block his shot at the goal line.\n\n“It was a great finish, great composure,” Chelsea captain César Azpilicueta said of the 22-year-old Pulisic, who has been thriving after being marred by injuries early in the season. “He’s an amazing player, he’s a young player, he’s growing and improving. I’m very pleased with his goal because he’s an important player for the team.”\n\nPulisic is the second U.S. international to play in a Champions League semifinal after Beasley for PSV Eindhoven in a first-leg game against AC Milan in 2005.\n\nMadrid evened the match on Benzema’s volley from inside the area in the 29th, and there were few significant chances either way during the rest of the game.\n\nBenzema’s goal came a few minutes after he clipped the post with a long-range shot. The French striker controlled a loose ball with his head before turning and firing a volley into the top of the net for his 13th goal in his last 14 matches. It was Benzema’s 16th goal in his last 17 home games with Madrid.\n\nHighlights:\n\nChelsea gave little space to Madrid and was the more dangerous team early on at the Di Stéfano in Madrid’s training complex. The hosts struggled defensively with their setup of three central defenders.\n\n“We started the game very, very well — very aggressively, with a lot of quality,” Chelsea coach Thomas Tuchel said. “We deserved to win the first half. We had a lot of chances. We should have scored at least one more when the chances and half-chances were there.”\n\nNot long before Pulisic’s opener, Timo Werner had his strike from in front of the goal stopped by a superb reflex save by Courtois, a former Chelsea player.\n\n“It’s true that it was a complicated first half,” Real Madrid coach Zinedine Zidane said. “But we are still alive going into the second leg. We are happy with the result in general.”\n\nFormer Chelsea forward Eden Hazard, coming off a long injury layoff, entered the match in the second half but couldn’t find spaces to spark Madrid to victory.\n\nMadrid, making a record 14th semifinal appearance, won three straight Champions League titles from 2016-18, before Cristiano Ronaldo left, but the 13-time champion was eliminated in the round of 16 in the last two editions.\n\nChelsea won the European title in 2012 and returned to the semifinals two years later, but hadn’t been back to the last four since. Tuchel is trying to make it to a second consecutive final after a runner-up finish with Paris Saint-Germain last season. Chelsea has only two losses since the German coach took over in January."}, {"Article Image": "https://c.ndtvimg.com/2021-04/utfqet48_ricky-ponting-delhi-capitals-bcciipl_625x300_26_April_21.jpg", "Article's Title": "Delhi Capitals Head Coach Ricky Ponting Says Travelling Back Home Small Issue Compared To Situation Outside IPL Bio-Bubble", "Article's Text": "Australian players might be a bit apprehensive following the suspension of flights from India but Delhi Capitals' head coach Ricky Ponting said it's a \"small issue\" when compared to the chaos triggered by the second wave of COVID-19 infections. Australia on Tuesday suspended all direct passenger flights from India until May 15 due to the \"very significant\" spike in COVID-19 cases in India.\n\nAustralian Prime Minister Scott Morrison also made it clear that cricketers competing in the IPL will have to make their \"own arrangements\" to return home.\n\n\"There have been revelations that our government has made as far as Australians in India returning to Australia. No doubt there have been few distractions, but the travel side for us and Australians who are here is only a small issue,\" Ponting said in a virtual press conference after his side lost to Royal Challengers Bangalore by one run.\n\n\"On daily basis, we are thinking about what's happening outside and we understand how blessed we are to be doing what we are doing. Hopefully, there are a number of people in India who got enjoyment by watching IPL cricket.\"\n\nThree Australian players have exited the tournament amid the escalating health crisis, while Mumbai Indians batsman Chris Lynn requested Cricket Australia to arrange for a chartered flight to take them home after the event is over.\n\nThe BCCI has already assured that it will make arrangements for the return of the foreign players once the tournament ends.\n\nA second wave of COVID-19 pandemic has swept India and the country is recording over 3 lakh daily cases for the past few days, leaving the health infrastructure in shambles.\n\nIn the wake of the unprecedent health crisis, India and DC spinner Ravichandran Ashwin decided to take a break from the tournament to be with his family.\n\n\"It is a really strange feeling amongst our team right now. We are very aware of what's happening outside and in India at the moment. Obviously, our hearts go out to every single person that's struggling with COVID-19 in the Indian society,\" Ponting said.\n\n\"We have had our one player leave as well, Ravichandran Ashwin left to be with his family so that is affecting, we are talking about it more than most teams are.\"\n\nOn the one-run defeat to RCB, Ponting said, \"Our last game went to a Super Over and against RCB, we lost by one run. That can only hold you in good stead when the bigger comes at the backend. We have got three games in four days, we have to take our learnings.\n\nPromoted\n\n\"The team is disappointed but also proud how boys fought. We will not overanalyse.\"\n\nDC will next take on Kolkata Knight Riders (KKR) in Ahmedabad on Thursday."}, {"Article Image": "https://c.ndtvimg.com/2020-07/pq3lrlq8_boxing-afp_625x300_24_July_20.jpg", "Article's Title": "Asian Boxing Championship Moved From Delhi To Dubai Due To COVID-19", "Article's Text": "The Asian Boxing Championship which was scheduled to be held in Delhi next month was on Wednesday moved to Dubai because of the deepening COVID-19 crisis in India but the national federation will remain a co-host along with its UAE counterpart. The tournament was to be held at the Indira Gandhi Indoor Stadium from May 21 to 31 in the national capital, which is recording over 20,000 daily cases right now. \"In the wake of international travel restrictions to India, the Boxing Federation of India (BFI), in consultation with Asian Boxing Confederation (ASBC), has decided to conduct the upcoming 2021 edition of the ASBC Asian Elite Men and Women Boxing Championships in Dubai,\" the BFI said in a statement.\n\n\"The event will now be organised by BFI in association with UAE Boxing Federation. The daily addition of over 3 lakh new cases has led to several countries imposing bans on flights to and from India.\n\n\"...with the newly-imposed international travel restrictions from many countries due to the prevailing pandemic situation, BFI and ASBC jointly took a decision to relocate the tournament,\" the BFI said.\n\nThe national body's President Ajay Singh said it was a difficult decision but one that had to be taken.\n\n\"It's unfortunate that we have to shift the venue out of India. We were very keen to host the championships in Delhi but we are left with no options,\" he said.\n\n\"Boxers' safety is the most important concern for us and hence we had to take this decision. We closely monitored the situation and after deliberation with ASBC as well as the Government of India, we decided to conduct the tournament in Dubai,\" he added.\n\nPromoted\n\nIn a communication to all the member national federations , ASBC informed that the upcoming edition of the championships will now take place between May 21 to June 1.\n\nThe Indian men's team for the event is yet to be announced but the women's team has been named and will be spearheaded by the iconic MC Mary Kom (51kg)."}, {"Article Image": "https://c.ndtvimg.com/2021-04/r1duq9mg_gayle-twitter_625x300_28_April_21.jpg", "Article's Title": "Indian Premier League: Chris Gayle Shows His 'Touch' And Not Just In Cricket. Watch", "Article's Text": "Self-proclaimed Universe Boss Chris Gayle is known for finishing cricket matches for his side. However, in an interesting turn of events, Gayle on Wednesday used his 'finishing touches' to score a goal during the Indian Premier League (IPL) team Punjab Kings' practice session. PBKS played their last match against Kolkata Knight Riders (KKR) on Monday and the KL Rahul-led outfit is enjoying a short break from their packed IPL schedule. Punjab will next take on Virat Kohli's Royal Challengers Bangalore (RCB) on Friday.\n\nSharing the short clip on Twitter, Punjab Kings wrote, \"Be it football or cricket, #UniverseBoss certainly knows how to apply finishing touches.\"\n\nSoon the comments section was filled by with people showing their admiration for Gayle.\n\n\"Waiting for him to perform like a storm, after all, universe boss,\" a fan wrote in the comment section.\n\nwaiting him to perform like a strom\n\nafterall universe boss — ayush (@ayush82173491) April 28, 2021\n\n\"UNIVERSE BOSS FOR A REASON,\" wrote another user.\n\nUNIVERSE BOSS FOR A REASON — CricketBuddy99 (@CBuddy99) April 28, 2021\n\nAnother follower of the team asked the franchise to play him as an opener. \"PLAY HIM AT 1,\" he said.\n\nPLAY HIM AT 1 — Rahul (@RahulPBKS) April 28, 2021\n\n\"Play football, but don't play with our emotions,\" wrote a PBKS fan in the comment section.\n\nPlay football, but don't play with our emotions.... — viresh swami (@vdviresh532) April 28, 2021\n\nThe KL Rahul-led outfit has not done well in IPL 2021 thus far. Punjab have won just two games from their opening six games and are placed in the bottom half of the points table.\n\nPunjab started the 14th edition of the cash-rich league on a positive note by defeating Rajasthan Royals (RR) by four runs in a last-over thriller.\n\nPromoted\n\nHowever, they failed to cash in on the victory, as they lost their next three games at the hands of Chennai Super Kings (CSK), Delhi Capitals (DC) and Sunrisers Hyderabad (SRH). A resurgent Punjab hammered reigning champions Mumbai Indians (MI) by nine wickets.\n\nBut in their next match, they were beaten by a struggling Kolkata Knight Riders (KKR) by five wickets."}, {"Article Image": "https://c.ndtvimg.com/2021-04/v9rh796k_ipl-csk-vs-srh-live-blog-david-warner-manish-pandey-srh_625x300_28_April_21.jpg", "Article's Title": "IPL 2021 Live Match Score, CSK vs SRH: David Warner, Manish Pandey Stitch Strong Stand For 2nd Wicket vs Chennai Super Kings", "Article's Text": "SRH 20/0 After 3!\n\n\n\n\n\nWe can expect the spinners in action soon from MSD.\n\nSRH are looking solid with no wickets loss in 3 overs."}, {"Article Image": "https://c.ndtvimg.com/2021-04/mrm89m6o_jadeja-bcci-ipl_625x300_25_April_21.jpg", "Article's Title": "CSK vs SRH, Indian Premier League 2021: Chennai Super Kings Players To Watch Out", "Article's Text": "Chennai Super Kings (CSK) will take on SunRisers Hyderabad (SRH) in what will be the first Indian Premier League (IPL) 2021 match in Delhi this season. Due to the ongoing coronavirus pandemic, all the eight franchises are playing at neutral venues. The MS Dhoni-led CSK are in a comfortable position on the IPL 2021 points table after winning four of their first five games. The three-time IPL champions will look to continue their form as they take on an inconsistent SRH outfit on Wednesday. CSK, despite being on a four-match winning streak, will need to careful against SRH as they have the bowlers that are hard to put away. Faf du Plessis, Suresh Raina and Ruturaj Gaikwad have been doing the bulk of scoring for CSK this season but the game changer in the last few games has been Ravindra Jadeja. CSK will also have the option to try Jason Behrendorff as the Australia pacer has completed his mandatory quarantine and has joined the rest of the squad in Delhi.\n\nHere are some of CSK's key players:\n\nFaf du Plessis\n\nWith 214 runs from five games, Du Plessis has been the standout performer with the bat for CSK in IPL 2021. The South Africa batsman has scored two half-centuries in five outings with a strike-rate of 138.96.\n\nCSK will be hoping that he can once again provide them with a solid start as they take on SRH.\n\nSuresh Raina\n\nRaina's availability this season has changed CSK's approach in the middle overs. The former India all-rounder marked his return to IPL with a half-century but since then hasn't got the chance to make a notable contribution as the openers have been performing well.\n\nRaina is known to take on the spinners and he could well be CSK's answer to the mystery of Rashid Khan when the two teams meet in Delhi on Wednesday.\n\nRavindra Jadeja\n\nPromoted\n\nJadeja came into the IPL 2021 after recovering from a shoulder injury that kept him away from the game for over two months. The left-hander has been one of the star performers in the tournament so far, shining with both bat and ball.\n\nIn his last match, Jadeja smashed 62 runs off just 28 deliveries as he took down Harshal Patel, scoring 36 runs off the final over. He then took three for 13 from his four-over spell to seal the win for CSK. Jadeja can once again prove to be the game-changer for CSK."}, {"Article Image": "https://edata.ndtv.com/twittergft/sport_automated_story/big_637552366180339023.png", "Article's Title": "Chennai Super Kings vs Sunrisers Hyderabad live score over Match 23 T20 1 5 updates", "Article's Text": "Get the latest updates on IPL 2021 live score . Like us on Facebook or follow us on Twitter for more sports updates. You can also download the NDTV Cricket app for Android or iOS"}]