[{"Article Image": "https://i.gadgets360cdn.com/large/sundar_pichai_reuters_1616735904768.jpg", "Article's Title": "Man Tweets To Google CEO Sundar Pichai, for Help Resetting His Gmail Password", "Article's Text": "What would you do if you forget your Gmail password? For Indian Twitter user, @Madhan67966174, the answer was simple — ask Google's CEO for tech support. He replied to one of the tweets by Sundar Pichai and asked if the Google boss could help him reset his password. “Hello, sir. How are you? I need help with my Gmail ID password. I forgot how to reset the password. Please help me,” Madhan wrote, replying to one of Pichai's recent tweets about COVID relief.\n\nThe Google CEO had just announced that his company would provide a Rs. 135-crore funding to UNICEF and the non-profit Give India to help the country in its fight against the second wave of the COVID-19 pandemic. Apparently, the Twitter user thought this was the best place to get help with his problem.\n\nHello sir\n\nHow are you\n\nI need one help in my gmail id password I forgeted how to reset the password please help me — Madhan (@Madhan67966174) April 26, 2021\n\nThough the Google boss didn't reply to the query, many others did. The replies were laced with sarcasm and humour. A user, @vaidyab, said Pichai is currently in the US, and once the travel restrictions are lifted he will personally visit Madhan and help him resent his password.\n\nCurrently @sundarpichai is in the US, once the travel restrictions are lifted he will personally come to your home n help you recover the pw and hopefully your wait of 2 years will end ????. Also incase you want chocolates pl. don't be shy to ask... until then stay home stay safe. — Bobbili Vaidyanath (@vaidyab) April 26, 2021\n\nAnother user equated Madhan to God, saying his tweet managed to bring smiles to their faces at a time when Indians are faced with a challenging situation.\n\nU r God.\n\nWhen situation in India is so bad and people forgot how to smile.\n\nU managed to add a smile so effortlessly ???????? — Devi Prasad (@RealDeviPrasad) April 27, 2021\n\nFunnily enough, this was not the first time Madhan sought assistance from Pichai. On February 17, 2020, he had tagged Pichai in another tweet, seeking a similar kind of in resetting his Gmail account password that he had forgotten. It looks like he has a lot of trouble with his account.\n\nhi sir how r u\n\n\n\nplease help me in my gmail account password i forgeted\n\nkindly recovery the mail id password please do needful help me sir — Madhan (@Madhan67966174) February 17, 2020\n\nTech CEOs get together to offer aid to India\n\nApart from Pichai offering to help India in its fight against COVID-19, his Microsoft and Apple counterparts, Satya Nadella and Tim Cook, respectively, have also expressed concern over the prevailing healthcare crisis and pledged support.\n\nOn Tuesday, India saw a record single-day rise of 3,60,960 coronavirus cases, which pushed the total tally to 1,79,97,267. The death count crossed two lakh, following 3,293 fresh fatalities on Tuesday, according to Union health ministry data updated on Wednesday."}, {"Article Image": "https://images.livemint.com/img/2021/04/28/600x338/oxygen_1593097344347_1619608611981.jpg", "Article's Title": "Covid-19: 1 lakh portable oxygen concentrators to be procured from PM CARES fund", "Article's Text": "Prime Minister Narendra Modi has sanctioned the procurement of 1 Lakh Portable Oxygen Concentrators from the PM Cares Fund.\n\nThe decision was taken at a high-level meeting chaired by Prime Minister Shri Narendra Modi to discuss the measures needed to improve Liquid Medical Oxygen (LMO) Supply for COVID management. PM instructed that these Oxygen Concentrators should be procured at the earliest & provided in states with high case burden, PIB said.\n\nIn addition to the earlier sanctioned 713 PSA plants under PM Cares Fund, 500 new Pressure Swing Adsorption (PSA) oxygen plants have been sanctioned under PM CARES Fund.\n\nThe PSA plants will augment the supply of Liquid Medical Oxygen at hospitals in district headquarters and Tier 2 cities. These 500 PSA plants will be established with transfer of the indigenous technology developed by DRDO and CSIR to the domestic manufacturers.\n\nEstablishing PSA plants and procurement of portable oxygen concentrators will greatly augment the supply of oxygen near the demand clusters, thereby addressing the current logistical challenges in transporting oxygen from plants to hospitals, the release said.\n\nOn Wednesday, the Defence Research and Development Organization (DRDO) said it would be setting up 500 medical oxygen plants in the country under the PM CARES fund programme. A statement from the DRDO said the medical oxygen plant (MOP) technology was developed to supply oxygen on board the light combat aircraft (LCA) by the Defence Bioengineering and Electromedical Laboratory (DEBEL). The same technology will be used to fight the current oxygen crisis facing covid-19 patients in the country.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter."}, {"Article Image": "https://images.livemint.com/img/2021/04/28/600x338/48c7faee-a537-11eb-a6ca-1ce56e8b7c0c_1619335098774_1619621541686.jpg", "Article's Title": "India’s need for oxygen is hitting demolition of old ships", "Article's Text": "India’s ship-demolition industry, among the world’s largest, is having to scale back the dismantling of obsolete vessels to help the nation cope with a surge in coronavirus cases, joining several other sectors already affected by a shortage of oxygen at the nation’s hospitals.\n\nWorkers on beaches in India and other countries on the subcontinent use oxygen-fueled blow torches to cut up giant freighters once they’ve reached the end of their useful lives. Because of the shortage, any oxygen supplies that could have been diverted toward hospitals have been, according to Anil Sharma, the chief executive officer of Global Marketing Systems Inc., a company that buys vessels from owners and sells them to the yards for recycling.\n\n“The oxygen shortage is not expected to last for long and the situation should improve in May,\" said Sharma. However, by then ship-recycling will be limited with the onset of monsoons in India which can extend the slowdown in operations into June, he added.\n\nCapacity to break up the aging freighters has dropped by 80% in the past week, GMS estimates. There are other examples of industries being affected by the oxygen shortage. Maruti Suzuki India Ltd., the nation’s biggest carmaker, said it is shutting its plant for maintenance to divert supplies to hospitals, while India’s steel output may decline as more and more steelmakers divert their oxygen stocks for medical purposes.\n\nThe delivery of vessels for scrapping had already been heavily curbed as various countries banned seafarers from traveling to and from India. This may negatively impact the buying and selling of ships, resulting in constrained supply of carriers for recycling, Sharma said.\n\nAvailability of carriers for scrapping had anyway declined in recent months amid high freight rates in several shipping sectors. Only 43 ships were recycled at Alang, India in the first quarter of 2021, a 27% drop from the same period last year, according to GMS.\n\n“Profitability for the ship-recycling industry won’t go down, as steel fundamentals are strong,\" Sharma said. “Oxygen shortages in India should ease in a few weeks with an acceleration in the setup of production plants, but supply of ships may be limited.\"\n\n\n\n\n\nThis story has been published from a wire agency feed without modifications to the text.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter."}, {"Article Image": "https://images.livemint.com/img/2021/04/28/600x338/b17bd1da-9ea9-11eb-aa67-d1e615859831_1618662706131_1619616690410.jpg", "Article's Title": "PM Modi speaks to Russian President Vladimir Putin, discusses Covid-19 situation", "Article's Text": "Prime Minister Narendra Modi spoke to Russian President Vladimir Putin on Wednesday to discuss Covid situation. He also thanked him for Russia's help and support in India's fight against Covid. Further, he also said that India and Russia's cooperation on Sputnik V vaccine will assist humanity in battling the pandemic.\n\n''Had an excellent conversation with my friend President Putin today. We discussed the evolving COVID-19 situation, and I thanked President Putin for Russia's help and support in India's fight against the pandemic,'' PM Modi tweeted.\n\nWe also reviewed our diverse bilateral cooperation, especially in the area of space exploration and renewable energy sector, including in hydrogen economy. Our cooperation on Sputnik-V vaccine will assist humanity in battling the pandemic, he added.\n\nPM Modi further informed that both the leaders reviewed the diverse bilateral cooperation, especially in the area of space exploration and renewable energy sector, including in hydrogen economy.\n\n''To add further momentum to our strong strategic partnership, President Putin and I have agreed to establish a 2+2 Ministerial Dialogue between our Foreign and Defence Ministers,'' the tweet said.\n\nThe Russian Direct Investment Fund (RDIF) on Tuesday said it will export the first batch of Sputnik V vaccine to India from 1 May, the day India expands its covid-19 immunization drive to cover all adults.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter."}, {"Article Image": "https://images.livemint.com/img/2021/04/28/600x338/26a0aa06-9baa-11eb-bcc6-91c576c9961b_1619619713978_1619619783101.jpg", "Article's Title": "Serum CEO Adar Poonawalla to get Y category security cover", "Article's Text": "Serum Institute of India CEO Adar Poonawalla will get 'Y' category security cover by the CRPF, the union home ministry of home affairs notified on Wednesday.\n\nThe 'Y' category security comprises 11 personnel, including one or two commandoes and police personnel.\n\nThe centre's decision has come after Director, Government and Regulatory Affairs at Pune-based Serum Institute, Prakash Kumar Singh had written to Union Home Minister Amit Shah on April 16 requesting security for Poonawalla.\n\nIn this letter, Singh had stated that Poonawalla has been getting threats from various groups regarding the COVID-19 vaccine supplies.\n\nIn this letter, Singh also said, \"We are working shoulder to shoulder to fight against COVID-19 pandemic with the Government of India under the dynamic leadership of Prime Minister Narendra Modi Ji.\"\n\nCovishield, one of the two COVID-19 vaccines used in India's COVID-19 vaccination programme, is being manufactured by SII.\n\nSeparately, the SII-Pune has announced a cut in price of Covishield it plans to sell to states to ₹300 per dose from the earlier ₹400.\n\nPoonawalla announced about this new update on Twitter. He wrote: \"As a philanthropic gesture on behalf of @SerumInstIndia, I hereby reduce the price to the states from ₹400 to ₹300 per dose, effective immediately; this will save thousands of crores of state funds going forward. This will enable more vaccinations and save countless lives\".\n\nThis follows widespread criticism of its pricing policy as the insitute has sold the initial doses of Covishield to the central government at ₹150 per dose.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter."}, {"Article Image": "https://images.livemint.com/img/2021/04/28/600x338/PTI04_24_2021_000294A_1619618397240_1619618410044.jpg", "Article's Title": "COVID-19: J&K imposes 84-hour-long lockdown in 11 districts from April 28", "Article's Text": "Jammu and Kashmir has imposed an 84-hour-long lockdown in its 11 districts starting from Thursday evening, April 29. The curfew will come into effect at 7 pm on Thursday and remain in force till 7 am on Monday.\n\n\"Eleven districts including Srinagar, Anantnag, Baramulla, Budgam, Kulgam, Pulwama, Ganderbal, Jammu, Kathua, Reasi, Udhampur will be under ‘corona curfew’ from Thursday evening (7 pm) till Monday morning (7 am)\", Simrandeep Singh, Secretary of the Disaster Management Relief, Rehabilitation and Reconstruction Department said.\n\nThe detailed orders under the Disaster Management Act listing out prohibitions and permissible activities will be issued by the deputy commissioners, he said.\n\nEarlier, the Jammu and Kashmir administration had announced a 34-hour curfew from 8 pm on Saturday. On April 8, a night curfew from 10 pm to 6 am was imposed in the urban areas of eight districts, which was extended to the municipal and urban local body limits of all the 20 districts in the UT on April 20.\n\nThe union territory had on Wednesday reported 3,023 new cases of coronavirus, taking up the caseload to 1,69,077. Moreover, the death toll climbed to 2,227 as the union territory reported 30 additional deaths due to coronavirus infection in 24 hours span.\n\nThe number of active cases has reached 24,313 in the union territory, while 1,42,537 patients have recovered so far.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter."}, {"Article Image": "https://images.livemint.com/img/2021/04/28/600x338/20210423_MOH-KS-LI-Covid_Testing_at_Sec_17__Chd_01_1619197444280_1619611740085.jpg", "Article's Title": "Chandigarh announces Corona curfew amid Covid surge. Details here", "Article's Text": "Amid the rise in Covid cases, Chandigarh administration on Wednesday imposed curfew from 6 pm, 29th April. As per the revised rules, 'Corona curfew' will be imposed in Chandigarh from 6pm, 29th April (till 5am) every day until further orders. All shops, malls, multiplexes etc. to close by 5pm every day. All non-essential activities prohibited during the night curfew.\n\nWeekend curfew wilbe imposed from 5am on Saturday to 5am on Monday. Only essential activities will be allowed during weekend curfew. All educational institutions, school, colleges, coaching institutions, libraries etc. will remain closed till 15th May.\n\nOn Wednesday, the Mohali district administration also announced night curfew and full lockdown on weekends to combat the rapidly increasing number of coronavirus cases. According to an official notification, the night curfew will be imposed from 6 pm to 5 am on all days. Whereas the weekend lockdown will begin from Friday 6 pm till Monday 5 am.\n\nSeparately, Punjab government on Monday extended the night curfew by two more hours and ordered closure of shops by 5 pm. As per the new order, a daily lockdown will continue from 6pm to 5am till further notice. Meanwhile, a weekend lockdown will be in force from Friday 6pm to Monday 5am.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter."}, {"Article Image": "https://images.livemint.com/img/2021/04/28/600x338/AFP_98W3U2_1619620781041_1619620839147.jpg", "Article's Title": "Tamil Nadu records highest single-day surge in Covid-19 cases, crosses 16,000-mark", "Article's Text": "Chennai: Covid-19 cases in Tamil Nadu breached the 16,000 mark on Wednesday, the highest since the start of the pandemic, taking the caseload to 11.30 lakh, while 98 fatalities pushed the toll 13,826. The state had logged cases in excess of 15,000 over the last three days. It had crossed the 10,000 mark on April 18 this year.\n\nThe 16,665 cases on Wednesday took the cumulative tally to 11,30,167, a health department bulletin said. As many as 15,114 people were cured of the virus, taking the aggregate to 10,06,033, leaving 1,10,308 active cases. Chennai headed the districts with 4,764 new cases, followed by Chengalpattu (1,219), while 29 districts saw a sharp increase, with figures in triple digits. Among the deceased, 14 had no comorbidities.\n\nAs many as 33 people who tested positive today were returnees from various destinations, including one from Jammu and Kashmir, the bulletin said. A total of 1,30,042 samples were tested on Wednesday, taking the cumulative number of specimens examined so far to 2,23,78,247.\n\nThis story has been published from a wire agency feed without modifications to the text. Only the headline has been changed.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter."}, {"Article Image": "https://images.livemint.com/img/2021/04/28/600x338/2021-04-23T210004Z_1445542553_RC2T1N9OKDMG_RTRMADP_3_HEALTH-CORONAVIRUS-CANADA_1619620179085_1619620193499.JPG", "Article's Title": "Canada PM says AstraZeneca vaccine is safe, despite blood clot death", "Article's Text": "OTTAWA: AstraZeneca PLC's COVID-19 vaccine is safe and Canadians should have confidence in it, Prime Minister Justin Trudeau said on Wednesday, reacting to news that a woman had died of a rare blood clot after being inoculated.\n\nFrancine Boyer, 54, is the first Canadian fatality linked to the AstraZeneca vaccine. She received a shot on April 9 and died on April 23 in hospital where she was being treated for fatigue and headaches, her husband said in a statement.\n\n\"I have tremendous confidence in all vaccines, including AstraZeneca,\" said Trudeau, who got his first AstraZeneca shot last Friday.\n\n\"The risks of blood clots from getting COVID are much greater than the very, very rare but real risk of side-effects from AstraZeneca. It is a very simple calculation we should make,\" Trudeau told a Halifax radio station.\n\nMore than a dozen European countries temporarily suspended use of the vaccine after reports of blood clots combined with low platelets in a very small number of people. Many countries have resumed using the shot.\n\nFaced with a rampant third wave of the virus, several Canadian provinces recently began offering the AstraZeneca vaccine to people aged 40 and over.\n\nThis story has been published from a wire agency feed without modifications to the text.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter."}, {"Article Image": "https://images.livemint.com/img/2021/04/28/600x338/05a13e45a89443959d315813bfc8f49c-05a13e45a89443959d315813bfc8f49c-0_1619269435672_1619614533785.jpg", "Article's Title": "Kerala records highest single-day surge of over 35,000 covid cases", "Article's Text": "Kerala logged highest single day surge of over 35,000 Covid cases on Wednesday. The state recorded 35,013 COVID-19 cases while over 2.66 lakh people are presently undergoing treatment for the infection as the toll climbed to 5,211 with 41 deaths, the state government said.\n\nWith the addition of the new cases, the infection count has gone up to 14,95,377. Active cases stood at 2,66,646. In the last 24 hours ending 2 pm, 1,38,190 samples were tested and the Test Positivity Rate (TPR) was 25.34 per cent.\n\nAs many as 15,505 people were cured, taking the total recoveries to 12,23,185, Chief Minister Pinarayi Vijayan told reporters.\n\nSo far, 1,54,92,489 samples have been tested. Of the positive cases, 97 are health workers, 275 had come from outside the state and 32,474 were infected through contact.\n\nErnakulam recorded the highest number of cases-- 5,287--today followed by Kozhikode 4,317, Thrissur 4,107, Malappuram 3,184 and Thiruvananthapuram 3,210.\n\nSeeking to contain the wide spread of the second wave of COVID-19, prohibitory orders were clamped in 14 more local self government (LSG) units in Malappuram district of Kerala, on Tuesday.\n\nIndia reported 3.60 lakh fresh coronavirus cases in the last 24 hours. A total of 3,60,960 new COVID-19 cases, 3,293 related deaths, and 2,61,162 recoveries were reported in the last 24 hours, taking the total active cases to 29,78,709, as per the health ministry update on Wednesday morning.\n\n(With inputs from PTI)\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter."}, {"Article Image": "https://images.livemint.com/img/2021/04/28/600x338/parliament-k3aC--621x414@LiveMint_1619602490364.jpg", "Article's Title": "Cabinet clears India-UK customs cooperation", "Article's Text": "NEW DELHI : The cabinet on Wednesday cleared signing of a deal between India and the UK to help each other in matters related to customs.\n\nThe deal facilitates information sharing for prevention of customs-related offences and in investigations. The agreement is also expected to support trade and ensure efficient clearance of goods traded between the countries, said an official statement.\n\nThe deal will be signed after it is approved by the two governments and will take effect from the first day of subsequent month.\n\nAvoiding customs related disputes is expected to help in clearing goods faster. India has been taking a host of measures to improve cross-border trade, which has a bearing on ease of doing business in the country. The World Bank’s ease of doing business reports have also flagged this as an area where India could make further improvement.\n\nThe proposed deal would also provide a legal framework for information sharing and in the proper application of customs laws.\n\nThe deal takes care of Indian Customs' concerns and requirements in the area of data sharing on the correctness of the customs value, tariff classification and origin of the goods traded between the two countries, the statement said.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter."}, {"Article Image": "https://images.livemint.com/img/2021/04/28/600x338/PTI29-11-2020_000264B_1607073354423_1607073375151_1619607521276.jpg", "Article's Title": "Bengaluru: 3000 Covid-infected people 'missing', says minister", "Article's Text": "Amid surging COVID-19 cases in the State, Karnataka Revenue Minister R Ashoka claimed on Wednesday most infected people have switched off their phones and about 3,000 of them who have gone 'missing' from Bengaluru are spreading the disease. Police have been asked to trace them, the minister told reporters.\n\n\"We are giving free medicines to the people, which can control 90 per cent of cases, but they have (COVID infected people) switched off their mobile phones. They reach the hospital in a critical stage to desperately look for the ICU beds.This is what is happening now,\" Ashoka said.\n\nHe said most of those infected with COVID have switched off their phones and are not letting people know about their whereabouts, which is making things difficult.\n\n\"I feel that at least 2,000 to 3,000 people in Bengaluru have switched off their phones and left their houses. We don't know where they have gone,\" the minister added.\n\nAppealing to the infected people to keep their phones switched on, Ashoka said police have been asked to track them.\n\n\"I pray to them with folded hands that COVID cases will only increase due to this (behaviour).It is wrong when you reach for ICU beds at the last moment,\" the minister said.\n\nThe government has imposed a lockdown for 14 days restricting unnecessary movement of people starting from Tuesday night to contain COVID cases, which is rising at an alarming proportion.\n\nMore than 30,000 fresh COVID-19 cases were reported on Tuesday including over 17,000 in Bengaluru while the active cases have exceeded three lakh in the state of which two lakh are in the state capital.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter."}, {"Article Image": "https://images.livemint.com/img/2021/04/28/600x338/371305593_0-6_1619609881634_1619613083126.jpg", "Article's Title": "Covid-19: Japan imposes restrictions on travelers from India", "Article's Text": "New Delhi: Japan became the latest country to impose restrictions on travelers from India due to the rising number of coronavirus cases in the South Asian country.\n\nJapan will tighten border controls on travelers from US' Tennessee, Florida, Michigan and Minnesota, as well as India and Peru to check the spread of new variants of the coronavirus detected in these countries, Japanese news agency Kyodo News reported on Wednesday.\n\nThe new measure, to be effective Saturday, requires people traveling from those areas to quarantine in a designated facility and take a covid-19 test on the third day after their arrival, the report added.\n\nAustralia, Bangladesh, Canada, France, Germany, Hong Kong, Indonesia, Iran, Italy, Kuwait, New Zealand, Oman, Saudi Arabia, Singapore and UAE are some of the countries that have banned travel to and from India due to the rising number of infections in the country.\n\nIndia reported 3.60 lakh fresh coronavirus cases in the last 24 hours.\n\nA total of 3,60,960 new covid-19 cases, 3,293 related deaths, and 2,61,162 recoveries were reported in the last 24 hours, taking the total active cases to 29,78,709, as per the health ministry update on Wednesday morning.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter."}, {"Article Image": "https://images.livemint.com/img/2021/04/28/600x338/kerala-kbvH--621x414@LiveMint_1619606010116.jpg", "Article's Title": "Tourism body appeals to PM to ease conditions for availing emergency credit", "Article's Text": "NEW DELHI : Indian Association of Tour Operators (IATO), which represents more than 1,600 operators for inbound tourists, on Wednesday said it has written to the Prime Minister Narendra Modi asking his intervention for suitable amendment to conditions imposed by National Credit Guarantee Trustee Company Ltd (NCGTC) in implementation of Emergency Credit Line Guarantee Scheme (ECLGS) which has been extended to hospitality and travel and tourism sector by the government. The scheme provides travel operators access to easy emergency credit with the government standing as guarantor.\n\nThe country’s inbound tourism sector, ravaged by the covid-19 pandemic, was offered some relief by the extension of ECLGS scheme (ECLGS 3.0) to cover business enterprises in the hospitality and travel and tourism sector as well. It was aimed at easing the immediate liquidity problem of the industry.\n\nHowever, the industry body said the conditions laid down by National Credit Guarantee Trustee Company Ltd (NCGTC) to avail this benefit are unrealistic. According to the conditions, the account availing this facility was not to be an NPA (non-performing asset) or DPD ( days past due) for over 90 days as on the date of sanction, or disbursement of the facility.\n\n“Consequent to that, it nullifies any benefit that may have accrued to tour operators,\" said Rajiv Mehra, president, IATO.\n\nMehra noted that tour operators were stressed, and that their accounts could not be good and that ECLGS was made applicable to operators in recognition of such a situation.\n\n\"But the condition as stipulated in NCGTC makes mockery of any benefit that may have accrued to the tour operators. As the scheme is announced to save the entities in the sector, the current NCGTC operational guidelines should be either revoked or amended suitably as operational guidelines are inconsistent with the spirit of both the ECLGS 3.0 scheme, and the RBI notification, and has defeated the very purpose of the scheme,\" he added.\n\nThe second wave of coronavirus has further pushed back the recovery process of tour operators who are reeling from severe losses ever since the pandemic broke in March 2020. In the scenario, IATO has urged immediate removal of these anomalies and release of Service Export Incentive Scheme (SEIS) as these measures would provide the sector with much needed relief.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter."}, {"Article Image": "https://images.livemint.com/img/2021/04/28/600x338/f4c300d0-a58e-11eb-a6ca-1ce56e8b7c0c_1619617415568_1619617447052.jpg", "Article's Title": "HC appeals to citizens not to hoard oxygen cylinders, COVID-19 medicines", "Article's Text": "﻿New Delhi: The Delhi High Court Wednesday appealed to citizens not to hoard oxygen cylinders and medicines required for COVID-19 patients so as to avoid creating artificial scarcity and make them available to people in need.\n\nA bench of Justices Vipin Sanghi and Rekha Palli, which heard the matter for four hours, appointed senior advocate Raj Shekhar Rao as amicus curiae to assist the court deal with medical oxygen crisis and other issues related to the COVID-19 pandemic.\n\nThe bench also asked the Delhi government to examine the suggestion for taking services of armed forces in this situation as they can set up field hospitals which will help a large number of COVID-19 patients in the national capital and take appropriate steps.\n\nIt also asked the state government to place report on the number of RT-PCR tests conducted in last seven days and the reasons for reduction in the tests.\n\nThis story has been published from a wire agency feed without modifications to the text.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter."}, {"Article Image": "https://images.livemint.com/img/2021/04/28/600x338/AP04_28_2021_000091B_1619615143188_1619615252859.jpg", "Article's Title": "256 oxygen concentrators arrive at Mumbai airport from Singapore", "Article's Text": "Mumbai: As many 256 oxygen concentrators have arrived at the City's Chhatrapati Shivaji Maharaj International Airport (CSMIA) from Singapore amid an acute shortage of medical oxygen in the wake of huge spike in Covid-19 cases in the country, the private airport operator said on Wednesday.\n\nThe oxygen concentrators weighing approximately 5.5 tonnes, landed in two tranches with each consisting of 128 concentrators in the last two days, it said.\n\nThe medical device concentrates oxygen from ambient air and is particularly helpful for patients who are isolating at home as well as for meeting the demands of hospitals running low on oxygen.\n\nAs India receives global support to combat the second wave of Covid-19, the first shipment of oxygen concentrators landed in Mumbai at 9.52 PM on Tuesday followed by another one, which arrived at 10.10 AM on Wednesday, CSMIA said.\n\nThe offloading of these shipments was given topmost priority and the entire process was completed in a span of 15 minutes, the airport operator said.\n\nThe recent spike in cases has led to an increase in demand for oxygen across the country.\n\nThis story has been published from a wire agency feed without modifications to the text.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter."}, {"Article Image": "https://images.livemint.com/img/2021/04/28/600x338/E0DP18fVIAUtvcs_1619603369381_1619603378582.jfif", "Article's Title": "PM Modi reviews Covid-related operations by IAF, stresses on speed, safety in transporting oxygen", "Article's Text": "Air Chief Marshal RKS Bhadauria called on Prime Minister Narendra Modi on Wednesday. He briefed the PM on the efforts being undertaken by Indian Air Force (IAF) to help in the Covid -19 related situation.\n\nAir Chief Marshal informed the Prime Minister that the IAF has ordered 24x7 readiness of the entire heavy lift fleet and substantial numbers of the medium lift fleets to operate in a hub and spoke model to rapidly meet all Covid related tasking across the country and overseas. Aircrew for all fleets have been augmented to ensure round the clock operations, the Press Information Bureau (PIB) said.\n\nPM stressed on the need to increase the speed, scale & safety of operations in transporting oxygen tankers & other essential material. PM spoke about the need to ensure that the IAF personnel engaged in Covid related operations remain safe from infection. He also spoke about the need to ensure safety of all Covid related operations.\n\nAir Chief Marshal RKS Bhadauria informed the that IAF is deploying big as well as medium sized aircrafts to cover all terrains. He briefed the PM about a dedicated COVID Air Support Cell set up by the IAF to ensure faster co-ordination with different ministries and agencies to Covid related operations.\n\nPM inquired about the health of IAF personnel and their families. Air Chief Marshal RKS Bhadauria apprised him that near saturation vaccination coverage has been achieved in the IAF.\n\nHe also informed the PM that hospitals under IAF have increased covid facilities and also allowing civilians wherever possible.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter."}, {"Article Image": "https://images.livemint.com/img/2021/04/28/600x338/AFP_98W433_1619619778903_1619619793255.jpg", "Article's Title": "German spy agency to monitor Covid sceptics", "Article's Text": "Germany's domestic intelligence agency will monitor leading protesters against Covid restrictions, the interior ministry said Wednesday, over concerns they pose a threat to democracy and have ties to right-wing extremism.\n\nThe monitoring will focus on members of Germany's \"Querdenker\" (Lateral Thinkers) movement, which has emerged as the loudest voice against coronavirus curbs and an active promoter of conspiracy theories that deny basic facts about the pandemic.\n\nSome protest organisers \"have clearly demonstrated that their agenda goes beyond simply mobilising protests against the government's corona measures\", a ministry statement said.\n\nTheir main aim appears to be to \"permanently undermine trust in state institutions and their representatives\", it added.\n\nThey are also suspected of seeking links with right-wing extremists such as \"Reichsbuerger\" (Citizens of the Reich) who question the legitimacy of the modern Federal Republic of Germany, and of spreading anti-Semitic messages and QAnon myths, the ministry said.\n\nThe extremists encourage supporters to ignore official orders and challenge the state monopoly on the use of force, it added.\n\nAfter the agency's announcement, local media reported that the BKA federal police force informed MPs who last week voted for a tightening of coronavirus restrictions that their names were circulating on the Telegram messaging app under the title \"death list of German politicians\".\n\n\"It is the message of a single person. That does not result in an increased threat level,\" the BKA wrote in the letter seen by news agency DPA.\n\n\"Querdenker\" demonstrations over the past year have attracted thousands, at times tens of thousands, of supporters, where anti-vaxxers and conspiracy theorists are seen marching side by side with neo-Nazis and members of the far-right AfD party.\n\nThe rallies are notorious for being broken up early by police because protesters fail to comply with rules on social distancing and mask wearing, and have occasionally descended into clashes.\n\nInterior Minister Horst Seehofer told reporters that the monitoring was aimed at \"preventing problems\" and \"preventing crimes\".\n\nFor intelligence officers to be legally allowed to start observing parts of the anti-corona movement, Germany's Federal Office for the Protection of the Constitution (BfV) had to create an entirely new category of group because the \"Querdenkers\" do not fit neatly into the existing classifications of right-wing, left-wing or Islamic extremism.\n\nThe new category is for groups suspected of being \"anti-democratic and/or delegitimising the state in a way that endangers security\".\n\nThe designation allows intelligence officers to gather data about individuals and their activities, and can in a further step include shadowing people and tapping their communications.\n\nThe BfV is already monitoring Germany's anti-Islam, anti-migrant AfD opposition party.\n\n\n\n\n\nThis story has been published from a wire agency feed without modifications to the text.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter."}, {"Article Image": "https://images.livemint.com/img/2021/04/28/600x338/13b621d84003476db0b1d15e93a247b3-13b621d84003476db0b1d15e93a247b3-0_1619610830876_1619610940829.jpg", "Article's Title": "Europe will reach herd immunity in 4 months: BioNTech chief", "Article's Text": "Berlin : Europe can achieve herd immunity against the coronavirus within the next four months, the head of German pharmaceutical company BioNTech, which developed the first widely approved COVID-19 vaccine with U.S. partner Pfizer, said Wednesday.\n\nWhile the exact threshold required to reach that critical level of immunisation remains a matter of debate, experts say a level above 70 per cent would significantly disrupt transmission of the coronavirus within a population.\n\n“Europe will reach herd immunity in July, latest by August,\" Ugur Sahin, BioNTech's chief executive, told reporters.\n\nHis company's vaccine makes up a large share of the doses administered in Europe and North America, where it is more commonly known as the Pfizer shot.\n\nSahin said data from people who have received the vaccine show that the immune response gets weaker over time, and a third shot will likely be required.\n\nStudies show the efficacy of the BioNTech/Pfizer vaccine declines from 95 per cent declines to about 91 per cent after six months, he said.\n\n“Accordingly, we need a third shot to get the vaccine protection back up to almost 100 per cent again\" Sahin said. He suggested this should be administered 9-12 months after the first shot.\n\n“And then I expect it will probably be necessary to get another booster every year or perhaps every 18 months again,\" he said.\n\nThis story has been published from a wire agency feed without modifications to the text. Only the headline has been changed.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter."}, {"Article Image": "https://images.livemint.com/img/2021/04/28/600x338/PTI04_28_2021_000044B_1619609117788_1619609155377.jpg", "Article's Title": "Indian Railways transports over 500 tonnes of oxygen to several states in 10 days", "Article's Text": "Indian Railways has transported more than 500 tonnes of medical oxygen safely to Maharashtra, Uttar Pradesh, Delhi and Madhya Pradesh as of April 28, the railway ministry said in a press release on Wednesday. The ministry said that its Oxygen Express trains have delivered a cumulative 510 tonnes of oxygen since April 19.\n\nAccording to the ministry, the Indian Railways has delivered 202 metric tonnes liquid medical oxygen to Uttar Pradesh, 174 metric tonnes to Maharashtra, 70 metric tonnes to Delhi and Madhya Pradesh 64 metric tonnes to date.\n\nMadhya Pradesh has received its first Oxygen Express carrying more than 64 metric tonnes of liquid medical oxygen on Wednesday morning, the railway ministry said. The oxygen tankers were unloaded in cities like Jabalpur (1 Tanker), Bhopal (2 Tankers), and Sagar (3 Tankers) on April 28, it added. Additionally, the fourth Oxygen Express, carrying three tankers of the life-saving gas, will be reaching Lucknow today, the Railway Ministry said in a press statement.\n\nHaryana will get its first Oxygen Express train over the next few days. On Wednesday, five tankers have left from Rourkela in Odisha and will reach Faridabad soon.\n\n\"The Haryana government has also requested railways for Oxygen Express. Currently, tankers are being loaded in Faridabad, which will be sent for filling to Rourkela. As of now, It is planned that two Oxygen Express trains with a capacity of five tankers each will be run specifically for Haryana,\" the railways said.\n\nThe first Oxygen Express train was pushed into service on April 19 when seven trucks left Mumbai for Vizag to load oxygen. These trucks were loaded on flat wagons and carried to the loading location.\n\nEach tanker of the Oxygen Express trains can carry around 16 tonnes of medical oxygen and these trains travel at a speed of around 65 kmph.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter."}, {"Article Image": "https://images.livemint.com/img/2021/04/28/600x338/app_1619615397367_1619615401835.jpeg", "Article's Title": "CoWin registration: Get appointment only when you see vacancies available, says govt", "Article's Text": "As registration for Covid-19 vaccination began today at 4 pm for the nest phase of vaccination scheduled to commence from 1 May, 2021, several issues on vaccination booking and appointment cropped up after CO-WIN portal regarding availability of vacancies etc.\n\nOn those lines, RS Sharma, CEO, National Health Authority advised the citizens to log in and get an appointment only when they see vacancies available. He also clarified that several states and hospitals are yet to come on board with the Centre's vaccination programme and the visibility into the bookings/vacancy available for vaccination will be available after 1 May.\n\n\"Some States and hospitals may come on board on May 1 or later, therefore, the visibility into the bookings/vacancy available for vaccination will be available when States, hospitals come on board,\" Sharma told news agency ANI.\n\n\"We will continue to announce as and when States come on board. We will provide information in public. The advice to people is that you log in and get an appointment only when you see vacancies available,\" he added.\n\nSharma also informed earlier that on many days, there are around 5 million people registering in a day. \"We expect more than double that number today. We think our system will be able to take the load when registrations open today.\"\n\n\"We had a test registration of about 5 million people in a day on the registration platform. Maybe the number will be double that after registrations are open. We are ready for it,\" he had said earlier.\n\nAll those aged above 18 can register themselves on the CoWIN portal or using the Aarogya Setu app to get vaccinated against COVID-19 starting 4 pm on Wednesday, the Union Health Ministry said as the government gears up to launch the third phase of vaccination drive from 1 May.\n\nAfter registration, taking an appointment to get a COVID-19 vaccine jab would be mandatory for those aged between 18 and 44 years as walk-ins will not be allowed initially, officials had said.\n\nThose above 45 years can still avail the facility of on-site registration to get vaccinated, they said.\n\nAs India witnesses a surge in coronavirus cases, it has decided to allow everyone above 18 years of age to get vaccinated from May 1.\n\n\"An increased demand is expected once the vaccination is opened for all. For the purpose of crowd control, registering on CoWIN portal and making an appointment to get a vaccine will be mandatory for those aged between 18 and 45 years. Walks-in will not be allowed in the beginning so that there is no chaos,\" an official had said.\n\nThe inoculation process and documents to be provided to get the jab remains the same.\n\n\"Registration of citizens in 18-44 age group will start with only online registration on COWIN from April 28 onwards,\" the ministry had said.\n\nAlso, from May 1, the types of anti-coronavirus vaccine and their prices will be displayed on the CoWIN portal for citizens to make an informed choice at the time of booking an appointment at a private vaccination centre.\n\nWhile those aged 18 to 44 years will be eligible to receive vaccination on payment from any of the private COVID vaccination centres (CVCs), citizens below 45 years shall also be eligible to receive a jab from a government CVC in a state or Union Territory which decides to lower the minimum cut off age for eligibility.\n\nAs provided in the Liberalised Pricing and Accelerated National COVID-19 Vaccination Strategy document, all priority groups, such as healthcare workers, frontline workers and citizens above aged 45 years or more (as on 01.01.2022), shall continue to be eligible for vaccination free of cost from government CVCs, or on payment from private CVCS.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter."}, {"Article Image": "https://images.livemint.com/img/2021/04/28/600x338/L5U7U2Q7LZMH3HXR7TTEOXTFUY_1619615680459_1619615684304.jpg", "Article's Title": "Got covid-vaccinated? This country offering no-hassle holidays", "Article's Text": "Nicosia: Cyprus is offering hassle-free holidays to fully vaccinated individuals from 65 countries from May 10 as it seeks to recoup lost ground from the pandemic.\n\nThe Mediterranean island, which has fared better than most countries in containing the COVID-19 outbreak, will accept vaccines permitted by the European Medicines Agency and Sputnik V made by Russia - its second largest market.\n\n\"I think it's a fantastic initiative and I think it's very very important for people to know, that irrespective of (country risk) categorisation, if someone is fully vaccinated they no longer require tests to come to Cyprus,\" Deputy Minister of Tourism Savvas Perdios told Reuters.\n\nThe move affects travel from 65 countries, including Russia, Ukraine, European Union member states, Britain and Gulf states. The island had already opened up to those countries in a colour-coded risk assessment system based on testing.\n\nPerdios said incoming traffic was already being registered from Israel. While the island's intention to accept fully vaccinated tourists from Britain, its main market, generated a great deal of interest, clarity would only be forthcoming next month after the UK sets out guidelines for overseas travel.\n\n\"The strongest positive messages at the moment are from the Israeli and Russian markets,\" Perdios said. \"We have made a lot of progress there and I think it's going to be a good season.\"\n\nOver the past two years, Cyprus has been targeting new markets in central and northern Europe, establishing year-round air links.\n\nThe island saw an 84% drop in arrivals in 2020. Cyprus itself is now in a third, two-week lockdown which runs until May 9. It has recorded 63,720 infections and 303 people have died.\n\nAsked about the timing of the initiative, just as Cyprus was facing a third coronavirus wave, Perdios said the island still had infection rates lower than many other countries, on record high testing rates.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter."}, {"Article Image": "https://images.livemint.com/img/2021/04/28/600x338/20200925172L_1604147540397_1604147553677_1619621114785.jpg", "Article's Title": "Rajasthan CM isolates himself after wife tests positive for Covid-19", "Article's Text": "Rajasthan chief minister Ashok Gehlot today declared that he has gone under self-isolation after her wife tests positive for Covid-19 infection.\n\nTaking to Twitter, Gehlot said, \"My wife Mrs. Sunita Gehlot has been tested Covid positive (Asymptomatic). According to protocol, her treatment in home isolation has started. Now, as precautionary isolation, I will hold a Covid review meeting with doctors and officials at 8.30 pm daily.\"\n\nमेरी पत्नी श्रीमती सुनीता गहलोत कोविड पॉजिटिव आ गई हैं (असिम्प्टोमैटिक)। प्रोटोकॉल के अनुसार होम आइसोलेशन में उनका ट्रीटमेंट प्रारम्भ हो गया है। अब मैं एहतियातन आइसोलेशन में रहकर चिकित्सकों एवं अधिकारियों के साथ सांय 8.30 बजे रोजाना होने वाली कोविड समीक्षा बैठक लूंगा। — Ashok Gehlot (@ashokgehlot51) April 28, 2021\n\nEarlier, Congress state president Govind Singh Dotasra also tested positive.\n\n\"After showing the initial symptoms, my COVID test report is positive today. On the advice of doctors, I have isolated myself at the Sikar residence. I request all the people who have come in contact with me for the last few days to get the test done,\" Dotasra tweeted.\n\nChief Minister Ashok Gehlot has wished him speed recovery. Dotasra has tested positive for the second time.\n\nRajasthan recorded the highest single-day rise in its COVID-19 death toll with 121 more people succumbing to the viral disease on Tuesday as well as 16,089 fresh cases.\n\nWith the fresh cases, the state's cumulative tally has climbed to 5,46,964 and the death toll stands at 3,806, according to an official report.\n\nThe number of active cases also increased to 1,55,182, it said.\n\nAmong the fresh cases include Congress state president Govind Singh Dotasra.\n\n\"After showing the initial symptoms, my COVID test report is positive today. On the advice of doctors, I have isolated myself at the Sikar residence. I request all the people who have come in contact with me for the last few days to get the test done,\" Dotasra tweeted.\n\nChief Minister Ashok Gehlot has wished him speed recovery. Dotasra has tested positive for the second time.\n\nAmong the districts which reported deaths were Jodhpur (22), Jaipur (21), Udaipur (14), Bikaner (8), Kota and Sikar (6 each), Pali and Alwar (5 each), Ajmer, Barmer and Sirohi (4 each).\n\nA total of 3,87,976 COVID-19 patients have recovered in the state so far.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter."}, {"Article Image": "https://images.livemint.com/img/2021/04/28/600x338/2021-02-26T163542Z_1_LYNXMPEH1P18E_RTROPTP_3_INDIA-ELECTION_1619605112598_1619605223297.JPG", "Article's Title": "EC makes negative Covid report or 2 vaccine doses must to enter counting centres", "Article's Text": "The Election Commission of India (ECI) on Wednesday has made it mandatory for candidates and their agents to show negative RT-PCR test reports or complete vaccination reports to enter counting centres.\n\n\"No candidates/agents will be allowed inside the counting hall without undergoing RT-PCR/RAT test or without having 2 doses of vaccination against Covid-19 and will have to produce negative RT-PCR report or RAT report or vaccination reports within 48 hours of start of counting,\" the election commission said.\n\nAccording to the ECI's official notification, the District Election Officer (DEO) will make arrangements for the RT-PCR test of the candidates and the counting agents before the day of the final counting.\n\nFurther, the election commission reiterated that there will be no victory procession after the counting of votes.\n\nIt added, \" Not more than two people shall be allowed to accompany the winning candidate or his/her authorized representative receive the certificate of election from the Returning Officers\".\n\nIt further prohibited public gatherings outside the counting venue during the process of the counting of votes.\n\nThe commission suggested bigger and more spacious rooms for the counting of votes to maintain social distancing and for proper ventilation due to ongoing coronavirus threats. It said that all counting centres should be disinfected \"before, during and after the counting\".\n\nBesides, \"sealed outer boxes of EVM/VVPAT shall also be sanitised\", the ECI said.\n\nThe election commission has assured that all counting officials will be provided masks, sanitisers, face shield, and gloves to prevent them from novel coronavirus.\n\nFurther, the election commission has directed mandatory thermal scanning of all persons who will be entering the counting centres. The commission has permitted candidates to change the counting agents if he/she turns out to be coronavirus positive.\n\nThe election commission also warned that legal actions will be taken against those who will violate the orders.\n\nOn May 2, the election commission will be announcing the assembly election results of four states and one Union Territory-- West Bengal, Tamil Nadu, Assam, Kerala and Puducherry.\n\n\n\n\n\n\n\n\n\n\n\n\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter."}, {"Article Image": "https://images.livemint.com/img/2021/04/28/600x338/20210418139L_1619616940662_1619617010077.jpg", "Article's Title": "Railways deploys 64,000 beds, 4,000 isolation coaches as India reels from 2nd Covid-19 wave", "Article's Text": "The Ministry of Railways has deployed nearly 4,000 isolation coaches with almost 64,000 beds in several states as hospitals across the country are overwhelmed due to a surge in coronavirus infections.\n\nHowever, at present, 191 coaches have been handed over to various states, including Maharashtra, Madhya Pradesh, and Delhi for Covid care, with a bed capacity of 2,990 beds, the ministry added.\n\nThe railways added that it has also positioned 50 coaches at major cities of Uttar Pradesh like Faizabad, Bhadohi, Varanasi, Bareli and Nazibabad.\n\nAccording to the railways, these isolation coaches can be easily moved and positioned at places of demand on the Indian Railways network.\n\nThe Indian Railways said that it has deployed 50 coaches at Shakurbasti and 25 Coaches at Anand Vihar stations in Delhi, with a capacity of 1,200 beds in total.\n\n\"In Delhi, the Railway has catered to the full demand of State Governments’ demand for 75 Covid Care Coaches with a capacity of 1,200 beds. 50 coaches are positioned at Shakurbasti and 25 Coaches at Anand Vihar stations. 5 admissions were registered as of date (April 28). 1,196 beds are still available,\" the Indian Railways said in a press release.\n\nOn the other hand, in Madhya Pradesh, the Ratlam Division of Western Railway has deployed 22 Coaches with a capacity of 320 beds at Tihi station near Indore. And in Bhopal, as many as 20 coaches have been deployed with a capacity of 280 beds.\n\n\"In UP, though coaches have not yet been requisitioned by State Govt, 10 coaches each are placed at Faizabad, Bhadohi, Varanasi, Bareli & Nazibabad totalling to a capacity of 800 beds (50 coaches),\" the railways added.\n\nIn another effort by the railways, the national transporter is also transporting liquid medical oxygen in various states. The Railway Ministry said that it supplied more than 510 metric tonnes of oxygen to Uttar Pradesh, Maharashtra, Delhi and Madhya Pradesh in the past 10 days.\n\nSo far, railways said it has delivered 202 tonnes of oxygen to Uttar Pradesh, 174 tonnes to Maharashtra, 70 tonnes to Delhi and 64 tonnes to Madhya Pradesh.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter."}, {"Article Image": "https://images.livemint.com/img/2021/04/28/600x338/2021-04-28T104459Z_1_LYNXMPEH3R0NF_RTROPTP_3_HEALTH-CORONAVIRUS-INDIA_1619611708493_1619611733063.JPG", "Article's Title": "Indian coronavirus strain found in UK, US, and 15 other countries: WHO", "Article's Text": "The 'Indian strain' of the coronavirus, also known as B.1.617 has been found in at least 17 countries, the World Health Organisation (WHO) said on Wednesday. Apart from India, the double mutant strain was majorly found in the United Kingdom, USA, and Singapore, it added.\n\n\"As of 27 April, over 1,200 sequences have been uploaded to GISAID and assigned to lineage B.1.617 (collectively) from at least 17 countries,\" WHO said. GISAID is a global science initiative and primary source established in 2008 that provides open access to genomic data of influenza viruses and the coronavirus.\n\nThe WHO said that studies have highlighted that the spread of the second wave has been much faster than the first in India.\n\n\"Preliminary modelling by WHO based on sequences submitted to GISAID suggest that B.1.617 has a higher growth rate than other circulating variants in India, suggesting potential increased transmissibility, with other co-circulating variants also demonstrating increased transmissibility,\" the report by the global health body said.\n\n\"Other drivers may include challenges around the implementation and adherence to public health and social measures (PHSM), and social gatherings (including mass gatherings during cultural and religious celebrations, and elections). Further investigation is needed to understand the relative contribution of these factors,\" it said.\n\nAs per the WHO, the B.1.617 variant comprises several sub-lineages, including B.1.617.1, B.1.617.2 and B.1.617.3. Both B.1.617.1 and B.1.617.2 were first identified in India in December 2020, and have been detected at increasing prevalence concurrent to the major upsurge observed in the country.\n\nB.1.617.3 was first detected in India in October 2020, but relatively fewer viruses matching this sub-lineage have been reported to date, the report said. The B.1.617 variant has three new spike protein mutations. Two mutations -- E484Q and L452R -- are in the area important for antibody-based neutralisation. The third mutation -- P681R -- allows the virus to enter cells a little better.\n\nThe WHO said that globally, new COVID-19 cases increased for the ninth consecutive week, with nearly 5.7 million new cases reported in the last week. India accounts for 38 per cent of the global cases reported during the period, it added.\n\n\"While a number of countries in the region are reporting upward trends, India accounts for the vast majority of cases from this regional trend and 38 per cent of global cases reported in the past week,\" WHO said.\n\nIndia has continued to witness a record-high increase in its daily coronavirus cases for the past few months. On April 28, the country reported 3,60,960 lakh fresh coronavirus cases in the last 24 hours. Besides, a total of 3,293 people died due to the virus in the same period, carrying the toll to 201,187.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter."}, {"Article Image": "https://images.livemint.com/img/2021/04/28/600x338/2021-04-25T140515Z_1_LYNXMPEH3O08H_RTROPTP_3_HEALTH-CORONAVIRUS-INDIA_1619367248053_1619613415664.JPG", "Article's Title": "Germany ready to send large oxygen plant to India in a week", "Article's Text": "New Delhi: Germany is ready to transport a large oxygen production plant to India in about a week which will provide oxygen for quite a number of people, German ambassador to India Walter J Lindner has said.\n\nAmbassador Lindner told ANI in an interview that a big oxygen plant will prove to be useful for India. The country is seeing a record surge in COVID-19 cases that has put strain on the health infrastructure.\n\nLinder said they are in close contact with Ministry of External Affairs (MEA), Red Cross and others to see how to bring oxygen plant to the country.\n\n\"We are ready to transport a large oxygen production plant to India. This will provide oxygen for quite a number of people. We are in close contact with MEA, Red Cross, and others to see how to bring it here,\" the German Ambassador told ANI.\n\n\"We are working on this. Won't say it is coming in the next two-three days. Give us a week, it's about logistics. When it's here you will see it make quite a lot of difference,\" he added.\n\nGerman Chancellor Angela Merkel had said last week that they are preparing a \"mission to support\" India's fight against the pandemic.\n\n\"A big oxygen plant is very useful as it can be used to refill oxygen cylinders. Of course, there will also be Mobil X oxygen plants which at the moment I understand are being brought to India by the Indian Air Force,\" the envoy said.\n\nHe said India has helped the world during the situation created by COVID-19 by producing vaccines and medicines \"and now we just need to give back to our friends\".\n\nHe urged people to get vaccinated against the virus.\n\n\"My message is - get vaccinated. It is very important. India has two 'made in India' vaccines,\" Lindner said\n\nIndia reported over 3.60 lakh fresh COVID-19 cases and 3,293 related deaths in the last 24 hours.\n\nThis story has been published from a wire agency feed without modifications to the text. Only the headline has been changed.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter."}, {"Article Image": "https://images.livemint.com/img/2021/04/28/600x338/371305593_0-6_1619609881634_1619610097984.jpg", "Article's Title": "UK plans to use health app as Covid vaccine passport for international travel", "Article's Text": "Britain plans to use a National Health Service phone app as its COVID-19 'vaccine passport' certificate that will allow its population to travel internationally this summer, Transport Secretary Grant Shapps said on Wednesday.\n\nCountries around the world are looking at a host of options that will serve as proof of COVID-19 vaccinations to allow travel, though airports, border agencies and airlines are worried there will be no clear global standard that will be accepted at all borders.\n\nSo-called vaccine passports could range from a digital certificate with a scannable QR code in the European Union, to a National Health Service (NHS) phone app in the United Kingdom, or a humble piece of paper in some other countries.\n\nBesides concerns over issuance, forgery and the repeated failure of government-backed technology projects, it was still unclear how such documents would be received by notoriously zealous border guards across the world.\n\n\"In terms of vaccine certification, I can confirm... it will be an NHS app that is used for people when they book appointments with the NHS and so on to be able to show that you've had a vaccine or that you've had testing,\" Transport Secretary Shapps told Sky News.\n\n\"And I'm working internationally with partners across the world, to make sure that that system can be internationally recognised,\" he said.\n\nAirlines, which were brought to the edge of insolvency by the COVID-19 pandemic, are desperate for flights to resume as lockdown restrictions ease, so that they can earn some money from the northern hemisphere's summer holiday season.\n\nBritish tourists are among the highest-spending European tourists, so their ability to travel is key for the economies of southern Europe.\n\nBritain has earmarked May 17 as being the earliest date when international travel would be allowed for non-essential reasons following a winter lockdown.\n\n\"The data does continue to look good from a UK perspective, notwithstanding those concerns about where people might be travelling to and making sure that we're protected from the disease being reimported,\" Shapps said.\n\nAirlines and airports have said any vaccine passport will need to be digital, to avoid delays during customs clearance or the boarding of flights caused by checks of paperwork.\n\nHowever, it is not clear how countries will recognise different systems: the global airline industry body IATA is launching a digital travel pass for COVID-19 test results and vaccine certificates, while the European Union is launching a bloc-wide system.\n\nShapps said he would reveal which travel categories countries would be placed in early next month.\n\n(Reporting by Guy Faulconbridge; writing by Michael Holden; Editing by Bernadette Baum)\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter."}, {"Article Image": "https://images.livemint.com/img/2021/04/28/600x338/PTI04_28_2021_000066A_1619610202484_1619610221001.jpg", "Article's Title": "From Reliance to Tata to Amazon, industry steps up to fight India's covid crisis", "Article's Text": "BENGALURU: Global and Indian firms are flexing their industrial muscle to help the world's second-biggest population battle coronavirus, coming to the rescue of a public health system buckling under the weight of surging infections and deaths.\n\nAmazon.com, Intel and Google, as well as Indian firms Tata Sons, Reliance Industries and JSW Steel have pitched in with everything from airlifts of medical equipment and funding pledges to making medical oxygen.\n\n\"What we need is better planning with the recognition that government's capacity is limited and therefore requires private participation,\" said economist Madhura Swaminathan of the Indian Statistical Institute in Bengaluru.\n\nHospitals struggling with a massive second wave of infections are turning away patients as beds and oxygen supplies run out, and social media brim with desperate calls for help in finding supplies of oxygen and drugs such as remdesivir.\n\nA record increase in deaths over the prior 24 hours carried India's toll past 200,000 on Wednesday, a situation that experts blame on lack of oxygen supplies and infrastructure challenges.\n\nOn Tuesday Amazon said it would ship 100 ICU ventilator units to India from the United States.\n\nIt had earlier worked with partners to airlift more than 8,000 oxygen concentrators and 500 ventilators from Singapore, relying on its massive global logistics network to hasten procurement, a spokeswoman said.\n\nGoogle promised $18 million in new funding for India, including advertising support for public health campaigns.\n\nIndia's largest steel maker by market value, JSW, has stopped making some of the construction raw material as it diverts resources to turning out liquid oxygen instead.\n\nFrom April 21 to 23, JSW supplied 898 tonnes of oxygen each day from its plants, equivalent to about 13% of the combined daily demand for 6,785 tonnes of the life-saving gas in India's 20 worst-hit states.\n\nJSW said it was building large COVID patient centres around its plants, so that they can be serviced via a pipeline.\n\nBillionaire Mukesh Ambani's Reliance Industries tweaked manufacturing at its oil refineries to produce hundreds of tonnes of oxygen for hard-hit areas such as Maharashtra, India's richest and worst-hit state.\n\nTata Group, one of India's oldest conglomerates, imported 24 cryogenic containers to transport liquid oxygen, while its Tata Steel unit ramped up oxygen supply.\n\n\"The government single-handedly cannot deal with this crisis any more, it is very important that the corporate sector gets into motion,\" said Kunal Kundu, India economist at Societe Generale in Bengaluru.\n\n\"We need all the help we can get.\"\n\nEconomist Swaminathan called for the scope of private sector contribution to be widened beyond the merely voluntary.\n\n\"Anybody who has surplus funds and equipment should step in to help,\" she added. \"In terms of logistics, beds, oxygen, hospitals, the private sector has to be asked to do its task as part of policy.\"\n\nThis story has been published from a wire agency feed without modifications to the text. Only the headline has been changed.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter."}, {"Article Image": "https://images.livemint.com/img/2021/04/28/600x338/20210428180L_1619616657932_1619616686119.jpg", "Article's Title": "1 lakh portable oxygen concentrators to be procured from PM cares fund", "Article's Text": "Prime Minister Narendra Modi on Wednesday sanctioned the procurement of 1 Lakh Portable Oxygen Concentrators from the PM Cares Fund.\n\nThe decision was taken at a high-level meeting chaired by Prime Minister to discuss the measures needed to improve Liquid Medical Oxygen (LMO) Supply for COVID management.\n\nThe prime minister instructed that these Oxygen Concentrators should be procured at the earliest and provided in states with high case burden. In addition to the earlier sanctioned 713 PSA plants under PM Cares Fund, 500 new Pressure Swing Adsorption (PSA) oxygen plants have been sanctioned under PM CARES Fund.\n\n“The PSA plants will augment the supply of Liquid Medical Oxygen at hospitals in district headquarters and Tier 2 cities. These 500 PSA plants will be established with transfer of the indigenous technology developed by DRDO and CSIR to the domestic manufacturers,\" said the prime minister office in a statement.\n\n“Establishing PSA plants and procurement of portable oxygen concentrators will greatly augment the supply of oxygen near the demand clusters, thereby addressing the current logistical challenges in transporting oxygen from plants to hospitals,\" it said.\n\nMeanwhile, Minister of State for Ports, Shipping and Waterways (I/C) and Chemical & Fertilizers, Mansukh Mandaviya also chaired a meeting to explore possibility of production of oxygen in their plants, with fertilizers companies of Public Sector, Private Sector as well as Co-Operative sector.\n\nMandaviya called upon the fertilizer companies to help the society during this pandemic time by reorienting their existing capacity of oxygen production and augmenting the supply of medical grade oxygen to the hospitals.\n\nIFFCO is putting up an oxygen plant with capacity of 200 cubic meters per hour in its KALOL unit in Gujarat and their total capacity would be 33,000 cubic meters per day. GSFC made small modification in their plants and started supplying liquid oxygen. GNFC has also started supply of liquid oxygen for medical purpose after starting of air separation unit.\n\nGSFS & GNFC has already started process to enhance their oxygen production capacities. The other fertilizer companies will set up medical plants in hospitals/plants at selected locations in the country through CSR funding.\n\nAltogether it is expected that approximately 50 Metric Tons (MT) of medical oxygen per day can be made available for COVID patients by the fertilizer Plants. These steps will augment the medical grade oxygen supply to hospitals in the country in the coming days.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter."}, {"Article Image": "https://images.livemint.com/img/2021/04/28/600x338/55AVVRZL_1599845920989_1599845929021_1619613377716.jpg", "Article's Title": "FinMin relaxes COVID-relief material import norms for Indian Red Cross", "Article's Text": "The Finance Ministry has waived permissions required from any government departments for customs clearance of COVID-related relief material imported by the Indian Red Cross Society.\n\nIn instruction to field offices, the Central Board of Indirect Taxes and Customs (CBIC) said in the wake of the extraordinary situation arising out of the COVID pandemic, the issue of providing seamless clearance to such relief material received from foreign governments and imported by the Indian Red Cross Society was discussed in a meeting chaired by the Cabinet Secretary on April 27.\n\n“It was decided that in all cases of COVID related imports facilitated by Ministry of External Affairs and/ or imported by Indian Red Cross Society, permissions/ licences/ authorisations required from other Government Department/Agencies prior to the clearance of goods, if any, would be deemed to have been given.\n\n“In other words, such cases need not be referred to those agencies or the requirement may be suitably waived,\" the CBIC said.\n\nThe CBIC, which is the apex body in Customs duty and clearance matters, also asked field offices to give the “highest priority\" to these consignments and facilitate their clearance in the shortest possible time.\n\nThe indirect tax body also noted that donations of COVID-related material and medicines from foreign governments, besides oxygen and related equipment, have also started arriving at Indian ports.\n\nThe government last week waived customs duty on the import of COVID vaccines as well as medical-grade oxygen and related equipment as the nation battles its worst health crisis with a \"tsunami\" of infections setting a new world record for cases.\n\nIn its fight against COVID, it had also waived customs duty on imported Remdesivir injections and the drug's active pharmaceutical ingredients (API) to boost supplies.\n\nThe CBIC had directed customs officers to clear all import consignments, including life-saving drugs and oxygen equipment, used in COVID treatment on the highest priority.\n\nAMRG & Associates Senior Partner Rajat Mohan said, “High priority Customs clearance coupled with a recent exemption for import duties on COVID-related relief material would strengthen the fight of a commoner against the pandemic\".\n\nIndia reported a record of 3,60,960 new infections on Wednesday, bringing its total to over 1.79 crore. Deaths also rose by a record 3,293 to 2,01,187.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter."}, {"Article Image": "https://images.livemint.com/img/2021/04/28/600x338/AFP_98W2LF_1619617413198_1619617428019.jpg", "Article's Title": "Karnataka sees over 39,000 Covid-19 cases for first time in a day, 22,596 in Bengaluru", "Article's Text": "Karnataka on Wednesday reported over 39,000 new Covid-19 cases in the last 24 hours, the highest-ever single-day spike since the outbreak of the pandemic.\n\nWith 39,047 fresh COVID-19 cases, the total tally of Karnataka's total tally has reached 14,39,822, according to the health bulletin. Of these, Bengaluru recorded highest single-day spike of 22,596 new Covid cases.\n\nAlong with that, the state reported 229 more virus-related fatalities, taking. the death toll to 15,036.\n\nActive cases in the state are at 3,28,88, while 11,833 people got discharged in the last 24 hours, taking the total to 10,95,883.\n\n\n\n\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter."}, {"Article Image": "https://images.livemint.com/img/2021/04/28/600x338/20210427_MAM-SSS-MN_Night_Curfew_01_24_1619603875215_1619603922083.jpg", "Article's Title": "Punjab: Mohali imposes night curfew, full weekend lockdown amid Covid-19 surge", "Article's Text": "The Mohali district administration on Wednesday announced night curfew and full lockdown on weekends to combat the rapidly increasing number of coronavirus cases. According to an official notification, the night curfew will be imposed from 6 pm to 5 am on all days. Whereas the weekend lockdown will begin from Friday 6 pm till Monday 5 am.\n\n\"Curfew in the entire district from 6 PM to 5 AM on all days (night curfew) and from 6 PM every Friday to 5 AM of every Monday (weekend curfew),\" said Mohali District Collector Girish Dayalan on Wednesday.\n\nDuring the fresh curbs in the district, all the restaurants will remain closed for dine-in but home delivery will be allowed up to 9 pm, Dayalan added. Moreover, all shops (including those in malls and multiplexes etc) will be closed by 5 pm every day in the district.\n\nDayalan further said that private offices including the service industry will 'work from home' only. \"Bare minimum staff involved in critical operations such as maintenance etc. will be allowed with curfew passes,\" he added.\n\nSeparately, the Punjab government had announced a night curfew - from 6 pm to 5 am during weekdays - and a weekend lockdown - from 6 pm on Friday to 5 am on Monday. Punjab on Tuesday reported 5,932 new Covid-19 cases and 100 deaths.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter."}, {"Article Image": "https://c.ndtvimg.com/2021-04/2g0vl2r4_vaccine-generic-injection-generic_625x300_15_April_21.jpg", "Article's Title": "Nearly 80 Lakh Apply For Covid Vaccination In 3 Hours: 10 Points", "Article's Text": "After initial glitches, the CoWIN site was getting almost 27 lakh hits a minute, government sources said. Appointments will be based on slots made available by states and private vaccination centres, they said.\n\n\"More Appointment slots will soon be offered. If slots are not currently available, please check again after sometime. We request your patience and understanding,\" said government sources.\n\nVaccinations will begin on Saturday for everyone above 18 from May 1 (Saturday) under a more \"liberalised and accelerated Phase 3 strategy of COVID-19 vaccination\".\n\nThose who want to take the vaccine are to go to https://www.cowin.gov.in/home and click on the \"register/sign-in\" option.\n\nAt 4 pm, this didn't work for many who got an error message saying: \"CoWIN server is facing issues. Please try later.\"\n\nHowever, Aarogya Setu, the Union government's app for contact tracing and dissemination of medical advisories to contain spread of COVID-19, tweeted saying, \"Cowin Portal is working. There was a minor glitch at 4 PM that was fixed. 18 plus can register.\"\n\nAfter the fixes, people said the site was working and appointments were being slotted.\n\nIndia began vaccinating people in January, starting with healthcare and frontline workers. The second phase included those above 45 and those with other illnesses. Earlier this month, the inoculations were opened to all adults as Covid cases exploded, leaving health services and medical resources severely strained.\n\nSerum Institute's Covishield and Bharat Biotech's Covaxin have been used so far. In a few weeks, say officials, Russia's Sputnik will also be available. The centre has fast-tracked approvals for foreign vaccines."}, {"Article Image": "https://c.ndtvimg.com/2020-01/8mrihf8g_airplane-generic-aeroplane-generic_625x300_03_January_20.jpg", "Article's Title": "Covid Risk Rises 50% If Passengers Board Planes Back To Front: Study", "Article's Text": "Delta Air Lines adopted back-to-front boarding to \"minimize contact with other customers\".\n\nBoarding passengers seated at the back of the aircraft first -- a Covid-era change by Delta Air Lines Inc. and others to cut the risk of infection -- actually increases the chance of catching the virus by 50%, a scientific study showed.\n\nSo-called back-to-front boarding is also twice as risky as letting passengers on at random, even though it does reduce exposure between seated passengers and those walking down the plane, according to the study published Wednesday in the Royal Society Open Science journal. The higher risk comes from closer contact between passengers in the same rows clustering in the aisle as they stow their luggage.\n\nDelta adopted back-to-front boarding to \"minimize contact with other customers,\" according to its website, though the U.S. airline only boards 10 passengers at a time. The change was among several across the industry -- including blocking out middle seats --- to persuade passengers it is safe to get back on a plane.\n\nScientists from institutions including the University of West Florida and Florida State University simulated 16,000 possible passenger movements for the study. \"The new policies do not improve on the old ones in any situation,\" they said. Delta's media office didn't reply to an email seeking comment.\n\nThe risk of virus exposure could be reduced by stopping people using overhead storage bins, and by boarding passengers in window seats before those in aisle seats, according to the study.\n\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)"}, {"Article Image": "https://images.livemint.com/img/2021/04/28/600x338/rajeshtopeani_1617874457438_1619606007756.jpg", "Article's Title": "Maharashtra lockdown extended by another 15 days beyond 30 April, says health minister", "Article's Text": "Amid a massive surge in both novel coronavirus cases and deaths in the state, Maharashtra health minister Rajesh Tope on Wednesday said that the lockdown in Maharashtra will be extended by another 15 days beyond April 30.\n\nThe strict curbs on movement of people and a host of other activities are in force in the state since April 14 and were to end on April 30. Essential services have been exempted from the curbs.\n\nHe said all members of the cabinet, who participated in a meeting chaired by Chief Minister Uddhav Thackeray, pitched for such extension.\n\n\"All members of the Maharastra Cabinet are of the opinion that current COVID-19 restrictions should be extended for the next 15 days,\" Tope told reporters.\n\nAddressing media persons after a Cabinet meeting here, Tope said though the COVID-19 situation seems to have stabilised to some extent in the state, all the ministers pitched for extending the on-going curbs.\n\nToday, the number (of daily cases) is 60,000-plus. There definitely is some stability. We had earlier predicted that (daily) cases may go beyond 70,000. But that has not happened.\n\nMeanwhile, ahead of the next phase of the Covid-19 vaccination drive in the country, which is scheduled to begin from 1 May, 2021, the Maharashtra government joined several states to announce that it would be providing free Covid-19 vaccines to all citizens in the state aged between 18-44 years.\n\n\"Today, the cabinet under the leadership of chief minister Uddhav Thackeray has decided to provide free COVID-19 vaccination to all the citizens of Maharashtra aged between 18-44 years,\" stated the CMO office.\n\n\"We have all the infrastructure to conduct vaccination but we don't have vaccines in adequate quantity. The CM is talking to different vaccine manufacturers. There will be separate centres for vaccination of those between 18-44 years of age,\" said Tope.\n\nIn view of the alarming rise in the COVID-19 cases, the Maharashtra government on April 4 announced a weekend lockdown and restrictions on the movement of people in the night during the weekdays till April 30.\n\nThe government had also clamped other restrictions like the closure of private offices, theatres and salons to curb the unprecedented surge in the cases.\n\nCurrently, the weekend lockdown is in force from 8 pm on Fridays and last till 7 am on Mondays.\n\nSection 144 of CrPC, prohibiting assembly of five or more people at one spot, will be in force during the period, Thackeray had said, but refrained from terming the new curbs as a lockdown.\n\nMalls, cinema halls, gyms, other recreational spaces are shut till 1 May in order to contain the virus. Social gatherings are also prohibited state-wide.\n\nThese curbs are in addition to the weekend lockdowns and other restrictions which will remain in force till April 30 under its 'Break the Chain' COVID-19 action plan.\n\nThe state government later directed groceries, vegetable shops and dairies to remain open only for four hours, between 7 am and 11 am, and banned home delivery after 8 pm till May 1.\n\nMeanwhile, Maharashtra on Tuesday reported the biggest single-day spike in novel coronavirus deaths since the pandemic outbreak in the country. With record 895 more virus-related fatalities recorded in last 24 hours, the death toll in the state has now reached 66,179.\n\nAlong with that, the state also reported over 66,358 new cases today, taking the tally to 44,100,85, according to the health bulletin.\n\nIn terms o vaccination, Maharashtra has inoculated over 1.53 crore people against Covid-19 o far, a health official said on Wednesday.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter."}, {"Article Image": "https://c.ndtvimg.com/2021-04/vo2m6bi8_mamata-banerjee-650_625x300_01_April_21.jpg", "Article's Title": "Opinion: The Big Numbers That Could Decide Whether Mamata Returns", "Article's Text": "The long-drawn ongoing assembly elections in West Bengal close amidst the alarming nationwide surge in Covid-19 cases. In about a week, we will find out whether the ruling Trinamool Congress can hold on to power for another five years, or the BJP will pull off a surprise, or the Left Front, now in an alliance with their erstwhile main rival, the Congress, will recover even some of the ground they have dramatically lost.\n\nElectoral campaigns have revolved around the record of the ruling Trinamool, which has now governed for a decade. The BJP is running on the electoral plank of \"real change,\" promising growth and jobs, while the Trinamool is pushing back with its record of setting up various welfare schemes; the Left Alliance has been highlighting the economic hardships faced by ordinary citizens, especially the poor. Given that 72% of people in the state live in rural areas, what is happening to the economy of rural Bengal could play a major role in the electoral outcome. With this in mind, let us briefly review West Bengal's economic performance over the last few decades based on official data reported in various RBI handbooks - both over time and relative to India - with special focus on the rural sector.\n\nAs is well known, until the early 1960s, West Bengal's per capita income was higher than the national average. In fact, it was among the three richest states - the other two being Maharashtra and Gujarat. By the early 1980s, its per capita income was just about equal to the national average. In the early 1990s, when the country was poised to move to a higher growth trajectory, the rank of West Bengal fell to seven. In 2000, it fell further to 10, and in 2011, when a new government came to power promising change, its rank was 11. After a decade under the new regime, the slide has continued - its rank now stands at 14.\n\nClearly, this long-term snapshot of the state falling behind in economic terms, relative to the rest of the country over the decades, reflects an overall growth trajectory that has not kept up with the national average. And indeed, the marginal decline in its rank over the last decade relative to the previous one shows that there has not been any paribartan or change in this respect. However, if we take a more granular view of the growth process in West Bengal, some interesting features begin to emerge.\n\nTo begin with, West Bengal has performed better in agricultural growth over the last decade compared to the rest of the country. And in this respect, its record is better than the decade before. Even though its share of agriculture and related activities is comparable to and slightly higher than the nationwide average, the growth rate of agriculture in West Bengal has been 3.3% over the last decade (2011-12 to 2019-20), while that of India has been 1.6%. This seems to be largely driven by the fall in the growth rate of agriculture in the country over the last five years, because if we just look at the first five years of the last decade, the all-India agricultural growth rate was higher than that of West Bengal. Interestingly, during the earlier decade (1999-2000 to 2009-2010), when the state was still under the rule of the Left Front, the state's growth rate in agriculture was very similar to (though marginally higher than) that of the country, while its overall growth rate was lower than that the national average. Of course, West Bengal's higher growth rate in agriculture in the last decade implies that the growth rate of manufacturing as well as services in the state were lower than the countrywide average, given that the overall growth rate was lower in the state (4.2%) relative to the rest of the country (5.2%).\n\nThis basic aspect of West Bengal's growth performance shows up in some other statistics as well. While the overall rural unemployment rate went up in West Bengal and nationwide between 2011-12 and 2018-19, the extent of the overall increase for India (1.7% to 5%) was much higher than the rise in the state (2.7% to 3.5%). Noticeably, however, the rural female unemployment rate went down in the state (2.4% to 1.4%) while it went up in the country as a whole (1.7% to 3.5%) over the same period.\n\nNow, given how state and national income statistics are estimated, we do not get a very reliable picture of what is happening in the informal economy. For this reason, data on consumer expenditure, based on household surveys, provide a valuable glimpse into what is happening to living standards. Earlier, the National Sample Survey Organization (NSSO) used to publish periodic reports on monthly per capita expenditure in rural and urban areas. Unfortunately, the report from the latest round (2017-18) was released, but later withdrawn. Still, comparing the numbers from this round with the previous round (2011-12) offers some interesting insights. After adjusting for inflation, the rate of growth of per capita consumption expenditure in urban areas in the state (3.8%) over the last decade fell short of that of the country as a whole (4.7%). However, for rural areas, the pattern reverses itself - over the last decade, West Bengal's growth rate shot up to 5%, well above the national average of 3%. This is also reflected in calculations that show that the percentage of people below the poverty line went down from 20% in 2011-12 to 14% in 2017-18 in West Bengal, while in the country as a whole it went up marginally from 22% to 23%. These numbers are consistent with the higher rate of agricultural growth in the state that we mentioned earlier.\n\nThere are many things in the electoral mix, from the various transfer programmes of the state government to perceptions of corruption, mismanagement, and political repression against the current regime as well as social issues based on caste, religion, and immigration. The chaos and misery unleashed up by Covid-19, as well as Cyclone Amphan, all in the last twelve months, have introduced a degree of unpredictability. However, the fact that the rural economy in the state over the last decade has outperformed the national average, a fact that has almost gone unnoticed, might end up playing an important role.\n\n(Maitreesh Ghatak is Professor of Economics at the London School of Economics and an elected Fellow of the British Academy.)\n\nDisclaimer: The opinions expressed within this article are the personal opinions of the author. The facts and opinions appearing in the article do not reflect the views of NDTV and NDTV does not assume any responsibility or liability for the same."}, {"Article Image": "https://c.ndtvimg.com/2020-03/hpdkk8tg_anand-mahindra_650x400_23_March_20.jpeg", "Article's Title": "Uddhav Thackeray's Meet With Industry Leaders Earns Anand Mahindra Praise", "Article's Text": "Anand Mahindra welcomed the meeting held on Tuesday as a productive one.\n\nMaharashtra Chief Minister Uddhav Thackeray held a meeting with industry leaders in the state ahead of the third phase of vaccination.\n\nIndustrialist Anand Mahindra, who chairs the diversified Anand Mahindra Group, welcomed the meeting held on Tuesday as a productive one.\n\n\"Uddhav Thackeray held a virtual meet with industry leaders discussing the state's efforts for the upcoming vaccination drive, efforts to ramp up facilities, and preparing a road map to safeguard the citizens and industry from the possible third wave,\" the Chief Minister's Office tweeted late on Tuesday.\n\nMaharashtra, one of the most industrialised states in the country, is the worst affected state by the number of reported cases in the second wave. The daily infections in Mumbai are now coming down from peaks of over 11,000 per day earlier in the month, but the pandemic rages on in the rest of the state.\n\nThis is the third meet between industrialists and the chief minister this month as efforts are made to restrict the spread of infections and also salvage the economy.\n\nIn response to the CMO's tweet, Anand Mahindra said the industrialists emerged with a feeling that they had \"spent productive time\".\n\nA meeting from which we emerged feeling we'd spent productive time. Because:\n\na) No time wasted in ceremonial comments\n\nb) Focused agenda\n\nc) Emphasis on practical/impactful corporate initiatives addressing ground realities\n\nd) Mechanism for followup/coordination established https://t.co/91dDP7bf07 — anand mahindra (@anandmahindra) April 28, 2021\n\nNo time was wasted in ceremonial comments and the agenda of the meeting was also focused, Anand Mahindra tweeted.\n\nThere was an emphasis on practical or impactful corporate initiatives addressing ground realities and a mechanism for follow-up and coordination was also established, Anand Mahindra said.\n\nAnand Mahindra had previously voiced concerns against the state imposing a lockdown in the state and insisted on improving the health apparatus in the state.\n\nResponding to the same in a speech where he virtually declared a state-wide lockdown, Uddhav Thackeray had said efforts have been underway to improve the health infrastructure but added that we need doctors and staff to deliver healthcare as well.\n\nIndustrialists should rather focus on ways to get at least 50 doctors, nurses, and health workers into the fold on a daily basis, Uddhav Thackeray had said."}, {"Article Image": "https://images.livemint.com/img/2021/04/28/600x338/769d036a-a1bd-11eb-a247-33e9e17dba1d_1619313662821_1619604692933.jpg", "Article's Title": "Maharashtra to provide Covid-19 vaccines for free for all above 18 yrs: Uddhav", "Article's Text": "Ahead of the next phase of the Covid-19 vaccination drive in the country, which is scheduled to begin from 1 May, 2021, the Maharashtra government joined several states to announce that it would be providing free Covid-19 vaccines to all citizens in the state aged between 18-44 years.\n\n\"Today, the cabinet under the leadership of chief minister Uddhav Thackeray has decided to provide free COVID-19 vaccination to all the citizens of Maharashtra aged between 18-44 years,\" stated the CMO office.\n\nThe move will put a burden of ₹6,500 crore on the state's coffers, said health minister Rajesh Tope.\n\nThe decision to provide free COVID vaccine to all the people in the age group of 18 to 44 in the state was taken in the state cabinet meeting held today. However, citizens will have to pay for the jabs in private hospitals.\n\nAfter the meeting, Thackeray clarified that the health department is planning for the vaccination program and the citizens will be informed about it in advance.\n\n\"We have been fighting the battle of COVID for the last one and a half years. Vaccination has been started in the state since January in collaboration with the Center. To date, more than 1.5 crore people under the age of 45 have been vaccinated. This is a record in the country\", he said.\n\nDiscussions have been held with Deputy Chief Minister Ajit Pawar, Revenue Minister Balasaheb Thorat, Health Minister Rajesh Tope and all other key colleagues in this regard.\n\nThe Chief Minister added that despite the current financial crisis in the state, the health of the citizens is the top priority and that is why the decision to provide free vaccines to all the people between the ages of 18 and 44 was taken at the state cabinet meeting.\n\nVaccination in Mumbai:\n\n1) 63 existing MCGM/Govt vaccination centres will be available in the age category of 45 years plus, as per reports.\n\n2) 227 new MCGM centres will be opened, one in each Hon’ble Municipal Corporator’s Ward which will be opened for all citizens in 18 years plus age category.\n\n3) Presently 73 vaccination centres in private hospitals would be increased to 100 plus private hospitals and they shall cater for vaccination to all citizens in the age category of 18 plus.\n\nEarlier, Nawab Malik, cabinet minister, government of Maharashtra had already announced that the state government would provide free Covid-19 vaccines for all adults.\n\nThe central government has announced a decision to vaccinate people above the age of 18 across the country from 1 May. \"Therefore, it is clear that the central government will not supply vaccines to those below the age of 45 years,\" said Malik's statement on the Facebook page of the Nationalist Congress Party of which he is the national spokesperson.\n\nFrom 1 May, covid-19 vaccination will be open for everyone above 18 years through booking on the Co-WIN website. The registration process for the third phase of the inoculation drive will begin on 28 April from 4 pm.\n\n\"Registration for 18 plus to begin on http://cowin.gov.in, Aarogya Setu App & UMANG App at 4 PM on 28th April. Appointments at State Govt centers & Private centers depending on how many vaccination centers are ready on 1st May for Vaccination of 18 plus,: Aarogya Setu informed in a tweet.\n\nThe government has liberalized the vaccination drive to allow states, private hospitals, and industrial establishments to procure the doses directly from manufacturers.\n\nPhase-I of the nationwide covid-19 vaccination drive was launched on January 16, prioritizing protection for healthcare workers and frontline workers. Phase-II was initiated from March 1, focusing on protecting the most vulnerable i.e. all people above 45 years of age.\n\nWhile Bharat Biotech has fixed the price of its Covid-19 vaccine, Covaxin, at ₹600 per dose for state governments and at ₹1,200 per dose for private hospitals.\n\nSerum Institute of India (SII)'s Covishield will be available at a price of ₹400 per dose to state governments and ₹600 per dose to private hospitals.\n\nMaharashtra on Tuesday reported the biggest single-day spike in novel coronavirus deaths since the pandemic outbreak in the country. With record 895 more virus-related fatalities recorded in last 24 hours, the death toll in the state has now reached 66,179.\n\nAlong with that, the state also reported over 66,358 new cases today, taking the tally to 44,100,85, according to the health bulletin.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter."}, {"Article Image": "https://c.ndtvimg.com/2020-10/jf03rmsg_samsung-chairman-lee-kunhee650_625x300_25_October_20.jpg", "Article's Title": "Samsung's Lee Family To Pay More Than 12 Trillion Won Inheritance Taxes", "Article's Text": "Lee Kun-hee's estate included shareholdings in Samsung affiliates valued at $17 billion.\n\nThe family of deceased Samsung Electronics chairman Lee Kun-hee said on Wednesday it will pay more than 12 trillion won ($10.78 billion) in inheritance taxes for the estate of the late patriarch.\n\nLee, who is credited with transforming Samsung into the world's largest smartphone and memory chip maker, died on Oct. 25. His estate included shareholdings in Samsung affiliates valued at $17 billion.\n\nThe Lee family's handling of the hefty inheritance tax bill - one of the largest ever in both Korea and globally - had been closely watched as it could have resulted in the dilution of the family's controlling stake in Samsung.\n\nThe family had been discussing using shares in affiliated companies as collateral for personal loans to pay part of the tax bill, a measure that would avoid the sale of their extensive Samsung holdings, Reuters reported last week, citing sources.\n\nThe family's statement on Wednesday did not give details of how Lee's shares will be distributed among the heirs or whether any will be sold. Besides loans, the family is expected to use dividends from both their own and Lee's shareholdings to pay the tax, analysts have said.\n\nLee's shareholdings included a 4.18% stake in Samsung Electronics, 0.08% of Samsung Electronics preferred shares, 20.76% of Samsung Life Insurance, 2.88% of Samsung C&T, and 0.01% stake in Samsung SDS, which according to South Korean tax code valuation were worth about 18.96 trillion won ($17 billion).\n\nSouth Korea's tax code allows payment in instalments, with one-sixth of the total tax bill to be paid first, then the rest over five years at an annual interest rate currently set at 1.2%.\n\nThe family also announced it will donate 1 trillion won to public health care charities, including for the creation of a specialized infection diseases laboratory. Lee's extensive collection of antiques and paintings will be donated to the National Museum of Korea and other cultural organizations.\n\n(This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)"}, {"Article Image": "https://images.livemint.com/img/2021/04/28/600x338/2021-01-25T183037Z_289375175_RC26FL9VCBN9_RTRMADP_3_HEALTH-CORONAVIRUS-INDIA-SAUDI_1618568921984_1619612848462.JPG", "Article's Title": "Covishield price for states reduced to ₹300 per dose: Serum CEO Adar Poonawalla", "Article's Text": "Serum Institute of India's CEO Adar Poonawalla on Wednesday announced that its Covid-19 vaccine candidate Covishield's' price for states have been reduced from ₹400 to ₹300 with immediate effect as a \"philanthropic gesture.\"\n\nTaking to Twitter, Poonawalla said, \"As a philanthropic gesture on behalf of @SerumInstIndia, I hereby reduce the price to the states from Rs.400 to Rs.300 per dose, effective immediately; this will save thousands of crores of state funds going forward. This will enable more vaccinations and save countless lives.\"\n\nAs a philanthropic gesture on behalf of @SerumInstIndia, I hereby reduce the price to the states from Rs.400 to Rs.300 per dose, effective immediately; this will save thousands of crores of state funds going forward. This will enable more vaccinations and save countless lives. — Adar Poonawalla (@adarpoonawalla) April 28, 2021\n\n\n\n\n\nThe Covishiled price for private market remains at ₹600 per dose.\n\nWhile Bharat Biotech has fixed the price of its Covid-19 vaccine, Covaxin, at ₹600 per dose for state governments and at ₹1,200 per dose for private hospitals.\n\nBoth vaccines are available to the central government at a rate of ₹150 per dose.\n\nThe announcement just days before India's expansion of its COVID-19 vaccination drive by allowing its large 18-plus population to get inoculated from May 1.\n\nFrom 1 May, covid-19 vaccination will be open for everyone above 18 years through booking on the Co-WIN website. The registration process for the third phase of the inoculation drive began today, 28 April from 4 pm.\n\n\"Registration for 18 plus to begin on http://cowin.gov.in, Aarogya Setu App & UMANG App at 4 PM on 28th April. Appointments at State Govt centers & Private centers depending on how many vaccination centers are ready on 1st May for Vaccination of 18 plus,: Aarogya Setu informed in a tweet.\n\nAlso, from May 1, the types of anti-coronavirus vaccine and their prices will be displayed on the CoWIN portal for citizens to make an informed choice at the time of booking an appointment at a private vaccination centre.\n\nWhile those aged 18 to 44 years will be eligible to receive vaccination on payment from any of the private COVID vaccination centres (CVCs), citizens below 45 years shall also be eligible to receive a jab from a government CVC in a state or Union Territory which decides to lower the minimum cut off age for eligibility.\n\nAs provided in the Liberalised Pricing and Accelerated National COVID-19 Vaccination Strategy document, all priority groups, such as healthcare workers, frontline workers and citizens above aged 45 years or more (as on 01.01.2022), shall continue to be eligible for vaccination free of cost from government CVCs, or on payment from private CVCS.\n\nUnder the third phase of the vaccination drive commencing next month, the vaccine manufacturers would supply 50 per cent of their monthly Central Drugs Laboratory (CDL) released doses to the central government and would be free to supply the remaining 50 per cent doses to state governments and in the open market.\n\nManufacturers would have to make an advance declaration of the price for 50 per cent supply that would be available to the state governments and in the open market before May 1, 2021, an official statement said.\n\nBased on this price, state governments, private hospitals, industrial establishments, etc would be able to procure vaccine doses from the manufacturers.\n\nPrivate Hospitals would have to procure their supplies of COVID-19 vaccine exclusively from the 50 per cent supply earmarked for entities other than those coming through the central government channel.\n\nThe private vaccination providers would need to transparently declare their self-set vaccination price and the eligibility through this channel would be opened up to all adults, that is everyone above the age of 18, the statement added.\n\nVaccination will continue as before in the government of India vaccination centres free of cost to the eligible population -- healthcare and frontline workers and all people above 45 years of age.\n\nCentre, from its share, will allocate vaccines to States/UTs based on the criteria of extent of infection (number of active Covid cases) & performance (speed of administration). Wastage of vaccine will also be considered in this criteria and will affect the criteria negatively. Based on the above criteria, State-wise quota would be decided and communicated to the States adequately in advance.\n\nSecond dose of all existing priority groups i.e. HCWs, FLWs and population above 45 years, wherever it has become due, would be given priority, for which a specific and focused strategy would be communicated to all stakeholders.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter."}, {"Article Image": "https://c.ndtvimg.com/2021-04/ick8f4o8_karnataka-coronavirus_625x300_25_April_21.jpg", "Article's Title": "39,047 Covid Cases In Karnataka, 22,596 In Bengaluru In New High Today", "Article's Text": "A 14-day lockdown came into effect in Karnataka on Wednesday to contain the spread of COVID-19.\n\nKarnataka reported a new all-time record on Wednesday with 39,047 COVID-19 cases in the last 24 hours, taking the total caseload to 14.39 lakh, the health department said. Its capital city, Bengaluru alone accounted for 22, 596 of the total number of cases even as its health infrastructure is bursting at the seams amid a deluge of cases.\n\nKarnataka has now over three lakh active cases of which two lakh are in Bengaluru alone.\n\nThe Karnataka High Court has called the situation in Bengaluru \"alarming\" where the number of beds available to coronavirus patients was not proportional to the demand.\n\nEarlier in the day, Chief Minister BS Yediyurappa appealed to the people to abide by the norms to break the chain of infections.\n\nThe Karnataka High Court on Tuesday pointed out that the number of beds available to coronavirus patients in the state capital Bengaluru was not proportional to the demand and called the situation \"alarming\".\n\n\"The 2 weeks strict rules to break the chain of Covid virus have begun. My appeal to everyone: follow the guidelines, cooperate with the govt, stay indoors, and step out only if it's an emergency. Together, we all can defeat the Covid-19 pandemic,\" Mr Yediyurappa tweeted.\n\nA 14-day lockdown came into effect in Karnataka on Tuesday night to contain the spread of COVID-19. The lockdown was imposed on the day the state reported over 30,000 COVID-19 cases in a single day.\n\nKarnataka had reported over 31,000 cases of coronavirus on Tuesday."}, {"Article Image": "https://c.ndtvimg.com/2021-04/a13ksghg_adar-poonawalla-ndtv_625x300_06_April_21.jpg", "Article's Title": "Serum Institute's Adar Poonawalla To Get Y Category Security Cover", "Article's Text": "The Serum Institute announced a 25 per cent reduction in price for the states - Rs 300 instead of Rs 400\n\nPune-based Serum Institute chief Adar Poonawalla will be provided \"Y category\" security across the country. The Union Home Ministry issued orders regarding this today after conducting a detailed threat assessment, sources said.\n\n\"Y category\" security involves the presence of 11 security personnel - one or two of them commandos and the rest policemen.\n\nSerum Institute has been much criticised after it announced the pricing of its Covishield vaccine to the states for the 18 to 45 age group - Rs 400 a shot, way above the Rs 150 price offered to the Centre.\n\nThe pricing has provoked anger and debate, with opposition leaders and many on social media demanding \"One vaccine one price\".\n\nToday, the Serum Institute announced a 25 per cent reduction in price for the states - Rs 300 instead of Rs 400.\n\nThe Serum institute chief had earlier said that the subsidized rate for the Centre was only for a \"limited\" period.\n\n\"The average price is around $20 (Rs 1,500)... (but) because of the Modi government's request, we are providing at subsidised rates... It is not that we're not making profits... but we are not making super profits, which is key to re-investing,\" he had told NDTV.\n\n\"As a philanthropic gesture on behalf of Serum Institute of India, I hereby reduce the price to the states from Rs.400 to Rs.300 per dose, effective immediately; this will save thousands of crores of state funds going forward. This will enable more vaccinations and save countless lives,\" Mr Poonawalla tweeted today."}, {"Article Image": "https://c.ndtvimg.com/2021-04/p73fh44k_cowin-vaccination-covid_625x300_28_April_21.jpg", "Article's Title": "\"CoWIN Crashed,\" Complain Many As Vaccine Registration For 18+ Begins", "Article's Text": "Many complained the CoWIN site wasn't working, though others successfully completed the process.\n\nOn a day registrations were opened up for all adults looking to get vaccinated against COVID-19, the government's dedicated website for the drive seemed to malfunction. Many complained today that the CoWIN site was not working, though others successfully completed the process. Less than an hour after registrations opened at 4 pm, however, it was informed that a minor glitch in the portal had been fixed.\n\nThe Centre had opened inoculation for everyone above the age of 18 from May 1 under a more \"liberalised and accelerated Phase 3 strategy of COVID-19 vaccination\".\n\nCoWIN server is facing issue.... What the hell! They can't have infra to support their own people....\n\n\n\nAnd they call them IT Super Power, what a shame ???? — Pulak (@pulakB) April 28, 2021\n\nThose looking to register for vaccination were to go to https://www.cowin.gov.in/home and click on the \"register/sign-in\" option. However, this didn't work for many who got an error message saying: \"CoWIN server is facing issues. Please try later.\"\n\nHowever, Aarogya Setu, the Union government's app for contact tracing and dissemination of medical advisories to contain spread of COVID-19, tweeted saying, \"Cowin Portal is working. There was a minor glitch at 4 PM that was fixed. 18 plus can register.\"\n\nThe vaccinations themselves will begin on Saturday.\n\nIn January 2021, India began the largest vaccination drive in the world, inoculating healthcare, sanitation and other frontline workers in the first phase. The second phase included those aged above 45 and those with co-morbidities. The third one, meant for all adults, came amid the a resurgence of the pandemic that saw a stunning number of people getting affected. This also coincided with a severe shortage of medical resources.\n\nIndia's daily Covid deaths hit a new peak today at 3,293 in the past 24 hours. New cases rose by over 3.6 lakh, a global high, pushing the total cases to over 1.79 crore. The crisis has left India grappling for oxygen and medicines.\n\nIndia has used Serum Institute's Covishield and Bharat Biotech's Covaxin to inoculate people till now. On April 13, as the second wave began to wreak devastation, the centre fast-tracked the approvals for vaccines used in other parts of the world."}, {"Article Image": "https://c.ndtvimg.com/2021-01/82l08puo_adar-poonawalla-tweet-january-2021_650x400_12_January_21.jpg", "Article's Title": "\"Philanthropic Gesture\": Covishield Price For States Reduced To Rs 300", "Article's Text": "This will enable more vaccinations and save countless lives, Mr Poonawalla tweeted. (FILE)\n\nSerum Institute of India's Covishield will cost states Rs 300 instead of Rs 400, CEO Adar Poonawalla tweeted today, calling it a \"philanthropic gesture\".\n\n\"As a philanthropic gesture on behalf of Serum Institute of India, I hereby reduce the price to the states from Rs.400 to Rs.300 per dose, effective immediately; this will save thousands of crores of state funds going forward. This will enable more vaccinations and save countless lives,\" Mr Poonawalla wrote in his tweet.\n\nThe higher prices of vaccines for states and private hospitals have provoked anger and debate since Serum made the announcement weeks ago.\n\nFrom May 1, as vaccinations open to all adults, states and private entities can buy doses directly from manufacturers under the Centre's liberalized policy to tackle the explosion of Covid cases.\n\nState governments and private hospitals can order up to 50 per cent of Serum's Covishield and Bharat Biotech's Covaxin to inoculate the younger population, while the centre will buy the other half to continue vaccinating those above 45 free of cost. Serum said it would continue to provide vaccines to the centre at Rs 150 a shot.\n\nWhile Serum announced a price of Rs 400 rupees for states and Rs 600 for private hospitals, Bharat Biotech set the prices at Rs 600 and Rs 1,200 a dose. These, according to reports, would mean the highest price at any private hospitals across the world for Covishield - the Indian name for the vaccine developed by Oxford-AstraZeneca.\n\nSerum CEO Adar Poonawalla had said the subsidized rate of Rs 150 per dose to the government was only for a \"limited\" period of time. \"We're supplying in India at approximately Rs 150-160. The average price is around $20 (Rs 1,500)... (but) because of the Modi government's request, we are providing at subsidised rates... It is not that we're not making profits... but we are not making super profits, which is key to re-investing,\" he told NDTV earlier this month."}, {"Article Image": "https://c.ndtvimg.com/2021-02/jc4dno8g_anthony-fauci_625x300_21_February_21.jpg", "Article's Title": "Covaxin \"Found To Neutralise\" Indian 617 Variant: US Adviser Dr. Fauci", "Article's Text": "Covaxin was found to neutralise the Indian 617 Covid variant, Anthony Fauci said (File)\n\nCovaxin, India's home-grown Covid vaccine produced by Bharat Biotech, has been found to neutralise the B.1.617 variant or the Indian double mutant strain, White House Chief Medical Adviser Anthony Fauci said on Tuesday.\n\n\"Now, this is something where we're still gaining data on a daily basis. But the most recent data was looking at convalescent sera of COVID-19 cases in people who received the vaccine used in India, the Covaxin. And it was found to neutralise the 617 variant,\" he said, according to news agency PTI.\n\n\"So despite the real difficulty that we're seeing in India, vaccination could be a very, very important antidote against this,\" Dr Fauci was quoted as telling reporters.\n\n\"So I'll stop there with the final statement. The one thing you can gather from everything I've said: that it's very important to get vaccinated.\"\n\nCovaxin was developed by Bharat Biotech in partnership with National Institute of Virology and the Indian Council of Medical Research (ICMR) and was approved for emergency use on January 3 while still in clinical trial.\n\nTrial results later showed the vaccine has an efficacy of 78 per cent, according to ICMR.\n\nThe B.1.617 variant, mostly found in Covid cases in Maharashtra and Delhi, has three new spike protein mutations. This variant is said to be pushing the deadly second surge in Covid across the country.\n\nCovaxin uses dead viruses and works by teaching the immune system to make antibodies against the coronavirus. When Covaxin is administered, immune cells recognise the dead virus, prompting the immune system to make antibodies to fight the coronavirus.\n\nWHO on Tuesday said the B.1.617 that a variant of Covid-19 feared to be contributing to a surge in coronavirus cases in India has been found in over a dozen countries.\n\nThe UN health agency said the B.1.617 variant of Covid-19 first found in India had as of Tuesday been detected in over 1,200 sequences uploaded to the GISAID open-access database \"from at least 17 countries\".\n\n\"Most sequences were uploaded from India, the United Kingdom, USA and Singapore,\" the WHO said in its weekly epidemiological update on the pandemic.\n\nThe WHO recently listed B.1.617 as a \"variant of interest\" and said it had been found in 17 countries.\n\nIndia's Covid cases smashed a new record today with 3.6 lakh cases and over 3,000 deaths in 24 hours."}, {"Article Image": "https://c.ndtvimg.com/2021-04/oef7l7j8_maruti-suzuki-650_650x400_27_April_21.jpg", "Article's Title": "Maruti Suzuki Shuts Down Plants To Make Oxygen For Medical Needs", "Article's Text": "Maruti Suzuki said that it is committed to support government in diverting oxygen for saving lives.\n\nMaruti Suzuki, the country's largest car maker, will shut down its manufacturing units in Haryana to make oxygen gas available for medical needs, the company said in a stock exchange filing. Suzuki Motor has also decided to shut down its manufacturing unit in Gujarat, Maruti Suzuki added.\n\nThe company advanced its annual maintenance shutdown to May 1 through May 9 from earlier plan of June, Maruti Suzuki said while adding that it is committed to support government in diverting oxygen for saving lives.\n\n\"As part of the car manufacturing process, Maruti Suzuki uses a small amount of oxygen in its factories while relatively much larger quantities are used by the manufacturers of components. In the current situation, we believe that all available oxygen should be used to save lives,\" Maruti Suzuki said in a press release.\n\nThe company has been informed that Suzuki Motor Gujarat has taken the same decision for its factory, Maruti Suzuki said.\n\nIndia's new Covid deaths hit an overwhelming peak with 3,293 people dying in the last 24 hours. New cases rose by over 3.6 lakh, a global high, pushing the total cases to over 1.79 crore. The crisis has left India grappling for oxygen and medicines.\n\nThis is the seventh straight day that over three lakh cases have been recorded in India, the second worst-hit country after the US. The fresh deaths, marking the deadliest day of the pandemic in the country, take its total fatalities to 2,01,187.\n\nMaruti Suzuki shares traded 0.44 per cent higher at Rs 6,587 after announcing its decision to shut down plants, underperforming the Sensex which was up 1.6 per cent."}, {"Article Image": "https://c.ndtvimg.com/2021-04/39o2vcrk_uddhav-thackeray650_625x300_13_April_21.jpg", "Article's Title": "May Extend Covid Restrictions By 15 Days: Maharashtra Minister", "Article's Text": "The final call on extending Covid-related restrictions will be taken by Chief Minister Thackeray (File)\n\nMaharashtra is likely to extend existing Covid-related restrictions by 15 days, state Health Minister Rajesh Tope was quoted by news agency PTI on Wednesday. The proposal was made at a cabinet meeting earlier today, but the final decision will be made by Chief Minister Uddhav Thackeray.\n\n\"It (the lockdown) will be extended by 15 days,\" Mr Tope was quoted as saying.\n\nThe state has, meanwhile, confirmed it will provide free vaccines for people between 18 and 44.\n\n\"Today, the Cabinet under the leadership of Chief Minister Uddhav Balasaheb Thackeray has decided to provide free COVID-19 vaccination to all the citizens of Maharashtra aged between 18-44years. #BreakTheChain,\" a tweet from the Chief Minister's Office said.\n\nToday, the Cabinet under the leadership of CM Uddhav Balasaheb Thackeray has decided to provide free COVID-19 vaccination to all the citizens of Maharashtra aged between 18-44years.#BreakTheChainpic.twitter.com/dzgmCLEDGT — Office of Uddhav Thackeray (@OfficeofUT) April 28, 2021\n\nAcross India over 100 crore people in this age group can get the vaccines from May 1 - part of the centre's \"liberalised\" vaccination policy that emerged after the devastating second Covid wave.\n\nAfter the meeting, Chief Minister Thackeray clarified that the state health department is planning for the vaccination program and the citizens will be informed about it in advance.\n\n\"We have been fighting the battle of COVID for the last one and a half years. Vaccination has been started in the state since January in collaboration with the Center. To date, more than 1.5 crore people under the age of 45 have been vaccinated. This is a record in the country,\" he said.\n\nLast week the state - the worst hit by the pandemic - announced a series of measures to combat the spike in cases. These measures, which included limiting attendance at non-essential private and government offices, and use of public transport - were to stay till 7 am on May 1.\n\nRestrictions were also imposed on weddings and social events, and shops selling groceries, dairy products and vegetables were allowed to open for only four hours - 7 am to 11 am per day.\n\nChief Minister Thackeray had earlier announced a night curfew and weekend lockdown.\n\nMaharashtra has over 6.7 lakh active coronavirus cases - more than Uttar Pradesh (3.06 lakh) and Karnataka (3.01 lakh) combined - and over 66,000 deaths have been recorded so far.\n\nOn Tuesday the state reported 66,358 new cases in 24 hours - compared to 48,700 on Sunday, 35,726 from a month ago and fewer than 9,000 just two months ago.\n\nWith input from PTI"}, {"Article Image": "https://c.ndtvimg.com/2021-04/euem8tqo_mother-daughter-singing_625x300_28_April_21.jpg", "Article's Title": "Toddler Joins Mom In Singing 'Agar Tum Saath Ho'. Smiles Guaranteed", "Article's Text": "A toddler sings 'Agar Tum Saath Ho' with her mother.\n\nIs this the cutest version yet of Agar Tum Saath Ho? The Internet certainly seems to think so. A video that is winning hearts on social media shows a little girl singing the hit Arijit Singh-Alka Yagnik song from the 2015 movie Tamasha alongside her mother. The video was originally posted on Facebook last week by Anjana Madathil and has since gone viral with thousands of views, comments and reactions.\n\nIn the 49-second clip, Ms Madathil was seen strumming a ukulele and singing Agar Tum Saath Ho. Her daughter, sitting next to her on the couch, joins her in singing the song and steals the show with her expressions and hand movements.\n\n\"My first attempt with the ukulele! It took me six months with the little one around,\" Anjana Madathil wrote while sharing the video.\n\nThe clip garnered over 11,000 'likes' and more than 900 comments on Facebook.\n\n\"What a fabulous rockstar she is,\" wrote a Facebook user. \"Please upload more videos of her!!\" another requested.\n\nThe mother-daughter performance, first shared on Facebook, quickly went viral and made its way to Twitter as well, where it has been viewed more than 2.7 lakh times. Take a look at some of the reactions it has garnered:\n\nThis is so beautiful ❤️❤️हम सब साथ है.. we are there for each other.. आपण एकमेकांना आहोत. Prayers for all 🙏 https://t.co/f1FKCB6h76 — Amruta Subhash (@AmrutaSubhash) April 26, 2021\n\nWonderful 😊💓\n\nCuteness overloaded 💐 — Ram Venkataraman (@JumbuTweeple) April 26, 2021\n\nHer little hands....❤❤ oh lord..I did so need to see that. — AD the lll (@medusaflower) April 26, 2021\n\nFor many, the video provided a much-needed dose of cheer and optimism in tough times\n\nIn the current times, when one is swamped by a deluge of despair and negativity, this is what is exactly required! https://t.co/Zs0r8x7m1m — Puneet Raina🇮🇳 (@drpuneetraina) April 28, 2021\n\nThats a cutest thing that i have come across in these difficult times... God bless... — SM Yousuff (@SMYousuff4) April 26, 2021\n\nLast year, a video of a three-year-old joining her father onstage and singing Chhoti Si Aasha had gone viral online.\n\nWhat do you think? Let us know using the comments section.\n\nClick for more trending news"}, {"Article Image": "https://c.ndtvimg.com/2021-04/ri0mi1v8_umesh-katti_625x300_28_April_21.jpg", "Article's Title": "Karnataka Minister Asks Farmer To \"Go Die\", Then A Bizarre Defence", "Article's Text": "Umesh Katti's response shocked many, who suggested that the Chief Minister drop him from his ministry.\n\nA farmer's query about cuts in PDS rice allotment has led to a harsh, insensitive response from a minister in Karnataka. Umesh Katti, the state's Food and Civil Supplies Minister, lashed out when a farmer quizzed him about the staples being offered to the poor by the government, citing Covid-induced lockdowns and poor income. The audio conversation is being widely circulated in the state.\n\n\"Sir now you made it 2 kg rice (in PDS). How will it be sufficient for us?\" the farmer had asked. When the minister replied that the government is also giving 3 kilos of raagi, the farmer argued it was not available in north Karnataka. Mr Katti said in North Karnataka, the government is distributing made jowar and Rice.\n\nThis was how the conversation went then:\n\nFarmer: Sir, will that be sufficient? Lockdown now and we don't earn our livelihood. Will that be sufficient, Sir?\n\nMinister: Every month, the Central Government is giving 5 kg (wheat or rice) during lockdown. In the month of May and June...\n\nFarmer: When are you giving?\n\nMinister: Next month.\n\nFarmer: Till then, should we starve or die?\n\nMinister: It is better to die. Actually, that is the reason we have stopped giving. Please don't call me.\n\nThe minister's response shocked many, who suggested that Chief Minister BS Yediyurappa immediately drop him from his ministry.\n\nCongress's DK Shivakumar tweeted: \"BJP Minister Umesh Katti has abused a citizen & asked him to 'go die' just because he asked him why Karnataka Govt has cut Rice under PDS to just 2 kgs! CM @BSYBJP must immediately throw him out of the cabinet for this most insensitive statement. Does this Govt have any shame?\"\n\nBJP Minister Umesh Katti has abused a citizen & asked him to 'go die' just because he asked him why Karnataka Govt has cut Rice under PDS to just 2 kgs!\n\n\n\nCM @BSYBJP must immediately throw him out of the cabinet for this most insensitive statement.\n\n\n\nDoes this Govt have any shame? — DK Shivakumar (@DKShivakumar) April 28, 2021\n\nMr Katti, however, defended his statement.\n\n\"If he is asking whether he should die, what should I tell him? When you are asking properly, I can respond to you in a proper manner. The way you are asking me now, I can answer you in the same manner and tone. When he said that he wanted to die, what should I reply to him?\" the minister told reporters.\n\nWhen reporters suggested that he should have said, \"You shouldn't die. The government is there to help you,\" Mr Katti replied, \"I don't have that big a heart, mine is a small heart\".\n\nThe last time Mr Katti made headlines for controversial decisions was in February, when he declared that families with televisions and two-wheelers should surrender their Below Poverty Line cards or face action. He had given a March 31 deadline.\n\nEven his party colleagues had criticised the decision,\n\n\"It is normal for every household these days to have a TV and refrigerator. Some may buy two-wheelers for the convenience of commute. He [Minister Katti] may have spoken about the merits for eligibility orally. This matter requires widespread consultation,\" Union Minister for Chemicals and Fertilizers D.V. Sadananda Gowda had said.\n\nAfter widespread criticism, Mr Katti issued a statement that read: \"No orders have been issued after the BJP government came to power. I have not issued any order after taking over as Minister either\"."}, {"Article Image": "https://c.ndtvimg.com/2019-05/1jlsbnq8_election-commission_625x300_23_May_19.jpg", "Article's Title": "Trinamool Candidate Dies Of Covid, Wife Accuses Election Body Of Murder", "Article's Text": "Election Commission \"singularly responsible for the second wave of Covid\": Madras High Court\n\nThe wife of a Trinamool Congress candidate who died of Covid, has filed a murder case against the Election Commission. Kajal Sinha, the party candidate from Khardah, died on April 25. His wife Nandita Sinha has now accused Deputy Election Commissioner Sudeep Jain and other officials of \"careless and negligent\" behaviour that led to the death of husband and several other candidates.\n\nAccusing the Commission of \"self-serving blind motives\", Nandita Sinha, in her complain to the police, wrote while the entire nation was \"struggling to cope with the coronavirus crisis\" the EC decided on a staggering eight-phase polls in Bengal that stretched from March 27 to April 29.\n\n\"In comparison, elections in Tamil Nadu, Kerala and Pondicherry were held and completed in one day in one phase... And Assam saw voting in three phases in a span of three days,\" she wrote.\n\nIn the complaint, she also mentioned that the Trinamool Congress had requested the Commission twice -- on April 16 and Aril 20 -- to club the remaining phase of polls citing the \"massive flare-up of Covid cases\" in the state.\n\nThe Commission had \"frivolously replied (citing) its illusory and cosmetic safeguards in the form of prohibition of campaign after 7 pm and extension of the silent period from 24 to 72 hours,\" she wrote.\n\nThe Commission, she said, had \"deliberately ignored all evidences of the impending catastrophe\" even after an alarm was sounded by the Calcutta High Court.\n\nNandita Sinha's move came two days after the Madras High Court's stinging criticism of the Commission's handling of the elections in five states.\n\nOn Monday, the court had said the Election Commission was \"singularly responsible for the second wave of Covid\". \"Your officers should be booked on murder charges probably,\" the judges had observed.\n\nIn a statement yesterday, the Commission said enforcing Covid safety measures is the job of state governments and not that of the Election Commission. The poll body, it indicated, is only responsible for conducting free, fair and safe elections.\n\nIn her complaint, Nandita Sinha pointed out that the Election Commission was in control of the law and order in Bengal and the Central paramilitary forces during the election, and was in a position to ensure that Covid protocols are maintained.\n\nEarlier, the Calcutta High Court had censured the Election Commission on the same lines. \"The Election Commission is empowered to act, but what is it doing about polls in these Covid times? The EC is just passing circulars and leaving it to the people. But the EC has implementing authority,\" the court had said.\n\nThe Trinamool Congress has vehemently criticised the Election Commission for the unprecedented eight-phase polls. It has also accused the Commission of being a stooge of the BJP, which is hoping to capture power in the state.\n\nConcerns about violence had been voiced the loudest by the BJP and the Commission, while announcing the polls, had indicated that security played a role in the decision.\n\nChief Minister Mamata Banerjee has said after the elections, she will approach the Supreme Court over the issue."}, {"Article Image": "https://c.ndtvimg.com/2021-04/55r3142g_meera-chopra-priyanka-chopra-_625x300_28_April_21.jpg", "Article's Title": "\"Not Got Any Work Because Of Priyanka,\" Says Cousin Meera Chopra", "Article's Text": "Meera Chopra shared this photo. (Image courtesy: meerachopra)\n\nHighlights Meera is the cousin of actresses Priyanka and Parineeti Chopra\n\n\"Being related to Priyanka has not helped me in my career,\" she said\n\nMeera made her acting debut with the 2005 Tamil film Anbe Aaruyire\n\nActress Meera Chopra, who is the cousin of global icon Priyanka Chopra, revealed in an exclusive interview with Zoom TV that being related to the Fashion actress \"hasn't helped\" her in her acting career. Meera made her acting debut with the 2005 Tamil film Anbe Aaruyire and ventured into Bollywood with Satish Kaushik's 2014 comedy-drama Gang Of Ghosts. She works predominantly in southern film industry. Talking to Zoom TV, Meera Chopra said that she \"never got any work because of Priyanka Chopra\" and that the \"only privilege she got\" for \"coming from a family who knew cinema\" was that people took her seriously. Meera Chopra's other cousins - Parineeti Chopra and Mannara - are also actresses.\n\n\"The only time when I came to Bollywood there was a buzz that Priyanka Chopra's sister is also coming but honestly I have not faced many comparisons. I have not got any work because of Priyanka. If I needed a producer, they have not cast me as I am her sister. Honestly, being related to her has not helped me in my career but it has really helped me in a way that people did take me seriously,\" Meera Chopra told Zoom TV.\n\nShe added: \"They did not take me for granted as they knew was coming from a family who knew cinema. That is the only privilege I got. Otherwise, I had to struggle. Honestly, with my work like every time my movie used to leave, fortunately, I have not been compared to both of them.\"\n\nMeera Chopra has worked in Tamil and Telugu movies like Bangaram, Jambhavan, Marudhamalai, Kaalai, Vaana, Jaganmohini and Killadi.\n\nShe was last seen in the film Section 375, in which she co-starred with Richa Chadha, Akshaye Khanna and Rahul Bhat.\n\nMeera Chopra has a film with Arjun Rampal and Harshaali Malhotra titled Nastik lined up.\n\nPriyanka Chopra, on the other hand, is a National Award-winning actress, who is the star of films like Barfi!, Mary Kom, Dil Dhadakne Do, 7 Khoon Maaf and Jai Gangaajal. She also headlined the American television series Quantico and has featured in several international projects such as Baywatch, Isn't It Romantic and We Can Be Heroes. Her lined-up projects include Matrix 4, Citadel and Text For You."}, {"Article Image": "https://c.ndtvimg.com/2021-04/g5ccsmtg_irrfan-khan-babil_625x300_28_April_21.jpg", "Article's Title": "What Irrfan Khan Told Son Babil In His Final Days In The Hospital", "Article's Text": "Babil shared this photo of Irrfan Khan. (Image courtesy: babil.i.k)\n\nHighlights \"I was there in the hospital,\" said Babil\n\n\"He was losing consciousness,\" Babil added\n\nIrrfan Khan died on April 20 last year\n\nIrrfan Khan was one of the most loved and respected actors of Bollywood. He died of cancer at the age of 53 in Mumbai's Kokilaben Hospital on April 20 last year. Irrfan Khan and his wife Sutapa Sikdar's son Babil, in an interview with Film Companion, revealed one of the last things that the actor said to him in his final days. Irrfan Khan was admitted to the Kokilaben Hospital. \"I was there in the hospital, two-three days before he died,\" said Babil while talking to Film Companion's Anupama Chopra during the interview and added: \"He was losing consciousness and one of the last things he said...he just looked at me, smiled and said 'I am going to die'.\"\n\n\"And I told him 'No, you are not'. He then smiled again and went back to sleep,\" added Babil during the online interview, which he gave with mother Sutapa Sikdar.\n\nIrrfan Khan was the star of films like The Namesake, Paan Singh Tomar, Haider, Maqbool, Piku and The Lunchbox. On Babil's Instagram feed, you can easily find priceless memories of the late actor - some from his films while others from his quality time with his family.\n\nIrrfan Khan was also remembered in the In Memoriam segment of the Academy Awards this year.\n\nIn the same Film Companion interview, Sutapa Sikdar shared that Irrfan Khan \"never pretended.\" Talking about \"the most precious quality\" about the late actor, Sutapa said: \"He never pretended. If he is angry with you, or he is in love with you. The main thing is, when he is in love with you and says 'I love you', he did not pretend. He did not say it till he meant it.\"\n\nIrrfan Khan and Sutapa Sikdar's son Babil is currently prepping for his first film. Babil will make his acting debut in Anushka Sharma-produced Netflix Film Qala, in which he co-stars with Tripti Dimri."}, {"Article Image": "https://c.ndtvimg.com/2021-04/pa15l86_sugandha-mishra-sanket-bhosale-_625x300_28_April_21.jpg", "Article's Title": "The Kapil Sharma Show Stars Sugandha Mishra And Sanket Bhosale Get Married. See Pic", "Article's Text": "Sugandha Mishra shared this photo. (Image courtesy: sugandhamishra23 )\n\nHighlights Sugandha shared a picture from their wedding ceremony on Tuesday\n\n\"Aur isee ke sath... Sanket Bhosale, your life, my rules,\" she wrote\n\nSanket Bhosale picked a green sherwani for the wedding ceremony\n\nCongratulations, Sugandha Mishra and Sanket Bhosale. The couple, who co-starred in the comedy show The Kapil Sharma Show, are now married. Sugandha shared a picture from their wedding ceremony on her Instagram profile on Tuesday evening and wrote this special note for her husband Sanket: \"Aur isee ke sath... Sanket Bhosale, your life, my rules\" with red heart icons. The duo got married on Monday. For their big day, Sugandha Mishra opted for a cream lehenga and pastel pink dupatta while Sanket Bhosale picked a green sherwani. The couple can be seen smiling with all their hearts in the picture-perfect moment from their wedding.\n\nSharing the same picture on his Instagram account, Sanket Bhosale wrote: \"Aur isee ke sath Teen naam Poore ho gaey! 'Sugandha Mishra Bhosale'.\"\n\nCheck out this beautiful photo from Sugandha Mishra and Sanket Bhosale's wedding here:\n\nSugandha Mishra and Sanket also shared glimpses of their official engagement ceremony on Tuesday. The pictures feature them twinning in yellow outfits.\n\nMeanwhile, also check out this photo from Sugandha Mishra's mehendi ceremony:\n\nThe couple announced their wedding date with these stunning pictures of themselves on April 18:\n\nSugandha Mishra is best-known for featuring in The Kapil Sharma Show. She is also a TV presenter and a singer. She has crooned songs like Zor Naache, Ishq Ki Dafli Baje, Tu Hass Le, Us Ladke Se Mohabbat Hai, Akhiyan, Chori Chori, Kinna Sohna, Challa and Loye Loye. She has featured as a host on shows like The Voice India Season 2 and Taare Zameen Par. She has also worked in TV series like Don't Worry Chachu, Comedy Circus Ke Taansen, Baal Veer and Kanpur Wale Khuranas."}]