[{"Article Image": "https://static.toiimg.com/thumb/msid-82293378,width-1070,height-580,imgsize-2329312,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "Texas man dies after attack by aggressive swarm of bees", "Article's Text": "The Breckenridge Fire Department said first responders faced \"very aggressive bee activity\" when they arrived at the home. Representational image: AP Photo\n\nBRECKENRIDGE: A Texas man died after going into cardiac arrest when he was attacked by an aggressive swarm of bees outside his home, authorities said.\n\nThomas Hicks, 70, was mowing his lawn Monday when he was repeatedly stung by the bees outside his home in Breckenridge, about 130 miles (210 kilometers) west of Dallas , authorities said.\n\nThe Breckenridge Fire Department said first responders faced \"very aggressive bee activity\" when they arrived at the home. Medics and firefighters attempted emergency care but Hicks died, the fire department said.\n\nHicks' wife, Zoni Hicks, told TV station KTAB that she had been out grocery shopping when she returned to find her husband screaming and covered in bees.\n\n\"You couldn't even see his back and his whole head - he was just covered,\" she said.\n\nZoni Hicks was also stung repeatedly and she was treated and released from a hospital.\n\nThe hive was located inside a tree and firefighters killed the bees by spraying foam onto them, authorities said.\n\n"}, {"Article Image": "https://static.toiimg.com/thumb/msid-82293599,width-1070,height-580,imgsize-111146,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "BioNTech co-founder 'confident' vaccine works against Indian variant", "Article's Text": "BERLIN: BioNTech co-founder Ugur Sahin on Wednesday voiced confidence that the vaccine that his company jointly developed with Pfizer works against the Indian variant of the coronavirus.\n\n\"We are still testing the Indian variant, but the Indian variant has mutations that we have already tested for and which our vaccine works against, so I am confident,\" said Sahin.\n\n\"The vaccine is cleverly built and I'm convinced the bulwark will hold. And if we have to strengthen the bulwark again, then we will do it, that I'm not worried about,\" he added.\n\nIndia is facing surging new cases and deaths in the pandemic, and fears are rising that the variant could be contributing to the unfolding catastrophe.\n\nThe World Health Organization has said the B.1.617 variant of Covid-19 first found in India had as of Tuesday been detected in \"at least 17 countries\".\n\nThe health agency recently listed B.1.617 -- which counts several sub-lineages with slightly different mutations and characteristics -- as a \"variant of interest\".\n\nBut so far it has stopped short of declaring it a \"variant of concern\", which would have indicated that it is more dangerous than the original version of the virus by, for instance, being more transmissible, deadly or able to dodge vaccine protections.\n\nThe BioNTech-Pfizer vaccine was the first to win authorisation in the West , and has since been deployed in dozens of countries worldwide.\n\nGiving an update of the authorisation process in China, Sahin said approval was \"very possible in July\".\n\n\"We are almost through with all questions,\" he said.\n\n\n\nFacebook Twitter Linkedin EMail"}, {"Article Image": "https://static.toiimg.com/thumb/msid-82293163,width-1070,height-580,imgsize-1917575,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "Guests flock to Dutch cafe terraces as lockdown eases", "Article's Text": "The Netherlands on Wednesday became the latest European country to begin cautiously relaxing its lockdown even as infection rates and intensive care occupancy remain stubbornly high. AP Photo\n\nUTRECHT: Lisa Gerritsen and Eva Diks were the first guests in six months to be served at Cafe Le Journal on The Neude square in the Dutch city of Utrecht on Wednesday.\n\nFirst in a long line waiting to be seated, they chose a table in the sun, ordered a bottle of rose wine and glasses of water and were planning to make a day of it.\n\n\"We've waited so long. We were here at 11 o'clock. Fantastic,\" said Gerritsen, a 19-year-old student. \"We plan to stay here until 6 p.m.\"\n\nThe Netherlands on Wednesday became the latest European country to begin cautiously relaxing its lockdown even as infection rates and intensive care occupancy remain stubbornly high.\n\nThe Dutch follow Italy , Greece , France and other European nations in moving to reopen society and edge away from economically crippling lockdowns in the coming weeks.\n\nA curfew that sparked rioting when it was introduced nationwide in January was lifted and shoppers were allowed to visit nonessential stores without making an appointment first, though numbers were limited.\n\nBars and cafes were allowed to reopen their outdoor terraces for the first time in six months, but some owners weren't happy with the conditions they say will make it near impossible to turn a profit.\n\nThe terraces are only allowed to open between midday and 6 p.m. for a maximum of two socially distanced people per table unless they are from the same household.\n\nAlex Celik, owner of the Il Pozzo Italian restaurant on the Old Canal that runs through downtown Utrecht, lamented that he has to close just when Dutch customers want to sit down for an evening meal.\n\n\"Midday to 6 pm is nothing for the hospitality industry,\" he said. \"Closing at 6 pm people will take food and go to the park. It won't work so well. It would have been much better if we could open until 8 o'clock.\"\n\nHe showed a recent photo he snapped during lockdown of around 250 people eating and drinking along the canal where he is now only allowed to accept 50 customers.\n\nHis comments echoed the country's hospitality lobby group, which has criticized the opening hours, saying guests will leave terraces and move elsewhere, making it more difficult to ensure they stick to social distancing and hygiene rules.\n\nThe country's public health institute reported Tuesday that infections edged higher over the last week to just over 55,000 while hospital admissions declined very slightly. More than 17,000 people are confirmed to have died of COVID-19 in the Netherlands.\n\nAfter being the last European Union nation to begin its vaccination campaign, the Netherlands, a nation of about 17.4 million people, has now administered around 5.3 million shots.\n\nGerritsen said she had mixed feelings about soaking up sun and wine while hospital staff were battling the COVID-19 crisis.\n\n\"It's tough for those working in health care that they're so busy and we're sitting here on a terrace,\" she said. \"We are allowed to do it now, but it's really difficult.\"\n\nThe reopening came a day after the annual King's Day holiday in the Netherlands that saw large crowds of revelers gather in most towns and cities, most of them ignoring social distancing guidelines.\n\n\"We can regulate things much better than that,\" said Eddy Schouten, owner of Cafe Het Neutje.\n\nFor Pamela Kuijper-Hartman and Sven Hartman, Wednesday was important for much more than the reopening of terraces.\n\nThe couple got married at Utrecht City Hall at 11 a.m. and then walked around the corner to The Neude where they sat with a small group of guests at socially distanced tables and enjoyed a drink in the spring sunshine.\n\n\"Perfect timing,\" Kuijper-Hartman said.\n\n"}, {"Article Image": "https://static.toiimg.com/thumb/msid-82288557,width-1070,height-580,imgsize-215944,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "Mohammed Bin Salman: Saudi prince strikes conciliatory tone with rival Iran", "Article's Text": "RIYADH: Saudi Arabia's crown prince on Tuesday struck a conciliatory tone towards the kingdom's arch-nemesis Iran, saying he sought \"good\" relations, after sources said the rivals held secret talks in Baghdad.\n\nThe two countries, locked in a fierce struggle for regional dominance, cut ties in 2016 after Iranian protesters attacked Saudi diplomatic missions following the kingdom's execution of a revered Shia cleric.\n\n\"Iran is a neighbouring country, and all we aspire for is a good and special relationship with Iran,\" Saudi Crown Prince Mohammed bin Salman said in a television interview broadcast late Tuesday.\n\n\"We do not want Iran's situation to be difficult. On the contrary, we want Iran to grow... and to push the region and the world towards prosperity.\"\n\nHe added that Riyadh was working with regional and global partners to find solutions to Tehran's \"negative behaviour\".\n\nThat marks a change in tone compared to Prince Mohammed's previous interviews, in which he lashed out at Tehran, accusing it of fuelling regional insecurity.\n\nThe prince did not mention any negotiations with Tehran.\n\nThe talks in Baghdad, facilitated by Iraqi Prime Minister Mustafa al-Kadhemi, remained secret until the Financial Times reported that a first meeting had been held on April 9.\n\nAn Iraqi government official confirmed the talks to AFP, while a Western diplomat said he had been \"briefed in advance\" about the effort to \"broker a better relationship and decrease tensions\".\n\nRiyadh has officially denied the talks in its state-backed media while Tehran has stayed mum, asserting only that it has \"always welcomed\" dialogue with Saudi Arabia.\n\nThe initiative comes at a time of shifting power dynamics, as US President Joe Biden is seeking to revive the tattered 2015 nuclear deal that was abandoned by Donald Trump .\n\nSaudi Arabia and Iran have backed opposite sides of several regional conflicts, from Syria to Yemen, where a Saudi-led coalition is fighting the Huthi rebels.\n\nIran supports the Huthi rebels, who are battling the Saudi-led military coalition that intervened in Yemen's war in 2015.\n\nThe rebels have also stepped up drone and missile strikes on Saudi targets, including its oil facilities.\n\nIn his interview, Prince Mohammed renewed calls for a ceasefire and negotiations with the rebels.\n\n\n\nFacebook Twitter Linkedin EMail"}, {"Article Image": "https://static.toiimg.com/thumb/msid-82290855,width-1070,height-580,imgsize-626129,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "Northern Ireland leader faces party revolt over Brexit fallout", "Article's Text": "Arlene Foster. Photo: Facebook/Arlene Foster\n\nLONDON: The leader of Northern Ireland was fighting Wednesday to keep her job as members of her party tried to oust her over her handling of the fallout from Brexit and other issues.\n\nNorthern Ireland Assembly lawmakers from the Democratic Unionist Party have been asked to sign a letter of no-confidence in party leader Arlene Foster . It is unclear how many have signed, and the DUP said it would not comment on internal party matters.\n\nThe move against Foster, who has led the party since 2015, is the latest sign of how Britain's economic split from the European Union at the end of 2020 has shaken the political balance in Northern Ireland, a part of the U.K. where some people identify as British and some as Irish.\n\nPost-Brexit trade rules have imposed customs and border checks on some goods moving between Northern Ireland and the rest of the U.K. The arrangement was designed to avoid checks between Northern Ireland and Ireland, an EU member, because an open Irish border has helped underpin the peace process that ended decades of violence in Northern Ireland.\n\nThe new arrangements have angered Northern Ireland's British unionists, who say the new checks amount to a border in the Irish Sea and weaken ties with the rest of the UK.\n\nTensions over the new rules were a contributing factor to a week of street violence in Northern Ireland cities earlier this month that saw youths pelt police with bricks, fireworks and petrol bombs.\n\nFoster and other prominent DUP politicians are facing the wrath of party members for backing the divorce agreement that British Prime Minister Boris Johnson struck with the EU.\n\nFoster also has alienated sections of the conservative, Protestant party by taking a too-liberal stand on social issues. Some are angry that Foster did not join most of her DUP colleagues in voting against a move to ban \"gay conversion\" therapy last week in the Northern Ireland Assembly.\n\nFoster downplayed the party's internal turmoil on Tuesday, saying \"stories on leadership come up from time to time, and it's one of those times.\"\n\nBut former DUP adviser Timothy Cairns said a leadership contest was nearly inevitable and Foster would be the \"greatest political survivor in the history of UK politics\" if she managed to keep her job.\n\n"}, {"Article Image": "https://static.toiimg.com/thumb/msid-82287516,width-1070,height-580,imgsize-1245099,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "'Scapegoat': The lonely life of doctor who helped pinpoint Osama bin Laden", "Article's Text": "File photo: People gather outside the hideout of al-Qaida leader Osama bin Laden following his death by US Special Forces in a ground operation in Abbottabad.\n\nISLAMABAD: Dismissed as a traitor in Pakistan but lauded as a hero by the United States, Shakeel Afridi is paying a heavy price for his role in bringing an end to Osama bin Laden .\n\nA decade after the al-Qaida chief was gunned down by a team of Navy Seals , there is no sign the doctor will be exonerated by Pakistan authorities for helping the CIA pinpoint Laden's location under the cloak of running a vaccination programme.\n\nLocked up in solitary confinement in Sahiwal Jail in Pakistan's central Punjab province, Afridi now spends his time counting the days -- with nothing to differentiate between them.\n\n\"He is being kept in prison now only to teach every Pakistani a lesson not to cooperate with a western intelligence agency,\" Husain Haqqani, who was serving as Pakistan's ambassador to Washington at the time of the raid, told AFP.\n\n\"Instead of coming clean on bin Laden's presence in Pakistan, the authorities have made Dr Afridi a scapegoat.\"\n\nAFP pieced together the daily routine of the doctor through interviews with his brother and lawyer, as Afridi is barred from speaking to anyone apart from his family or legal team.\n\nFor exercise, he paces around his seven by eight foot cell and does occasional push-ups, according to his family.\n\nHe has a copy of the Koran, but is not allowed other books.\n\nA couple of times a week he shaves in the presence of a guard, but contact with other inmates is also strictly prohibited.\n\nFamily members can visit just twice a month, but are separated by an iron grate and forbidden from conversing in their native Pashto tongue.\n\n\"The prison authorities have told us that we can't discuss politics or talk about the situation inside the jail,\" said the brother.\n\nHailing from Pakistan's rugged tribal areas, the physician appeared to be an ideal asset for the CIA as the spy agency zeroed in on Bin Laden's hideout in the city of Abbottabad.\n\nAll the Americans needed was a bit of proof that bin Laden was there, so they had Afridi launch a vaccine campaign with the aim of extracting a DNA sample from inside his compound.\n\nJust how instrumental Afridi was in identifying the al-Qaida boss is unclear, but the doctor was arrested by authorities weeks after the deadly assault on bin Laden's home.\n\nHe was never found guilty of anything linked to the raid, but convicted by a tribal court under an obscure colonial era law of providing money to an insurgent group and handed a 33-year sentence.\n\nSuccessive US administrations have protested against his continued imprisonment -- and over the years there has been talk of a prisoner exchange -- but a deal to free Afridi has never materialised.\n\n\"Let's be clear: Afridi has paid the highest price,\" said Michael Kugelman, deputy South Asia director at the Wilson Center in Washington.\n\n\"He became the fall guy.\"\n\nThe 10-year anniversary of the bin Laden raid comes just weeks after President Joe Biden announced that the US's long war in Afghanistan would be coming to an end.\n\nIn an address to the nation, Biden citied the killing of bin Laden as proof that US forces had long ago accomplished their initial objectives for invading Afghanistan.\n\nUnsurprisingly, the president made no mention of Afridi.\n\n\"The withdrawal from Afghanistan, and the downgrading of ties with Pakistan that this could entail, suggests that Afridi won't be the hot button issue that it's been in the past,\" said Kugelman.\n\nFew are sympathetic to Afridi's ongoing plight in Pakistan, where the bin Laden raid fanned anti-American sentiment after years of simmering distrust between the uneasy allies.\n\n\"Whenever someone works for a foreign intelligence agency it's one of the most unforgivable crimes,\" Asad Durrani, the former head of Pakistan's formidable spy agency, told AFP, saying that Afridi's arrest probably saved the doctor from being lynched.\n\nBut even as the US prepares to exit Afghanistan and memories of the bin Laden saga fade, Afridi's legacy continues to reverberate in Pakistan.\n\nFaith in vaccine campaigns has been seriously undercut by the ruse, with families routinely refusing to have their children inoculated for curable diseases such as polio.\n\nInsurgents have also attacked vaccine teams, with dozens of health workers gunned down in the past decade.\n\nMeanwhile in prison, Afridi remains largely cut off from the outside world and passes his time pacing his cell and reciting daily prayers.\n\n\"He is not allowed to use a mobile, read a newspaper or a book,\" said his brother Jamil Afridi.\n\n\"He lives in isolation.\"\n\n"}, {"Article Image": "https://static.toiimg.com/thumb/msid-82284874,width-1070,height-580,imgsize-71864,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "Sri Lankan cabinet OKs proposed ban on burqas in public", "Article's Text": "File photo: A burqa clad Sri Lankan Muslim woman walks in a street of Colombo, Sri Lanka.\n\nCOLOMBO: Sri Lanka ’s cabinet on Tuesday approved a proposed ban on wearing full-face veils, including Muslim burqas in public, citing national security grounds, despite a UN expert’s comment that it would violate international law. The cabinet approved the proposal by public security minister Sarath Weerasekera at its weekly meeting, Weerasekara said on his Facebook page.\n\nThe proposal will now be sent to the attorney general and must be approved by parliament to become law. The government holds a majority in parliament and the proposal could easily be passed.\n\nWeerasekara has called burqas, a garment that covers the body and face worn by some Muslim women, a sign of religious extremism and said a ban would improve national security. Wearing of burqas was temporarily banned in 2019 after Easter Sunday bomb attacks killed more than 260 people. Two local Muslim groups that had pledged allegiance to the Islamic State group were blamed for the attacks at six locations — two Roman Catholic churches, one Protestant church and three top hotels.\n\nLast month, Pakistani envoy Saad Khattak tweeted that a ban would hurt the feelings of Muslims. The UN special rapporteur on freedom of religion or belief, Ahmed Shaheed , tweeted that a ban would be incompatible with international law and the right to free religious expression. Muslims make up about 9% of Sri Lanka’s 22 million people, with Buddhists accounting for over 70%.\n\n"}, {"Article Image": "https://static.toiimg.com/thumb/msid-82292217,width-1070,height-580,imgsize-1648224,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "Russian FM Sergey Lavrov: US-Russia ties worse than during Cold War", "Article's Text": "Russian Foreign Minister Sergey Lavrov said that Moscow stands ready to normalize ties with Washington. AP Photo\n\nMOSCOW: Russia 's top diplomat said Wednesday that relations with the United States are now even worse than during the Cold War times because of a lack of mutual respect.\n\nRussian Foreign Minister Sergey Lavrov said that Moscow stands ready to normalize ties with Washington, but warned that the US should stop posturing like a \"sovereign\" rallying its allies against Russia and China.\n\nHe warned that if the US shuns a mutually respectful dialogue on the basis of a balance of interests, \"we would live in conditions of a 'Cold War' or worse.\"\n\n\"During the Cold War, the tensions were flying high and risky crisis situations often emerged, but there was also a mutual respect,\" Lavrov said in an interview with the Russian state television. \"It seems to me there is a deficit of it now.\"\n\nEarlier this month, the Biden administration slapped Russia with sanctions for interfering in the 2020 US presidential election and for involvement in the SolarWind hack of federal agencies - activities Moscow has denied.\n\nThe US ordered 10 Russian diplomats expelled, targeted dozens of companies and people and imposed new curbs on Russia's ability to borrow money. Russia quickly retaliated by ordering 10 US diplomats to leave, blacklisting eight current and former US officials and tightening requirements for the U.S. Embassy operations.\n\nWhile ordering the sanctions, Biden also called for de-escalating tensions and held the door open for cooperation with Russia in certain areas.\n\nSpeaking in an interview with Russian state television, Lavrov noted that Moscow has had a \"positive\" attitude to U.S. President Joe Biden 's proposal to hold a summit with Russian President Vladimir Putin , but added that Russia still needs to analyze all aspects of the initiative.\n\nLavrov said he would attend a meeting of top diplomats of the Arctic nations in Iceland set for next month and would be ready to meet with U.S. Secretary of State Antony Blinken if he also joins the meeting.\n\n"}, {"Article Image": "https://static.toiimg.com/thumb/msid-82286374,width-1070,height-580,imgsize-836170,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "5 rebels, 1 police killed in clash in Indonesia's Papua", "Article's Text": "Indonesian President Joko Widodo expressed his condolences after an Indonesian brigadier general was killed in an ongoing clash between security forces and a rebel group in Papua (AP)\n\nJAYAPURA, INDONESIA : An Indonesian police officer and five Papuan independence fighters were killed in an ongoing clash between security forces and a rebel group in restive Papua province, authorities said on Wednesday.\n\nThe clashes began early this month in Indonesia's eastern most Papua province after rebels set fire to several schools and shot dead two teachers in Beoga village in Puncak district.\n\nPolice, military and intelligence forces joined together to find the attackers, who authorities believe belong to the West Papua Liberation Army, the military wing of the Free Papua Organization.\n\nRebels in Papua have been fighting a low-level insurgency since the early 1960s, when Indonesia annexed the region, a former Dutch colony. Papua was formally incorporated into Indonesia in 1969 after a UN-sponsored ballot that was seen as a sham by many.\n\nPapua police chief Mathius Fakhiri said a joint military and police force killed five of the Papuan fighters in a battle with dozens of rebels armed with military-grade weapons as well as axes and arrows in Makki village on Tuesday. He said a police officer was shot at his stomach and died while two others were injured.\n\nSecurity forces managed to evacuate the body and injured officers to a hospital in nearby Mimika district near the mining town of Tembagapura on Tuesday while the joint force was hunting for other rebels who fled to the jungle, Fakhiri said.\n\nSebby Sambom, a spokesman for the liberation army, confirmed the police claim, adding that two other fighters were injured in the battle.\n\nTuesday's clash happened two days after Papua's intelligence agency chief Brig . General Gusti Putu Danny Nugraha was shot in his head and died in a rebel ambush. The ambush occurred while the general was patrolling Dambet village in Puncak district with 13 other personnel on motorcycle after rebels set fire to an elementary school and houses in the village.\n\nPresident Joko Widodo has ordered government forces to hunt down the rebels.\n\n\"I emphasize that there is no place for armed criminal groups in Papua and in all corners of the country,\" Widodo said in televised remarks on Monday.\n\nAttacks by rebels in several districts in Papua have spiked in the past year, including in the Grasberg mine.\n\nThe Grasberg mine's vast gold and copper reserves have been exploited for decades by US-based Freeport-McMoRan , damaging the surrounding environment while providing significant tax income for the Indonesian government.\n\nBut indigenous Papuans have benefited little and are poorer, sicker and more likely to die young than people elsewhere in Indonesia.\n\n"}, {"Article Image": "https://static.toiimg.com/thumb/msid-82287121,width-1070,height-580,imgsize-163390,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "Australia to upgrade military bases, expand wargames with US", "Article's Text": "SYDNEY: Australia will spend A$747 million ($580 million) to upgrade four military bases in its north and expand war games with the United States, Prime Minister Scott Morrison will say on Wednesday.\n\nAn airstrip in the Northern Territory will be lengthened to support larger aircraft, firing ranges overhauled and new training facilities set up for defence personnel and US marines, according to extracts of the announcement seen by Reuters.\n\n\"Working with the United States, our allies and Indo-Pacific neighbours, we will continue to advance Australia's interests by investing in the Australian Defence Force ,\" Prime Minister Scott Morrison will say.\n\n\"Our focus is on pursuing peace, stability and a free and open Indo-Pacific, with a world order that favours freedom.\"\n\nThe military upgrades will begin this year and be finished by 2026.\n\nThe prime minister's office did not immediately respond to requests for comment.\n\nThe US embassy in Canberra also did not immediately respond to requests for comment.\n\nAustralia and the United States hold biennial war games, the next of which is scheduled to begin in August.\n\nTypically, more than 30,000 troops participate in the exercises off Australia's east coast.\n\nOne of Australia's most senior security officials earlier this week said liberal democracies must brace for war.\n\nHome affairs department secretary Mike Pezzullo did not specify the catalyst for his warning but it follows a sharp deterioration in Australia's relationship with China and a rise in regional tensions over Taiwan.\n\nRelations between Australia and China have worsened since Canberra called for an international inquiry into the origins of the coronavirus, prompting trade reprisals from Beijing.\n\nAustralian defence minister Peter Dutton on Sunday said a conflict between China and Taiwan \"should not be discounted\".\n\n\n\nFacebook Twitter Linkedin EMail"}, {"Article Image": "https://www.thehindu.com/news/international/agokgm/article34429095.ece/ALTERNATES/LANDSCAPE_615/General-Wei-Fenghe-Chinas-State-Councilor-and-Defence-Minister-visits-Sri-Lank", "Article's Title": "Chinese Defence Minister arrives in Sri Lanka for bilateral talks", "Article's Text": "Gen. Wei Fenghe, who landed on a Chinese military aircraft, was received at the Colombo international airport by Sri Lanka Army’s Commander Gen. Shavendra Silva\n\nChina’s Defence Minister Gen. Wei Fenghe arrived in Colombo on a two-day visit for bilateral talks with President Gotabaya Rajapaksa and Prime Minister Mahinda Rajapaksa, the Foreign Ministry said on April 28.\n\nGen. Wei, who landed on a Chinese military aircraft, was received at the Colombo international airport by Sri Lanka Army’s Commander Gen. Shavendra Silva.\n\nThe Chinese Minister will hold bilateral talks with President Gotabaya and his brother and Prime Minister Mahinda.\n\nGen. Wei is the second high-ranking Chinese official to visit the island nation after the onset of the COVID-19 pandemic.\n\nIn October last year, Director of the Office of the Central Commission for Foreign Affairs of the ruling Communist Party of China Yang Jiechi visited Colombo.\n\nThe Chinese Defence Minister’s visit assumes significance in the backdrop of a public diplomacy campaign launched by the Chinese embassy on the Chinese-built Port City in Colombo.\n\nLast week, Sri Lanka’s Supreme Court heard petitions on the constitutionality of the administrative body of the Port City built on reclaimed sea.\n\nThe Port City commission bill was challenged by the Opposition parties and civil society groups over its constitutionality. They want the bill to be subject to a referendum and a special two thirds mandate in the Parliament.\n\nThe five-member Bench of the Supreme Court handed over its determination to Parliament Speaker Mahinda Yapa Abeywardena after a 5-day hearing. It will be announced in the Parliament next week, officials said.\n\nThe $1.4 billion project, which has been exempted from a series of local laws, has come under severe criticism from the Opposition parties, civil society groups and labour unions which allege that the project violated the country’s sovereignty, the Constitution and labour rights.\n\nThe Colombo Port City project, expected to play a key role in China’s ambitious ‘Maritime Silk Road’ project in India’s backyard, is said to be the single largest private sector development ever in the island.\n\nSri Lanka in recent years carried out various development projects with an estimated $8 billion loans.\n\nThe huge Chinese loans sparked concerns globally after Sri Lanka handed over the Hambantota port to China in 2017 as debt swap amounting to $1.2 billion for a 99 years’ lease."}, {"Article Image": "https://www.thehindu.com/incoming/pcudv6/article30707697.ece/ALTERNATES/LANDSCAPE_615/0001OL4GCjpg", "Article's Title": "EU Parliament approves post-Brexit trade treaty", "Article's Text": "Lawmakers at the European Parliament voted in favour of the agreement sealed between the U.K. government and the EU.\n\nEuropean lawmakers have approved the final ratification of the post-Brexit trade deal between the European Union and the United Kingdom, nearly five years after Britain decided to leave the bloc.\n\nThe deal, which was finalized on Christmas Eve, had already been ratified by the U.K. Parliament and conditionally came into force pending the European Parliament’s approval, which marks the final legal hurdle.\n\nLawmakers at the European Parliament voted in favour of the agreement sealed between the U.K. government and the EU. The vote took place Tuesday but results were not announced until Wednesday morning.\n\nThe U.K. had joined the bloc in 1973."}, {"Article Image": "https://www.thehindu.com/business/Industry/q92c4i/article34432116.ece/ALTERNATES/LANDSCAPE_615/SaudiArabiaAramco89989jpg-e2e06jpg", "Article's Title": "Saudi in talks to sell 1% of Aramco, says crown prince", "Article's Text": "Aramco, the world's biggest oil company which listed on the Saudi bourse in late 2019, could sell further shares including to international investors within the next year or two, says Mohammed bin Salman\n\nSaudi Arabia's crown prince said in televised remarks on Tuesday that the kingdom was in discussions to sell 1% of state oil firm Saudi Aramco to a leading global energy company.\n\nCrown Prince Mohammed bin Salman said Aramco, the world's biggest oil company which listed on the Saudi bourse in late 2019, could sell further shares including to international investors within the next year or two.\n\n\"There are talks now for the acquisition of a 1% stake by a leading global energy company in an important deal that would boost Aramco's sales in ... a major country,\" he said, without elaborating.\n\n\"There are talks with other companies for different stakes,and part of Aramco's shares could be transferred to the (Saudi)Public Investment Fund and a part listed ... on the Saudi bourse,\" he said in an interview aired by Saudi TV marking the fifth anniversary of Vision 2030.\n\nThe Aramco initial public offering in 2019 was seen as a pillar of the economic diversification programme aimed at attracting foreign investment.\n\nAramco raised $25.6 billion in the IPO and later sold more shares under a \"green shoe option\" to raise the total to $29.4 billion.\n\nThe crown prince in 2016 announced a plan to raise as much as $100 billion via an international and domestic listing of a 5% stake in Aramco. In 2017 sources said Chinese state-owned companies PetroChina and Sinopec had written to Aramco to express an interest in a direct deal.\n\nListing plans were halted in 2018 and when they were revived the following year the deal found little interest beyond theGulf. Riyadh scaled back its ambitions and canceled road shows in New York and London, selling a 1.7% stake and relying on mainly domestic and regional buyers.\n\nThe proceeds of that offer were transferred to the Public Investment Fund (PIF), Prince Mohammed’s vehicle of choice to transform the Saudi economy and diversify away from oil revenue."}, {"Article Image": "https://www.thehindu.com/news/national/n02x9i/article34431963.ece/ALTERNATES/LANDSCAPE_615/piyushkb", "Article's Title": "China wary as India, Australia, Japan push supply chain resilience", "Article's Text": "Joint measures they are considering are seen aimed at reducing their reliance on China\n\nThe Supply Chain Resilience Initiative (SCRI) formally launched on Tuesday by the Trade Ministers of India, Japan and Australia brought a wary response from China, which has described the effort as ‘unrealistic’.\n\nPiyush Goyal, Minister for Commerce and Industry, launched the SCRI along with Dan Tehan, Australia’s Minister for Trade, Tourism and Investment, and Hiroshi Kajiyama, Japan’s Minister for Economy, Trade and Industry. The three sides agreed the pandemic “revealed supply chain vulnerabilities globally and in the region” and “noted the importance of risk management and continuity plans in order to avoid supply chain disruptions”.\n\nSome of the joint measures they are considering include supporting the enhanced utilisation of digital technology and trade and investment diversification, which is seen as being aimed at reducing their reliance on China. “The SCRI aims to create a virtuous cycle of enhancing supply chain resilience with a view to eventually attaining strong, sustainable, balanced and inclusive growth in the region,” a statement said.\n\nUnrealistic approach: Beijing\n\nChina’s Foreign Ministry on Wednesday described the move as ‘unrealistic’. “The formation and development of global industrial and supply chains are determined by market forces and companies choices,” spokesperson Zhao Lijian said.\n\nThe Hindu Explains | Why has Japan mooted the Supply Chain Resilience Initiative?\n\n“Artificial industrial ‘transfer’ is an unrealistic approach that goes against the economic laws and can neither solve domestic problems nor do anything good to the stability of the global industrial and supply chains, or to the stable recovery of the world economy.”\n\nComment | Resilient supply chains as a pandemic lesson\n\nMr. Zhao said China hoped that amid the epidemic, “parties concerned will cherish the hard-won outcomes of international cooperation in the fight against the epidemic” and “act in ways conducive to enhancing mutual trust and cooperation, so as to jointly ensure the global industrial and supply chains stable and unimpeded”."}, {"Article Image": "https://www.thehindu.com/news/international/9esrzf/article34431198.ece/ALTERNATES/LANDSCAPE_615/charleskb", "Article's Title": "COVID-19 surge | Prince Charles charity joins UK aid efforts to India", "Article's Text": "The British Asian Trust launched an emergency appeal called “Oxygen for India” to buy oxygen concentrators\n\nPrince Charles said on Wednesday that he is “deeply saddened” by the surge in coronavirus deaths in India.\n\nHe urged the public to back an appeal to buy oxygen equipment for the stricken nation.\n\nIn a message to the people of India, the heir to the throne said: “Indian aid and ingenuity has been a support to other countries through this immensely difficult time. As India has helped others, so now must we help India.”\n\nHe added that he has a “great love for India” and that he wanted “those suffering the effects of this pandemic in India to know that they are in my thoughts and prayers.”\n\nThe British Asian Trust, a charity Charles founded in 2007, launched an emergency appeal called “Oxygen for India” to buy oxygen concentrators, which can extract oxygen from the air when hospital infrastructure struggles to cope. As of Wednesday, the charity had raised more than 140,000 pounds of its 200,000-pound target.\n\nBritain has a huge Indian diaspora community of about 1.4 million people, and many have sought ways to support their home country during this crisis. A separate online fundraiser on the GoFundMe website has collected more than 380,000 pounds within days, and its organizers say the funds have enabled them to order hundreds of oxygen concentrators and ship them to India by the weekend.\n\nA first British government shipment of 200 pieces of medical equipment, including ventilators and oxygen concentrators, arrived in Delhi Tuesday, and further shipments will take place later in the week."}, {"Article Image": "https://ichef.bbci.co.uk/images/ic/400xn/p09fzq5c.jpg", "Article's Title": "India's Covid crisis: 'I lost my unborn child and wife on the same day'", "Article's Text": "India has seen more Covid cases in the past seven days than any other country, as it battles its second wave.\n\nHospitals have been overwhelmed with relatives begging for beds and oxygen for loved ones - now crematoriums are also running out of space.\n\nOne man who lost his wife and unborn child on the same day says it felt like his heart had been \"ripped out\".\n\nBBC correspondent Divya Arya has been speaking to him and another grieving family member.\n\nVideo by Neha Sharma"}, {"Article Image": "https://ichef.bbci.co.uk/news/1024/branded_news/17F7D/production/_118237189_bild.jpg", "Article's Title": "Grenade-shaped sex toy sparks police alert in Germany", "Article's Text": "\"How they came to be there and why they remained there can only be imagined,\" the statement added."}, {"Article Image": "https://ichef.bbci.co.uk/news/1024/branded_news/1697/production/_118238750_hi067022434.jpg", "Article's Title": "Latvia fire: Riga hostel blaze kills eight", "Article's Text": "He told reporters that police were asking for help to identify the victims and that \"specialists have been employed to help with the language barrier\". He added that alternative accommodation was being provided to anyone affected."}, {"Article Image": "https://ichef.bbci.co.uk/news/1024/branded_news/4A46/production/_118241091_mediaitem118240540.jpg", "Article's Title": "Saudi Arabia's crown prince seeks good relations with Iran", "Article's Text": "\"We are more than 90% in agreement with the Biden administration when it comes to Saudi and US interests, and we are working to strengthen these interests,\" Prince Mohammed said. \"There is no doubt that the United States is a strategic partner.\""}, {"Article Image": "https://ichef.bbci.co.uk/news/1024/branded_news/6E0D/production/_118237182_d13b9da7-e1a0-4b36-8160-3802a42ae641.jpg", "Article's Title": "Britney Spears asks to address court over conservatorship case", "Article's Text": "Exact details of her order have not been made public but a conservatorship is granted by a court for individuals who are unable to make their own decisions, like those with dementia or other mental illnesses."}, {"Article Image": "https://ichef.bbci.co.uk/news/1024/branded_news/47D9/production/_118239381_gettyimages-174306696-1.jpg", "Article's Title": "France arrests ex-members of Italy extremist group Red Brigades", "Article's Text": "France arrests ex-members of Italy extremist group Red Brigades Published 1 hour ago\n\nimage copyright Getty Images image caption The Red Brigades sowed chaos at a time of social and political turmoil in Italy\n\nFrance has detained seven former members of far-left Italian militant groups, including the Red Brigades.\n\nThe seven, and three other Italians still being sought, had been convicted of terrorism charges in Italy dating back to the 1970s and 1980s.\n\nFrance had offered left-wing radicals protection from extradition under a controversial policy.\n\nItaly's prime minister welcomed the arrests, saying the crimes had \"left a wound that is still open\".\n\nThe Red Brigades and other militant groups carried out violence in Italy during the so-called Years of Lead.\n\nThe period, from the late 1960s to early 1980s, got its name from the vast number of bullets fired.\n\nThe Red Brigades were blamed for numerous killings, including the 1978 abduction and murder of former prime minister Aldo Moro.\n\nWhat do we know about the arrests?\n\nThe arrests on Wednesday involved members of the Red Brigades and a co-founder of the far-left militant group Lotta Continua.\n\nIn the 1980s, France's then Socialist president François Mitterrand offered Italy's far-left radicals protection from extradition under the \"Mitterrand doctrine\", on the condition that they renounced violence and had not been accused of bloodshed.\n\nThe policy has long been a source of tension between the two countries, with Italy calling on France to hand over some 200 people.\n\nThe French presidency on Wednesday said the arrests did not mark a break from the Mitterrand doctrine, because Mr Mitterrand himself had said that those with blood on their hands should not be protected. But it said they were part of efforts to resolve tensions.\n\n\"France, also affected by terrorism, understands the absolute necessity of providing justice for victims,\" a statement said. \"With this transfer, it is also part of the urgent need to build a Europe of justice in which mutual confidence must be at the centre.\"\n\nOfficials in France said the arrests followed months of discussions between the two countries.\n\nSince taking office in February, Italian Prime Minister Mario Draghi has established a close working relationship with French President Emmanuel Macron.\n\nWhy has France acted now?\n\nThe Mitterrand doctrine meant that ex-Red Brigaders would not be troubled by French police as long as they were now leading ordinary, innocent lives.\n\nCrucially, and this bit is often forgotten, President Mitterrand also said this rule should not apply to members who the Italian authorities could show had blood on their hands. Suspected killers would not be protected, but extradited to face justice.\n\nIn practice this never, or rarely, happened. Only two former members of the Red Brigades have been sent back. One of them, Cesare Battisti, fled to South America in 2004 before he could be handed over. His eventual extradition to Italy was from Bolivia.\n\nOne reason for this was the strong support for the militants in France's left-wing intelligentsia. Another was the claim that the Italian justice system would not treat them fairly. The Italians were obviously furious.\n\nToday, because the original intention was always, in theory, to send back to Italy the worst alleged offenders, President Macron can argue that he's not actually breaking with the Mitterrand doctrine. But he is certainly breaking with precedent.\n\nWhat has the reaction been?\n\nItalian Justice Minister Marta Cartabia hailed a \"historic\" action.\n\nForeign Minister Luigi Di Maio said the arrests proved that \"one cannot run away from one's responsibilities, from the pain inflicted, the harm caused\".\n\nBut the lawyer for five of the detainees called the arrests an \"unspeakable betrayal on France's part\".\n\n\"Since the 1980s, these people have been under the protection of France. They've remade their lives here for 30 years in the full view and knowledge of everyone, with their children and their grandchildren... and then in the early morning, they come looking for them, 40 years after the facts,\" Irène Terrel told AFP.\n\nIt is not yet clear what will happen to the detainees.\n\nFrench Interior Minister Gérald Darmanin told France Inter radio that it was up to a French court to decide whether they would be extradited."}, {"Article Image": "https://ichef.bbci.co.uk/news/1024/branded_news/11F9F/production/_117513637_ricahrdpusey.png", "Article's Title": "Richard Pusey: Australian jailed for filming dying officers", "Article's Text": "\"Your conduct in recording the police officers in their dying moments, together with the words you used as you recorded, was not only derogatory and horrible... but it was also callous and reprehensible conduct,\" Judge Wraight said."}, {"Article Image": "https://ichef.bbci.co.uk/news/1024/branded_news/A5D3/production/_118015424_indiavax1.jpg", "Article's Title": "India coronavirus: Can it make enough vaccines to meet demand?", "Article's Text": "\"Even when [global] demand is very high, new suppliers can't spring up as quickly as they would in some other industries, or at least those new suppliers would not be trusted.\""}, {"Article Image": "https://ichef.bbci.co.uk/news/1024/branded_news/AD4B/production/_118236344_tv067015975.jpg", "Article's Title": "Biden to sell child care and free university in speech to Congress", "Article's Text": "The White House has indicated the package would be funded by almost doubling the capital gains tax rate on incomes above $1 million to 39.6% and hiking the top income tax bracket for households earning more than $400,000 to the same level."}, {"Article Image": "https://ichef.bbci.co.uk/news/1024/branded_news/FE08/production/_118223056_mediaitem118223055.jpg", "Article's Title": "Brexit: European Parliament backs UK trade deal", "Article's Text": "Hugely welcome the overwhelming vote by @Europarl_EN for our trade agreement with the EU.\n\n\n\nHope we can now begin a new chapter together as Europeans, characterised by friendly cooperation between sovereign equals.\n\n\n\nThank you @EU_Commission @michelbarnier for helping get us here."}, {"Article Image": "https://www.thehindu.com/news/international/xl56rz/article34431146.ece/ALTERNATES/LANDSCAPE_615/SAG2496", "Article's Title": "China pushes defence ties with Bangladesh, Sri Lanka", "Article's Text": "Defence Minister calls to resist ‘powers outside the region setting up alliances’\n\nChina’s Minister of Defence Wei Fenghe, visiting Bangladesh and Sri Lanka this week, has called on countries in the neighbourhood to resist “powers from outside the region setting up military alliances in South Asia”.\n\nGeneral Wei’s comments in Dhaka on Tuesday came amid a push back from Chinese officials on the India-U.S.-Australia-Japan Quad grouping, which some in Beijing have described as a quasi-military alliance.\n\nThe Chinese Defence Minister and People’s Liberation Army General on Wednesday held talks with President Gotabaya Rajapaksa in Sri Lanka, as he began a two-day visit following his trip to Bangladesh. Both sides had discussions that were “extremely fruitful”, said a statement issued by the Presidential Media Division. “He [Chinese Defence Minister] also said the relations between the two nations were further strengthened by this visit,” the statement said.\n\nThe General's visit comes six months after top Chinese foreign policy official Yang Jiechi was in Colombo in October 2020 for high-level discussions. China on Tuesday also convened a six-country South Asia dialogue on COVID-19 and economic cooperation with the Foreign Ministers of Afghanistan, Bangladesh, Nepal, Pakistan and Sri Lanka.\n\nThe senior Chinese official’s visit to Sri Lanka coincides with mounting resistance in Sri Lanka to a Bill envisioning laws to govern the China-backed $1.4 billion Colombo Port City. The Supreme Court recently heard a case on the matter, following some 20 petitions by opposition parties and civil society organisations that challenged the Bill arguing that it \"threatened\" Sri Lanka’s sovereignty. The top court is expected to rule on the case soon. The visiting Chinese official is also scheduled to meet Prime Minister Mahinda Rajapaksa.\n\nBeijing has extended over $2 billion – in loans and a currency swap facility – to Colombo after the pandemic struck, to help the government cope with its economic strain. Prior to that Colombo owed Beijing over $5 billion in loan repayment.\n\nOn Tuesday, General Wei held talks with Bangladesh President Abdul Hamid in Dhaka. A statement from China’s official Xinhua news agency quoted him as calling for the two militaries to \"increase high-level visits, deepen cooperation in equipment technology, broaden exchanges in specialized fields and forge closer military relations.”\n\n\"To jointly maintain regional peace and stability,” he said, \"the two sides should make joint efforts against powers outside the region setting up military alliance in South Asia and practicing hegemonism.\""}, {"Article Image": "https://ichef.bbci.co.uk/news/1024/branded_news/6C23/production/_118238672_spanishbeach.jpg", "Article's Title": "Covid: Spain hopes for tourists as EU votes on digital passports", "Article's Text": "\"We would risk having a variety of documents that cannot be read and verified in other member states. And we risk the spread of forged documents, and with it, the spread of both the virus and the mistrust of citizens,\" he said."}, {"Article Image": "https://www.thehindu.com/news/international/r725lp/article34430931.ece/ALTERNATES/LANDSCAPE_615/28THAPBioNTechUgurSahin", "Article's Title": "Covid-19 | Europe can reach herd immunity by August, says BioNTech chief", "Article's Text": "Ugur Sahin says data from people who have received the vaccine show that the immune response gets weaker over time, and a third shot will likely be required.\n\nEurope can achieve herd immunity against the coronavirus within the next four months, the head of German pharmaceutical company BioNTech, which developed the first widely approved COVID-19 vaccine with U.S. partner Pfizer, said on Wednesday.\n\nWhile the exact threshold required to reach that critical level of immunisation remains a matter of debate, experts say a level above 70% would significantly disrupt transmission of the coronavirus within a population.\n\n“Europe will reach herd immunity in July, latest by August,” Ugur Sahin, BioNTech's chief executive, told reporters.\n\nHis company's vaccine makes up a large share of the doses administered in Europe and North America, where it is more commonly known as the Pfizer shot.\n\nMr. Sahin said data from people who have received the vaccine show that the immune response gets weaker over time, and a third shot will likely be required.\n\nStudies show the efficacy of the BioNTech-Pfizer vaccine declines from 95% to about 91% after six months, he said.\n\n“Accordingly, we need a third shot to get the vaccine protection back up to almost 100% again” Mr. Sahin said.\n\nVaccine recipients currently receive a second dose three weeks after their first shot, although some countries have longer intervals. Sahin suggested the third should be administered nine to 12 months after the first shot.\n\n“And then I expect it will probably be necessary to get another booster every year or perhaps every 18 months,” he said.\n\nNew variants\n\nConcerns have been raised that existing vaccines might be less effective against new variants of the virus now emerging in different parts of the world.\n\nMr. Sahin said BioNTech has tested its vaccine against more than 30 variants, including the now-dominant one first detected in Britain, and found the shot triggers a good immune response against almost all of them in the lab. In cases where the immune response was weaker, it remained sufficient, he said, without providing exact figures.\n\nAsked about the new variant first detected in India, Mr. Sahin said the vaccine's effectiveness against it was still being investigated.\n\n“But the Indian variant has mutations that we have previously investigated and against which our vaccine also works, so I am confident there, too,” he said.\n\nThe Mainz-based company's work developing a vaccine based on messenger RNA, or mRNA, benefited from its earlier research into pharmaceuticals to treat cancer, as tumors often try to adapt to evade the immune system, Mr. Sahin said.\n\n“The way our vaccine works is that it has two points of attack,” he explained. Along with stimulating the production of antibodies, it prompts the body's so-called T-cells to attack the virus, he said.\n\n“The vaccine is quite cleverly constructed, and the bulwark will hold. I'm convinced of that,\" Mr. Sahin said. “If the bulwark needs to be strengthened again, we'll do so. I'm not worried.”"}, {"Article Image": "https://ichef.bbci.co.uk/news/1024/branded_news/147E6/production/_118224938_gettyimages-1055211712.jpg", "Article's Title": "Burkina Faso ambush: Spaniards and Irishman killed after abduction", "Article's Text": "Burkina Faso ambush: Spaniards and Irishman killed after abduction Published 9 hours ago\n\nimage copyright Getty Images image caption Burkina Faso's security forces are battling to curb an insurgency\n\nTwo Spanish journalists and an Irish national abducted near a nature reserve in eastern Burkina Faso have been killed.\n\nThe Europeans were part of an anti-poaching patrol that was ambushed by gunmen near Pama Reserve on Monday.\n\nBurkina Faso government officials confirmed their deaths on Tuesday. A local soldier was also abducted, but his status is unknown.\n\nIt remains unclear who carried out the attack.\n\nThe West African country is facing a deepening security crisis, like many of its neighbours, as Islamist armed groups carry out raids and kidnappings across much of the region.\n\nWhat do we know about the attack?\n\nThe patrol on Monday included soldiers, forest rangers and foreign reporters.\n\nTwo soldiers wounded in the ambush told the Associated Press (AP) news agency the attack had been launched by jihadists who had outnumbered the patrol.\n\nOne of the soldiers was shot in the leg and the other in his arm, causing it to be amputated, according to AP. The soldiers said they had tried to form a protective shield around the foreigners, but realised when the shooting stopped that they had disappeared.\n\nVehicles and weapons were also seized in the attack.\n\nimage copyright Getty Images image caption Burkina Faso's nature reserves used to be popular with tourists\n\nSpanish Foreign Minister Arancha González Laya told reporters on Tuesday that bodies found in the area appeared to be those of two Spanish journalists who had been filming a documentary.\n\nPrime Minister Pedro Sánchez later tweeted: \"The worst news is confirmed.\"\n\nHe named the journalists as David Beriain and Roberto Fraile, and praised \"those who, like them, carry out courageous and essential journalism from conflict zones\".\n\nMr Beriain was a seasoned journalist who had reported from around the world and launched his own production house, while Mr Fraile had covered several conflicts as a cameraman, including the war in Syria.\n\nOn Tuesday Burkina Faso officials confirmed their deaths, as well as the death of an Irish national.\n\nThe Irish victim was named as Rory Young, co-founder and president of the anti-poaching group Chengeta Wildlife. The organisation called him an \"inspirational leader\".\n\nIn a statement, Ireland's Foreign Minister Simon Coveney said he had learned with \"deep dismay\" of Mr Young's death, and offered condolences to the families of all three victims.\n\n\"The minister condemns in the strongest possible terms the actions of those who are responsible for this attack. We will continue to liaise with the authorities and partners on the ground on the matter,\" the statement said.\n\nA senior security source told AFP news agency that the three Europeans had been \"executed by terrorists\".\n\nThe secretary general of journalism advocacy group Reporters Without Borders reacted to the news on Twitter, saying \"this tragedy confirms the great dangers reporters face\" in Africa's Sahel region.\n\nDetails of what happened to the local soldier who was abducted were not immediately clear.\n\nWhat's the background?\n\nThe kidnappings are the latest in the former French colony where wildlife reserves used to be popular with tourists.\n\nBut many of them are in territory now targeted by jihadists.\n\nMilitant Islamist groups are believed to be holding several foreigners hostage in Burkina Faso, as well as in the neighbouring states of Mali and Niger, Reuters news agency reports.\n\nThe semi-arid region, known as the Sahel, has been hit by an insurgency since the militants captured large parts of northern Mali in 2012 and 2013.\n\nFrance and other foreign allies have deployed troops to the region but have failed to end the insurgency.\n\nThe conflict has displaced nearly three million people.\n\nMore on the Sahel crisis:\n\nmedia caption What is the Sahel G-5 force?"}, {"Article Image": "https://static01.nyt.com/images/2021/04/28/world/28eu-brexit01/28eu-brexit01-facebookJumbo.jpg", "Article's Title": "Brexit Trade Deal Gets a Final OK From E.U. Parliament", "Article's Text": "BRUSSELS — The European Parliament has voted by a large margin to give the European Union’s final approval to a Brexit deal already beset by difficulties, complaints and a court challenge.\n\nThe tally, released Wednesday, was 660 in favor, with five against and 32 abstentions.\n\nWhile the outcome was never really in doubt, the Parliament expressed considerable concerns about the trustworthiness of the current British government to carry out its side of the Brexit bargain, including the trade deal that was just approved.\n\nThat agreement, which governs trade and customs issues and provides for zero tariffs and zero quotas, has been applied conditionally since the beginning of the year. But a negative vote by the European Parliament would have killed it, producing the “no-deal Brexit” that neither side favored.\n\nThe deal leaves out key issues like financial services and foreign and security policy. Debates and consultations over how best to implement the trade deal and the general withdrawal agreement in real life seem fated to extend indefinitely."}, {"Article Image": "https://ichef.bbci.co.uk/news/1024/branded_news/17A9A/production/_118222969_woman_mask_getty_976.png", "Article's Title": "Covid-19 in India: Cases, deaths and oxygen supply", "Article's Text": "To try to get supplies to where they are needed, the government has now started an \"oxygen express\", with trains carrying tankers to wherever there is demand. The Indian Air Force is also airlifting oxygen from military bases."}, {"Article Image": "https://static01.nyt.com/images/2021/04/27/world/27uk-virus7/27uk-virus7-facebookJumbo.jpg", "Article's Title": "For U.K.’s Johnson, Plenty of Mud but Will It Stick?", "Article's Text": "LONDON — Prime Minister Boris Johnson has long had a weakness for a funny line, even in the face of an unfunny problem like the pandemic. When coronavirus cases first spiked last spring, he promised that a lockdown would “squash the sombrero.” When he spoke to businesspeople about an emergency plan to manufacture ventilators, he joked that it could be called “Operation Last Gasp.”\n\nNow, Mr. Johnson stands accused of something darker: declaring at a tense meeting last fall that he would not bow to pressure to impose yet another lockdown, even if it meant letting “the bodies pile high in their thousands.”\n\nHe has denied the claim, made by anonymous sources to multiple British newspapers. But the papers, as well as the BBC, are not backing down from their reporting. The dispute has called into question not just Mr. Johnson’s credibility, which is regularly in doubt, but also his humanity, which is usually not."}, {"Article Image": "https://static01.nyt.com/images/2021/04/28/world/28virus-india-variant-promo/28virus-india-variant-1-facebookJumbo.jpg", "Article's Title": "India Blames a Virus Variant as Its Covid-19 Crisis Deepens", "Article's Text": "Doctors, the public and the media point to anecdotal evidence of infections even among the vaccinated. Scientists say the data is too thin and cite other reasons behind the country’s second wave.\n\nNEW DELHI — At Sir Ganga Ram Hospital, a huge facility in the middle of India’s capital, 37 fully vaccinated doctors came down with Covid-19 earlier this month.\n\nThe infections left most with mild symptoms, but it added to their growing fears that the virus behind India’s catastrophic second wave is different. They wonder if a more contagious variant that dodges the immune system could be fueling the epidemic inside the world’s hardest-hit nation.\n\nSo far the evidence is inconclusive, and researchers caution that other factors could explain the viciousness of the outbreak, which has overwhelmed India’s capital so quickly that hospitals are entirely overrun and crematories burn nonstop. Still, the presence of the variant could complicate the taming of India’s Covid-19 disaster."}, {"Article Image": "https://www.thehindu.com/news/international/wptnol/article34430853.ece/ALTERNATES/LANDSCAPE_615/AustraliaChina59658jpg-6872ajpg", "Article's Title": "Australia to spend 747 million dollars for upgrading four defence bases to boost Indo-Pacific engagements", "Article's Text": "Australia’s PM Scott Morrison announced the multi-million dollar investment stating that the objective was to pursue peace rather than sending any message to China\n\nAustralia will invest 747 million dollars in upgrading four key military training areas and ranges in the Northern Territory to defend the country's interests and support greater engagement with the Indo-Pacific neighbours and allies, Prime Minister Scott Morrison announced on Wednesday, amid China's increasing assertiveness in the region.\n\nMr. Morrison announced the multi-million dollar investment stating that the objective was to pursue peace rather than sending any message to China.\n\nThe multi-million investment would upgrade four key training areas and ranges in the Northern Territory to enable the Australian Defence Force (ADF) to conduct simulated training exercises and remain battle-ready.\n\nEssential upgrades will be made to four key military training areas and weapon ranges in the Northern Territory, including Robertson Barracks, Kangaroo Flats, Mount Bundey and Bradshaw.\n\n\"These defence training areas and facilities will support greater engagement with our Indo-Pacific neighbours and our allies, and to conduct small and large scale military exercises across a number of different scenarios,\" Mr. Morrison said.\n\n“This investment will deliver a jobs boom for the Northern Territory,” he said, adding “We continue to invest more than 270 billion dollars in defence capability across Australia over the next decade, ensuring we have a capable defence force to meet a changing global environment while backing thousands of ADF men and women with the newest technology and training.”\n\n“Working with the United States and Indo-Pacific neighbours, we will continue to advance Australia’s interests by investing in the Australian Defence Force, particularly across Northern Australia. Our focus is on pursuing peace, stability and a free and open Indo-Pacific, with a world order that favours freedom,\" he said.\n\nAustralia along with India, Japan and the U.S., had in 2017 given shape to the long-pending proposal of setting up the \"Quad\" or the Quadrilateral coalition to counter China's aggressive behaviour in the Indo-Pacific region.\n\nChina is engaged in hotly contested territorial disputes in the South and East China Seas. Beijing has also made substantial progress in militarizing its man-made islands in the past few years.\n\nBeijing claims sovereignty over all of the South China Sea. But Vietnam, Malaysia, the Philippines, Brunei and Taiwan have counterclaims. In the East China Sea, China has territorial disputes with Japan.\n\nThis investment will also maximise local jobs through a targeted industry plan to contract local businesses throughout the entire supply chain, Mr. Morrison said.\n\n\"My commitment is keeping Australians safe and keeping Australians in jobs,” he said.\n\n\"All of our objectives through the activities of our Defence Forces is designed to pursue peace,\" he said during a press briefing.\n\n\"In a region as uncertain as this you need to ensure that you have the Defence capability that enables you to protect and defend Australia's interests in that region.\n\n\"And this enables us to ensure there's an appropriate balance — particularly in partnership with our United States allies to ensure we can promote an environment where peace will be the outcome.\" In an official statement, Defence Minister Peter Dutton said this significant investment would ensure the Australian Defence Force continues to deliver world-class training and our engagement with allies and other nations through the conduct of joint training exercises, including with the U.S. Marine Rotational Force - Darwin.\n\n“This investment is critical to ensuring that our ADF land combat capability is equipped with the cutting edge technology it will require to maintain our competitive advantage,” Mr. Dutton said.\n\nThese works will provide a strong economic benefit to the region, with significant opportunities for the local construction industry over a five-year delivery phase programme.\n\nSubject to parliamentary approvals, construction is expected to commence in the second half of 2021, with completion expected by mid-2026.\n\nThe fraying of China-Australia ties that began with Canberra banning China’s Huawei from its 5G networks in 2018, worsened after Australia called on China to allow international investigators into Wuhan to probe the origins of the novel coronavirus last year.\n\nBeijing placed crippling tariffs on Australia’s barley exports and halted beef imports from four large meat plants. China also put embargoes on Australian cotton."}, {"Article Image": "https://static01.nyt.com/images/2021/04/28/world/28xp-virus-india-help/28xp-virus-india-help-facebookJumbo.jpg", "Article's Title": "How to Help India Amid the Covid Crisis", "Article's Text": "India’s coronavirus crisis is the worst since the pandemic began, and it will probably worsen before it gets better.\n\nHospitals are full, oxygen supplies are dwindling, and sick people are dying as they wait to see doctors. As workers leave locked-down cities for their home villages, experts fear that the exodus could accelerate the spread of the virus in rural areas, as a similar one did last year.\n\nOfficial estimates of the nationwide infection toll — well above 300,000 a day — are probably undercounted, epidemiologists say. The reported figure will mostly likely rise to 500,000 cases a day by August, they say, leaving as many as one million of India’s 1.4 billion people dead from Covid-19.\n\nCharities, volunteers and businesses in India and beyond are trying to help the country’s Covid victims and frontline workers."}, {"Article Image": "https://www.thehindu.com/news/international/oz7jpg/article34431189.ece/ALTERNATES/LANDSCAPE_615/boris", "Article's Title": "UK elections watchdog to probe Boris Johnson Downing Street flat refit", "Article's Text": "The UK's Electoral Commission on Wednesday launched a formal investigation into the funding of Prime Minister Boris Johnson’s Downing Street flat refurbishments, which have been at the centre of a row over whether donations to the ruling Conservative Party were involved in it.\n\nThe elections watchdog, which has been in contact with the Tory party since last month, said it felt there were “reasonable grounds” to suspect that an offence may have occurred in relation to the apartment used by the Prime Minister above No. 11 Downing Street.\n\n“We have been in contact with the Conservative Party since late March and have conducted an assessment of the information they have provided to us. We are now satisfied that there are reasonable grounds to suspect that an offence or offences may have occurred,” an Electoral Commission spokesperson said.\n\n“We will therefore continue this work as a formal investigation to establish whether this is the case. The investigation will determine whether any transactions relating to the works at 11 Downing Street fall within the regime regulated by the Commission and whether such funding was reported as required,” the spokesperson said.\n\nThe watchdog said it would not comment any further on the probe and will provide an update only once the investigation is complete. Under its remit, the Electoral Commission looks at evidence in a process known as an \"assessment\".\n\nIf the assessment finds evidence that gives reasonable grounds to suspect that an offence or contravention under the Political Parties at Elections and Referendums Act (2000) has occurred, and it is proportionate and appropriate to do so, it then opens an investigation.\n\nIts move this week follows weeks of controversy and “sleaze” allegations by the Opposition Labour Party, escalated further by former Downing Street top aide Dominic Cummings, claiming in a blog that the UK Prime Minister had planned for party donors to \"secretly pay\" for the works at the flat he shares with fiancée Carrie Symonds and their baby boy Wilfred.\n\n“The PM stopped speaking to me about this matter in 2020 as I told him I thought his plans to have donors secretly pay for the renovation were unethical, foolish, possibly illegal and almost certainly broke the rules on proper disclosure of political donations if conducted in the way he intended,” Cummings writes in his now infamous blog post from last week.\n\n“I refused to help him organise these payments. My knowledge about them is therefore limited. I would be happy to tell the Cabinet Secretary or Electoral Commission what I know concerning this matter,” said Johnson’s former close ally as his Chief Strategy Adviser.\n\nIt led to Labour demanding a full investigation into the allegations that Johnson borrowed from party funds for the refurbishment. Like Prime Ministers over the years, Johnson occupies the flat above No. 11 Downing Street and each new incumbent is allocated a budget to refurbish the place to their taste. Johnson and his fiancée are said to have decided to opt for a grander makeover worth around 58,000 pounds, which was allegedly sought to be funded through donations before being repaid.\n\nIn a statement released to Parliament last week, the Cabinet Office said that the UK Prime Miniter had “personally met” all the costs of the redecoration.\n\nIn its response to the allegations, Downing Street has said: \"At all times, the government and ministers have acted in accordance with the appropriate codes of conduct and electoral law. Cabinet Office officials have been engaged and informed throughout and official advice has been followed.\n\n\"All reportable donations are transparently declared and published – either by the Electoral Commission or the House of Commons registrar, in line with the requirements set out in electoral law. Gifts and benefits received in a ministerial capacity are, and will continue to be, declared in transparency returns.\" While it is not against the rules to receive donations, politicians are required to declare them under public transparency requirements."}, {"Article Image": "https://static01.nyt.com/images/2021/04/28/world/28oz-sentence/28oz-sentence-facebookJumbo.jpg", "Article's Title": "Australian Who Filmed 4 Dead and Dying Officers Gets Prison Sentence", "Article's Text": "CANBERRA, Australia — An Australian driver who filmed four dead and dying police officers who had been hit by a truck on a freeway was sentenced on Wednesday to 10 months in prison for what a judge described as a “heartless, cruel and disgraceful” act.\n\nThe driver, Richard Pusey, 42, a mortgage broker, had pleaded guilty in a court in the state of Victoria to a rarely prosecuted charge of outraging public decency over his commentary in crash-scene videos he shot with his phone. It was the first time the charge had been prosecuted in the state since 1963.\n\nThe most serious charge against him was reckless conduct endangering persons, which could carry a maximum sentence of five years in prison. But the judge, Trevor Wraight, sentenced Mr. Pusey to 10 months in prison, backdated to when he was arrested 296 days ago. While Mr. Pusey’s sentence is almost completed, he is likely to remain in custody for unrelated matters.\n\nThe police pulled Mr. Pusey over in April 2020 for driving a Porsche at 93 miles per hour on Melbourne’s Eastern Freeway. (The speed limit was 62 m.p.h.) They were considering impounding his car when a truck crashed into the officers, the Porsche and two police cars in an emergency stopping lane."}, {"Article Image": "https://www.thehindu.com/sci-tech/technology/o83ytb/article34429603.ece/ALTERNATES/LANDSCAPE_615/Alphabet-reutersjpg", "Article's Title": "Alphabet sets profit record, plans $50 billion buyback", "Article's Text": "The results provided the first sign that Google services such as search and YouTube may hold on to gains made since lockdowns and other pandemic restrictions forced people to shop and communicate online over the last year\n\n(Subscribe to our Today's Cache newsletter for a quick snapshot of top 5 tech stories. Click here to subscribe for free.)\n\nGoogle parent Alphabet Inc on Tuesday reported record profit for the second consecutive quarter and a $50 billion share buyback but warned a surge in usage and ad sales during the pandemic may slow as people resume in-person activities.\n\nWith online consumer activity remaining elevated in the first quarter, Alphabet beat analysts' revenue estimates and nearly surpassed the sales record it set in the fourth quarter.\n\nGoogle ad sales jumped 32% in the first quarter compared with a year ago, above expectations of analysts tracked by Refinitiv. Cloud sales increased 45.7%, in line with estimates.\n\nAlphabet shares rose about 4.3% to $2,390.10 in extended trading.\n\nThe results provided the first sign that Google services such as search and YouTube may hold on to gains made since lockdowns and other pandemic restrictions forced people to shop and communicate online over the last year.\n\nAlso Read | Regulatory probes Google is facing in Asia\n\nAbout 17% of people in the United States, Alphabet's top region by revenue, were fully vaccinated against COVID-19 by the end of the first quarter. Activities including in-person dining resumed in big cities in March, and security screenings at U.S. airports had their busiest day in a year.\n\nBut Alphabet Chief Financial Officer Ruth Porat told analysts on Tuesday, \"it's too early to forecast the extent to which these changes in consumer behavior and advertising spend will endure.\"\n\nGoogle Chief Business Officer Philipp Schindler and Porat declined to comment on whether Google had seen a recovery in spending by travel and other industries that were major customers before the pandemic.\n\nAlphabet's overall quarterly sales rose 34% to $55.3 billion, above analysts' estimate of 26% growth from a year ago and close to the $56.9 billion it reported in the fourth quarter. Revenue benefited by an unspecified amount from Google's acquisition of smartwatch maker Fitbit in January.\n\nAlphabet's quarterly profit was $17.9 billion, or $26.29 per share, beating estimates of $15.88 per share and topping its previous-high of $15.2 billion last quarter.\n\nAlso Read | Google asks U.S. judge to move states’ antitrust lawsuit to California\n\nBut nearly $4 billion of earnings came from unrealized gains in venture capital investments and recalculating depreciation of some data center equipment.\n\nThe high sales pushed operating margins up to 30% for the first time since incorporating as Alphabet in 2015 even as its costs began to pick up again for hiring, legal matters and building out new facilities. Alphabet in 2020 suffered its slowest sales growth in 11 years but posted record profit and boosted its cash hoard by $17 billion after slowing hiring and construction.\n\nThe share repurchase authorization by Alphabet's board follows a $25 billion buyback program announced in 2019. Jefferies analyst Brent Thill estimated Alphabet now has $56 billion left to spend buying its shares.\n\nAd rebound\n\nGoogle's ad business, the global market leader as measured in sales, accounted for 81% of Alphabet's first-quarter revenue.\n\nSchindler said retail, technology and consumer product companies were among big search advertisers in the quarter.\n\nGoogle Cloud, a distant rival to the cloud businesses of Amazon.com Inc and Microsoft Corp, narrow edits operating loss to 44% to $974 million in the first quarter. But Porat told analysts not to glean too much from the drop because one-time factors, including the depreciation, were at play.\n\nShares of Alphabet, 184th among companies in the S&P 500 index, have surged 80% in the last year. Shares of top rival Facebook Inc, which had been up 62% during the last year entering Tuesday, rose 1.7% after hours.\n\nAlso Read | Google’s new ad tracking tech to be blocked by WordPress\n\nThough several concerns about Google's long-term prospects have emerged in recent years, none have significantly affected sales.\n\nResolution likely remains years away in privacy and antitrust lawsuits against Google that could result in changes to its ad operations.\n\nDiscussions about changing U.S. and European laws to impose new oversight on Google, Facebook and other companies, especially regarding privacy and artificial intelligence, have lagged as legislators have been distracted by the pandemic.\n\nStill, issues continue to emerge. On Monday, streaming TV technology company Roku Inc accused Google of engaging in anticompetitive behavior to benefit its YouTube and hardware businesses. YouTube called them \"baseless claims.\""}, {"Article Image": "https://static01.nyt.com/images/2021/04/23/world/00afghanistan-security-forces-00001/00afghanistan-security-forces-00001-facebookJumbo.jpg", "Article's Title": "U.S. Built the Afghan Military Over 20 Years. Will It Last One More?", "Article's Text": "The Taliban and its allies went on the offensive, and seized territory across the country.\n\nWhat remains in the country is a security apparatus propped up by international funds and, as in years past, U.S. support. The United States has poured more than $70 billion in weapons, equipment and training into the Afghan forces. But from the look of many units, it is unclear where the money went.\n\nCommanders report having to buy their own sniper rifles on the black market. They have a fraction of the Humvees they’ve been promised. Some are running out of ammunition (though soldiers and police sometimes fire an excessive number of bullets so they can sell the discarded brass casings for scrap). A small outpost outside Kandahar relies on decrepit Soviet-era armored vehicles to defend its position.\n\nAnd a professional corps of officers and noncommissioned officers has barely emerged, in part because wages are low, risks high and many commanders dishonest.\n\n“Only the sons of poor people are here to show off that we have forces in the district,” army Maj. Abdul Nasir Haqmal said this winter from his hilltop post in Kandahar. “The salary of the rest of the soldiers is going to the pocket of corps commanders and people in the ministry of defense.”\n\nWhere government and Taliban territory meet, police outposts are often battered nightly, frequently by fighters with night-vision gear. Regular Afghan soldiers and police, lacking the same capability, have resorted to buying their own or sometimes even lighting debris or brush on fire to interfere with the Taliban’s devices. The Pentagon tried to equip certain units with night vision, but stopped after so much of the gear was lost, stolen or sold."}, {"Article Image": "https://static01.nyt.com/images/2021/04/26/world/26virus-eu1/26virus-eu1-facebookJumbo.jpg", "Article's Title": "How Europe Sealed a Pfizer Vaccine Deal With Texts and Calls", "Article's Text": "BRUSSELS — It was February and things were going from bad to worse for the European Union’s vaccination campaign, and for its top executive, Ursula von der Leyen.\n\nMuch of Europe was in lockdown, people were dying and the bloc was running low on doses of vaccines after its biggest supplier, AstraZeneca, announced production problems. Critics inside and outside the European Union questioned Ms. von der Leyen’s leadership and accused her of mishandling the crisis.\n\nIt was at that low point that she caught a break.\n\nFor a month, Ms. von der Leyen had been exchanging texts and calls with Albert Bourla, the chief executive of Pfizer, another vaccine supplier to the bloc. And as they spoke, two things became clear: Pfizer might have more doses it could offer the bloc — many more. And the European Union would be thrilled to have them.\n\nThat personal diplomacy played a big role in a deal, to be finalized this week, in which the European Union will lock in 1.8 billion doses from Pfizer, which, with its smaller German partner, BioNTech, made the first Covid-19 vaccine to get regulatory approval in the European Union."}, {"Article Image": "https://www.thehindu.com/static/theme/default/base/img/og-image.jpg", "Article's Title": "Indian-American NGO raises $4.7 million for COVID-19 relief", "Article's Text": "Further, Sewa collected a shipment of 2,184 oxygen concentrators to be sent to India.\n\nAn Indian-American non-profit body has raised nearly $4.7 million through social media towards COVID-19 relief efforts in India as the country battles a severe second wave of the pandemic.\n\n“This is a collective effort that can save lives, defeat hunger, assure distressed people, and help India in its decisive fight against COVID-19,” Sewa International USA said.\n\nOn Tuesday, Sewa collected a shipment of 2,184 oxygen concentrators to be sent to India.\n\nIn less than 100 hours of launching the fund-raising campaign, more than 66,700 Indian-Americans came out to raise over $4.7 million for COVID-19 relief efforts in India, it said.\n\nOver the last few years, Sewa International USA has emerged as the top Indian-American charity organisation in the U.S.\n\n“Right now, our top priority is to quickly acquire oxygen concentrators and ship them to India as it can save lives. We are also providing support to hospitals run by Sewa’s partner organisations to extend their capacity to treat more coronavirus-infected patients,” the organisation said.\n\nSewa’s volunteers are working on building a digital helpdesk to provide critical information such as ambulance service, hospital bed availability and blood and medicinal supplies to people, it added.\n\n“As the pandemic is causing economic hardships by forcing partial lockdowns, we are planning to distribute over 10,000 essential item kits to families and assist more than 1,000 orphanages and senior care centres,” Sewa said.\n\n“Working closely with our partner organisations, we are also distributing food and medicines to the needy in multiple places,” it added.\n\nAmerican Association of Physicians of Indian Origin (APPI), the largest ethnic medical organisation in the country, on Tuesday announced a nationwide campaign for medical oxygen, tele-consult and educational webinars to help combat COVID-19 in India.\n\n“This is the time for immediate AAPI action. As doctors, we all share a visceral urge to do something about it,” said Dr. Sudhakar Jonnalgadda, AAPI president.\n\n“We have located a source manufacturer that supplies oxygen concentrators, each of which can save several lives in India. The cost of each unit is around $500,” he said.\n\n“AAPI, with the collaboration of numerous members, has placed orders for securing and delivering 200 oxygen concentrators directly to hospitals in India with the help of SEWA International, a reliable non-profit organisation,” Mr. Jonnalgadda said.\n\nThe U.S. India Chamber of Commerce DFW and the Indo American Chamber of Commerce of Greater Houston – both from Texas – in partnership with the USICOC Foundation shipped out the first batch of 20 ventilators to the Indian Red Cross Society in Delhi to be disbursed to hospitals and field teams in hard-hit areas, a media statement said.\n\n“It is our moral obligation to help India in every way that we can during this time of need. We will continue to provide support as long as it takes to bring the situation to normal,” said Ashok Mago, founding chairman of the U.S. India Chamber, who helped coordinate many of the necessary funds for the effort.\n\nAnother next 30 ventilators are scheduled to ship out in the next few days.\n\nJagdip Ahluwalia from the Indo American Chamber of Commerce of Greater Houston, who was coordinating efforts from the Houston area, said members of the organisation are coordinating with hospitals, NGOs, medical schools and government bodies in India to make sure the equipment is getting to trained professionals, who can put it to immediate use."}, {"Article Image": "https://static01.nyt.com/images/2021/04/28/multimedia/28xp-edballs/28xp-edballs-facebookJumbo.jpg", "Article's Title": "Ten Years Ago, Ed Balls Tweeted ‘Ed Balls.’ How Is It Still Funny?", "Article's Text": "LONDON — Ten years ago on Wednesday, a politician who was a significant figure in British politics but hardly an international star followed an aide’s suggestion: He loaded the Twitter app on his BlackBerry and searched for his own name to see what people were saying about him.\n\nExcept he didn’t search for his name. He accidentally tweeted it instead.\n\nWhat might have been a routine, deeply forgettable gaffe instead became an annual event of remembrance, still being celebrated a decade later in an ocean-spanning meme nearly unrivaled in its longevity, because that politician’s name happened to appeal to the most childish of impulses.\n\n“I didn’t really particularly clock it as a big deal at the time,” Ed Balls, then a member of Parliament and among the top leaders of the opposition Labour Party, said in a recent interview."}, {"Article Image": "https://static01.nyt.com/images/2021/04/28/world/28france-terrorism01sub/28france-terrorism01sub-facebookJumbo.jpg", "Article's Title": "France Weighs an Anti-Terrorism Bill as Insecurity Widens a Political Fracture", "Article's Text": "PARIS — The French government, responding to several attacks over the past seven months, presented a new anti-terrorism bill on Wednesday that would allow intense algorithmic surveillance of phone and internet communications and tighten restrictions on convicted terrorists emerging from prison.\n\nPrepared before the latest terrorist attack — the fatal stabbing five days ago of a police employee by a radicalized Tunisian immigrant — the bill assumed greater urgency in a country where feelings of insecurity have spread.\n\n“There have been nine attacks in a row that we could not detect through current means,” Gérald Darmanin, the interior minister, told France Inter radio. “We continue to be blind, doing surveillance on normal phone lines that nobody uses any longer.”\n\nThe draft bill, prepared by Mr. Darmanin, came in a political and social climate envenomed by Marine Le Pen, the far-right leader, who applauded a letter published this month by 20 retired generals that described France as being in a state of “disintegration” and warned of a possible coup in thinly veiled terms."}, {"Article Image": "https://static01.nyt.com/images/2021/04/27/lens/27hungary-photo/27hungary-photo-facebookJumbo.jpg", "Article's Title": "Hungary Transfers 11 Universities to Foundations Led by Orban Allies", "Article's Text": "Hungary’s Parliament voted on Tuesday to transfer control of 11 state universities, along with billions of euros in related state assets, to quasi-public foundations led by close allies of the country’s prime minister, Viktor Orban.\n\nCritics immediately denounced the move as a government handover of both public education and a vast network of public assets — including real estate and shares in Hungarian companies — to Mr. Orban and his supporters.\n\nAccording to the measure that passed on Tuesday, the foundations will “ensure the realization of vital public goals” by managing the universities more efficiently, regardless of who is in power.\n\nBut going forward, any changes to the rules governing the foundations will require a two-thirds majority in Parliament. Practically speaking, this that means any effort to tinker with the new system of oversight will require the same level of political support as overhauling the Constitution."}, {"Article Image": "https://www.thehindu.com/news/international/3vob7u/article34427769.ece/ALTERNATES/LANDSCAPE_615/SouthKoreaSamsung", "Article's Title": "Samsung family to pay $10.8 billion in inheritance tax", "Article's Text": "This would be the largest-ever amount in South Korea and more than three times the country's total estate tax revenue for last year.\n\nSamsung's founding family will donate tens of thousands of rare artworks, including Picassos and Dalis, and give hundreds of millions of dollars to medical research to help them pay a massive inheritance tax following last year's death of chairman Lee Kun-Hee.\n\nThe Lee family, including his wife and three children, expects to pay more than 12 trillion won ($10.8 billion) in taxes related to inheritance, Samsung said on Wednesday.\n\nThis would be the largest-ever amount in South Korea and more than three times the country's total estate tax revenue for last year. The family plans to divide the payment in six installments over five years, while making the first payment this month.\n\nRaising cash for the tax payment is crucial for the Lee family to extend its control over Samsung's business empire, which extends from semiconductors, smartphones and TVs to construction, shipbuilding and insurance. Some analysts say the process could result in a shakeup across the group.\n\nGiving away the late chairman's vast collection of masterpieces could help smoothen the payment as his family wouldn't need to pay taxes on donated artworks.\n\nThe family plans to donate 23,000 pieces from Lee's personal collection to two state-run museums. They include old Korean paintings, books and other cultural assets designated as national treasures, paintings of modern Korean artists, including Park Soo-keun and Lee Jung-seop, and the works of Marc Chagall, Pablo Picasso and Paul Gauguin, Claude Monet, Joan Miro and Salvador Dali, Samsung said.\n\nThe Lee family will also donate 1 trillion won ($900 million) to help fund infectious disease research and treatment for children with cancer and rare illnesses.\n\nBefore his death in October, Lee was credited for transforming Samsung Electronics from a small television maker into a global giant in semiconductors and consumer electronics. But his leadership was also marred by corruption convictions that highlighted the traditionally murky ties between the country's family-owned conglomerates and politicians. He had been hospitalized for years following a heart attack in 2014.\n\nLee's only son and corporate heir, Lee Jae-yong, who has since helmed the group in his capacity as vice chairman of Samsung Electronics, is currently serving a two and a half-year sentence for his involvement in a 2016 corruption scandal that spurred massive protests and ousted South Korea's then-President."}, {"Article Image": "https://www.thehindu.com/news/international/ws5ce7/article34428773.ece/ALTERNATES/LANDSCAPE_615/Persian-Gulf-Tensions", "Article's Title": "U.S. Navy fires warning shots in new tense encounter with Iran", "Article's Text": "The U.S. Navy said the USS Firebolt fired the warning shots after three fast-attack Guard vessels came within 68 yards (62 metres) of it and the U.S. Coast Guard patrol boat USCGC Baranoff\n\nAn American warship fired warning shots when vessels of Iran’s paramilitary Revolutionary Guard came too close to a patrol in the Persian Gulf, the U.S. Navy said April 28.\n\nThe Navy released black-and-white footage of the encounter on April 26 night in international waters of the northern reaches of the Persian Gulf. In it, lights can be seen in the distance and what appears to be a single gunshot can be heard, with a tracer round racing across the top of the water.\n\nIran did not immediately acknowledge the incident.\n\nThe Navy said the USS Firebolt fired the warning shots after three fast-attack Guard vessels came within 68 yards (62 metres) of it and the U.S. Coast Guard patrol boat USCGC Baranoff.\n\n“The U.S. crews issued multiple warnings via bridge-to-bridge radio and loud-hailer devices, but the [Guard] vessels continued their close range manoeuvrers,” said Cmdr. Rebecca Rebarich, a spokeswoman for the Mideast-based 5th Fleet.\n\n“The crew of Firebolt then fired warning shots, and the [Guard] vessels moved away to a safe distance from the U.S. vessels.” She called on the Guard to “operate with due regard for the safety of all vessels as required by international law”. “U.S. naval forces continue to remain vigilant and are trained to act in a professional manner, while our commanding officers retain the inherent right to act in self-defence,” she said.\n\nThe incident on April 26 marked the second time the Navy accused the Guard of operating in an “unsafe and unprofessional” manner this month alone after tense encounters between the forces had dropped in recent years.\n\nFootage released on April 27 by the Navy showed a ship commanded by the Guard cut in front of the USCGC Monomoy, causing the Coast Guard vessel to come to an abrupt stop with its engine smoking on April 2.\n\nThe Guard also did the same with another Coast Guard vessel, the USCGC Wrangell, Ms. Rebarich said. Such close passes risk collisions.\n\nThe interaction marked the first “unsafe and unprofessional” incident involving the Iranians since April 15, 2020, Ms. Rebarich said. However, Iran had largely stopped such incidents in 2018 and nearly in the entirety of 2019, she said.\n\nIn 2017, the Navy recorded 14 instances of what it describes as “unsafe and or unprofessional” interactions with Iranians forces. It recorded 35 in 2016, and 23 in 2015.\n\nThe incidents at sea almost always involve the Revolutionary Guard, which reports only to Supreme Leader Ayatollah Ali Khamenei. Typically, they involve Iranian speedboats armed with deck-mounted machine guns and rocket launchers test-firing weapons or shadowing American aircraft carriers passing through the Strait of Hormuz, the narrow mouth of the Persian Gulf through which 20% of all oil passes.\n\nSome analysts believe the incidents are meant in part to squeeze President Hassan Rouhani’s administration after the 2015 nuclear deal.\n\nThey include a 2016 incident in which Iranian forces captured and held overnight 10 U.S. sailors who strayed into the Islamic Republic’s territorial waters.\n\nThe incident comes as Iran negotiates with world powers in Vienna over Tehran and Washington returning to the 2015 nuclear deal. It also follows a series of incidents across the Mideast attributed to a shadow war between Iran and Israel, which includes attacks on regional shipping and sabotage at Iran’s Natanz nuclear facility."}, {"Article Image": "https://www.thehindu.com/sci-tech/technology/internet/8oq3e7/article34428337.ece/ALTERNATES/LANDSCAPE_615/Apple-APjfif", "Article's Title": "EU to hit Apple with antitrust charge this week", "Article's Text": "Spotify took its grievance to the European Commission in 2019, saying Apple unfairly restricts rivals to its own music steaming service Apple Music\n\n(Subscribe to our Today's Cache newsletter for a quick snapshot of top 5 tech stories. Click here to subscribe for free.)\n\nEU antitrust regulators are set to charge iPhone maker Apple this week with blocking rivals on its App Store following a complaint by music streaming service Spotify, a person familiar with the matter said on Tuesday.\n\nThe move, the first EU antitrust charge against Apple, could lead to a fine as much as 10% of Apple's global revenue and changes in its lucrative business model.\n\nReuters was the first to report about the imminent EU antitrust charge in March.\n\nSweden's Spotify took its grievance to the European Commission in 2019, saying Apple unfairly restricts rivals to its own music steaming service Apple Music.\n\nAlso Read | Regulation may be needed for Apple, Google app stores if changes not made: Australian regulator\n\nIt also complained about the 30% fee levied on app developers to use Apple's in-app purchase system (IAP).\n\nThe EU competition enforcer, which has four Apple investigations including the Spotify complaint, declined to comment.\n\nApple referred to its March 2019 blog following the Spotify complaint, which said its App Store helped its rival to benefit from hundreds of millions of app downloads to become Europe's largest music streaming service."}, {"Article Image": "https://www.thehindu.com/news/international/5229vg/article34354003.ece/ALTERNATES/LANDSCAPE_615/Trudeau", "Article's Title": "Canada to provide 10mn dollars to India to support fight against COVID-19: PM Justin Trudeau", "Article's Text": "Mr. Trudeau said that Minister of Foreign Affairs Marc Garneau had “direct conversations” with his Indian counterpart S. Jaishankar about how Canada can help.\n\nCanada will provide 10 million dollars to India to support the country in its fight against the unprecedented second wave of the COVID-19 pandemic, Prime Minister Justin Trudeau has announced.\n\nAddressing a press conference, Mr. Trudeau said that Minister of Foreign Affairs Marc Garneau had “direct conversations” with his Indian counterpart S. Jaishankar about how Canada can best help, including the donation of extra medical supplies.\n\n“We are also ready to provide 10 million dollars through the Canadian Red Cross to the Indian Red Cross,” the Prime Minister said.\n\nThis will support everything from ambulant services to buying more Personal Protective Equipment locally, he said.\n\n“If you want to donate to the emergency efforts on the ground, go to redcross.ca… As a world, we are in this fight together,” Mr. Trudeau said.\n\nAbout the talks between the Foreign Affairs Ministers of both the countries, he said: “We are there to support in any ways we can, and those conversations are very much ongoing”.\n\n“It’s something that Canadians are extremely concerned about as we see the terrible and tragic images coming out of India. We know that we need to be there for our friends. And indeed, we need to be there for everyone around the world because we don’t get through this pandemic anywhere until we get through it everywhere,” Mr. Trudeau said.\n\nEarlier, Foreign Affairs Minister Garneau said on Twitter that he spoke to his Indian counterpart Jaishankar about the COVID-19 situation in the country and conveyed Canada’s solidarity with the people of India.\n\n“This morning, I spoke with @DrSJaishankar to convey Canada’s solidarity with the people of India as they face this deadly wave of #Covid19. Canada is exploring all options to support India’s urgent needs. We are ready to assist,” he said in a tweet.\n\nIndia is struggling with a second wave of the pandemic with more than 3,00,000 daily new coronavirus cases being reported in the past few days and hospitals in several states are reeling under a shortage of medical oxygen and beds.\n\nIndia saw a record single-day rise of 3,60,960 coronavirus cases, which pushed the total tally to 1,79,97,267, while the death toll crossed two lakh following 3,293 fresh fatalities, the Health Ministry said on Wednesday.\n\nThe death toll stands at 2,01,187, it said."}, {"Article Image": "https://www.thehindu.com/news/international/9dn5kb/article34427696.ece/ALTERNATES/LANDSCAPE_615/joebiden", "Article's Title": "Joe Biden reiterates U.S. intention to send India vaccines", "Article's Text": "He said that the U.S. was sending “a whole series of help” to India including remdesivir and vaccine inputs.\n\nU.S. President Joe Biden,on Tuesday, elaborated on his phone conversation with Prime Minister Narendra Modi on Monday to discuss the COVID-19 outbreak in India. He said that the U.S. was sending “a whole series of help” to India including remdesivir and vaccine inputs.\n\n“With regard to India, I spoke at length with Modi, the Prime Minister. We are sending immediately a whole series of help that he needs, including providing for those — remdesivir and other drugs that are able to deal with this and prevent, in some cases, but recover — help recovery,” said Mr. Biden, who was walking away from the lectern at the end of his remarks on COVID-19 on the North Lawn of the White House, but returned briefly specifically to answer questions on India.\n\n“Secondly, we are sending the actual mechanical parts that are needed for the machinery they have to build a vaccine. And that's being done as well,” Mr. Biden said, adding that he told Mr. Modi that the U.S. would be able to send actual vials (of vaccine) to India.\n\n“I've discussed with him [Mr. Modi] when we'll be able to send actual vaccines to India, which would be my intention to do.”\n\n“ The problem is, right now, we have to make sure we have other vaccines, like Novavax and others, coming on, probably. And I think we'll be in a position to be able to share — to share vaccines, as well as know-how, with other countries who are in real need. That's the hope and expectation.” Mr. Biden said.\n\nThe White House announced on Monday that it was making available some 60 million doses of AstraZeneca vaccine for use by other countries over the course of May and June.\n\n“And I might add, when we were in a bind at the very beginning, India helped us,” Mr. Biden said as he was leaving the venue.\n\nSenate India Caucus writes to Biden\n\nCo-Chairs of the Senate India Caucus, Mark Warner (Democrat, Virginia) and John Cornyn (Republican, Texas) wrote to President Biden urging him to “accelerate U.S. efforts” to support countries like India that had been hard hit by COVID-19.\n\n“As co-chairs of the Senate India Caucus, we are watching with growing alarm the unprecedented surge of COVID-19 cases, hospitalizations, and deaths, which has overwhelmed hospitals and the overall health system in India,” the Senators write.\n\nFinally, we congratulate you for taking specific actions to remove obstacles that would get in the way of sending excess vaccines to India,” they say, asking that similar domestic barriers be removed for sharing vaccines with other countries as well."}, {"Article Image": "https://www.thehindu.com/sci-tech/technology/internet/fw24hm/article34428397.ece/ALTERNATES/LANDSCAPE_615/Apple-AP-3jpeg", "Article's Title": "Russia fines Apple $12 mln for alleged app market abuse", "Article's Text": "The FAS said in a statement it had imposed a turnover fine on Apple of 906.3 million roubles ($12.1 million) for the alleged violation of Russian anti-monopoly legislation\n\n(Subscribe to our Today's Cache newsletter for a quick snapshot of top 5 tech stories. Click here to subscribe for free.)\n\nRussia said it had fined Apple $12 million for alleged abuse of its dominance in the mobile applications market, in the latest dispute between Moscow and a Western technology firm.\n\nThe Federal Anti-monopoly Service (FAS) said on Tuesday that U.S. tech giant Apple's distribution of apps through its iOS operating system gave its own products a competitive advantage.\n\nApple said it \"respectfully disagreed\" with the FAS ruling and that it would appeal it.\n\nWestern tech companies have come under increasing pressure in Russia in recent months, with social network Twitter punitively slowed down over a failure to delete content which Moscow says is illegal.\n\nFacebook, TikTok and Alphabet's Google have also come under fire.\n\nAlso Read | EU to hit Apple with antitrust charge this week\n\nThe FAS said in a statement it had imposed a turnover fine on Apple of 906.3 million roubles ($12.1 million) for the alleged violation of Russian anti-monopoly legislation.\n\nIt determined in August 2020 that Apple had abused its dominant position and then issued a directive requiring the U.S. company to remove provisions giving it the right to reject third-party apps from its App Store.\n\nThat move followed a complaint from cybersecurity company Kaspersky Lab, which had said that a new version of its SafeKids application had been declined by Apple's operating system.\n\nApple said it was proud to have helped thousands of developers in Russia, including Kaspersky.\n\n\"We worked with Kaspersky to get their app in compliance with rules that were put in place to protect children,\" Apple said in a statement. \"They now have 13 apps on the App Store and we have processed hundreds of updates for them.\"\n\nAlso Read | Regulation may be needed for Apple, Google app stores if changes not made: Australian regulator\n\nAnton Gorelkin, a member of Russia's State Duma committee on information and communications, said the fine would not destroy Apple, but would be noticeable on financial statements.\n\n\"Gradually we are approaching the kind of seriousness in the conversation with Big Tech that has long been on display in the West,\" Gorelkin wrote on Telegram. ($1 = 74.8200 roubles)"}, {"Article Image": "https://www.thehindu.com/news/international/911d1y/article34427777.ece/ALTERNATES/LANDSCAPE_615/doug-ducey", "Article's Title": "Arizona Governor signs abortion ban for genetic issues", "Article's Text": "The measure passed the Republican-controlled Legislature on party-line votes over unanimous opposition from minority Democrats.\n\nArizona Gov. Doug Ducey has signed a sweeping anti-abortion bill that bans the procedure if the woman is seeking it solely because a fetus has a genetic abnormality such as Down syndrome.\n\nDoctors who perform an abortion solely because the child has a survivable genetic issue can face felony charges. The proposal also contains a raft of other provisions sought by abortion opponents.\n\nThe measure passed the Republican-controlled Legislature on party-line votes over unanimous opposition from minority Democrats. The Republican governor is an abortion opponent who has never vetoed a piece of anti-abortion legislation.\n\nSenate Bill 1457 moved through the Legislature in fits and starts, stalling twice before moving again amid intense pressure by abortion opponents on GOP lawmakers who opposed some of its provisions. It finally passed both chambers last week.\n\nThe abortion bill as originally written made it a felony for a doctor to perform the procedure because the fetus has a genetic abnormality such as Down syndrome, and contained a slew of other provisions, including one that confers all civil rights to unborn children. Democrats call that “personhood” provision a backdoor way to allow criminal charges against a woman who has an abortion.\n\nIn addition to the ban on abortions for genetic abnormalities and the “personhood” provision, the bill bans mail delivery of abortion-inducing medication, allows the father or maternal grandparents of a fetus aborted because of a genetic issue to sue, and bans the spending of any state money toward organisations that provide abortion care.\n\nThe measure also requires fetal remains to be buried or cremated, and it forbids state universities from providing abortion care.\n\n“There’s immeasurable value in every single life — regardless of genetic makeup,” Mr. Ducey said in a statement on Tuesday. “We will continue to prioritise protecting life in our preborn children, and this legislation goes a long way in protecting real human lives.”\n\nThe bill was amended twice to allay the concerns of a pair of Republicans — one worried that a woman would be forced to carry a fetus that could not survive and a second concerned that a doctors’ medical decisions could be overruled by a jury.\n\nThat GOP-backed amendment also clarified that the “personhood” provision does not ban in-vitro fertilisation.\n\nThe Democrats issued a lengthy written rebuttal to the bill after the final amendment.\n\nThe measure was a top priority for the social conservative group Center for Arizona Policy. Its president, Cathi Herrod, routinely backs anti-abortion bills in the Legislature. National anti-abortion groups hailed its passage.\n\nMinutes after the governor acted, Ms. Herrod sent out a news release with the subject line “Life Wins!”\n\n“Today, Arizonans win. Arizona children diagnosed with disabilities prior to birth will no longer be discriminated against,” Ms. Herrod wrote in the release. “Arizona women will be ensured common-sense safeguards if they choose the abortion pill. Arizona taxpayers will not be forced to support abortions at public colleges and universities, and the laws of Arizona will be interpreted to value all human life.”\n\nAbortion rights groups had rallied at the Capitol on Monday, urging Mr. Ducey to veto the measure and presenting him with petitions signed by opponents of the bill.\n\nDemocrats lamented the governor’s action, including Rep. Diego Espinoza of Tolleson.\n\n“Gov. Ducey’s decision to sign SB1457 is not pro-life. It is anti-families, anti-woman, and anti-doctor,” Mr. Espinoza tweeted. “I’m disappointed to see Arizona moving in this direction, ignoring the needs and desires of doctors, women, and families for an extreme political agenda.”\n\nRepublican-controlled legislatures in Arizona and several other states — emboldened by the possibility that a more conservative U.S. Supreme Court could overturn Roe vs Wade, the 1973 decision that found women have a constitutional right to seek an abortion — have embraced proposals this year that could completely ban abortion. An Arizona proposal doing that, however, has not advanced.\n\nEarlier this month, a divided federal appeals court lifted the hold on a similar Ohio law that prohibits doctors from performing abortions based on a fetal diagnosis of Down syndrome.\n\nJudges of the 6th U.S. Circuit Court of Appeals narrowly reversed two earlier decisions blocking enforcement of Ohio’s 2017 law. A majority of the appeals court said the law doesn’t impede a woman’s right to an abortion.\n\nMonday’s amendment to the Arizona bill also added a legislative intent clause that included much of the reasoning the appeals court used in the Ohio decision."}, {"Article Image": "https://www.thehindu.com/news/international/9ub4v9/article34428305.ece/ALTERNATES/LANDSCAPE_615/FILE-PHOTO-A-woman-holds-a-small-bottle-labeled-with-a-Coronavirus-COVID-19-Va", "Article's Title": "Top U.S. trade negotiator discusses COVID-19 vaccine ramp-up with Novavax", "Article's Text": "Novavax’s COVID-19 vaccine is not currently authorised for use in the United States.\n\nU.S. Trade Representative Katherine Tai discussed increasing COVID-19 vaccine production in a virtual meeting on April 27 with an executive of drugmaker Novavax, Ms. Tai’s office said in a statement.\n\nMs. Tai and Novavax Executive Vice President John Trizzino also discussed a proposal before the World Trade Organisation to waive certain intellectual property rights in response to the coronavirus pandemic, the USTR statement said.\n\n“Ambassador Tai sought Mr. Trizzino’s views on steps Novavax is taking to quickly increase equitable production and distribution of vaccines in the United States and around the world,” the statement said.\n\nNovavax’s COVID-19 vaccine is not currently authorised for use in the United States.\n\nWTO members are due to discuss a proposal by India and South Africa to waive certain provisions of the WTO’s Agreement on Trade-Related Aspects of Intellectual Property Rights on April 30, but the United States and a few other big countries have blocked such a move.\n\nDemocratic lawmakers, civil society groups, and 60 former heads of state and 100 Nobel Prize winners have urged U.S. President Joe Biden to back the waiver.\n\nShares of Novavax surged 16% in extended trading on April 27 after Mr. Biden said the United States was planning to share COVID-19 vaccines with countries in need of aid.\n\nThe company is expected to report data from its ongoing large, late-stage study in the United States and Mexico during the second quarter of this year.\n\nMs. Tai held virtual meetings on April 26 with vaccine makers Pfizer and AstraZeneca.\n\nMeeting with South Korean President\n\nNovavax Chief Executive Stanley Erck met with South Korean President Moon Jae-in on April 27 and said he was in talks with SK bioscience, the vaccine arm of SK Chemicals, to extend production and technology transfer agreements until 2022.\n\nSK bioscience plans to start producing the Novavax COVID-19 vaccines as soon as the approval comes and manufacture 40 million doses to supply South Korea."}, {"Article Image": "https://static01.nyt.com/images/2021/04/28/world/28uk-johnson-ethics01/28uk-johnson-ethics01-facebookJumbo.jpg", "Article's Title": "U.K.’s Johnson on the Defensive as Ethical Questions Mount", "Article's Text": "LONDON — The ethical allegations swirling around Prime Minister Boris Johnson got more serious on Wednesday after Britain’s Electoral Commission announced it would open a formal investigation into whether Mr. Johnson secretly used political donations to refurbish his apartment in Downing Street.\n\nThe commission said it found “reasonable grounds to suspect that an offense or offenses may have occurred.” Mr. Johnson is accused of using funds from a Conservative Party donor to supplement the budget for upgrading his official quarters, which are above the offices at 11 Downing Street.\n\nMr. Johnson insisted he paid for the refurbishment out of his own pocket, but he has not disclosed whether he repaid a donation made to the Conservative Party once the accusations surfaced. He is entitled to £30,000 ($41,600) a year in public funds to decorate his apartment, but apparently concluded that budget was inadequate.\n\nThe news of a formal investigation raised the political stakes for Mr. Johnson, who has been engaged in an ugly exchange of charges and countercharges with his disaffected former chief adviser, Dominic Cummings. In Parliament on Wednesday, Mr. Johnson seemed uncharacteristically rattled and angry."}, {"Article Image": "https://static01.nyt.com/images/2021/04/26/us/26virus-briefing-brazil-sputnik/26virus-briefing-brazil-sputnik-facebookJumbo-v3.jpg", "Article's Title": "Brazil’s health authority rejects importing Russia’s Sputnik V vaccine.", "Article's Text": "Russia is using Sputnik V in its own mass vaccination campaign, and the vaccine has been approved for emergency use in dozens of countries. A peer-reviewed study published in The Lancet in February said the vaccine had an efficacy rate of 91.6 percent.\n\nBrazil’s decision prompted a response at the highest level of the Russian government, which has been energetically promoting Sputnik V in Latin America at a time when the United States has limited its vaccine exports to reserve doses for its own citizens.\n\nThe Kremlin spokesman, Dmitri S. Peskov, said on Tuesday that the Russian government would try to win over the Brazilian regulators’ minds about the vaccine’s safety. “Contacts will continue,” Mr. Peskov said on a conference call with journalists. “If data is missing, it will be provided. There should be no doubt in this.”\n\nThe official Sputnik V Twitter account have also pushed back, with a post in Portuguese on Monday saying that the vaccine’s developers had shared “all the necessary information and documentation” with Anvisa. In another tweet, it said Anvisa’s decision “was of a political nature” and had “nothing to do with access to information or science.” It alleged that the United States had persuaded Brazil to deny approval.\n\nAnvisa officials were under immense pressure to deliver a decision on Sputnik V, because Brazilian states had contracts to buy almost 30 million doses. The Supreme Court ordered Anvisa to make a decision."}, {"Article Image": "https://static01.nyt.com/images/2021/04/27/us/politics/27dc-navy/27dc-navy-facebookJumbo.jpg", "Article's Title": "Second Close Call Between Iranian and American Vessels Raises Tensions", "Article's Text": "WASHINGTON — For the second time in a month, vessels from Iran and the United States came dangerously close in the Persian Gulf on Monday night, the Navy said on Tuesday, escalating tensions between the two nations as their negotiators have resumed talks toward renewing the 2015 nuclear deal.\n\nAccording to the U.S. Navy’s Fifth Fleet in Bahrain, three fast-attack craft from Iran’s Islamic Revolutionary Guards Corps sailed close to a Navy coastal patrol ship and a Coast Guard patrol boat as the two American vessels were patrolling international waters in the northern part of the Persian Gulf.\n\nAt about 8 p.m. local time Monday, the Iranian boats rapidly and repeatedly approached the American ships, the Firebolt and the Baranoff — at one point coming as close as 68 yards, according to a Navy statement.\n\nThe American crews issued multiple warnings via bridge-to-bridge radio and loudspeakers, but the Iranian vessels continued their close-range maneuvers, the Navy said. When the Firebolt’s crew fired warning shots, the Iranian vessels moved away “to a safe distance from the U.S. vessels,” the Navy said."}, {"Article Image": "https://www.thehindu.com/sci-tech/technology/6q0fdd/article34428322.ece/ALTERNATES/LANDSCAPE_615/Apple-AP-2jpg", "Article's Title": "Regulation may be needed for Apple, Google app stores if changes not made: Australian regulator", "Article's Text": "Apple and Google representatives told senators that their tight control over their stores and the associated revenue-sharing requirements were needed to enforce and pay for security measures to protect consumers from harmful apps and practices\n\n(Subscribe to our Today's Cache newsletter for a quick snapshot of top 5 tech stories. Click here to subscribe for free.)\n\nAustralia's competition watchdog said on Wednesday regulation may be required to address the significant market power app stores owned by Alphabet's Google and Apple have if they do not take steps to assuage concerns.\n\nThe global dominance of Apple's App Store and Google's Play Store has been criticised by some app makers for mandatory revenue sharing payments and strict inclusive rules by both companies.\n\nThe Australian Competition and Consumer Commission (ACCC), in a digital platforms services inquiry interim report, said app developers should be allowed to provide customers with alternative payment options and data collected by Google and Apple should be kept separate from their other operations.\n\nThe ACCC also called for consumers to be allowed to change or remove pre-installed or default apps.\n\nAlso Read | What do Apple's new iPhone privacy changes mean for consumers and businesses?\n\n\"We have identified a number of areas where action is required and have put forward potential measures to address areas of particular concern,\" ACCC Chair Rod Sims said.\n\n\"There is a window of opportunity for Apple and Google themselves to take steps to improve outcomes for app developers and consumers.\"\n\nApple and Google did not immediately respond to requests for comment.\n\nA panel of U.S. senators questioned both companies last week over their dominance and whether they were abusing their power at the expense of smaller competitors.\n\nApple and Google representatives told senators that their tight control over their stores and the associated revenue-sharing requirements were needed to enforce and pay for security measures to protect consumers from harmful apps and practices.\n\nSims said the ACC would look at changes of laws in other countries and other proposals, but \"regulation may be required if Apple and Google fail to take steps to address the concerns identified.\""}, {"Article Image": "https://static01.nyt.com/images/2021/04/27/us/27virus-briefing-mask-states1/27virus-briefing-mask-states1-facebookJumbo.jpg", "Article's Title": "Despite new C.D.C. mask guidance, the U.S. patchwork of mandates will take time to unravel.", "Article's Text": "As the Centers for Disease Control and Prevention offered on Tuesday new guidance about when masks should be worn outdoors, people across the United States are living under an often confusing patchwork of limits, one that could continue for some time.\n\nBefore the C.D.C.’s changes on Tuesday, 25 states had some form of statewide mask mandate, as did the District of Columbia and Puerto Rico, according to a New York Times tracker of coronavirus restrictions across the country. In 24 other states there was no statewide mask mandate, while in Colorado masks could be required depending upon the number of cases diagnosed in a county.\n\nBut even within a state, mask mandates can vary based upon county or city. Kansas has no statewide mask mandates, but a number of cities and counties have their own orders. In Colorado, masks must always be worn in specific indoor locations — like schools, hospitals and government buildings — but in some counties with a high rate of new cases, they must also be worn in all public indoor settings with 10 or more people.\n\nAfter the C.D.C.’s announcement on Tuesday, a handful of governors said they would relax their outdoor mask mandates. In Massachusetts, masks won’t be required unless it is not possible to social distance. Maine recommends wearing a mask outdoors when it’s difficult to stay distanced, and Gov. Gavin Newsom of California said on Tuesday that “if you’re fully vaccinated, outdoors and not in a large crowd — you do not need to wear a mask.”"}, {"Article Image": "https://static01.nyt.com/images/2021/04/26/us/politics/26dc-virus-biden1/merlin_186898722_e7e1dd37-aac2-4f15-9197-e0bc0eee422e-facebookJumbo.jpg", "Article's Title": "As Virus Rages Abroad, Biden Promises to Ship Millions of Vaccine Doses", "Article's Text": "Senior Biden administration officials, asked by a reporter on Monday whether they had a “moral obligation” to ease the patent restrictions, said they had no new information to share. But Jen Psaki, the White House press secretary, defended the president’s response.\n\n“The United States has been one of the largest providers of assistance to address the Covid pandemic around the world, including to India, and we have obviously taken some significant steps over the last couple of days to address their immediate needs,” Ms. Psaki said.\n\nThe situation in India is especially dire. The country is experiencing what may be the worst crisis any nation has seen since the pandemic began. Hospitals are overflowing, and desperate patients are dying as they wait to see doctors. On Monday, India broke the world record for daily coronavirus infections for a fifth consecutive day, reporting nearly 353,000 new cases. And it added 2,812 deaths to its overall toll of more than 195,000, which experts say is likely to be a vast undercount.\n\n“The crisis in India is a humanitarian disaster unfolding before our eyes,” said Tom Hart, the acting chief executive of the ONE campaign, a nonprofit dedicated to eradicating world poverty. Based on an analysis of contracts signed by Mr. Biden’s most recent predecessor, the group estimates that the federal government has secured 550 million more doses than it needs to cover every American.\n\nWith worrisome variants spreading in the United States and around the world, public health experts say vaccinating people overseas is not only a moral imperative, but it is essential to protecting Americans. J. Stephen Morrison, the director of the Global Health Policy Center at the Center for Strategic and International Studies, said Mr. Biden needed to offer a more sweeping vision of how the United States can help the world.\n\n“We are approaching these colossal, complex problems in an ad hoc, reactive, short-term manner,” Mr. Morrison said. He called the announcement on Monday a “further incremental step by the Biden administration toward fuller engagement internationally to address the dire vaccine gap.”\n\nOn a conference call with reporters on Monday, senior Biden administration officials said that in addition to the money pledged to the international vaccine initiative, known as Covax, the administration intended to spend $11.5 billion, appropriated by Congress as part of the $1.9 trillion stimulus package, on helping other countries fight the pandemic and administer vaccines."}, {"Article Image": "https://static01.nyt.com/images/2021/04/21/multimedia/00xp-jane-austen-1/merlin_90406354_3e65ecb7-7f9c-4b6a-80be-332d5fb878d7-facebookJumbo.jpg", "Article's Title": "A Jane Austen Museum Wants to Discuss Slavery. Will Her Fans Listen?", "Article's Text": "“The slave trade and the consequences of Regency-era colonialism touched every family of means during the period. Jane Austen’s family were no exception,” Ms. Dunford said, adding, “This is just the start of a steady and considered process of historical interrogation.”\n\nThe reaction from the British tabloids was swift. The Express called the decision “woke madness,” while The Daily Mail said it was “a revisionist attack” and a “BLM-inspired interrogation” of the author’s love for drinking tea. The museum then issued a statement saying that it “never had any intention to interrogate Austen, her characters or her readers for drinking tea.”\n\nThe museum said visitors had increasingly asked about Austen’s connection to the slave trade, which was banned in the British Empire in 1807. “It is therefore appropriate that we share the information and research that already exists on her connections to slavery and its mention in her novels,” the museum’s statement said.\n\nIn a statement to The New York Times on Tuesday, Ms. Dunford said the museum’s role was to champion what she called Austen’s timeless genius. “The suggestion that we would do anything to bring this into disrepute is outrageous,” she said.\n\nThe museum’s plans come amid a broader examination of the legacy of the British Empire and its role in the slave trade. Last year, the statue of a 17th-century slave trader was torn down in Bristol, England, and the National Trust, a conservation charity, revealed that a third of the properties it manages had direct links to colonialism or slavery."}, {"Article Image": "https://www.thehindu.com/news/international/r9j5jf/article34427415.ece/ALTERNATES/LANDSCAPE_615/image-8", "Article's Title": "Coronavirus | Indian COVID-19 variant found in at least 17 countries, says WHO", "Article's Text": "The WHO recently listed B.1.617 — which counts several sub-lineages with slightly different mutations and characteristics — as a \"variant of interest\".\n\nThe World Health Organization said Tuesday that a variant of COVID-19 feared to be contributing to a surge in coronavirus cases in India has been found in over a dozen countries.\n\nThe U.N. health agency said the B.1.617 variant of COVID-19 first found in India had as of Tuesday been detected in over 1,200 sequences uploaded to the GISAID open-access database \"from at least 17 countries\".\n\n\"Most sequences were uploaded from India, the United Kingdom, USA and Singapore,\" the WHO said in its weekly epidemiological update on the pandemic.\n\nThe WHO recently listed B.1.617 — which counts several sub-lineages with slightly different mutations and characteristics — as a \"variant of interest\".\n\nBut so far it has stopped short of declaring it a \"variant of concern\".\n\nThat label would indicate that it is more dangerous that the original version of the virus by for instance being more transmissible, deadly or able to dodge vaccine protections.\n\nIndia is facing surging new cases and deaths in the pandemic, and fears are rising that the variant could be contributing to the unfolding catastrophe.\n\nThe explosion in infections in India — 350,000 new cases were recorded there on Tuesday alone — has driven a surge in global cases to 147.7 million.\n\nThe virus has now killed more than 3.1 million people worldwide.\n\nThe WHO acknowledged that its preliminary modelling based on sequences submitted to GISAID indicates \"that B.1.617 has a higher growth rate than other circulating variants in India, suggesting potential increased transmissibility\".\n\nIt stressed that other variants circulating at the same time were also showing increased transmissibility, and that the combination \"may be playing a role in the current resurgence in this country.\"\n\n\"Indeed, studies have highlighted that the spread of the second wave has been much faster than the first,\" the WHO said.\n\nIt highlighted though that \"other drivers\" could be contributing to the surge, including lax adherence to public health measures as well as mass gatherings.\n\n\"Further investigation is needed to understand the relative contribution of these factors,\" it said.\n\nThe UN agency also stressed that \"further robust studies\" into the characteristics of B.1.617 and other variants, including impacts on transmissibility, severity and the risk of reinfection, were \"urgently needed\"."}, {"Article Image": "https://www.thehindu.com/news/international/e2n6gn/article30647176.ece/ALTERNATES/LANDSCAPE_615/SHAHMAHMOODQURESHI", "Article's Title": "Need for equitable, affordable supply of COVID-19 vaccines for everyone: Qureshi", "Article's Text": "The video-conference was attended by the foreign ministers of Bangladesh, Nepal, Sri Lanka, Afghanistan, Pakistan and China.\n\nThere is a need to ensure equitable and affordable supply of COVID-19 vaccines for everyone to keep them safe from coronavirus, Pakistan’s Foreign Minister Shah Mahmood Qureshi said on Tuesday.\n\nTaking part in the six nation video conference led by Chinese Foreign Minister Wang Yi on joint response on COVID-19, Qureshi also said there was a need to discourage stigmatisation and insinuations on the origin of the coronavirus.\n\n“There is a need for equitable and affordable supply of COVID-19 vaccines across the world as global public good,” Mr. Qureshi said.\n\nThe video-conference was attended by the foreign ministers of Bangladesh, Nepal, Sri Lanka, Afghanistan, Pakistan and China.\n\nTalking about the conference on the joint response on COVID-19, Mr. Qureshi said that it was important for all participating countries to enhance cooperation and collaboration in areas like coronavirus pandemic, poverty alleviation and disaster relief.\n\nHe stressed that the pandemic was a common challenge and required joint efforts."}, {"Article Image": "https://static01.nyt.com/images/2021/04/27/world/27virus-briefing-thailand-mask/27virus-briefing-thailand-mask-facebookJumbo.jpg", "Article's Title": "Thailand’s prime minister is fined for not wearing a mask.", "Article's Text": "With Thailand struggling to bring its worst coronavirus outbreak under control, Bangkok made it compulsory for residents to wear masks in public beginning on Monday. One of the first to break the new rule?\n\nThe country’s prime minister, Prayuth Chan-ocha, who was seen maskless at a government meeting in a photo published on his official Facebook page.\n\nAs a first-time offender, he agreed to pay a fine of about $190. Bangkok’s governor, Aswin Kwanmuang, came around with top police officials on Monday to help collect it.\n\n“I informed the prime minister this was a violation of the rules,” the governor wrote on Facebook. The photograph was removed from the prime minister’s Facebook page."}, {"Article Image": "https://static01.nyt.com/images/2021/04/27/world/27burkinafaso01/merlin_164264031_b72142a2-254e-4e65-b342-da28ab952745-facebookJumbo.jpg", "Article's Title": "2 Spanish Journalists and an Irish Ranger Killed in Burkina Faso Ambush", "Article's Text": "Six people were injured in the ambush on the convoy on Monday, and a Burkinabe soldier was still missing on Tuesday evening. The fate of the others in the convoy, and the identities of those who carried out the killings, remained unclear.\n\nThe eastern parts of Burkina Faso, particularly around the city of Fada-Ngourma near the reserve where the journalists were abducted, have been a perilous area because of the armed groups operating there over the past few years.\n\nLast year was the deadliest for militant Islamist violence in the region, according to the Africa Center for Strategic Studies, a U.S. Defense Department research institution. About 4,250 people were killed — a 60 percent increase over 2019 — with the Islamic State in the Greater Sahara linked to more than half of the deaths.\n\nOn Tuesday, the United Nations said a record 29 million people were in need of humanitarian assistance and protection in six countries of the region, among them Burkina Faso and Chad, where the killing of the president, Idriss Déby, last week could further destabilize the region.\n\nMr. Déby, who had a poor human rights record, was a key figure in regional efforts to fight off Islamist insurgents in alliance with French and African forces. About 1,200 Chadian troops were deployed this year in the border area between Burkina Faso, Mali and Niger, where Al Qaeda in the Islamic Maghreb has made significant strides.\n\nIn Burkina Faso, violence has fueled a fast-growing displacement crisis, with more than a million people fleeing their homes since 2019, according to the United Nations’ humanitarian affairs body. Three million people are in need of humanitarian assistance, in a country with a population of 20 million.\n\nIn addition to violence from militants, Burkina Faso’s military has killed growing numbers of civilians, sometimes in proportions similar to those killed by Islamic insurgents, according to rights groups and analysts."}, {"Article Image": "https://www.thehindu.com/news/international/uidhpd/article34428133.ece/ALTERNATES/LANDSCAPE_615/VirusOutbreak", "Article's Title": "Covaxin found to neutralise 617 variant of COVID-19, says Dr. Fauci", "Article's Text": "Developed by Bharat Biotech in partnership with National Institute of Virology and the Indian Council of Medical Research, trial results have showed that Covaxin has an efficacy of 78%.\n\nCovaxin, India’s home-grown COVID-19 vaccine, has been found to neutralise the 617 variant of the deadly virus, White House chief medical adviser and America’s top pandemic expert Dr. Anthony Fauci said here.\n\nDr. Fauci was speaking to reporters during a conference call on Tuesday.\n\n“This is something where we’re still gaining data on a daily basis. But the most recent data, was looking at convalescent Sera of COVID-19 cases and people who received the vaccine used in India, the Covaxin. It was found to neutralise the 617 variants,” he said.\n\n“So, despite the real difficulty that we’re seeing in India, vaccination could be a very, very important antidote against this,” Dr. Fauci added.\n\nThe New York Times on Tuesday said Covaxin works by teaching the immune system to make antibodies against the SARS-CoV-2 coronavirus. The antibodies attach to viral proteins, such as the so-called spike proteins that stud its surface.\n\nDeveloped by Bharat Biotech in partnership with National Institute of Virology and the Indian Council of Medical Research, Covaxin was approved for emergency use on January 3. Trial results later showed the vaccine has an efficacy of 78%.\n\nResponding to a question, Dr. Andy Slavitt, White House COVID-19 Response Senior Advisor, said that a strike team from the Center for Disease Control and Prevention is headed over to India to help coordinate this response.\n\n“We are making sure that we are locating some of the raw materials necessary to create more vaccines in India, which I think is going to be an important help there,” he said.\n\n“We stand with the country of India during this very trying and tragic surge. We are working to deploy resources and supplies, including therapeutics, rapid testing kits, ventilators, PPE, and raw materials, that are needed to manufacture vaccines in India, and the CDC, which has a long history of working with and in India on public health measures, will be deploying a strike team to the country to support the public health efforts there,” Dr. Slavitt said.\n\nGiven the strong portfolio of approved, highly effective and safe vaccines here in the United States, the administration is looking at options to share AstraZeneca vaccines with other countries as they become available.\n\nThis should amount to around 60 million doses or so over the next two months, he added.\n\n“The AstraZeneca vaccine is highly safe and effective, and approved in many parts of the world, and since it is not approved for use in the U.S., we do not need to use the AstraZeneca vaccine here during the next few months,” Dr. Slavitt said.\n\n“We have sufficient supply of vaccines from Pfizer, Moderna, and Johnson & Johnson to accommodate our needs in the U.S.,” he added."}, {"Article Image": "https://static01.nyt.com/images/2021/04/27/world/27Israel01/27Israel01-facebookJumbo.jpg", "Article's Title": "Rights Group Hits Israel With Explosive Charge: Apartheid", "Article's Text": "Mr. Regev added: “To allege that Israeli policies are motivated by racism is both baseless and outrageous, and belittles the very real security threats posed by Palestinian terrorists to Israeli civilians — whose fundamental human rights to live in freedom and security are callously ignored by H.R.W.”\n\nIsrael’s ambassador to the United States, Gilad Erdan, said the report bordered on anti-Semitism.\n\n“When the authors of the report cynically and falsely use the term apartheid, they nullify the legal and social status of millions of Israeli citizens, including Arab citizens, who are an integral part of the state of Israel,” he said.\n\nHuman Rights Watch does not draw a direct comparison with the notorious South African regime that segregated and subjugated people according to their skin color. Instead, it cites international laws that define apartheid as a crime against humanity in which one racial group dominates another through intentional, systematic and inhumane acts of oppression. Race is interpreted broadly to apply to ethnic groups.\n\nWhile Human Rights Watch argues that these policies persist, to varying degrees, across the West Bank, the Gaza Strip and within the state of Israel itself, it points to the occupied West Bank as exhibit A. There, the group says, Israel has created a two-tier system with some Palestinians living under military rule and Israeli settlers under a civil legal system with greater freedoms, an inequity that H.R.W. said “amounts to the systematic oppression required for apartheid.”\n\nIsrael fully governs over 60 percent of the West Bank, and uses checkpoints and a permit system to regulate Palestinian movement between areas of nominal Palestinian self-rule and to Israel. H.R.W. also cites “the forcible transfer of thousands of Palestinians out of their homes, denial of residency rights to hundreds of thousands of Palestinians and their relatives, and the suspension of basic civil rights to millions of Palestinians” as policies that meet the definition of apartheid.\n\n“These policies, which grant Jewish Israelis the same rights and privileges wherever they live and discriminate against Palestinians to varying degrees wherever they live, reflect a policy to privilege one people at the expense of another,” Mr. Roth said."}, {"Article Image": "https://static01.nyt.com/images/2021/04/28/us/28-EUROPE-BRIEFING-NL-promo/merlin_186835764_14052ff3-baf6-42c3-8645-2ce46aefffe5-facebookJumbo.jpg", "Article's Title": "Your Wednesday Briefing", "Article's Text": "How Europe sealed its Pfizer deal\n\nThe E.U. will finalize a deal this week for 1.8 billion doses of the Pfizer-BioNTech Covid-19 vaccine, after a striking alignment of personal diplomacy, political survival and corporate hustle.\n\nFor a month, Ursula von der Leyen, president of the European Commission, exchanged texts and calls with Albert Bourla, chief executive of Pfizer. Then, finally, a breakthrough: Pfizer might have more doses it could offer the bloc — much more. And the E.U. would be thrilled to have them.\n\nAlthough many other leaders were also in talks with Pfizer, Bourla said he and von der Leyen had “developed a deep trust, because we got into deep discussions.” He added: “She knew details about the variants. She knew details about everything. So that made the discussion way more engaged.”\n\nDetails: The contract will permit the E.U. to resell or donate the vaccines to partners, empowering the bloc to conduct vaccine diplomacy and to support struggling efforts to immunize people in poorer countries."}, {"Article Image": "https://static01.nyt.com/images/2021/04/28/us/28virus-briefing-germany-1/28virus-briefing-germany-1-facebookJumbo.jpg", "Article's Title": "Germany looks into Covid deniers’ links with the far right.", "Article's Text": "The German domestic intelligence agency is keeping close tabs on a group of coronavirus deniers, who, in their protests against restrictions and tendency to believe in conspiracy theories, have found common cause with far-right extremists.\n\nGovernment officials said the movement’s close ties to extremist organizations, such as the “Reich citizens” — or “Reichsbürger,” as they are known in German, referring to a group that refuses to accept the legitimacy of the modern German state — were troubling. Many of the coronavirus deniers say they also believe in QAnon conspiracy theories, and protesters are frequently seen holding signs with anti-Semitic tropes. A number of journalists have been attacked while covering the demonstrations.\n\nA spokesman for the Interior Ministry said in a statement, “Our basic democratic order, as well as state institutions such as parliaments and governments, have faced multiple attacks since the beginning of the measures to contain the Covid-19 pandemic.” Several regional intelligence agencies have already been observing participants in the movement, he added.\n\nThe group of deniers, which started as a fringe movement last spring, has grown into a coordinated effort that organizes mass demonstrations across Germany. The rallies occasionally turn aggressive, and many have ended in scuffles with law enforcement officers."}, {"Article Image": "https://static01.nyt.com/images/2021/04/28/world/28safrica01/28safrica01-facebookJumbo.jpg", "Article's Title": "South African President Appears Before Corruption Investigators", "Article's Text": "JOHANNESBURG — Three years ago, amid a flurry of corruption scandals that rocked South Africa, President Cyril Ramaphosa assumed power on promises to root out graft and restore public confidence in the governing party, the African National Congress.\n\nBut over the past year, those efforts have been threatened by a brazen show of defiance from his predecessor, Jacob Zuma, who has snubbed a commission investigating graft during his tenure, refused to appear before the country’s highest court and lobbed attacks on its judges.\n\nMr. Ramaphosa appeared before corruption investigators himself on Wednesday to account for his party’s scandals and sought to reinforce his vision for a corruption-free A.N.C. His appearance sent a message to a disillusioned nation: No one in South Africa — even a sitting president — is above the law.\n\n“When I was confirming that I would be appearing, I happened to be talking to one of my colleagues who is also a head of state,” Mr. Ramaphosa said in his opening statement. “His reaction was, ‘Ah, how can you do that as head of state?’ I said: ‘This is how our democracy works.’”"}, {"Article Image": "https://static01.nyt.com/images/2021/04/26/climate/26CLI-SNOWMELT1/26CLI-SNOWMELT1-facebookJumbo.jpg", "Article's Title": "What Covid and Clear Skies Meant to Drinking Water for 300 Million", "Article's Text": "Cleaner skies over South Asia that resulted from pandemic lockdowns last year likely affected the timing of snowmelt in the Indus River basin of Pakistan and India, researchers reported on Monday.\n\nThe lockdowns cut emissions of soot and other pollutants, as people drove less and the generation of electricity, largely from coal, was reduced. That meant less soot was deposited on snow, where it absorbs sunlight, emits heat and causes faster melting.\n\nThe cleaner snow in 2020 reflected more sunlight and did not melt as fast, the researchers said. In all, that delayed runoff into the Indus River of more than than one and a half cubic miles of melt water, they calculated, similar to the volume of some of the largest reservoirs in the United States."}, {"Article Image": "https://static01.nyt.com/images/2021/04/27/nyregion/27virus-briefing-NY-walk-in1/merlin_186101916_c3e7145c-12d2-41df-a4dc-1109e06b5991-facebookJumbo.jpg", "Article's Title": "Any eligible adult in New York will be able to walk in for vaccination at state-run sites.", "Article's Text": "All state-run mass coronavirus vaccination sites in New York will allow anyone 16 or older to walk in without an appointment and get their first dose, beginning on Thursday, Gov. Andrew M. Cuomo announced on Tuesday.\n\nWalk-in vaccinations will be available at state-run sites in New York City, like the Javits Center in Manhattan and Yankee Stadium in the Bronx, as well as on Long Island and in upstate cities like Albany and Syracuse, the governor said.\n\nSecond doses will still be given by appointment, which will be scheduled after the first dose is administered.\n\n“Just show up, and roll up your sleeve, and the mass vaccination sites have the capacity to handle it,” Mr. Cuomo said at a news conference on Tuesday."}, {"Article Image": "https://static01.nyt.com/images/2021/04/28/world/28VIRUS-BRIEFING-OXYGEN/28VIRUS-BRIEFING-OXYGEN-facebookJumbo.jpg", "Article's Title": "Their father was dying, so two brothers in India went on a desperate hunt for oxygen.", "Article's Text": "“I don’t want to die,” he said, grasping her hand.\n\nOn Sunday evening, four days after he had tested positive, his sons stopped outside an oxygen refill shop in southern Delhi. A man stepped forward and offered to help. Relieved, Anikat and Mukul prepared to hand over the money their mother had given them: 10,000 rupees, about $135, the standard rate for a cylinder.\n\n“Sixty thousand,” the man said.\n\nThe young men were stunned. That was nearly as much as their father earned in a year.\n\n“But do you have a choice?” Anikat Saha said. “What do you do when your patient is dying?”\n\nSome in Delhi say they have paid at least 10 times the usual price for oxygen, and the news media have carried reports of cylinders being looted from hospitals. A Delhi court on Tuesday said that the local government had failed to curb a mushrooming black market and described those hoarding supplies as “vultures.”\n\n“When hundreds of people die over something as basic as medical oxygen, it is a massive governance failure,” said Asim Ali, a research scholar at the Center for Policy Research, a think tank in New Delhi.\n\nThe brothers spoke to their mother, who made desperate calls to neighbors and relatives in Assam, their father’s home state. In the end, they did not have to pawn her gold jewelry: They scraped together the money and carried the cylinder away on their motorbike.\n\nAt home, they couldn’t immediately figure out how to connect their father to the oxygen supply. By the time they got it to work, the oximeter on his finger showed his blood oxygen level dropping below 50 — dangerously low. For several hours, he drew shallow breaths through the tube.\n\nBut then his eyes closed and his body lay still.\n\nThey called an ambulance and Mrs. Devi rode with her husband to a hospital where they were told they might find a bed. They arrived to find a line of ambulances waiting outside with patients. Mr. Saha died before he could be admitted."}, {"Article Image": "https://www.thehindu.com/news/international/mde5xw/article29871613.ece/ALTERNATES/LANDSCAPE_615/03IN-SAUDI-ARAMCOIPO", "Article's Title": "Talks underway to sell 1% of Saudi Aramco to foreign firm: Mohammed bin Salman", "Article's Text": "The Prince neither named the company nor the country\n\nSaudi Arabia is in discussions to sell 1% of oil giant Aramco to a foreign energy firm, the kingdom's Crown Prince said in a television interview broadcast Tuesday.\n\n\"There is a discussion on the acquisition of 1% (of Aramco) by one of the world's leading energy companies, and this will be a very important deal to boost Aramco's sales in that country,\" Crown Prince Mohammed bin Salman said.\n\nThe Prince neither named the company nor the country.\n\nAramco previously sold a sliver of its shares on the Saudi bourse in December 2019, generating $29.4 billion in the world's biggest initial public offering.\n\nThe latest announcement underscores how Saudi Arabia is seeking to monetise its energy assets to generate revenue for an ambitious effort to diversify the oil-reliant economy.\n\nEarlier this month, Aramco said it had struck a $12.4 billion deal to sell a minority stake in a newly formed oil pipeline business to a consortium led by U.S.-based EIG Global Energy Partners.\n\nAramco faces pressure to maintain hefty dividend payments to the Saudi government, its biggest shareholder, despite posting consecutive falls in profits since it began disclosing earnings in 2019.\n\nLast month, Aramco posted a 44.4% slump in 2020 net profit, piling pressure on government finances as Riyadh pursues its multi-billion dollar projects to diversify the economy.\n\nThe company's debt has climbed as Saudi Arabia, the world's biggest crude exporter, was hammered last year by the double whammy of low prices and sharp cuts in production triggered by the coronavirus pandemic."}, {"Article Image": "https://www.thehindu.com/static/theme/default/base/img/og-image.jpg", "Article's Title": "Fifteen die in north Burkina Faso attacks: local source", "Article's Text": "A security source confirmed a \"series of attacks\" and reported casualties but gave no figures\n\nGunmen killed at least 15 people in an overnight raid on several villages in northern Burkina Faso, an elected local official said Tuesday.\n\n\"Armed individuals carried out a murderous raid on Monday on villages and hamlets in the Seytenga area killing about 15 people,\" the official, who asked not to be named, told AFP from the nearby major Sahel town of Dori, close to Niger.\n\nHe said Yatakou village was the first to be attacked and \"at least 10 people died\" there while five more were killed at Sofokel.\n\nMost of the dead were men, he added.\n\nA security source confirmed a \"series of attacks\" and reported casualties but gave no figures.\n\nTroops have been despatched to secure the area and supervise the removal of the bodies, the source said.\n\nLocal people said the bloodshed had led residents to flee the Seytenga villages for Dori, 40 kilometres (25 miles) away.\n\nThe attacks came after three European journalists — two Spanish and one Irish — died on Monday in an attack on an anti-poaching patrol in the east of the west African nation.\n\nOne of the poorest countries in the world, Burkina Faso is struggling with a ruthless insurgency by armed Islamists who swept in from neighbouring Mali in 2015.\n\nJihadist groups — some affiliated to Al-Qaeda and others to the Islamic State group — have launched increasing numbers of attacks in the country.\n\nMore than 1,300 people have died and over a million have fled their homes."}, {"Article Image": "https://static01.nyt.com/images/2021/04/26/world/00virus-india-dispatch-promo/00virus-india-dispatch-1-facebookJumbo.jpg", "Article's Title": "‘This Is a Catastrophe.’ In India, Illness Is Everywhere.", "Article's Text": "NEW DELHI — Crematories are so full of bodies, it’s as if a war just happened. Fires burn around the clock. Many places are holding mass cremations, dozens at a time, and at night, in certain areas of New Delhi, the sky glows.\n\nSickness and death are everywhere.\n\nDozens of houses in my neighborhood have sick people.\n\nOne of my colleagues is sick.\n\nOne of my son’s teachers is sick.\n\nThe neighbor two doors down, to the right of us: sick.\n\nTwo doors to the left: sick.\n\n“I have no idea how I got it,” said a good friend who is now in the hospital. “You catch just a whiff of this…..” and then his voice trailed off, too sick to finish."}, {"Article Image": "https://www.thehindu.com/static/theme/default/base/img/og-image.jpg", "Article's Title": "Israeli military says it downed Hezbollah drone", "Article's Text": "There was no immediate comment from Hezbollah or the Lebanese government\n\nThe Israeli military Tuesday said it shot down a drone belonging to Lebanon's Hezbollah militant group that entered Israeli airspace.\n\nIn a short statement, the military said it had monitored the aircraft throughout the incident. It also said troops found the remnants of a Hezbollah drone shot down several weeks earlier after crossing into Israeli airspace from Lebanon.\n\nThere was no immediate comment from Hezbollah or the Lebanese government.\n\nIsrael and Hezbollah are bitter enemies that fought a month-long war in 2006. A U.N.-brokered cease-fire has largely kept the border area quiet since then, but the sides have had several small clashes in the years since, most recently last summer.\n\nIn November, the military also said it downed a Hezbollah drone that entered Israeli airspace.\n\nThe army said it would “continue to operate in order to prevent any attempt to violate Israeli sovereignty.”"}, {"Article Image": "https://static01.nyt.com/images/2021/04/28/lens/28ambriefing-promo/merlin_124922720_46f62e21-e87c-4620-acf7-55802d2b9b63-facebookJumbo.jpg", "Article's Title": "A Bipartisan Schools Movement", "Article's Text": "Or as Rahm Emanuel, a Democrat and former mayor of Chicago who expanded pre-K and community-college enrollments, told me: “High school just doesn’t cut it anymore. It was good for the industrial age. For the information age, you’ve got to go to community college.” Emanuel added, “It has bipartisan support.”\n\nBiden goes to Capitol Hill\n\nTonight, President Biden will go before Congress to lay out his agenda, and an expansion of federal funding for pre-K and community college will be a central part of it. Despite the recent gains, both pre-K and community college remain far from universal. And Biden’s proposal is an example of how he is trying to define bipartisanship during a time when congressional Republicans are often unwilling to support almost any new federal policy.\n\nI realize that may sound like a sweeping statement about the Republican Party, but I think the facts justify it. Consider the past decade:\n\nWhen Republicans controlled the White House and Congress in 2017 and 2018, the only major legislation they passed was a tax cut, and the only other big bill that came close was a repeal of Obamacare, without a replacement.\n\nWhen Donald Trump ran for re-election, the party did not write a campaign platform.\n\nDuring Barack Obama’s presidency, and now Biden’s, Republicans have almost uniformly opposed significant legislation, be it on health care, climate change, Wall Street regulation or economic stimulus.\n\nBiden is hoping he has found one exception — infrastructure. A handful of congressional Republicans have proposed a plan for new roads and other infrastructure that is much smaller than Biden’s yet a possible basis for negotiations. Ron Klain, Biden’s chief of staff, told a group of columnists this week that he considered the offer serious and “a step in the right direction.”\n\nOn many other issues, though, there is no sign that congressional Republicans are open to compromise with Biden. Their political strategy, as Senator Mitch McConnell famously described in 2010, is to make a Democratic president look partisan and try to win the next election."}, {"Article Image": "https://static01.nyt.com/images/2021/04/25/multimedia/00XP-VACCINE-PROOF/00XP-VACCINE-PROOF-facebookJumbo.jpg", "Article's Title": "A Look at Covid-19 Vaccine ‘Passports,’ Passes and Apps Around the Globe", "Article's Text": "Isn’t the European Union also developing a system? Yes. On June 21, the E.U. is expected to introduce a certificate called a Digital Green Pass, with the aim of allowing people who have been vaccinated against the coronavirus to travel more freely. Under the proposed rules, each nation within the bloc could decide which travel restrictions, such as obligatory quarantine, to waive for Digital Green holders. But many countries, including Denmark, say they cannot afford to wait for the Digital Green Pass and are developing their own versions.\n\nIsrael\n\nImage Israel’s Green Pass app features a gif of a family headed on a trip. Credit... Isabel Kershner\n\nName of card: The Green Pass\n\nCould it get you an indoor table? Yes.\n\nHow about entry to a concert or sports game? That, too.\n\nAnything else? The pass allows you to enter many businesses, including swimming pools, gyms, theaters and wedding halls, as well as cultural events, such as concerts, sports games and religious gatherings. Having the pass may also mean that you may not have to quarantine for 10 to 14 days after international travel.\n\nHow does it work? In late February, Israel’s ministry of health began offering the Green Pass to fully vaccinated residents and individuals who have recovered from Covid-19. When booking a table at a restaurant, many of the businesses began to ask, “Do you have a Green Pass?” Israelis can print their certificates containing a QR code, download the code onto their phones or flash the app itself.\n\nWhat’s with that family? The app and other Green Pass materials feature an animated illustration of a family of three. The man is wearing shorts, a backpack and a camera around his neck, suggesting he’s on vacation. His son and wife are wearing masks, but their postures are relaxed as they pull their suitcases.\n\nAparna Nair, a professor of science history at the University of Oklahoma who maintains a collection of vaccination certificates going back to the 1820s, said that this detail was noteworthy: “They are using the design of the vaccine passport to form visual connections with life after the pandemic, essentially, the vaccine as a literal passport to the rest of the world.”"}, {"Article Image": "https://www.thehindu.com/news/international/fquu9x/article34425314.ece/ALTERNATES/LANDSCAPE_615/image-1", "Article's Title": "Coronavirus | CDC says many Americans can now go outside without a mask", "Article's Text": "For most of the past year, the CDC had been advising Americans to wear masks outdoors if they are within six feet of each other\n\nU.S. health officials say fully vaccinated Americans don't need to wear masks outdoors anymore unless they are in a big crowd of strangers, and those who are unvaccinated can go without a face covering outside in some cases, too.\n\nAlso read: Coronavirus | U.S. advises its citizens to avoid all travel to India\n\nThe Centers for Disease Control and Prevention released the updated guidance on Tuesday in yet another carefully calibrated step on the road back to normal from the coronavirus outbreak that has killed over 570,000 people in U.S.\n\nFor most of the past year, the CDC had been advising Americans to wear masks outdoors if they are within six feet of each other.\n\nThe change comes as more than half of U.S. adults have gotten at least one dose of coronavirus vaccine, and more than a third have been fully vaccinated.\n\n\"It's the return of freedom,\" said Dr. Mike Saag, an infectious disease expert at the University of Alabama at Birmingham who welcomed the change. \"It's the return of us being able to do normal activities again. We're not there yet, but we're on the exit ramp. And that's a beautiful thing.\" More people need to be vaccinated, and concerns persist about variants and other possible shifts in the epidemic. But Dr. Saag said the new guidance is a sensible reward following the development and distribution of effective vaccines and about 140 million Americans stepping forward to get their shots.\n\nThe CDC, which has been cautious in its guidance during the crisis, essentially endorsed what many Americans have already been doing over the past several weeks.\n\nThe CDC guidance says that fully vaccinated or not, people do not have to wear masks outdoors when they walk, bike or run alone or with members of their household. They also can go maskless in small outdoor gatherings with fully vaccinated people.\n\nBut from there, the CDC has differing guidance for people who are fully vaccinated and those who are not.\n\nUnvaccinated people — defined by the CDC as those who have yet to receive both doses of the Pfizer or Moderna vaccine or the one-shot Johnson&Johnson formula — should wear masks at outdoor gatherings that include other unvaccinated people. They also should keep using masks at outdoor restaurants.\n\nFully vaccinated people do not need to cover up in those situations, the CDC says.\n\nHowever, everyone should keep wearing masks at crowded outdoor events such as concerts or sporting events, the CDC says.\n\nThe agency continues to recommend masks at indoor public places, such as hair salons, restaurants, shopping centers, museums and movie theaters.\n\nDr. Babak Javid, a physician-scientist at the University of California, San Francisco, said the new CDC guidance is sensible.\n\n“In the vast majority of outdoor scenarios, transmission risk is low,” Dr. Javid said.\n\nDr. Javid has favoured outdoor mask-wearing requirements because he believes they increase indoor mask-wearing, but he said Americans can understand the relative risks and make good decisions.\n\n\"The key thing is to make sure people wear masks indoors” while in public spaces, he said.\n\nHe added: \"I'm looking forward to mask-free existence.\" \"The timing is right because we now have a fair amount of data about the scenarios where transmission occurs,” said Mercedes Carnethon, a professor and vice chair of preventive medicine at Northwestern University's Feinberg School of Medicine in Chicago.\n\nWhat's more, she said, “the additional freedoms may serve as a motivator” for people to get vaccinated."}, {"Article Image": "https://www.thehindu.com/news/international/sjh7pc/article34425963.ece/ALTERNATES/LANDSCAPE_615/image-2", "Article's Title": "Coronavirus | U.S. rushing medical assistance to India to combat COVID-19 surge: Joe Biden", "Article's Text": "Fully vaccinated people can eat, walk or attend small gatherings outside without a mask — as long as they are not at crowded events.\n\nPresident Joe Biden on Tuesday said the U.S. was rushing a whole series of help to India, including remdesivir and other life-saving drugs, to help the country combat the massive surge in COVID-19 cases.\n\nAlso read: India likely to get major chunk of U.S. vaccine exports\n\nSpeaking to reporters a day after he spoke to Prime Minister Narendra Modi, Mr. Biden noted that when America was facing a major health crisis, India helped his country by sending key drugs.\n\nAlso read: Coronavirus | In telephonic conversation with Modi, Biden conveyed solidarity with India\n\n\"I spoke at length with Prime Minister Modi. We are sending immediately a whole series of help that it needs, including providing Remdesivir & other drugs that can deal with disease and help recovery,\" Mr. Biden said.\n\n\"We are sending actual mechanical parts that are needed for the machinery they have to build a vaccine. I have also discussed with him (Modi) when we will be able to send actual vaccines to India which will be my intention to do,\" he said.\n\n\"When we were in a bind at the very beginning (of the COVID-19 pandemic), India helped us,\" he said, referring to India, the largest producer of hydroxychloroquine, lifting the ban on the export of the medicine to the U.S. after then President Donald Trump spoke to Mr. Modi on phone last year.\n\nOn Monday, Mr. Biden assured Mr. Modi that the United States and India will work closely together in the fight against COVID-19.\n\nAlso read: Coronavirus | U.S. leads international support to enable India to counter the COVID-19’s deadly second wave\n\nIndia is currently struggling with a second wave of the pandemic with more than 3,00,000 daily new coronavirus cases being reported in the past few days, and hospitals are reeling under a shortage of medical oxygen and beds.\n\nMr. Biden pledged America’s steadfast support for the people of India who have been impacted by the recent surge in COVID-19 cases.\n\nIn response, the United States is providing a range of emergency assistance, including oxygen-related supplies, vaccine materials, and therapeutics.\n\nPrime Minister Modi expressed appreciation for the strong cooperation between both countries. The two leaders resolved that the United States and India will continue to stand shoulder-to-shoulder in the effort to protect our citizens and the health of our communities, the White House said in a readout of the telephonic conversation between Mr. Biden and Mr. Modi."}, {"Article Image": "https://static01.nyt.com/images/2021/04/26/world/26virus-india-aid1/26virus-india-aid1-facebookJumbo.jpg", "Article's Title": "Amid Second Covid Wave, World Responds to India’s Distress Call", "Article's Text": "NEW DELHI — Oxygen generators from Saudi Arabia and the United Arab Emirates. Raw material for coronavirus vaccines from the United States. Millions in cash from companies led by Indian-American businessmen.\n\nAs a second wave of the pandemic rages in India, the world is coming to the rescue.\n\nBut it is unlikely to plug enough holes in India’s sinking health care system to fully stop the deadly crisis that is underway, and the health emergency has global implications for new infections worldwide, as well as for countries relying on India for the AstraZeneca vaccine.\n\n“It’s a desperate situation out there,” said Dr. Ramanan Laxminarayan, the founder and director of the Center for Disease Dynamics, Economics and Policy, adding that donations will be welcome, but may make only a “limited dent on the problem.”\n\nIn the early months of 2021, the government of Prime Minister Narendra Modi acted as if the coronavirus battle had been won, holding huge campaign rallies and permitting thousands to gather for a Hindu religious festival."}, {"Article Image": "https://www.thehindu.com/news/international/v0hlev/article34426373.ece/ALTERNATES/LANDSCAPE_615/image-5", "Article's Title": "Coronavirus | Brazil regulator rejects Sputnik vaccine; Russia cries foul", "Article's Text": "The agency, known as Anvisa, said there were faults in all clinical studies of the vaccine's development, as well as absent or insufficient data\n\nBrazil's health regulator cited safety concerns while rejecting several states' requests to import almost 30 million doses of Russia's Sputnik V vaccine, prompting criticism from the Russian government.\n\nThe five-person board of the Brazilian Health Regulatory Agency unanimously decided late Monday that consistent and trustworthy data required was lacking for approval of the requests from 10 States, according to a statement. Another four States and two cities have also sought authorization to import the vaccine.\n\nThe agency, known as Anvisa, said there were faults in all clinical studies of the vaccine's development, as well as absent or insufficient data.\n\nThe agency statement said that analysis indicated that the adenovirus on which the vaccine is based has the capacity to replicate, which could cause sickness or death, particularly among those with low immunity or respiratory problems. The Russian fund overseeing the vaccine's marketing globally denied the claim.\n\n“We will never permit, without the existence of due proof required, millions of Brazilians to be exposed to products without the due proof of their quality, safety and efficacy or, at minimum, in the face of the grave situation that we're living through, a favorable cost-benefit relationship,” Anvisa's president Antônio Barra Torres said in the statement.\n\nAnvisa's decision doesn't affect a separate request from Brazilian company Uniao Quimica for emergency use authorization of Sputnik V produced locally, according to an emailed statement from Anvisa's press office.\n\nStill, it came as a blow to Russia's efforts to promote worldwide adoption of the vaccine, whose exports have helped it regain diplomatic footholds in countries where relationships had languished.\n\n“We need additional information on what this lack (of data) means, because there's already more than enough data,\" Kremlin's spokesperson Dmitry Peskov told reporters in a daily briefing.\n\n“The contacts (with Brazil) will continue. If some data is lacking, it will be provided,” he added.\n\nThe Russian Direct Investment Fund said in a three-page statement that “no replication-competent adenoviruses were ever found in any of the Sputnik V vaccine batches produced.” It was also more pointed in its criticism, saying that dozens of national health regulators have approved Sputnik V and Anvisa's decision was “of a political nature and has nothing to do with the regulator's access to information or science.” The fund pointed to the U.S. Department of Health and Human Services' 2020 annual report, which said in a section titled “Combatting malign influences in the Americas” that it had convinced Brazil to not to buy the Russian shot.\n\nThe U.S. Embassy in Brazil has denied exerting any pressure regarding vaccines approved by Brazil's health regulator, and Brazil's foreign ministry has denied being contacted.\n\nDaniel Dourado, a Brazilian doctor and lawyer who is a researcher at the University of Sao Paulo, said on Twitter that he doubted politics played any role in Anvisa's decision, as that would have required its directors to lie in their analysis. He added that, while the state governors' hurry is understandable, Anvisa is correctly fulfilling its duty.\n\nBrazil hasn't lived up to its proud tradition of mass vaccination programs in this pandemic, with the Health Ministry ignoring early opportunities to purchase shots and facing shortages locally of vaccines it did acquire. The country has the world's second-highest death toll, and will surpass the milestone of 400,000 deaths this week. The majority of that staggering tally came in just the last four months.\n\nOne of Anvisa's directors, Cristiane Rose Jourdan Gomes, acknowledged the sensitivity of its decision since making available an array of vaccines is a priority in fighting COVID-19. She said she hopes Sputnik V can bring its information in line with requirements.\n\nDenise Garrett, vice president of the Sabin Vaccine Institute that advocates for expanding global vaccine access, and who is Brazilian herself, also voiced support of Anvisa on Twitter.\n\n“There is no way to approve Sputnik V with the information available at the moment,” she said."}, {"Article Image": "https://www.thehindu.com/news/international/s3zbxv/article34426142.ece/ALTERNATES/LANDSCAPE_615/image-3", "Article's Title": "U.S. orders big drawdown at Kabul embassy as troops leave", "Article's Text": "The department said it had instructed all personnel to depart unless their jobs require them to be physically located in Afghanistan.\n\nThe State Department on Tuesday ordered a significant number of its remaining staff at the US Embassy in Kabul to leave Afghanistan as the military steps up the pullout of American troops from the country.\n\nThe department said it had instructed all personnel to depart unless their jobs require them to be physically located in Afghanistan. The order was not specific as to the number of people affected, but it went well beyond the usual curtailment of staffers for security and safety reasons. Such orders normally apply only to non-essential personnel.\n\nIn an updated travel advisory for Afghanistan, the department said it had ordered the departure of all U.S. government employees “whose functions can be performed elsewhere.” It also said American citizens should not travel to Afghanistan and those there who want to depart “should leave as soon as possible on available commercial flights.” The embassy in Kabul is heavily dependent on the U.S. military for security, and staff drawdowns had been been underway since the Trump administration had announced last year that American troops would be withdrawn from Afghanistan by May 1.\n\nThe Biden administration extended that deadline until September 11, the 20th anniversary of the 2001 terrorist attacks, but has accelerated the pullout.\n\nGen. Kenneth McKenzie, head of the US Central Command, said Tuesday the administration remains committed to keeping a functioning embassy in Kabul.\n\n“It is our intention to maintain an embassy in Afghanistan going forward. But we'll have a very, very minimal military presence there — that which is strictly necessary to defend the embassy,” he said in remarks to the American Enterprise Institute.\n\nThe State Department order came just two days after Gen. Austin Miller, America's top general in Afghanistan, said the U.S. military had begun closing down operations in the country and that Afghanistan's security forces had to be ready to take over.\n\nWhile the official start to the withdrawal of Washington's 2,500 to 3,500 troops and NATO's 7,000 allied forces is May 1, Miller said the pullout had already begun.\n\nThe US military and NATO will be shipping some military equipment out of Afghanistan while deciding what would remain behind with the Afghan Defense and Security Force, he said.\n\nIn February last year, the US military began closing its smaller bases. In mid-April, the Biden administration announced that the final phase of the withdrawal would begin May 1 and be completed before September 11."}, {"Article Image": "https://static.toiimg.com/thumb/msid-82292616,width-1070,height-580,imgsize-1564895,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "French President Emmanuel Macron to update France on Covid situation this Friday", "Article's Text": "PARIS: French President Emmanuel Macron will deliver an update on Friday on how the Covid-19 restrictions will progressively be relaxed in the country, Prime Minister Jean Castex said on Wednesday.\"The epidemic situation continues to improve at a regular pace. Virus circulation remains high but is on a real downward trend even though its impact on hospitalisation is limited notably on the number of people in intensive care units,\" Castex told reporters after a meeting of the French cabinet. France 's main Covid-19 indicators all showed some signs of improvement on Tuesday, with the seven-day moving of daily new infections falling to 27,856, standing below the 28,000 for the first time since more than a month."}, {"Article Image": "https://static.toiimg.com/thumb/msid-82290605,width-1070,height-580,imgsize-785488,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "Pfizer vaccine: UK regulator sees no heart inflammation concerns from Pfizer Covid shot", "Article's Text": "LONDON: There are no new safety concerns around the Pfizer Covid-19 vaccine and heart inflammation based on the rollout of the shot in Britain , the UK MHRA medicine regulator said on Wednesday, after cases of the condition in Israel.\"The MHRA is as aware of the reports of myocarditis under investigation in Israel. Based on our experience and safety monitoring in the UK, there is currently no new safety concerns raised regarding myocarditis,\" a MHRA spokeswoman said.The comment echoed the US Centers for Disease Control and Prevention CDC ) which said it had not seen a link between the shot and heart inflammation."}, {"Article Image": "https://static.toiimg.com/thumb/msid-82292054,width-1070,height-580,imgsize-1331701,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "BioNTech chief: Europe will reach herd immunity by August", "Article's Text": "BERLIN: Europe can achieve herd immunity against the coronavirus within the next four months, the head of German pharmaceutical company BioNTech , which developed the first widely approved Covid-19 vaccine with US partner Pfizer , said Wednesday.While the exact threshold required to reach that critical level of immunization remains a matter of debate, experts say a level above 70% would significantly disrupt transmission of the coronavirus within a population.\"Europe will reach herd immunity in July, latest by August,\" Ugur Sahin , BioNTech's chief executive, told reporters.His company's vaccine makes up a large share of the doses administered in Europe and North America , where it is more commonly known as the Pfizer shot.Sahin said data from people who have received the vaccine show that the immune response gets weaker over time, and a third shot will likely be required.Studies show the efficacy of the BioNTech/Pfizer vaccine declines from 95% declines to about 91% after six months, he said.\"Accordingly, we need a third shot to get the vaccine protection back up to almost 100% again\" Sahin said. He suggested this should be administered 9-12 months after the first shot.\"And then I expect it will probably be necessary to get another booster every year or perhaps every 18 months again,\" he said."}, {"Article Image": "https://static.toiimg.com/thumb/msid-82280735,width-1070,height-580,imgsize-477467,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "Citing 'stunning progress' on coronavirus, Biden lifts outdoor mask guidelines", "Article's Text": "Fully vaccinated people can safely engage in outdoor activities like walking and hiking without wearing masks but should continue to use face-coverings in public spaces where they are required, US health regulators and President Joe Biden said on Tuesday.The updated health advice comes as more than half of all adults in the United States have now received at least one dose of Covid-19 vaccine, according to the US Centers for Disease Control and Prevention CDC ).Biden said the new advice was a direct result of steps the country had take to fight the coronavirus.\"We’ve made stunning progress because of all of you,” Biden said, adding that Covid-19 cases are \"down dramatically.\" Deaths among senior citizens have dropped by 80%, as vaccinations have increased, he said.Wearing face masks has been considered by experts one of the most effective ways of controlling virus transmission. With most Covid-19 transmission occurring indoors, and vaccinations on the rise, the use of masks outdoors has been under public debate for weeks in the United States as Americans look to enjoy the benefits of being fully vaccinated.\"The release of these new guidelines is a first step at helping fully vaccinated Americans resume activities they had stopped doing because of the pandemic, while being mindful of the potential risk of transmitting the virus to others,\" the CDC said.New Covid-19 cases have dropped 16% in the last week as the US surpassed 140 million people having received at least one shot of authorized vaccines from Pfizer/BioNTech Moderna or Johnson & Johnson's one-dose vaccine.This was the biggest percentage drop in weekly new cases since February, according to a Reuters analysis of state and county data.SMALL OUTDOOR GATHERINGSThe agency said fully-vaccinated Americans can safely dine outdoors with friends from multiple households at restaurants and attend small outdoor gatherings with a mixture of fully vaccinated and unvaccinated people.CDC continues to recommend masking for crowded outdoor events such as parades and sporting events and indoor visits to the hair salon, shopping malls, movie theaters and houses of worship.The agency classified activities as \"red,\" \"yellow\" and \"green\" based on level of safety for unvaccinated people.It said unvaccinated people can also walk and run unmasked with household members outdoors safely and attend small outdoor gatherings with fully vaccinated family and friends.Data on whether vaccinated people can spread infection to those who did not receive their shots is limited and the CDC warned that people should evaluate risk to friends and family before going out without masks.This is an update to the CDC's guidance, which in March said people who have been fully vaccinated against Covid-19 can meet without masks indoors in small groups with others who also have been inoculated."}, {"Article Image": "https://static.toiimg.com/thumb/msid-82287647,width-1070,height-580,imgsize-502807,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "Article's Title": "Pakistan Corona Deaths: Pakistan records highest-ever deaths due to Covid-19", "Article's Text": "ISLAMABAD: Pakistan on Wednesday reported more than 200 deaths due to the Covid-19 , the highest number of fatalities in a single day, according to the official data.The death toll jumped to 17,530 after 201 fatalities were reported in the last 24 hours, according to the Ministry of National Health Services.It said that 5,214 patients were in a critical condition.The data showed that 157 people died on April 23, which broke the record of 153 deaths reported on June 20 last year. However, a new record was created within a week, showing the ferocity of the pandemic.In the last 24 hours, at least 5,292 new cases were reported, taking the national tally to 810,231.The ministry reported that another 4,678 persons were reported as having recovered in the last 24 hours, taking the number of recuperated people to 704,494.The number of active patients was 88,207.The authorities performed 49,101 tests in the last one day, registering a positivity rate of 10.78 per cent.Information minister Fawad Chaudhry on Tuesday said that due to the increasing number of deaths and spike in the positive cases, Prime Minister Imran Khan might order a lockdown of the worst-hit cities.The issue of pandemic was discussed in the Cabinet and the Prime Minister “directed that food supplies should be improved if we go for a complete lockdown,” he said.The government has already postponed examination until mid-June to arrest the spread."}, {"Article Image": "https://images.indianexpress.com/2021/04/Pramila-Jaypal.jpg", "Article's Title": "Indian-American Congresswoman Pramila Jayapal’s parents test Covid positive in India", "Article's Text": "Indian-American Congresswoman Pramila Jayapal has disclosed that both her parents, who live in India, were recently diagnosed with COVID-19 and hospitalised.\n\nJayapal said her parents contracted the disease at the start of the current surge. They are now back home and recuperating, she added.\n\nThe first-ever Indian-American Congresswoman who represents Seattle in the US House of Representatives was recently in India to meet her ailing parents.\n\n“It was rough. I’ve got to say both my parents are there. They’re 80 and 90 years old. They were both diagnosed with COVID. They both ended up in the hospital. My dad needed oxygen,” she told the media on Tuesday.\n\n“Now in retrospect, I’m almost glad — it’s a strange thing to say that it happened when it did, because they were at the beginning of the surge. I’m not sure they could have gotten into the hospital or gotten oxygen had they not been. They are thankfully home and recuperating,” Jayapal said.\n\n“They’ve made it through the roughest time. And I think the fact that they got the first dose of the vaccine four weeks before actually helped to limit their symptoms. But we saw it happening,” the Indian-American Congresswoman said.\n\nJayapal said she was there in India with her parents as the cases started ramping up.\n\n“I’m talking to my parents every day and I’m hearing, just the fear that everyone has because this is so extreme, it’s coming so quickly. We pushed very hard to make sure, and we’re grateful to the (US) President (Joe Biden) for making sure that we can get those raw materials (for the manufacture of COVID-19 vaccines in India) over there,” she said.\n\nApplauding Biden for his statement on India, Jayapal said those things are going to start happening right away.\n\nThe CDC is also sending a team to assist India. “That is immediate because there are no hospital beds. I saw it just in my little area, that hospital was completely full,” she said."}, {"Article Image": "https://i.ndtvimg.com/i/2016-12/china-police_650x400_81482953766.jpg", "Article's Title": "16 Children Among 18 Injured In Knife Attack At Kindergarten In China", "Article's Text": "A suspect was arrested by police, Xinhua added. (Representational)\n\nA man wielding a knife wounded 18 people including 16 children at a kindergarten in China's southwestern region of Guangxi on Wednesday, state-backed media said.\n\nTwo of the children were seriously injured in the attack in the city of Beiliu, state-run Xinhua news agency said.\n\nA suspect was arrested by police, Xinhua added.\n\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)"}, {"Article Image": "https://images.indianexpress.com/2021/04/RO.jpg", "Article's Title": "Hope Biden asks Pfizer CEO to allow India to develop its vaccines: Congressman Ro Khanna", "Article's Text": "Khanna, who represents Silicon Valley in the US House of Representatives, has been an ardent supporter of the move by India and South Africa at the World Trade Organization (WTO) for Trade-Related Aspects of Intellectual Property Rights (TRIPS) waiver of COVID-19 vaccines. (Express Archive)\n\nWith millions of lives at stake amid a rapid spread of COVID-19, Indian-American Congressman Ro Khanna said he hoped President Joe Biden would call the Pfizer CEO to let India produce its vaccine at least for six months or a year.\n\nKhanna, who represents Silicon Valley in the US House of Representatives, has been an ardent supporter of the move by India and South Africa at the World Trade Organization (WTO) for Trade-Related Aspects of Intellectual Property Rights (TRIPS) waiver of COVID-19 vaccines.\n\n“Allow India to develop that vaccine, and this is good in your own long-term interests. It’s good for the United States and our interests with the role with India and the rest of the world,” Khanna told the media.\n\nMajor pharma companies like Pfizer and Moderna and organisations like the US Chambers of Commerce are opposing such a move.\n\nA day earlier, US Trade Representative Katherine Tai spoke with the CEOs of Pfizer and AstraZeneca regarding the TRIPS waiver, which is slated to come up before the WTO on May 5.\n\n“I do know there are very senior people in the administration who are supportive of it. We are making the case to the White House. And my hope is that the President would at least call the Pfizer CEO and say, look, your long-term strategy in India, a huge market, just in your economic interest, at least waive it for six months or a year,” Khanna said.\n\nMicrosoft founder and eminent philanthropist Bill Gates in a media interview on Monday opposed the move.\n\nAsked about it, Khanna said, “I rarely think Bill Gates is wrong, but this is a case I hope he will engage. The point that Bill Gates made about manufacturing capacity being restricted is absolutely correct. But what I said is why not have a global fund, USD25 billion, to help with manufacturing capacity and then allow the vaccine recipes to be shared.”\n\n“You’re not going to have a lack of quality control. I think it is patronising to say that 100 other nations can’t have a regulatory process to make sure that manufacturing is safe. They can and the World Health Organization can,” he added.\n\n“No one is asking Pfizer to manufacture these vaccines, no one is saying they need to do it for free. It’s important to understand, they will get paid. They will be able to sell it. The reason they’re not doing it would be pure greed,” Khanna said.\n\nThe United States government gave a USD2 billion guarantee to Pfizer to purchase vaccines.\n\n“If it weren’t for that, Pfizer would have never been able to do what they did. Our NIH gave the IP that allowed Moderna to develop the vaccine,” he argued.\n\n“What we’re now saying is that they should share the vaccine recipe with over 100 countries who want to do the manufacturing. They’re willing to do the manufacturing themselves, they need to have contract manufacturing. Pfizer would still get paid. Moderna would still get paid. But it is just wrong, morally wrong, strategically wrong for them not to share the vaccine recipe, which was developed with US taxpayer support,” Khanna further said.\n\nHe applauded Biden for committing to help India in its fight against the virus.\n\n“But we also ultimately need to get vaccines to India. The president has said that he will release the AstraZeneca vaccine, which Americans are not going to use after it’s deemed safe. But more important is Pfizer and Moderna need to license the vaccine recipe to allow India and other countries to manufacture it,” he added."}, {"Article Image": "https://images.indianexpress.com/2021/04/fauci-1.jpg", "Article's Title": "Covaxin found to neutralise 617 variant of COVID-19: Dr Anthony Fauci", "Article's Text": "Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases. (Amr Alfiky/The New York Times via AP, Pool)\n\nCovaxin, India’s home-grown COVID-19 vaccine, has been found to neutralise the 617 variant of the deadly virus, White House chief medical adviser and America’s top pandemic expert Dr Anthony Fauci said here.\n\nFauci was speaking to reporters during a conference call on Tuesday.\n\n“This is something where we’re still gaining data on a daily basis. But the most recent data, was looking at convalescent Sera of COVID-19 cases and people who received the vaccine used in India, the Covaxin. It was found to neutralise the 617 variants,” he said.\n\n“So, despite the real difficulty that we’re seeing in India, vaccination could be a very, very important antidote against this,” Fauci added.\n\nThe New York Times on Tuesday said Covaxin works by teaching the immune system to make antibodies against the SARS-CoV-2 coronavirus. The antibodies attach to viral proteins, such as the so-called spike proteins that stud its surface.\n\nDeveloped by Bharat Biotech in partnership with National Institute of Virology and the Indian Council of Medical Research, Covaxin was approved for emergency use on January 3. Trial results later showed the vaccine has an efficacy of 78 per cent.\n\nResponding to a question, Dr Andy Slavitt, White House COVID-19 Response Senior Advisor, said that a strike team from the Center for Disease Control and Prevention is headed over to India to help coordinate this response.\n\n“We are making sure that we are locating some of the raw materials necessary to create more vaccines in India, which I think is going to be an important help there,” he said.\n\n“We stand with the country of India during this very trying and tragic surge. We are working to deploy resources and supplies, including therapeutics, rapid testing kits, ventilators, PPE, and raw materials, that are needed to manufacture vaccines in India, and the CDC, which has a long history of working with and in India on public health measures, will be deploying a strike team to the country to support the public health efforts there,” Slavitt said.\n\nGiven the strong portfolio of approved, highly effective and safe vaccines here in the United States, the administration is looking at options to share AstraZeneca vaccines with other countries as they become available.\n\nThis should amount to around 60 million doses or so over the next two months, he added.\n\n“The AstraZeneca vaccine is highly safe and effective, and approved in many parts of the world, and since it is not approved for use in the US, we do not need to use the AstraZeneca vaccine here during the next few months,” Slavitt said.\n\n“We have sufficient supply of vaccines from Pfizer, Moderna, and Johnson & Johnson to accommodate our needs in the US,” he added."}, {"Article Image": "https://images.indianexpress.com/2021/04/Untitled-design-32-1.png", "Article's Title": "Samsung’s Lee family to pay more than 12 trillion won inheritance taxes", "Article's Text": "Samsung C&T shares dropped as much as 5.5% and Samsung Life Insurance shares fell as much as 1.3% after the announcement. (Reuters)\n\nThe family of deceased Samsung Electronics chairman Lee Kun-hee said on Wednesday it will pay more than 12 trillion won ($10.78 billion) in inheritance taxes for the estate of the late patriarch. Lee, who is credited with transforming Samsung into the world’s largest smartphone and memory chip maker, died on Oct. 25.\n\nHis estate, valued at around 26 trillion won ($23.4 billion) according to local media, included shareholdings in Samsung affiliates valued at $17 billion.\n\nThe Lee family’s handling of the hefty inheritance tax bill – one of the largest ever in both Korea and globally – had been closely watched as it could have resulted in the dilution of the family’s controlling stake in Samsung.\n\nThe family’s statement on Wednesday did not give details of how Lee’s shares will be distributed among the heirs or whether any will be sold.\n\nThe family had been discussing using shares in affiliated companies as collateral for personal loans to pay part of the tax bill, a measure that would avoid the sale of their extensive Samsung holdings, Reuters reported last week, citing sources.\n\nThe family is also expected to use dividends from both their own and Lee’s shareholdings to pay the tax, analysts have said.\n\nLee’s shareholdings included a 4.18% stake in Samsung Electronics, 0.08% of Samsung Electronics preferred shares, 20.76% of Samsung Life Insurance, 2.88% of Samsung C&T, and 0.01% stake in Samsung SDS, which according to South Korean tax code valuation were worth about 18.96 trillion won ($17 billion).\n\nSamsung C&T shares dropped as much as 5.5% and Samsung Life Insurance shares fell as much as 1.3% after the announcement. Any changes in shareholding by Lee’s son and Samsung Electronics vice chairman Jay Y.\n\nLee or other family members are expected to be reported in quarterly regulatory filings. The family will make payments in instalments, as allowed by South Korea’s tax code, with one-sixth of the total tax bill to be paid first, then the rest over five years at an annual interest rate currently set at 1.2%, according to tax officials.\n\nThe family also announced it will donate 1 trillion won to public health care charities, including for the creation of a specialized infection diseases laboratory.\n\nLee’s extensive collection of antiques and paintings will be donated to the National Museum of Korea and other cultural organizations. Meanwhile, a presidential Blue House official said the office of President Moon Jae-in was not considering a pardon for Jay Y. Lee following his January conviction for bribery and other offences, and had no plans to do so.\n\nBusiness lobby groups, religious leaders and some lawmakers have said Jay Y. Lee should be freed to help South Korea secure supplies of coronavirus vaccines.\n\nHe has served about half of a 30-month sentence and last week appeared in court to face separate fraud and stock manipulation charges. ($1 = 1,111.7700 won)"}, {"Article Image": "https://images.indianexpress.com/2021/04/Untitled-design-31-1.png", "Article's Title": "Myanmar unity government tells ASEAN no talks until prisoners freed", "Article's Text": "Police confront activists holding placards and banners during a protest to support the anti-coup movement and democracy in Myanmar, near the Association of Southeast Asian Nations (ASEAN) secretariat building, ahead of the ASEAN leaders' meeting in Jakarta, Indonesia. (REUTERS/Willy Kurniawan)\n\nMyanmar’s pro-democracy unity government, which includes members of parliament ousted by the military coup, has told Southeast Asia’s regional bloc that it will not engage in talks until the junta releases all political prisoners.\n\nThe 10-member Association of Southeast Asian Nations (ASEAN) has been trying to find a path for Myanmar out of a bloody crisis triggered by the Feb. 1 coup and has called for an end to violence and talks between all sides.\n\nBut the junta has already declined to accept proposals to resolve the crisis that emerged from an ASEAN summit last weekend that was attended by Myanmar’s Senior General Min Aung Hlaing, but no-one from the civilian side.\n\nThe pro-democracy National Unity Government (NUG), formed this month by opponents of the military, said ASEAN should be engaging with it as the legitimate representative of the people.\n\n“Before any constructive dialogue can take place, however, there must be an unconditional release of political prisoners including President U Win Myint and State Counsellor Daw Aung San Suu Kyi,” the NUG prime minister, Minister Mahn Winn Khaing Thann, said in a statement.\n\nWin Myint and Suu Kyi have been detained since the coup, which the military launched as Suu Kyi’s government was preparing for a second term after sweeping a November election.\n\nThe military said it had to seize power because its complaints of fraud in the election were not being addressed by an election commission that deemed the vote fair.\n\nPro-democracy protests have taken place in cities and towns across the country since the coup. The military has cracked down with lethal force on the protesters, killing more than 750 people, an activist group says.\n\nReuters is unable to confirm the casualties as the junta has clamped down on media freedoms and journalists are among the many people who have been detained.\n\nAlarmed by the turmoil in one of its members, ASEAN held a meeting on Saturday in the Indonesian capital with the leader of the junta in a bid to press him to end the crisis.\n\nASEAN did not invite a representative of Suu Kyi’s ousted government.\n\nASEAN leaders said after the meeting they had reached a “five-point consensus” on steps to end violence and promote dialogue between the rival Myanmar sides.\n\nBut the junta later said it would give “careful consideration” to ASEAN’s suggestions, which included appointing an envoy to visit Myanmar, “when the situation returns to stability” and provided that ASEAN’s recommendations facilitated the junta’s own roadmap and served the country’s interests.\n\nActivists had earlier criticised the plan, saying it helped to legitimise the junta and fell far short of their demands.\n\nIn particular, it did not call for the release of Suu Kyi, 75, and other political prisoners. The Assistance Association for Political Prisoners advocacy group says more than 3,400 people have been detained for opposing the coup.\n\nThe NUG is largely made up of ousted members of parliament together with politicians representing ethnic minorities and pro-democracy protest leaders.\n\nThe coup has also exacerbated old conflicts the military and ethnic minority insurgents who have been battling for years for greater autonomy in frontier regions.\n\nFighting has flared between the army and Karen insurgents in the east near the Thai border, and between the army and Kachin insurgents in the north, near the border with China. Clashes have also broken out in Chin State, which is on the border with India, between anti-coup activists and security forces."}, {"Article Image": "https://images.indianexpress.com/2021/04/masks-2.jpg", "Article's Title": "US’s CDC eases outdoors mask-wearing guidelines for the vaccinated", "Article's Text": "Written by Sheryl Gay Stolberg and Roni Caryn Rabin\n\nThe Centers for Disease Control and Prevention took a major step Tuesday toward coaxing Americans into a post-pandemic world, relaxing the rules on mask wearing outdoors as coronavirus cases recede and people increasingly chafe against restrictions.\n\nThe mask guidance is modest and carefully written: Americans who are fully vaccinated against the coronavirus no longer need to wear a mask outdoors while walking, running, hiking or biking alone, or when in small gatherings, including with members of their own households. Masks are still necessary in crowded outdoor venues like sports stadiums, the CDC said.\n\nBut President Joe Biden hailed it as a landmark moment in the pandemic, wearing a mask as he approached the lectern on a warm spring day on the White House grounds — and pointedly keeping it off as he walked back into the White House when he was done.\n\n“Go get the shot. It’s never been easier,” Biden said. “And once you’re fully vaccinated, you can go without a mask when you’re outside and away from big crowds.”\n\nThe CDC stopped short of telling even fully vaccinated people that they could shed their masks outdoors altogether — citing the worrying risk that remains for transmitting the coronavirus, unknown vaccination levels among people in crowds and the still-high caseloads in some regions of the country. The guidance also cautioned even vaccinated people against going without masks in medium-size outdoor gatherings.\n\nBut even the CDC’s director, Dr. Rochelle Walensky, emphasized a more expansive interpretation, telling reporters at a White House briefing, “We no longer feel that the vaccinated people require masks outdoors,” outside “large public venues, such as concerts, stadiums and things like that.”\n\nThe order had immediate ripple effects in the states. Governors in California, New York, Louisiana, Maine and Massachusetts all relaxed outdoor mask mandates after the CDC’s announcement. In Tennessee, Gov. Bill Lee, a Republican, went much further, ignoring the federal government’s advice as he declared it was “time for celebrations and weddings and conventions and concerts and parades and proms” to take place “without limits on gathering sizes.”\n\nOn Capitol Hill, a group of Republican lawmakers who are also medical professionals released an advertisement Tuesday encouraging vaccination, in which they appeared wearing white coats with stethoscopes draped around their necks. Sen. Roger Marshall, a freshman Republican from Kansas and a medical doctor, told viewers that the reason to get vaccinated was simple: “So we can throw away our masks, and live life as free as before.”\n\nMarshall, who organized the effort, said it was based on research conducted by Frank Luntz, a Republican pollster working to reduce vaccine hesitancy among conservatives. In an interview, Luntz said Biden’s announcement was a positive step, and could give people who are reluctant to get vaccinated a reason to get their shots.\n\n“It gives them a light at the end of the tunnel,” he said. “‘Tell me when I can get rid of my mask’ is actually the language that they use, so the fact that this is a meaningful, measurable step toward returning to normal is a big deal.”\n\nAlso from NYT | Millions of Americans are skipping their second doses of COVID vaccines\n\nFor Biden, who will address Congress on Wednesday and mark his 100th day in office Thursday, the CDC’s announcement was a moment to bask in what he called the “stunning progress” Americans had made since he took office. Next week, he said, he will outline a plan “to get us to July 4 as our target date to get life in America closer to normal and begin to celebrate our independence from the virus.”\n\nThe guidelines issued Tuesday reflect some basic coronavirus math: As the number of vaccinated people goes up, cases are going down.\n\nSo far, about 43% of Americans have received at least one dose of a COVID-19 vaccine, and 29% have received both doses of the two vaccines requiring double shots. The United States is averaging around 55,000 new cases a day, a roughly 20% drop from two weeks ago, according to a New York Times database.\n\n“I know the quarantine and shutdowns throughout the pandemic have been exhausting,” Walensky said. “I know we all miss the things we used to do before the pandemic, and I know we all want to do the things we love and soon. Today is another day we can take a step back to the normalcy of before.”\n\nHer remarks, and those of the president, got a welcome reception even from some of the Biden administration’s fiercest Republican critics in Congress, many of whom have complained that coronavirus restrictions were an intrusion on their personal freedoms.\n\nSen. Ted Cruz, R-Texas, who quit wearing masks indoors after he was vaccinated, said he was “glad the CDC finally acknowledged what has been obvious for a long time, which is that wearing a mask outside is silly and not remotely justified by the science.”\n\nIn fact, the science behind the CDC’s new guidance is not comprehensive. A growing body of research indicates that the odds of the virus spreading outdoors is far lower than it is indoors, but the risk is not zero and is hard to quantify.\n\nMost if not all of the research about viral transmission outside was done before the vaccine was available, so it does not distinguish between the risk to those who are inoculated and those who are not.\n\nBut experts say that viral particles disperse quickly outdoors, meaning brief encounters with a passing walker or jogger pose very little risk of transmission.\n\n“The two main things you have going for you outdoors is that the virus rapidly becomes diluted” and decays quickly in the sunlight, said Linsey Marr, an aerosol expert at Virginia Tech, adding, “I think something like sitting at a baseball game where people are really cheek by jowl, side by side, and in front and behind each other, and there’s yelling, cheering — I would wear a mask in that situation.”\n\nOne of the paper’s authors, Dr. Nooshin Razani, an associate adjunct professor in epidemiology, biostatistics and pediatrics at University of California, San Francisco, cautioned that the low odds of transmission outdoors may simply reflect the fact that people spend little time outdoors.\n\nIn one documented case in Italy, the virus spread between joggers who were running outdoors together, side by side.\n\nThe CDC’s new guidance was issued amid growing debate over why the federal government was still recommending that people wear masks outdoors. Writing in The New England Journal of Medicine last week, Dr. Paul Sax, an infectious disease expert at Brigham and Women’s Hospital in Massachusetts, said it was time to end outdoor mask mandates.\n\nAlong with the guidelines, the CDC published a color-coded chart outlining masking recommendations for a variety of scenarios such as, “dine at an outdoor restaurant with friends from multiple households,” “visit a barber or hair salon” and “go to an uncrowded, indoor shopping center or museum.”\n\nBut Marr said that seemed overly complex: “I would have to carry around a sheet of paper — a cheat sheet with all these different stipulations.” She added: “I worry that this is not as helpful as it could be.”"}, {"Article Image": "https://c.ndtvimg.com/2020-10/jf03rmsg_samsung-chairman-lee-kunhee650_625x300_25_October_20.jpg", "Article's Title": "Samsung's Lee Family To Pay More Than 12 Trillion Won Inheritance Taxes", "Article's Text": "Lee Kun-hee's estate included shareholdings in Samsung affiliates valued at $17 billion.\n\nThe family of deceased Samsung Electronics chairman Lee Kun-hee said on Wednesday it will pay more than 12 trillion won ($10.78 billion) in inheritance taxes for the estate of the late patriarch.\n\nLee, who is credited with transforming Samsung into the world's largest smartphone and memory chip maker, died on Oct. 25. His estate included shareholdings in Samsung affiliates valued at $17 billion.\n\nThe Lee family's handling of the hefty inheritance tax bill - one of the largest ever in both Korea and globally - had been closely watched as it could have resulted in the dilution of the family's controlling stake in Samsung.\n\nThe family had been discussing using shares in affiliated companies as collateral for personal loans to pay part of the tax bill, a measure that would avoid the sale of their extensive Samsung holdings, Reuters reported last week, citing sources.\n\nThe family's statement on Wednesday did not give details of how Lee's shares will be distributed among the heirs or whether any will be sold. Besides loans, the family is expected to use dividends from both their own and Lee's shareholdings to pay the tax, analysts have said.\n\nLee's shareholdings included a 4.18% stake in Samsung Electronics, 0.08% of Samsung Electronics preferred shares, 20.76% of Samsung Life Insurance, 2.88% of Samsung C&T, and 0.01% stake in Samsung SDS, which according to South Korean tax code valuation were worth about 18.96 trillion won ($17 billion).\n\nSouth Korea's tax code allows payment in instalments, with one-sixth of the total tax bill to be paid first, then the rest over five years at an annual interest rate currently set at 1.2%.\n\nThe family also announced it will donate 1 trillion won to public health care charities, including for the creation of a specialized infection diseases laboratory. Lee's extensive collection of antiques and paintings will be donated to the National Museum of Korea and other cultural organizations.\n\n(This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)"}, {"Article Image": "https://c.ndtvimg.com/2021-02/1599ak3o_pfizer-and-biontech-_625x300_22_February_21.jpg", "Article's Title": "\"Confident\" Pfizer Shot Works Against Indian Variant: BioNTech Co-Founder", "Article's Text": "The vaccine is cleverly built, said BioNTech co-founder Ugur Sahin (File)\n\nBioNTech co-founder Ugur Sahin on Wednesday voiced confidence that the vaccine that his company jointly developed with Pfizer works against the Indian variant of the coronavirus.\n\n\"We are still testing the Indian variant, but the Indian variant has mutations that we have already tested for and which our vaccine works against, so I am confident,\" said Mr Sahin.\n\n\"The vaccine is cleverly built and I'm convinced the bulwark will hold. And if we have to strengthen the bulwark again, then we will do it, that I'm not worried about,\" he added.\n\nThe country is facing surging new cases and deaths in the pandemic, and fears are rising that the variant could be contributing to the unfolding catastrophe.\n\nThe World Health Organization has said the B.1.617 variant of Covid-19 first found in the country had as of Tuesday been detected in \"at least 17 countries\".\n\nThe health agency recently listed B.1.617 -- which counts several sub-lineages with slightly different mutations and characteristics -- as a \"variant of interest\".\n\nBut so far it has stopped short of declaring it a \"variant of concern\", which would have indicated that it is more dangerous than the original version of the virus by, for instance, being more transmissible, deadly or able to dodge vaccine protections.\n\nThe BioNTech-Pfizer vaccine was the first to win authorisation in the West, and has since been deployed in dozens of countries worldwide.\n\nGiving an update of the authorisation process in China, Mr Sahin said approval was \"very possible in July\".\n\n\"We are almost through with all questions,\" he said."}, {"Article Image": "https://c.ndtvimg.com/2021-04/7hh5irlg_joe-biden-afp_625x300_07_April_21.jpg", "Article's Title": "Joe Biden Gets Outpour Of Bipartisan Support Over Covid Help To India", "Article's Text": "American lawmakers applauded US President Joe Biden for his help to India to fight Covid\n\nIn an outpour of support during India's moment of crisis, American lawmakers applauded President Joe Biden for all help he was extending to save lives of people suffering from COVID-19, and urged him to do more.\n\n\"The US maintains a moral obligation to assist our ally India as they face severe challenges posed by COVID-19. We must take every necessary step to ensure the Indian people receive the aid and assistance they need in order to emerge from this crisis,\" Congressman Brad Sherman, a senior member of the House Foreign Affairs Committee, said on Tuesday.\n\n\"My heart goes out to the people of India and neighbouring nations as they fight an uphill battle with COVID. I'm glad that the White House is providing these life-saving vaccines, but we will need a strong, coordinated global response in the days ahead,\" Congresswoman Carolyn Boudreaux said.\n\nCongressman Michael Waltz Press said India is an essential ally in America's global competition with China. \"Its strength is important to stability in Asia and the United States. We must do what we can to help them curb their new wave of COVID cases,\" he added.\n\nCongressman Bill Foster said while America continues to make progress in battling this pandemic, the critical situation in India can't be ignored.\n\nSeveral other American lawmakers have also come out in support of India as its people battle one of the gravest challenges to its public health system.\n\n\"I am glad to see President Biden taking action to aid the people of India as they experience a devastating surge of COVID19. This will save lives and bring relief to millions of Indian-Americans who are worried about the health and safety of their loved ones in India,\" Congressman Steven Horsford said.\n\nThe United States and India have both suffered tremendously from COVID-19, and the countries will crush this virus together, he added.\n\nCongressman Joe Morell said the US has a moral obligation to help its global partners fight back against the COVID-19 pandemic.\n\n\"I stand alongside President Biden, the Congressional India Caucus, and our local Indian American community to support increased aid to India during their time of need,\" he said.\n\nSenator Robert Menendez, Chairman of the Senate Foreign Relations Committee, too came out in support of India.\n\n\"Pursuing vaccine equity doesn't just advance our economic & health security - it's a moral imperative. As a bastion of innovation & champion for marginalized people everywhere, the U.S. must lead efforts to guarantee immunization access to EVERYONE at home & abroad,\" Mr Menendez tweeted.\n\nIndian-American Congressman Raja Krishnamoorthi said he was pleased the US will be sending its AstraZeneca supply to India and other countries in need of it as he had urged earlier.\n\n\"This is the compassionate choice and the smart one because it only takes one of India's many variants of COVID-19 to derail the US progress,\" he said.\n\nCongresswoman Barbara Lee, Chair of the House Appropriations subcommittee on State and Foreign Operations, and Congresswoman Rosa DeLauro, Chair of the House Appropriations Committee, praised Biden's plan to distribute 60 million AstraZeneca doses to countries in need in the coming months.\n\nThe White House on Tuesday welcomed the decision of Gilead to expand the availability of remdesivir, a key therapeutic medicine used in the treatment of COVID-19 patients, in India.\n\n\"We welcome generosity from the private sector to support the people of India. Ending the pandemic will require the partnerships with governments, industry, private citizens, non-governmental organizations and multilateral institutions,\" tweeted National Security Council of the White House.\n\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)"}, {"Article Image": "https://c.ndtvimg.com/2019-06/gll2nkug_34-finches-found-stuffed-into-hair-rollers-at-airport-wp_625x300_18_June_19.jpg", "Article's Title": "Man Tries To Smuggle 35 Birds Past US Customs For Singing Contests", "Article's Text": "Finches are in particularly high demand due to their superior singing abilities.(Representational)\n\nCustoms officials at New York's JFK Airport discovered 35 live finches attached to a man's jacket and ankles as he attempted to smuggle them into the country for singing competitions, federal prosecutors said Tuesday.\n\nA search revealed the man was wearing dozens of small cylindrical containers with mesh-covered openings, allowing the birds inside to breathe, according to photos published online.\n\nApproximately a dozen of the containers, which were made from hair curlers, were attached to the inside of his jacket, while the rest were wrapped around his ankles.\n\nWhen questioned, the man said that he was offered $3,000 to transport the birds, receiving $500 before he leaving the capital of Guyana, Georgetown. He was to receive the remaining balance upon delivery in the United States.\n\nFinches are prized for their joyful and melodious song, with singing competitions regularly held in parts of the New York boroughs of Queens and Brooklyn, which include betting.\n\nA winning finch can be worth more than $10,000, according to a special agent for the US Fish and Wildlife Service in the document released by prosecutors Tuesday.\n\nFinches from Guyana are in particularly high demand due to their superior singing abilities.\n\nThe man was released on $25,000 bond, according to documents.\n\nWorldwide, officials seized 20,762 wild animals in 2017, according to the United Nations Office on Drugs and Crime (UNODC), citing the last available figure.\n\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)"}, {"Article Image": "https://c.ndtvimg.com/2020-01/8mrihf8g_airplane-generic-aeroplane-generic_625x300_03_January_20.jpg", "Article's Title": "Covid Risk Rises 50% If Passengers Board Planes Back To Front: Study", "Article's Text": "Delta Air Lines adopted back-to-front boarding to \"minimize contact with other customers\".\n\nBoarding passengers seated at the back of the aircraft first -- a Covid-era change by Delta Air Lines Inc. and others to cut the risk of infection -- actually increases the chance of catching the virus by 50%, a scientific study showed.\n\nSo-called back-to-front boarding is also twice as risky as letting passengers on at random, even though it does reduce exposure between seated passengers and those walking down the plane, according to the study published Wednesday in the Royal Society Open Science journal. The higher risk comes from closer contact between passengers in the same rows clustering in the aisle as they stow their luggage.\n\nDelta adopted back-to-front boarding to \"minimize contact with other customers,\" according to its website, though the U.S. airline only boards 10 passengers at a time. The change was among several across the industry -- including blocking out middle seats --- to persuade passengers it is safe to get back on a plane.\n\nScientists from institutions including the University of West Florida and Florida State University simulated 16,000 possible passenger movements for the study. \"The new policies do not improve on the old ones in any situation,\" they said. Delta's media office didn't reply to an email seeking comment.\n\nThe risk of virus exposure could be reduced by stopping people using overhead storage bins, and by boarding passengers in window seats before those in aisle seats, according to the study.\n\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)"}, {"Article Image": "https://c.ndtvimg.com/2021-04/7hh5irlg_joe-biden-afp_625x300_07_April_21.jpg", "Article's Title": "Joe Biden Unveils Plan To Reverse Donald Trump's Tax Cuts For Rich", "Article's Text": "The spending plan will need approval by a deeply divided Congress. (File)\n\nPresident Joe Biden will call for reversing his predecessor Donald Trump's tax cuts for the wealthy to pay for a huge middle class families spending program, senior administration officials said Wednesday.\n\nBiden will use his speech to a joint session of Congress to unveil the $1.8 trillion American Families Plan, funded by ending Trump's tax cuts and closing loopholes used by the most wealthy to escape paying their share, officials said.\n\n\"The president will be proposing a set of measures to make sure the wealthiest Americans pay the taxes that they owe, while also ensuring that no one making less than $400,000 a year will see their taxes go up,\" one official, who asked not to be identified, told reporters.\n\nThe spending plan, which will need approval by a deeply divided Congress, would pour money into early education, childcare, higher education and other building blocks in what the Biden administration argues will be reconstruction of the country's battered middle class.\n\nSome $800 billion would be sent out in tax cuts for lower income people and another $1 trillion would be invested.\n\nThe strategy, an official said, is \"to build back better and generate a strong and inclusive economy for the future.\"\n\nTax credits will cut child poverty and halve the price of childcare, allowing mothers to remain longer in the labor force, the official said, predicting \"a larger, more productive and healthier workforce.\"\n\nThe plan to pay for the huge government program will likely be a lightning rod for Republican members of Congress.\n\nBut the White House is banking on voter support by targeting the tax increases firmly at the super rich.\n\nThey would pay a top income tax rate of 39.6 percent, ending the reduction to 37 percent enacted under Trump.\n\nThe Biden plan would also end loopholes and capital income tax breaks, while raising \"billions,\" according to the White House in tighter taxes on inherited wealth.\n\nOfficials said that the measures would be enough to pay for the nearly $2 trillion spending program within 15 years -- and make the country fairer.\n\n\"The president's plan makes clear where we should be reducing the tax burden and where he thinks we should appropriately increase taxes,\" an official said.\n\n\"There is broad support among the American people for this approach, there's broad support for the American people for the investments these resources will go to,\" he said.\n\n\"These reforms are fundamentally about fairness in the tax code.\"\n\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)"}, {"Article Image": "https://c.ndtvimg.com/2021-04/6kp9dcm_japan-fm-toshimitsu-motegi_625x300_28_April_21.jpg", "Article's Title": "China, Japan Trade Acrimonious Barbs Over Fukushima Tweet", "Article's Text": "In the image Mount Fuji in the background was replaced by a nuclear plant cooling tower.\n\nChina and Japan accused each other of inappropriate behaviour after a Chinese government official posted a tweet of an iconic Japanese woodblock print manipulated to show nuclear waste being poured into the sea, launching a new diplomatic spat.\n\nEarlier this month, Japan said it would release into the sea contaminated water from the crippled Fukushima nuclear power plant, angering its neighbours. China said the plan was \"extremely irresponsible\".\n\nOn Monday, Zhao Lijian, a Chinese foreign ministry spokesman, tweeted an image of \"The Great Wave Off Kanagawa\" made in the 19th century by artist Hokusai, altered to show green nuclear waste being poured into the sea by two people in orange Hazmat suits from a boat.\n\nIn the image, created by a Chinese illustrator, Mount Fuji in the background was replaced by a nuclear plant cooling tower.\n\nJapanese Foreign Minister Toshimitsu Motegi, when asked about the tweet at a news conference on Tuesday, said he would not comment on every tweet \"by someone at the press secretary level\".\n\nBut he said Japan was lodging a \"forceful protest\" and seeking the tweet's removal through diplomatic channels.\n\n\"You asked if I will delete the tweet and apologise. You may have noticed, I have pinned the tweet at the top,\" Zhao said at a regular press briefing in Beijing on Wednesday.\n\n\"The illustration shows the righteous call of the people. It is the Japanese government which needs to revoke its wrong decision and apologise,\" Zhao said.\n\nOn Wednesday, when asked again about the tweet by an opposition lawmaker in Japan's parliament, Motegi said that \"such heartless tweets should not be allowed\", according to Kyodo News.\n\n\"Japan did a bad thing, yet can't let others talk about it?\" Zhao said.\n\n\"The whole world has been protesting for a while now, some Japanese officials play dumb and pretended not to hear, yet they get so worked up over an illustration.\"\n\nThe bitter exchanges came on the heels of Chinese anger at a recent statement by U.S. President Joe Biden and Japanese Prime Minister Yoshihide Suga, who jointly agreed to face down China over a range of issues from Taiwan to Muslim Uighurs in the farwestern Chinese region of Xinjiang.\n\n(This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)"}, {"Article Image": "https://c.ndtvimg.com/2021-03/9op9k9ko_elon-musk-reuters_625x300_25_March_21.jpg", "Article's Title": "Elon Musk Trolls Jeff Bezos As Space Race Between World's Richest Men Heats Up", "Article's Text": "Elon Musk, who also leads SpaceX, fired back with a tweet that said: \"Can't get it up (to orbit) lol.\"\n\nThe space race between the world's two richest men went into hyperdrive on Tuesday after Tesla chief Elon Musk took a swipe at Jeff Bezos' attempt to challenge a major NASA contract.\n\nThe two billionaires, who have been trying to launch long-range orbital rockets, were competing for a coveted contract from the government to build a spaceship to deliver astronauts to the moon as early as 2024.\n\nMusk won. Bezos was not happy.\n\nBezos' Blue Origin on Monday filed a protest with the Government Accountability Office (GAO), accusing the National Aeronautics and Space Administration (NASA) of moving the goalposts for contract bidders at the last minute.\n\nMusk, who also leads SpaceX, fired back with a tweet that said: \"Can't get it up (to orbit) lol.\"\n\nHe did not elaborate on the tweet, but pasted a screenshot of a 2019 report about Bezos unveiling Blue Origin's moon lander on the same Twitter thread.\n\nBlue Origin has fallen far behind SpaceX and United Launch Alliance (ULA) on orbital transportation, losing out on billions of dollars' worth of U.S. national security launch contracts that begin in 2022. ULA is a joint venture of Boeing Co and Lockheed Martin Corp.\n\nThese rocket startups mainly aim to send satellites for clients into orbit at an affordable price and reuse parts of rockets to keep costs in check.\n\nEarlier this month, NASA awarded SpaceX the lunar contract over Blue Origin and defense contractor Dynetics. The sought-after project aims to put humans back on the moon for the first time since 1972.\n\n\"NASA has executed a flawed acquisition for the Human Landing System program and moved the goalposts at the last minute,\" Blue Origin said in an emailed statement.\n\n\"Their decision eliminates opportunities for competition, significantly narrows the supply base, and not only delays, but also endangers America's return to the moon. Because of that, we've filed a protest with the GAO.\"\n\nThe GAO also confirmed that Dynetics had challenged the NASA contract award to SpaceX. Dynetics did not immediately respond to a Reuters request for comment.\n\nMusk's SpaceX bid alone while Amazon.com founder Bezos' Blue Origin partnered with Lockheed Martin Corp, Northrop Grumman Corp and Draper.\n\nThe filing of the 50-page protest by Blue Origin was reported earlier by the New York Times.\n\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)"}, {"Article Image": "https://c.ndtvimg.com/2021-04/hs3mfqu_boris-johnson_625x300_28_April_21.jpg", "Article's Title": "UK PM Boris Johnson Faces Formal Probe Over Apartment Renovation Funding", "Article's Text": "UK Prime Minister Boris Johnson speaks during his visit to a farm in Wrexham, Wales, Britain.\n\nBritain's electoral commission opened a formal investigation into the financing of the refurbishment of British Prime Minister Boris Johnson's Downing Street apartment, saying there were grounds to suspect an offence may have been committed.\n\nEight days before local elections across England, as well as the election of the Welsh and Scottish regional assemblies, Johnson is facing a stream of allegations about everything from his muddled initial handling of the COVID-19 crisis to questions about who leaked what from his office.\n\n\"We are now satisfied that there are reasonable grounds to suspect that an offence or offences may have occurred,\" the electoral commission said. \"We will therefore continue this work as a formal investigation to establish whether this is the case.\"\n\nThe commission said it had been in contact with the Conservative party since late March.\n\nThe investigation will determine whether any transactions relating to the works at 11 Downing Street fall within the regime regulated by the Commission and whether such funding was reported as required.\n\nAsked last month about the refurbishment, Johnson's spokeswoman said all donations, gifts and benefits were properly declared, and that no Conservative Party funds were being used to pay for the refurbishment.\n\nJohnson has a taxpayer-funded 30,000 pound ($42,000) allowance each year for maintaining and furnishing his official residence, but anything above that must be met by the prime minister.\n\nMinisters have said Johnson has paid for the work himself, but it is unclear when he paid, and whether the refurbishment, reported to have cost 200,000 pounds ($280,000) was initially financed by a loan of some kind. Under political financing rules, Johnson would have been required to declare this.\n\nThe opposition Labour Party has demanded an explanation.\n\nLabour deputy leader Angela Rayner wrote to Simon Case, the head of the civil service, asking him to investigate answers about the affair given by Johnson's then-press secretary earlier this year. Allegra Stratton, a former BBC journalist, was Johnson's press secretary from October until last week.\n\nDominic Cummings, who was Johnson's key adviser on the Brexit campaign and helped him to win an election in 2019 before an acrimonious split last year, said on Friday that Johnson had wanted donors to pay for the renovation secretly.\n\nCummings said he had told the prime minister such plans were \"unethical, foolish, possibly illegal\".\n\nAsked if Johnson had received a loan from the Conservative Party for the refurbishment, transport minister Grant Shapps told Sky News: \"The prime minister has already paid for it.\"\n\nIn a further potentially damaging allegation, the Daily Mail newspaper on Sunday cited unidentified sources as saying that, in October, shortly after agreeing to a second lockdown, Johnson had told a meeting in Downing Street: \"No more fucking lockdowns - let the bodies pile high in their thousands.\"\n\nAsked on Monday whether he had made the remark, Johnson told broadcasters: \"No, but again, I think the important thing, I think, that people want us to get on and do as a government is to make sure that the lockdowns work, and they have.\"\n\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)"}, {"Article Image": "https://c.ndtvimg.com/2021-04/las1uf2_astrazeneca_625x300_26_April_21.jpg", "Article's Title": "Canada Reports First Death Linked To AstraZeneca Covid Vaccine Shot", "Article's Text": "As of last Friday, over 1.1 million AstraZeneca doses had been administered in Canada. (File)\n\nA 54-year woman has died in Canada after receiving the AstraZeneca Covid vaccine, the first fatality linked to the drug in the country, provincial authorities announced Tuesday.\n\n\"I'm sad to know that a healthy 54-year-old woman... died because she was vaccinated. It's hard to take,\" Francois Legault, the premier of Quebec, told a news conference.\n\nThe French-speaking province's chief public health officer Horacio Arruda said life-saving treatments did not work and the unidentified patient died of cerebral thrombosis after being vaccinated.\n\nBut he cautioned that the death should not change the government's recommendations to use the vaccine for those over 45 years old.\n\n\"We knew about serious complications, there was one in 100,000 (doses administered). But we must remember that, to date, we have had more than 400,000 people who have been vaccinated with AstraZeneca,\" Quebec health minister Christian Dube added.\n\nAs of last Friday, just over 1.1 million AstraZeneca doses had been administered nationwide.\n\nOnly four other cases of blood clots associated with low platelets have been reported in the country, and each patient recovered.\n\nPrime Minister Justin Trudeau received an AstraZeneca shot on Friday.\n\nOn Tuesday, the Canadian leader said about 60 soldiers had been deployed to overwhelmed hospitals in Nova Scotia to help care for critical patients.\n\nThe day before about 30 army nurses and health technicians were sent to reinforce hospital staff in Ontario, which is struggling with a new wave of infections led by variants.\n\nIn Quebec, which has suffered the most Covid deaths of any region in the country, the latest data showed rates of infections were slowing, allowing the government to announce it was pushing the start of a nightly curfew in Montreal from 8 pm to 9:30 pm (0130 GMT) starting next Monday.\n\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)"}, {"Article Image": "https://c.ndtvimg.com/2019-06/kjp5551o_irans-foreign-minister-mohammad-javad-zarif-reuters-650_625x300_26_June_19.jpg", "Article's Title": "Regrets Audio Leak Caused \"Domestic Infighting\": Iran's Foreign Minister", "Article's Text": "Mohammad Javad Zarif also appeared to stick by the core argument that he made in the leaked audio.\n\nIran's foreign minister said Wednesday he favours a \"smart adjustment\" between the military and diplomatic spheres, in his first public reaction to leaked audio of him bemoaning the military's influence.\n\nMohammad Javad Zarif also said he regretted that the leak had triggered \"domestic infighting,\" amid a furious reaction from conservative figures and media outlets.\n\n\"I was very sorry that a secret theoretical talk regarding the need for synergy between diplomacy and the (military) field ... turns into domestic infighting,\" Iran's top diplomat said on his Instagram account.\n\n\"Honest and passionate\" argument in a private setting had been misconstrued as \"personal criticism,\" he wrote.\n\nBut Zarif also appeared to stick by the core argument that he made in the leaked audio.\n\nHe said on Wednesday that the \"main point\" of his remarks in the audio -- in which he says the military has too much influence on diplomacy -- is emphasising \"the need for a smart adjustment of the relationship between\" diplomacy and the military.\n\nZarif also said on Wednesday he saw a need for \"setting priorities through legal structures and under the great purview of the supreme leader\" Ayatollah Ali Khamenei.\n\nIran's President Hassan Rouhani has ordered a probe to identify who leaked the \"stolen\" three-hour recording.\n\nHis moderate government has sought to downplay the remarks, which were leaked ahead of the June elections and as Iran and world powers discuss ways to revive a 2015 nuclear accord.\n\n\"In the Islamic republic the military field rules,\" Zarif said in the audio tape, published by several media outlets outside Iran on Sunday. \"I have sacrified diplomacy for the military field rather than the field servicing diplomacy\".\n\nComments he made about Qasem Soleimani, the commander of the Revolutionary Guards' foreign operations arm who was killed in a US air strike last year, especially hit a nerve, with Zarif specifically addressing that in his Instagram post.\n\n\"I have had the honour of deep friendship and cooperation with haj Qasem (Soleimani) for more than two decades,\" he wrote, noting that he has repeatedly reminded the world of Soleimani's \"humanity, peacefulness and courage\".\n\nHe also defended his track record by stressing that he has \"always followed the country's internally agreed policies and strongly defended them\".\n\n\"Safeguarding the country's interests and... (those of) the patient and valiant people of Iran is an oath I will stand by until the last moment,\" Zarif pledged.\n\n\"But I have considered appeasement and self-censorship in expert opinion to be a betrayal,\" he added.\n\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)"}, {"Article Image": "https://c.ndtvimg.com/2021-04/2g0vl2r4_vaccine-generic-injection-generic_625x300_15_April_21.jpg", "Article's Title": "One Dose Of Covid Vaccine Cuts Household Spread By Up To 50%: UK Study", "Article's Text": "Previous studies have shown that being vaccinated reduces the risk of being infected with Covid. (File)\n\nOne dose of the Pfizer or AstraZeneca vaccines reduces the chances of someone infected with coronavirus from spreading it to other household members by up to 50 percent, according to a English study published Wednesday.\n\nThe Public Health England (PHE) research found that those who became infected three weeks after receiving their first jab were between 38 and 49 percent less likely to pass the virus on to their household contacts than those who were unvaccinated.\n\n\"This is terrific news -- we already know vaccines save lives and this study is the most comprehensive real-world data showing they also cut transmission of this deadly virus,\" said British Health Secretary Matt Hancock.\n\n\"It further reinforces that vaccines are the best way out of this pandemic as they protect you and they may prevent you from unknowingly infecting someone in your household,\" he added.\n\nThe study drew data from over 57,000 contacts in 24,000 households in which there was a lab-confirmed case that had received a vaccination, compared with nearly one million contacts of unvaccinated cases.\n\nPrevious studies have already shown that being vaccinated reduces the risk of a person developing symptomatic infection in the first place by up to 65 percent, four weeks after one dose.\n\nHouseholds are deemed as \"high-risk\" settings for transmission, and \"similar results could be expected in other settings with similar transmission risks, such as shared accommodations and prisons,\" said the PHE study.\n\n\"Not only do vaccines reduce the severity of illness and prevent hundreds of deaths every day, we now see they also have an additional impact on reducing the chance of passing COVID-19 on to others,\" said Mary Ramsay, Head of Immunisation at PHE.\n\nPrevious PHE studies have estimate that Britain's succesful vaccine rollout had prevented 10,400 deaths in the over-60s by the end of March.\n\n(This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)"}, {"Article Image": "https://c.ndtvimg.com/2020-12/nd16akhk_albert-bourla_625x300_08_December_20.jpg", "Article's Title": "Pfizer Chief Says Oral Drug For COVID-19 Could Be Ready Next Year: Report", "Article's Text": "We are now progressing the studies and we will have more news around summer, the Pfizer CEO said.\n\nPfizer CEO Albert Bourla has said that an oral drug for treating coronavirus could be ready next year, adding that the company is working on two antivirals, an oral and an injectable.\n\n\"We are actually on two, one is injectable and the other one an oral (antiviral)... Particularly the attention is on the oral for the world and of us because provides several advantages and one of them is that you don't need to go to the hospital to get the treatment of which is the case with all the injectables so far but you can get it home,\" Albert Bourla told CNBC in an interview on Tuesday, as cited by The Hill.\n\n\"If all goes well, and we implement the same speed that we are, and if regulators do the same, and they are, I hope that by the end of the year,\" Albert Bourla added.\n\nThe only antiviral currently approved for use against the coronavirus is remdesivir, which is manufactured by Gilead Sciences. The US Food and Drug Administration (FDA) gave the drug full approval in October after it was granted emergency use authorization in May last year.\n\nHe also said the medication could be \"way more effective against the multiple variants\" of the virus than current options adding that the mechanism of action, of the antiviral, is not expected to be subject to mutations, \"particularly because it's not acting on the spike, as we all know, all the mutations that we are hearing right now are seeing this in the proteins of the spike.\"\n\n\"This one doesn't work there so that allows us to believe that will be way more effective against the multiple variants. So, all good news. We are now progressing the studies and we will have more news around summer,\" the CEO added.\n\nThe Hill further reported that thus far, more than 121 million doses of the vaccine have been administered across the United States."}, {"Article Image": "https://c.ndtvimg.com/2019-08/ne5bdbjo_iranian-foreign-minister-mohammad-javad-zarif_625x300_13_August_19.jpg", "Article's Title": "Favour \"Adjustment\" Between Military, Diplomatic Spheres: Iran's Zarif", "Article's Text": "Iran's Foreign Minister Mohammad Javad Zarif on Wednesday said he favoured a \"smart adjustment\" between the military and diplomatic spheres, in his first public reaction after a controversial leaked audiotape.\n\nThe top diplomat wrote on Instagram that the \"main point\" of his remarks in the audio -- in which he says the military has too much influence on diplomacy -- is emphasising \"the need for a smart adjustment of the relationship between these two wings\" of Iran's power.\n\nHe also saw a need for \"setting priorities through legal structures and under the great purview of the supreme leader\".\n\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)"}, {"Article Image": "https://i.ndtvimg.com/i/2018-04/man-with-gun-generic-unsplash_650x400_61523241012.jpg", "Article's Title": "Three-Year-Old Boy Dies After Being Shot At His Birthday Party In Florida", "Article's Text": "The Florida Police recovered more than 60 bullets on the scene. (Representational)\n\nPolice in Florida were investigating Tuesday the murder of a three-year-old boy who was shot and killed at his own birthday party.\n\nElijah LaFrance was likely struck by a stray bullet in a Miami suburb Saturday evening, when \"unknown subjects armed with various semi-automatic weapons, to include rifles, arrived on the scene and began discharging the firearms towards the residence\" as the child's family cleaned up the yard after the party, Miami-Dade police said.\n\nThe toddler was taken to the hospital, where he \"succumbed to his injuries,\" according to police.\n\nAuthorities were offering a $15,000 reward for information leading to the arrest of suspects in the case.\n\nElijah, who would have turned four in a few days, was celebrating his birthday with another child, his family told local media.\n\nVideos from the party show the children playing in a pool at the house, surrounded by colorful balloons.\n\nOfficers arrived on the scene after being alerted through the ShotSpotter system, a technology that listens for gunshots and is installed throughout nearly 100 American cities.\n\nA 21-year-old woman was also shot in the incident. Police recovered more than 60 bullets on the scene.\n\n\"I am completely devastated, I'm disgusted,\" said Miami-Dade County Police Department Chief Alfredo Ramirez III as he vowed to invest every effort possible to solve the crime.\n\nYoung children are regularly victims of gun violence in the United States, where firearms are common and elected officials struggle to come to consensus around regulations.\n\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)"}, {"Article Image": "https://i.ndtvimg.com/i/2014-04/lee-kun-hee-samsung_625x300_71396434283.jpg", "Article's Title": "Samsung Heirs To Pay Over $10 Billion, Donate Picasso In Inheritance Tax", "Article's Text": "Lee Kun-hee left a trove of antiques and artworks reportedly worth 2 to 3 trillion won.\n\nThe heirs to South Korea's Samsung group announced their plans to pay more than $10 billion in death duties Wednesday -- one of the world's biggest ever inheritance tax settlements -- including donating Picasso and Monet artworks.\n\nLee Kun-hee, the late Samsung Electronics chairman was the country's richest man when he died last October at age 78 after being hospitalised for years, leaving an estimated 22 trillion won ($19.6 billion) in assets.\n\nSouth Korea has stringent inheritance tax laws and high rates, resulting in a hefty bill for the family, including Samsung Electronics vice chairman Lee Jae-yong, who is currently in jail for bribery, embezzlement and other offences.\n\nLee's family \"expects to pay more than 12 trillion won in taxes related to inheritance, which is more than half of the value of the late Chairman's total estate,\" Samsung said in a statement.\n\n\"The inheritance tax payment is one of the largest ever in Korea and globally,\" it added, saying the Lee family will pay it off in six instalments starting this month.\n\nThe assets include shareholdings in Samsung Electronics, Samsung Life and Samsung C&T, as well as real estate, according to the statement.\n\nThe late chairman also left a trove of antiques and artworks reportedly worth 2 to 3 trillion won.\n\nAround 23,000 pieces from Lee's collection will be donated, Samsung said, including 14 items classed as National Treasures that will be showcased at the National Museum of Korea.\n\nWorks by artists Marc Chagall, Pablo Picasso, Paul Gauguin as well as Claude Monet, Joan Miro and Salvador Dali will be donated to the National Museum of Modern and Contemporary Art, it added.\n\nReports say the art donations will reduce the family's tax liability.\n\nAnother 1 trillion won will be donated to health causes, half of it to be spent on building the South's first specialist infectious diseases hospital.\n\nSamsung -- whose flagship subsidiary is among the world's biggest smartphone and computer chip makers -- is by far the largest of the family-controlled empires known as chaebols that dominate business in South Korea, the world's 12th-largest economy.\n\nThe conglomerate is crucial to the South's economic health -- its overall turnover is equivalent to a fifth of the national gross domestic product.\n\nThe late chairman's eldest son and the group's de facto leader, Lee Jae-yong was jailed in January over a sprawling corruption scandal that brought down former president Park Geun-hye.\n\nHe is undergoing a separate trial over stock manipulation, which critics say was key to ensuring a smooth succession of power within the conglomerate.\n\nLee apologised last May for some governance issues at the group, pledging to ensure \"there will be no more controversy over the succession\" and that he would not allow his children to take over from him at the firm.\n\n(This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)"}, {"Article Image": "https://c.ndtvimg.com/2021-02/jc4dno8g_anthony-fauci_625x300_21_February_21.jpg", "Article's Title": "Covaxin \"Found To Neutralise\" Indian 617 Variant: US Adviser Dr. Fauci", "Article's Text": "Covaxin was found to neutralise the Indian 617 Covid variant, Anthony Fauci said (File)\n\nCovaxin, India's home-grown Covid vaccine produced by Bharat Biotech, has been found to neutralise the B.1.617 variant or the Indian double mutant strain, White House Chief Medical Adviser Anthony Fauci said on Tuesday.\n\n\"Now, this is something where we're still gaining data on a daily basis. But the most recent data was looking at convalescent sera of COVID-19 cases in people who received the vaccine used in India, the Covaxin. And it was found to neutralise the 617 variant,\" he said, according to news agency PTI.\n\n\"So despite the real difficulty that we're seeing in India, vaccination could be a very, very important antidote against this,\" Dr Fauci was quoted as telling reporters.\n\n\"So I'll stop there with the final statement. The one thing you can gather from everything I've said: that it's very important to get vaccinated.\"\n\nCovaxin was developed by Bharat Biotech in partnership with National Institute of Virology and the Indian Council of Medical Research (ICMR) and was approved for emergency use on January 3 while still in clinical trial.\n\nTrial results later showed the vaccine has an efficacy of 78 per cent, according to ICMR.\n\nThe B.1.617 variant, mostly found in Covid cases in Maharashtra and Delhi, has three new spike protein mutations. This variant is said to be pushing the deadly second surge in Covid across the country.\n\nCovaxin uses dead viruses and works by teaching the immune system to make antibodies against the coronavirus. When Covaxin is administered, immune cells recognise the dead virus, prompting the immune system to make antibodies to fight the coronavirus.\n\nWHO on Tuesday said the B.1.617 that a variant of Covid-19 feared to be contributing to a surge in coronavirus cases in India has been found in over a dozen countries.\n\nThe UN health agency said the B.1.617 variant of Covid-19 first found in India had as of Tuesday been detected in over 1,200 sequences uploaded to the GISAID open-access database \"from at least 17 countries\".\n\n\"Most sequences were uploaded from India, the United Kingdom, USA and Singapore,\" the WHO said in its weekly epidemiological update on the pandemic.\n\nThe WHO recently listed B.1.617 as a \"variant of interest\" and said it had been found in 17 countries.\n\nIndia's Covid cases smashed a new record today with 3.6 lakh cases and over 3,000 deaths in 24 hours."}]