[
  {
    "Date": "Thu, 06 May 2021 01:07:04 +0530",
    "Description": "Kawasaki Versys’ engine is its crowning jewel, to say nothing of its impressive handling and comfortable seating",
    "Image": "https://th.thgim.com/entertainment/movies/jup5gv/article34487681.ece/ALTERNATES/FREE_960/1DSC2641",
    "Link": "https://www.thehindu.com/life-and-style/motoring/versys-1000-makes-for-a-breezy-ride/article34487682.ece",
    "Text": "Kawasaki Versys’ engine is its crowning jewel, to say nothing of its impressive handling and comfortable seating\n\nEvery time I step off an adventure tourer, I am left with a sense of conviction about their aptness for our roads. They have the ability to gobble serious miles without compromising on comfort and also have a touch of sportiness sewn in. And that is where motorcycles like the Kawasaki Versys 1000 appear to make a strong case for themselves.\n\nThe Design\n\nFirstly, it is the sheer size of the Kawasaki Versys 1000 that captures your attention, leaving you a little intimidated as well. With its new ZX-6R inspired face, the Versys 1000 is a little easier on the eyes, but it is still not what you would call pretty.\n\nStep to the side and it becomes even more apparent that this motorcycle is built to chew miles all day long. The 21-litre tank, massive fairing and spacious seating are all indicative of the Versys’ touring orientation. But there is no getting away from the fact that the bodywork is so huge that the relatively small 17-inch wheels make the motorcycle appear disproportionate, despite running sport-bike tyre sizes.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe other advantage of so much real estate is what is possibly the roomiest and comfiest rider and pillion seat in the class. The ergonomics are pretty relaxed, with a slightly pared-back footrest and an easy reach to the bar. That, along with the windscreen, takes the fatigue out of spending a whole day in the saddle.\n\nEngine & Performance\n\nThe Versys’ engine is the crowning jewel of the whole package; it is the same engine that also powers the Ninja 1000SX, however, it makes less power and torque in the Versys. Nevertheless, 120hp and 102Nm are decent figures.\n\nWhen you fire up the engine, the sweet hum at idle feels like the calm before the storm. Once on the move, the loud intake howl is accompanied by a surge in acceleration that belies this motorcycle’s size and weight. You get to unmentionable speeds in no time and the engine doesn’t feel strained at any point. Slot the slick gearbox in sixth, and the Versys transforms into an effortless cruiser with enough juice in reserve to pull a quick overtake, sometimes even without down-shifting. Even in the city, the engine’s tractability and heat management is impressive, making it capable of dealing with a city commute, if necessary.\n\nThe 2019 update to the Versys 1000 also brought in IMU assisted, three-step traction control (TC) and lean-sensitive ABS. Adding another layer of safety are the two power modes — Full and Low. The ‘Low’ mode chops power down to 75% and also softens the power delivery. This makes riding this big Kawasaki quite easy, whether in the wet or dry. However, we did find the TC to be too intrusive in some situations and it cuts power rather abruptly. A smoother throttle action does help to an extent, but Kawasaki needs to refine the system further so that it doesn’t upset the chassis the way it currently does on loose and slippery surfaces.\n\nHandling\n\nIt is not just the performance but also the way this 255kg motorcycle handles that impresses. Get past the initial trepidation of riding a tall motorcycle and you will be surprised to see how well this motorcycle takes to the bends. There is oodles of grip and feedback through the chassis while the 17-inch wheels make life easy during quick direction changes.\n\nThe suspension does a pretty good job of absorbing undulations, and the ride quality over bad roads is comfortable enough despite the firm edge. Adjustability, however, is limited and one can tune the 43mm fork and monoshock for preload and rebound only.\n\nFor those wondering if they should wander off-road on this Versys, the motorcycle can only handle a mild trail. Because, the 17-inch wheels, fat tyres and 150mm of ground clearance aren’t encouraging specifications to venture off the beaten path. The 310mm discs do a good job of hauling down the motorcycle to a stop while the ABS is well-calibrated to prevent unnecessary intervention.\n\nVerdict\n\nAt ₹11.44 lakh, the Kawasaki Versys 1000 is nothing but a steal for the kind of performance it offers. Not to mention the sweet sound and character of an inline-four engine. In fact, at this price point, its biggest competition comes from its sibling the Ninja 1000SX. It may not have the ergonomics, suspension travel and all-day comfort of the Versys 1000 but it is more powerful and better equipped. That said, the Versys offers unbeatable value for someone looking for a supremely comfortable and fast road-biased touring motorcycle.",
    "Title": "Why the Versys 1000 makes for a breezy ride"
  },
  {
    "Date": "Thu, 06 May 2021 11:19:04 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/auto/cars/bmw-to-launch-x5-based-hydrogen-car-in-2022/articleshow/82425652.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82425652.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>The SUV will be equipped with a hydrogen fuel cell e-drive that emits only water vapor. BMW said it's trying to provide one more option in the growth of e-mobility.",
    "Image": "https://static.toiimg.com/thumb/msid-82425647,width-1070,height-580,imgsize-1409150,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/auto/cars/bmw-to-launch-x5-based-hydrogen-car-in-2022/articleshow/82425652.cms",
    "Text": "Save the date: a small series of the #BMWi Hydrogen NEXT arrives in 2022. The vehicle is based on the current BMW X… https://t.co/6gYoU0vbpr — BMW (@BMW) 1620144108000\n\nNEW DELHI: German luxury carmaker BMW took to Twitter to reiterate the arrival of a small series of the Hydrogen NEXT in 2022, based on the current BMW X5 The SUV will be equipped with a hydrogen fuel cell e-drive that emits only water vapor. BMW said it's trying to provide one more option in the growth of e-mobility.“The fuel cell system for the powertrain for the BMW iHydrogen NEXT generates up to 125 kW (170 hp) of electric power from the chemical reaction between hydrogen and oxygen from the ambient air,” explains Jürgen Guldner, Vice President of Hydrogen Fuel Cell Technology and Vehicle Projects at the BMW Group This means the vehicle emits nothing but water vapour. The electric converter located underneath the fuel cell adapts the voltage level to that of both the electric powertrain and the peak power battery, which is fed by brake energy as well as the energy from the fuel cell.The vehicle also accommodates a pair of 700 bar tanks that can together hold six kilograms of hydrogen. “This guarantees a long-range regardless of the weather conditions,” notes Guldner.“And refuelling only takes three to four minutes.” The fifth-generation eDrive unit set to make its debut in the BMW iX3 is also fully integrated into the BMW i Hydrogen NEXT.The peak power battery positioned above the electric motor injects an extra dose of dynamics when overtaking or accelerating. The total system output of 275 kW (374 hp) fuels the typical driving dynamics for which BMW is renowned.This hydrogen fuel cell electric powertrain will be piloted in a small series based on the current BMW X5 that the BMW Group plans to present in 2022. A customer offering powered by hydrogen fuel cell technology will be brought to market at the earliest in the second half of this decade by the BMW Group, depending on the global market conditions and requirements.",
    "Title": "BMW to launch X5-based hydrogen car in 2022"
  },
  {
    "Date": "Thu, 06 May 2021 10:51:51 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/auto/news/maruti-suzuki-india-production-dips-7-per-cent-in-april/articleshow/82425242.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82425242.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>The pandmemic and lockdowns have slowed down production at the plants",
    "Image": "https://static.toiimg.com/thumb/msid-82425248,width-1070,height-580,imgsize-186640,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/auto/news/maruti-suzuki-india-production-dips-7-per-cent-in-april/articleshow/82425242.cms",
    "Text": "NEW DELHI: The country's largest carmaker Maruti Suzuki India ( MSI ) on Wednesday said its total production in April 2021 stood at 1,59,955 units, down 7 per cent from March this year.The company had produced a total of 1,72,433 units in the year-ago period, Maruti Suzuki India (MSI) said in a regulatory filing.Production of mini cars comprising Alto and S-Presso models stood at 29,056 units last month as against 28,519 units in March.However, manufacturing of compact cars, comprising WagonR, Celerio, Ignis, Swift, Baleno and Dzire, declined to 83,432 units last month as against 95,186 units in March 2021, MSI said.Similarly, production of utility vehicles -- Gypsy, Ertiga, S-Cross , Vitara Brezza and XL6 -- declined to 31,059 units in April as compared with 32,421 units in March.MSI said production of its light commercial vehicle Super Carry stood at 2,390 units in last month as against 2,397 units in March 20121.\"There was no production in April 2020 due to COVID -19 related lockdown. A comparison between April 2021 production volume and that of April 2020 doesn't have any meaning,\" it noted.",
    "Title": "Maruti Suzuki India production dips 7 per cent in April"
  },
  {
    "Date": "Thu, 06 May 2021 10:45:55 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/auto/cars/ford-is-betting-that-solid-state-batteries-will-cut-ev-costs/articleshow/82425136.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82425136.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>The automaker is heavily invesing into EV's and feels that overall costs can be reduced",
    "Image": "https://static.toiimg.com/thumb/msid-82425170,width-1070,height-580,imgsize-215660,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/auto/cars/ford-is-betting-that-solid-state-batteries-will-cut-ev-costs/articleshow/82425136.cms",
    "Text": "DETROIT: Ford has raised its stake in a manufacturer of solid-state batteries, a move that its chief product and operations officer, Hau Thai-Tang, says will strengthen the company's effort to increase the range and reduce the costs of its next generation of electric vehicles Ford, along with BMW , this week announced their investment in a $130 million funding round for Solid Power, a Denver-area company that is developing sulfide solid-state battery technology. Thai-Tang says the technology should give Ford the flexibility to either shrink battery sizes to make it less expensive to manufacture some vehicles or keep the same size battery and achieve a greater range of distance in other models.Solid state batteries, with their solid ion-conducting material instead of the liquid electrolyte found in most lithium-ion batteries, can store more energy. This expands the vehicles' range from the same-size battery or allows for smaller batteries, which are typically lighter with a lower risk of fire.At the same time, it's harder to draw power from solid-state batteries than from lithium-ion batteries, said Sam Abuelsamid, an analyst at Guidehouse Research. But the technology holds such promise, he said, that whatever company perfects it first could command a competitive edge.The Associated Press spoke recently with Thai-Tang about the new chemistry and what it could mean to speeding the adoption of electric vehicles. The interview was edited for clarity and length.____Q: Why are solid-state batteries so important compared with the lithium-ion batteries now used in electric vehicles?A: Because of the promise of much higher levels of energy density. For customers, that basically means they can drive farther with the more range. So as you get better energy and power density, the cells get smaller. That allows the vehicles to become lighter for the same range, as well as more space for people and their things instead of for batteries. And then, of course, cost. Being able to drive the cost-per-kilowatt-hour down will speed up the adoption of battery electric vehicles.___Q. What's the advantage over lithium-ion batteries now?A: The big thing is going from a liquid electrolyte to a solid electrolyte; that gives you better conductivity. That's the enabler for the power and energy. The challenge has always been, can you actually scale it up to where the format of the cell is large enough for automotive use? Then can you actually manufacture it at scale to hit the cost targets?___Q: There has been a lot of talk about potential shortages of lithium, copper, nickel, other precious metals. Does solid state use fewer of those?A: It depends on the chemistry. For most companies, the cathode is about the same as what's in lithium-ion. That doesn't really change. It's really the anode and the electrolyte. Because you're getting higher conductivity and higher energy density, so for the same power and range and energy, you would use less. That in itself will help, even if it was the same chemistry. But depending on which company you partner with, they would have different chemistries, which will reduce dependencies on things like copper as well as cobalt, for example.___Q: How far along is Solid Power in this process?A: We think Solid Power is among the leaders because of their ability to scale up to a multi-layer cell, up to 20 amp-hour. This is something that we can actually use in an automobile. Beginning next year, they're targeting to give us as well as the other investor, BMW, a 100 amp-hour battery. That's at the size we really can use for automotive applications. The other big thing is, their chemistry can be built in the same manufacturing process that we would invest in to build lithium-ion batteries. So this allows us to ease into that new technology without having to reinvest in all of that capital equipment.___Q: What time frame do you see for switching to solid-state?A: We think it's realistic to target by the end of this decade if we continue to make the progress we're making.___Q: How much farther could the vehicle go if you if you perfect solid state?A: You can either maintain the current range and use fewer batteries, or you can give customers even more range within the physical package of that battery size. We're seeing roughly 25% to 30% improvement in energy density. So we can literally give that all to more range. Or we could say 300 miles is optimal, and we would just reduce the number of batteries and drive the cost down. And anywhere in between those two bookends.___Q: So in the current package for a Mustang Mach-E electric SUV, say roughly 300 miles, you would be able to go around 400 miles?A: Yes, you can get another 25% to 30%.___Q: Does this announcement mean there will be a much wider array of electric vehicles coming?A: Ford can lead the electric revolution and accelerate the transition from internal combustion engines to drive the cost down and improve the the range for our customers, making it safer. I think charging infrastructure is probably the other thing that would be the key for a faster rate of adoption.___Q: Do you need solid state to reach cost parity with internal combustion engines?A: We see further opportunities to drive the cost down below $100 per kilowatt with additional advances in lithium-ion technology. To take the next incremental step in terms of cost, we think you have to go to solid state.___Q: How much over the current battery chemistry might you save in cost if this comes to fruition?A: If you're getting 25%-to-30% improvement in energy density and you can build it in the same process, you would expect to see that level of cost improvement versus today's state of the art technology.",
    "Title": "Ford is betting that solid-state batteries will cut EV costs"
  }
]