[
  {
    "Date": "Mon, 10 May 2021 00:46:07 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/business/india-business/bad-loan-cos-seek-level-playing-field/articleshow/82507871.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82507871.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>The Association of ARCs in India recently responded to the RBI’s call for suggestions to overhaul their structure in the country. ARCs were created under the Securitisation and Reconstruction of Financial Assets and Enforcement of Security Interest Act (SARFAESI), 2002, which allowed lenders to seize assets.",
    "Image": "https://static.toiimg.com/thumb/msid-82513280,width-1070,height-580,imgsize-72447,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/business/india-business/bad-loan-cos-seek-level-playing-field/articleshow/82507871.cms",
    "Text": "File photo for representation purpose only\n\nMUMBAI: Asset reconstruction companies (ARCs) have asked the RBI to let them sell assets of defaulting promoters back to them. They have also asked the central bank to allow corporates and high net worth individuals to invest in troubled loans through the securities issued by ARCs.\n\nThe Association of ARCs in India recently responded to the RBI’s call for suggestions to overhaul their structure in the country. ARCs were created under the Securitisation and Reconstruction of Financial Assets and Enforcement of Security Interest Act ( SARFAESI ), 2002, which allowed lenders to seize assets.\n\nThe role of ARCs reduced after the Insolvency and Bankruptcy Code (IBC), 2016, which enabled banks to sell the defaulting business to a new promoter. To prevent defaulters from buying back their companies at a discount, Section 29A was incorporated. This blacklisted defaulting promoters. After the IBC Act, the RBI had asked ARCs to stick to the principles of its Section 29 and not sell loans to promoters even outside the bankruptcy process.\n\nAccording to the ARC association, the SARFAESI Act allows them to sell assets to the borrower or the promoter group of companies. “Hence, following the spirit of Section 29A of IBC would be contradictory to the provision of SARFAESI Act,” it said in a note.\n\nAnother request from the ARCs is that they be allowed to pick up equity in bankrupt companies as a ‘resolution applicant’ in IBC cases. In the bidding for RCom, the RBI had rejected the winning bid by UV ARC, stating that the SARFAESI law disqualifies them from holding equity in a company.\n\nIn a note to members, the association said it has sought a level playing field with the National Asset Reconstruction Company ( NARC ), which is proposed to be set up by public sector banks, and which will be backed with some form of government guarantee. “Government has announced the formation of new ARC/asset management company to takeover non-performing assets (NPAs) from different banks to clean up their books and work on resolving those NPAs . We request that special regulatory dispensation/benefit if any given to proposed ARC should apply to all existing ARCs and level playing field from regulatory perspective be given to all existing ARCs,” the association said.\n\nARCs raise money for buying bad loans by selling security receipts (SRs) that entitle investors a share of the recovery proceeds. To ensure that they retain skin in the game, the RBI has asked ARCs to invest at least 15% in the SRs they issue. ARCs have asked for this minimum investment to be brought down to 2.5% in cases where the bank selling the bad loan is not the investor. Other suggestions include a request to be classified as non-banking financial companies ( NBFCs ), which will enable ARCs to borrow from banks.\n\n",
    "Title": "Bad loan companies seek level playing field"
  },
  {
    "Date": "Mon, 10 May 2021 09:55:34 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/business/india-business/sensex-surges-over-350-points-in-early-trade-nifty-tops-14900/articleshow/82514572.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82514572.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>",
    "Image": "https://static.toiimg.com/thumb/msid-82514561,width-1070,height-580,imgsize-57116,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/business/india-business/sensex-surges-over-350-points-in-early-trade-nifty-tops-14900/articleshow/82514572.cms",
    "Text": "File photo for representation purpose only\n\nMUMBAI: Equity benchmark Sensex rallied over 350 points in early trade on Monday, tracking gains in index majors HDFC twins, ICICI Bank and Kotak Bank amid largely positive cues from global markets.\n\nThe 30-share BSE index was trading 353.64 points or 0.72% higher at 49,560.11 in initial deals.\n\nSimilarly, the broader NSE Nifty surged 114.85 points or 0.77% to 14,938.\n\nDr Reddy's was the top gainer in the Sensex pack, rising over 2%, followed by ONGC , HDFC, IndusInd Bank, ICICI Bank, Sun Pharma and Kotak Bank.\n\nOn the other hand, UltraTech Cement, Bajaj Finance, Nestle India and Infosys were among the laggards.\n\nIn the previous session, Sensex climbed 256.71 points or 0.52% to finish at 49,206.47, and Nifty rose 98.35 points or 0.67% to 14,823.15.\n\nForeign institutional investors (FIIs) were net sellers in the capital market as they offloaded shares worth Rs 1,142.75 crore on Friday, according to provisional exchange data.\n\n\"Domestic equities look good at the moment. Favourable global cues, steady March quarter earnings along with favourable commentary, liquidity support announced by the RBI and absence of nationwide lockdown have aided domestic equities to shrug off rising COVID-19 cases in the country,\" said Binod Modi, Head Strategy at Reliance Securities.\n\nHowever, elevated daily caseload, higher positivity rate and rising Covid-19 cases in hinterlands of the country are expected to weigh on investors' sentiments and will prevent the market from taking any decisive upmove, he added.\n\nElsewhere in Asia, bourses in Shanghai, Tokyo and Seoul were trading on a positive note in mid-session deals, while Hong Kong was in the red.\n\nMeanwhile, international oil benchmark Brent crude was trading 0.44% higher at $68.58 per barrel.\n\n",
    "Title": "Sensex surges over 350 points in early trade; Nifty tops 14,900"
  },
  {
    "Date": "Mon, 10 May 2021 08:37:06 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/business/international-business/hack-at-colonial-pipeline-what-we-know-and-dont-know/articleshow/82513560.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82513560.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>Alpharetta, Georgia-based Colonial Pipeline and the US government have both blamed ransomware for the massive outage, pointing the finger at cybercriminal gangs who routinely hold data and computer networks hostage in exchange for digital currency payments.",
    "Image": "https://static.toiimg.com/thumb/msid-82513558,width-1070,height-580,imgsize-32228,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/business/international-business/hack-at-colonial-pipeline-what-we-know-and-dont-know/articleshow/82513560.cms",
    "Text": "Holding tanks are seen at Colonial Pipeline's Linden Junction Tank Farm in Woodbridge, New Jersey.\n\nWASHINGTON: Ransom-seeking hackers have broken into Colonial Pipeline , prompting the company to shut one of America's major arteries for fuel delivery.\n\nHere is a look at what we know, and what we don't, about one of the most disruptive digital shakedown efforts to hit a US company.\n\nWHO IS INVOLVED?\n\nAlpharetta, Georgia-based Colonial Pipeline and the US government have both blamed ransomware for the massive outage, pointing the finger at cybercriminal gangs who routinely hold data and computer networks hostage in exchange for digital currency payments.\n\nThere is no official word on which group is believed to have carried out the intrusion - and attributing malicious activity online can be extremely difficult - but a former US official and three industry sources told Reuters a group dubbed \" DarkSide \" was among the suspects. If so, that would lay the responsibility on a new but professional group of criminals believed to be operating out of the former Soviet republics.\n\nCybersecurity FireEye is involved with the incident response, according to three industry sources.\n\nHOW BAD IS IT?\n\nRansomware can deal catastrophic damage to an organization's network by locking away critical data or even wrecking computers beyond repair. But the effect on the actual nuts and bolts of energy companies' operations varies.\n\nA destructive cyberattack on Saudi Aramco in 2012 crippled the oil giant's computer network but left production more-or-less unscathed. By contrast, a more recent ransomware incident at Norsk Hydro temporarily pushed the aluminum maker to switch away from automated production at its smelters.\n\nExperts say the severity of the Colonial case will depend on whether the ransomware made its way into the company's operational technology network, which interfaces with the pipeline itself. Earlier this year, US government officials announced https://us-cert.cisa.gov/ncas/alerts/aa20-049a that an intrusion at an unnamed natural gas compression plant that spilled over into its operational technology network forced a two-day shut down of its entire pipeline.\n\nColonial has not given any public indication as to the reach of the ransomware outbreak, but Robert M. Lee, chief executive of cybersecurity firm Dragos, said he believed Colonial's operations network was shut down proactively \"to make sure that nothing spread into those systems.\"\n\nHe said that will hopefully translate to \"a temporary outage versus something that would be more sustained.\"\n\nWHAT HAPPENS NEXT?\n\nUS government officials are working with Colonial to help it recover while scrambling to avoid more severe fuel supply disruptions should the outage continue.\n\nColonial's pipeline network serves major US airports, including Atlanta's Hartsfield Jackson Airport, the world's busiest by passenger traffic, and experts say regional fuel supplies could be impacted if the pipeline stays shut.\n\n\"A one-to-two-day outage is really a minor inconvenience,\" said Andrew Lipow , president of Lipow Oil Associates . But by day four or five, he said, \"we could see a much greater widespread impact through large areas throughout the mid-Atlantic and the southeast.\"\n\nWhether the pipeline stays shut that long in turn depends on how deeply the hackers penetrated Colonial's network - and how soon cybersecurity experts can pull them out.\n\n",
    "Title": "Hack at Colonial Pipeline: What we know and don't know"
  },
  {
    "Date": "Mon, 10 May 2021 10:55:08 +0530",
    "Description": "The Indian rupee advanced by 18 paise to 73.33 against the U.S. dollar in opening trade on Monday supported by positive domestic equities. At the int",
    "Image": "https://th.thgim.com/business/Economy/jr8vl5/article34304590.ece/ALTERNATES/FREE_960/NKV1-RUPEES",
    "Link": "https://www.thehindu.com/business/markets/rupee-rallies-18-paise-to-7333-against-us-dollar-in-early-trade/article34524573.ece",
    "Text": "The advance was supported by positive domestic equities.\n\nThe Indian rupee advanced by 18 paise to 73.33 against the U.S. dollar in opening trade on Monday supported by positive domestic equities.\n\nAt the interbank forex market, the local unit opened at 73.34 against the U.S. dollar, then inched higher to 73.33, reflecting a rise of 18 paise over its last close. The local unit also touched a low of 73.41 in initial deals.\n\nOn Friday, the rupee had settled at 73.51 against the American currency.\n\nThe rupee started on a stronger note against the dollar supported by improved risk appetite in the global and regional markets and weak dollar, Reliance Securities said in a research note.\n\nHowever, rise COVID-19 cases in India and likely presence of the Reserve Bank of India could cap gains, the note added.\n\nAfter recording over four lakh fresh cases for four consecutive days, India witnessed a single-day rise of 3,66,161 COVID-19 cases on Monday, which pushed its tally to 2,26,62,575, according to the health ministry.\n\nMeanwhile, the dollar index, which gauges the greenback’s strength against a basket of six currencies, rose 0.05% to 90.27.\n\nGlobal oil benchmark Brent crude futures rose 0.51% to $68.63 per barrel.\n\nOn the domestic equity market front, BSE Sensex was trading 286.91 points or 0.58% higher at 49,493.38, while the broader NSE Nifty rose 100.10 points or 0.68% to 14,923.25.\n\nForeign institutional investors were net sellers in the capital market on Friday as they offloaded shares worth ₹1,142.75 crore, as per exchange data.",
    "Title": "Rupee rallies 18 paise to 73.33 against U.S. dollar in early trade"
  },
  {
    "Date": "Mon, 10 May 2021 01:08:58 +0000",
    "Description": "While the impact has been limited so far, some energy analysts warned of possible shortages and higher prices as the suspension continues.",
    "Image": "https://static01.nyt.com/images/2021/05/09/lens/09supplies/09supplies-facebookJumbo.jpg",
    "Link": "https://www.nytimes.com/2021/05/09/business/energy-environment/colonial-pipeline-shutdown-gasoline.html",
    "Text": "HOUSTON — The operator of the largest petroleum pipeline between Texas and New York, which was shut down after a ransomware attack, declined on Sunday to say when it would reopen, raising concerns about a critical piece of infrastructure that carries nearly half of the East Coast’s fuel supplies.\n\nWhile the shutdown has so far had little impact on supplies of gasoline, diesel or jet fuel, some energy analysts warned that a prolonged suspension could raise prices at the pump along the East Coast and leave some smaller airports scrambling for jet fuel.\n\nColonial Pipeline, the pipeline operator, said on Sunday afternoon that it was developing “a system restart plan” and would restore service to some small lines between terminals and delivery points but “will bring our full system back online only when we believe it is safe to do so.”\n\nThe company, which shut down the pipeline on Friday, acknowledged on Saturday that it had been the victim of a ransomware attack by a criminal group, meaning that the hacker may hold the company’s data hostage until it pays a ransom. Colonial Pipeline, which is privately held, would not say whether it had paid a ransom. By failing to state a timeline for reopening on Sunday, the company renewed questions about whether the operations of the pipeline could still be in jeopardy.",
    "Title": "Hacked Pipeline May Stay Shut for Days, Raising Concerns About Fuel Supply"
  },
  {
    "Date": "Mon, 10 May 2021 10:56:04 +0530",
    "Description": "Elsewhere in Asia, bourses in Shanghai, Tokyo and Seoul were trading on a positive note in mid-session deals, while Hong Kong was in the red.",
    "Image": "https://th.thgim.com/business/markets/x3r1m5/article34492731.ece/ALTERNATES/FREE_960/TH06BUBSE",
    "Link": "https://www.thehindu.com/business/markets/sensex-surges-over-350-points-in-early-trade-nifty-tops-14900/article34524518.ece",
    "Text": "Elsewhere in Asia, bourses in Shanghai, Tokyo and Seoul were trading on a positive note in mid-session deals, while Hong Kong was in the red.\n\nEquity benchmark Sensex rallied over 350 points in early trade on Monday, tracking gains in index majors HDFC twins, ICICI Bank and Kotak Bank amid largely positive cues from global markets.\n\nThe 30-share BSE index was trading 353.64 points or 0.72% higher at 49,560.11 in initial deals.\n\nSimilarly, the broader NSE Nifty surged 114.85 points or 0.77% to 14,938.\n\nDr. Reddy’s was the top gainer in the Sensex pack, rising over 2%, followed by ONGC, HDFC, IndusInd Bank, ICICI Bank, Sun Pharma and Kotak Bank.\n\nOn the other hand, UltraTech Cement, Bajaj Finance, Nestle India and Infosys were among the laggards.\n\nIn the previous session, Sensex climbed 256.71 points or 0.52% to finish at 49,206.47, and Nifty rose 98.35 points or 0.67% to 14,823.15.\n\nForeign institutional investors (FIIs) were net sellers in the capital market as they offloaded shares worth ₹1,142.75 crore on Friday, according to provisional exchange data.\n\n“Domestic equities look good at the moment. Favourable global cues, steady March quarter earnings along with favourable commentary, liquidity support announced by the RBI and absence of nationwide lockdown have aided domestic equities to shrug off rising COVID-19 cases in the country,” said Binod Modi, Head Strategy at Reliance Securities.\n\nHowever, elevated daily caseload, higher positivity rate and rising COVID-19 cases in hinterlands of the country are expected to weigh on investors' sentiments and will prevent the market from taking any decisive upmove, he added.\n\nElsewhere in Asia, bourses in Shanghai, Tokyo and Seoul were trading on a positive note in mid-session deals, while Hong Kong was in the red.\n\nMeanwhile, international oil benchmark Brent crude was trading 0.44% higher at $68.58 per barrel.",
    "Title": "Sensex surges over 350 points in early trade; Nifty tops 14,900"
  },
  {
    "Date": "Mon, 10 May 2021 03:49:23 +0000",
    "Description": "The government has been using its money and power to create an alternative to a global news media dominated by outlets like the BBC and CNN.",
    "Image": "https://static01.nyt.com/images/2021/05/10/business/09jpBenSmith-print/merlin_184595013_c2248a66-69c2-4cb3-a638-15242c4450b4-facebookJumbo.jpg",
    "Link": "https://www.nytimes.com/2021/05/09/business/media/china-beijing-coronavirus-media.html",
    "Text": "In the fall of 2019, just before global borders closed, an international journalists’ association decided to canvass its members about a subject that kept coming up in informal conversations: What is China doing?\n\nWhat it found was astonishing in its scope. Journalists from countries as tiny as Guinea-Bissau had been invited to sign agreements with their Chinese counterparts. The Chinese government was distributing versions of its propaganda newspaper China Daily in English — and also Serbian. A Filipino journalist estimated that more than half of the stories on a Philippines newswire came from the Chinese state agency Xinhua. A Kenyan media group raised money from Chinese investors, then fired a columnist who wrote about China’s suppression of its Uyghur minority. Journalists in Peru faced intense social media criticism from combative Chinese government officials.\n\nWhat seemed, in each country, like an odd local anomaly looked, all told, like a vast, if patchwork, strategy to create an alternative to a global news media dominated by outlets like the BBC and CNN, and to insert Chinese money, power and perspective into the media in almost every country in the world.\n\nBut the study raised an obvious question: What is China planning to do with this new power?\n\nThe answer comes in a second report, which is set to be released on Wednesday by the International Federation of Journalists, a Brussels-based union of journalism unions whose mission gives it a global bird's-eye view into news media almost everywhere. The group, which shared a copy with me, hired an author of the first report, Louisa Lim, to canvass journalists in 54 countries. The interviews “reveal an activation of the existing media infrastructure China has put in place globally,” Ms. Lim, a former NPR bureau chief in Beijing who is now a senior lecturer at the University of Melbourne, wrote in the report. “As the pandemic started to spread, Beijing used its media infrastructure globally to seed positive narratives about China in national media, as well as mobilizing more novel tactics such as disinformation.”",
    "Title": "When Covid Hit, China Was Ready to Tell Its Version of the Story"
  },
  {
    "Date": "Mon, 10 May 2021 10:48:40 +0530",
    "Description": "This is the second time this year that rates in some parts have crossed the ₹100-a litre mark",
    "Image": "https://th.thgim.com/business/Economy/u9tom5/article34323937.ece/ALTERNATES/FREE_960/petrol-thmni",
    "Link": "https://www.thehindu.com/business/petrol-diesel-prices-at-record-highs-crosses-100-mark-in-maharashtra/article34524524.ece",
    "Text": "This is the second time this year that rates in some parts have crossed the ₹100-a litre mark\n\nPetrol and diesel prices on Monday hit record highs across the country after rates were increased for the fifth time in a week, following which Maharashtra joined Rajasthan and Madhya Pradesh in the league of states where petrol rates breached the ₹100-a-litre mark.\n\nPetrol price was hiked by 26 paise a litre and diesel by 33 paise per litre, according to a price notification by state-owned fuel retailers.\n\nThis was the fifth increase in prices since May 4, when the state-owned oil firms ended an 18-hiatus in rate revision during assembly elections in states like West Bengal.\n\nThe increase took petrol and diesel prices to their highest-ever level. In Delhi, petrol now comes for ₹91.53 per litre and diesel is priced at ₹82.06 per litre.\n\nWhile petrol prices had crossed the ₹100-mark in some places in Rajasthan and Madhya Pradesh a few days back, Maharashtra's Parbhani joined the league on Monday. Petrol in Parbhani was priced at ₹100.20 a litre, while in Bhopal it came for₹ 99.55 a litre.\n\nThe fuel is sold at ₹102.42 a litre in Sri Ganganagar district of Rajasthan and at ₹ 102.12 in Anuppur of Madhya Pradesh.\n\nThis is the second time this year that rates in some parts have crossed the ₹100-a litre mark. Rates had breached the physiological mark for the first time in mid-February.\n\nFuel prices differ from state to state depending on the incidence of local taxes such as VAT and freight charges. Rajasthan levies the highest value-added tax (VAT) on petrol in the country, followed by Madhya Pradesh.\n\nIn five increases in the last one week, petrol price has risen by ₹1.14 per litre and diesel by ₹1.33 — more than neutralising all of the reduction that came between March 24 and April 15.\n\nAfter raising petrol price by a record ₹21.58 per litre and diesel by ₹19.18 since the government raised excise duty to an all-time high in March last year, state-owned fuel retailers, IOC, BPCL and HPCL had reduced petrol price by 67 paise a litre and diesel by 74 paise per litre effected between March 24 and April 15.\n\nOil companies, who have in recent months resorted to unexplained freeze in rate revision, had hit a pause button after cutting prices marginally on April 15. This coincided with electioneering hitting peak to elect new governments in five states including West Bengal.\n\nNo sooner had voting ended, oil companies indicated an impending increase in retail prices in view of firming trends in international oil markets.\n\nThey said prices have been on a continuous uptrend since April 27, crude oil price is hovering near USD 70-per-barrel mark.\n\nCentral and state taxes make up for 60 per cent of the retail selling price of petrol and over 54 per cent of diesel. The union government levies ₹32.90 per litre of excise duty on petrol and ₹31.80 on diesel.\n\nIn Mumbai, the petrol price was hiked to ₹97.86 a litre on Monday from ₹97.61, while diesel rates were increased to Rs 89.17 from R₹88.82, the price notification showed.",
    "Title": "Petrol, diesel prices at record highs; crosses ₹100-mark in Maharashtra"
  },
  {
    "Date": "Mon, 10 May 2021 09:45:49 +0530",
    "Description": "Cipla’s deal with Lilly expands the its portfolio of COVID-19 drugs.",
    "Image": "https://th.thgim.com/business/ww4p3o/article30920173.ece/ALTERNATES/FREE_960/Ciplajpg",
    "Link": "https://www.thehindu.com/business/cipla-to-make-and-sell-eli-lillys-baricitinib-to-treat-covid-19/article34524250.ece",
    "Text": "Cipla’s deal with Lilly expands the its portfolio of COVID-19 drugs.\n\nDrugmaker Cipla Ltd said on Monday it had entered into a licensing agreement with U.S. company Eli Lilly and Co to make and sell Lilly’s arthritis drug baricitinib for the treatment of COVID-19 patients.\n\nThe agreement comes at a time when India is struggling with a catastrophic second wave of the pandemic, leading to an acute shortage of coronavirus medicines such as remdesivir and tocilizumab.\n\nBaricitinib has been given restricted emergency use approval by Central Drugs Standard Control Organisation (CDSCO) for use in combination with remdesivir for the treatment of hospitalised COVID-19 adult patients requiring supplemental oxygen, Cipla said in a filing to stock exchanges.\n\nIn November, the U.S. Food and Drug Administration initially gave Eli Lilly an emergency use approval for baricitinib in combination with remdesivir to treat COVID-19 patients.\n\nCipla’s deal with Lilly expands the its portfolio of COVID-19 drugs. Aside from remdesivir and tocilizumab, the company also offers antiviral drug favipiravir, used to treat patients with moderate to mild COVID-19.\n\nLast week, Cipla said it would be the local distribution partner for a COVID-19 antibody drug cocktail developed by Roche and Regeneron, after the therapy got emergency use approval from CDSCO.\n\nIndia has posted more than 4,00,000 daily coronavirus cases for the past four days, and its total infections have reached nearly 22.30 million, the second highest number of cases in the world after the United States.",
    "Title": "Cipla to make and sell Eli Lilly’s baricitinib to treat COVID-19"
  },
  {
    "Date": "Mon, 10 May 2021 01:48:05 GMT",
    "Description": "A new set of tools will let some regulators pull items from sale on eBay without company approval.",
    "Image": "https://ichef.bbci.co.uk/news/1024/branded_news/12DC3/production/_118415277_hi065992822.jpg",
    "Link": "https://www.bbc.co.uk/news/technology-57021383",
    "Text": "Another body with access is Ofcom, which among other roles regulates the radio waves used for broadcast and wireless signals. Certain types of wireless radio kit are tightly regulated - so that they cannot interfere with protected signals - and it plans to use the new tools to remove such items from sale.",
    "Title": "Dangerous eBay listings can be removed by regulators"
  },
  {
    "Date": "Mon, 10 May 2021 10:17:34 +0530",
    "Description": "Updates from the world of economy, markets, and finance",
    "Image": "https://th.thgim.com/business/markets/ns64qi/article34128489.ece/ALTERNATES/FREE_460/thnakIMGVBK-SENSEX-building251EF8CIMHAjpg",
    "Link": "https://www.thehindu.com/business/business-live/article34524404.ece",
    "Text": "The Nifty and the Sensex opened the day on a\n\nJoin us as we follow the top business news through the day.\n\n10:00 AM\n\nPetrol, diesel prices at record highs; Petrol crosses Rs 100-mark in Maharashtra\n\nPTI reports: \"Petrol and diesel prices on Monday hit record highs across the country after rates were increased for the fifth time in a week, following which Maharashtra joined Rajasthan and Madhya Pradesh in the league of states where petrol rates breached the Rs 100-a-litre mark.\n\nPetrol price was hiked by 26 paise a litre and diesel by 33 paise per litre, according to a price notification by state-owned fuel retailers.\n\nThis was the fifth increase in prices since May 4, when the state-owned oil firms ended an 18-hiatus in rate revision during assembly elections in states like West Bengal.\n\nThe increase took petrol and diesel prices to their highest-ever level. In Delhi, petrol now comes for Rs 91.53 per litre and diesel is priced at Rs 82.06 per litre.\n\nWhile petrol prices had crossed the Rs 100-mark in some places in Rajasthan and Madhya Pradesh a few days back, Maharashtra's Parbhani joined the league on Monday. Petrol in Parbhani was priced at Rs 100.20 a litre, while in Bhopal it came for Rs 99.55 a litre.\n\nThe fuel is sold at Rs 102.42 a litre in Sri Ganganagar district of Rajasthan and at Rs 102.12 in Anuppur of Madhya Pradesh.\n\nThis is the second time this year that rates in some parts have crossed the Rs 100-a litre mark. Rates had breached the physiological mark for the first time in mid-February.\n\nFuel prices differ from state to state depending on the incidence of local taxes such as VAT and freight charges. Rajasthan levies the highest value-added tax (VAT) on petrol in the country, followed by Madhya Pradesh.\n\nIn five increases in the last one week, petrol price has risen by Rs 1.14 per litre and diesel by Rs 1.33 - more than neutralising all of the reduction that came between March 24 and April 15.\n\nAfter raising petrol price by a record Rs 21.58 per litre and diesel by Rs 19.18 since the government raised excise duty to an all-time high in March last year, state-owned fuel retailers, IOC, BPCL and HPCL had reduced petrol price by 67 paise a litre and diesel by 74 paise per litre effected between March 24 and April 15.\n\nOil companies, who have in recent months resorted to unexplained freeze in rate revision, had hit a pause button after cutting prices marginally on April 15. This coincided with electioneering hitting peak to elect new governments in five states including West Bengal.\n\nNo sooner had voting ended, oil companies indicated an impending increase in retail prices in view of firming trends in international oil markets.\n\nThey said prices have been on a continuous uptrend since April 27, crude oil price is hovering near USD 70-per-barrel mark.\n\nCentral and state taxes make up for 60 per cent of the retail selling price of petrol and over 54 per cent of diesel. The union government levies Rs 32.90 per litre of excise duty on petrol and Rs 31.80 on diesel.\n\nIn Mumbai, the petrol price was hiked to Rs 97.86 a litre on Monday from Rs 97.61, while diesel rates were increased to Rs 89.17 from Rs 88.82, the price notification showed.\"\n\n9:30 AM\n\nDon’t sweat the small stuff\n\nBeing alive, being well, and being safe is all that matters today. Everything else is small stuff and not worth your sweat right now. In case you have been fretting about the following issues to do with your money, let’s just allay some of your concerns.\n\nIf you’re worried no end about the low interest your deposit is fetching you and making calls to banks or visiting their branches (with masks), to know where there are better rates, let it go. While the RBI is using many tools to keep the government bond rates low, the creeping inflation is slowly pushing rates up. If you have not noticed, some of the large NBFCs deposits have started increasing their deposit rates offered to senior citizens and you will likely see many such hikes slowly. Just renew your deposits for shorter periods of 3-6 months so that you can lock into higher rates a while later. If you have longer horizons, go for floating rate bonds from RBI or the other small savings schemes which still offer good rates.",
    "Title": "Business Live:"
  },
  {
    "Date": "Mon, 10 May 2021 00:54:55 GMT",
    "Description": "After a year of working from home, are you looking forward to getting back in the office or dreading it?",
    "Image": "https://ichef.bbci.co.uk/news/1024/branded_news/D5FE/production/_118428745_ashley.jpg",
    "Link": "https://www.bbc.co.uk/news/business-57010911",
    "Text": "For over a year anyone who has been able to, has been asked to do their job from home. And for many that has meant a whole catalogue of challenges from fitting work around home schooling to shooing the cat off your keyboard.",
    "Title": "Office or home? The pleasure and pain of lockdown working"
  },
  {
    "Date": "Mon, 10 May 2021 03:24:53 GMT",
    "Description": "The value of the cryptocurrency has fallen sharply after Mr Musk called it a \"hustle\" on US TV.",
    "Image": "https://ichef.bbci.co.uk/news/1024/branded_news/17196/production/_118441649_gettyimages-1229893385-1.jpg",
    "Link": "https://www.bbc.co.uk/news/business-57052811",
    "Text": "The announcement was seen as another major step towards the mainstream acceptance of bitcoin and helped to boost the price of the cryptocurrency to a fresh record high of nearly $62,000.",
    "Title": "Cryptocurrency: Musk's SpaceX to launch dogecoin moon mission"
  },
  {
    "Date": "Mon, 10 May 2021 02:22:16 GMT",
    "Description": "The US acts to keep fuel flowing after its largest pipeline was hit by a ransomware cyber-attack.",
    "Image": "https://ichef.bbci.co.uk/news/1024/branded_news/47EE/production/_118441481_colonial-pipeline2.jpg",
    "Link": "https://www.bbc.co.uk/news/business-57050690",
    "Text": "He says it is possible for anyone to look up the login portals for computers connected to the internet on search engines like Shodan, and then \"have-a-go\" hackers just keep trying usernames and passwords until they get some to work.",
    "Title": "US passes emergency waiver over fuel pipeline cyber-attack"
  },
  {
    "Date": "Mon, 10 May 2021 10:53:14 +0530",
    "Description": "As an increasing number of platforms are opening up their apps for audio-based chat forums, Clubhouse is doubling its efforts to get a slice of the Android pie.",
    "Image": "https://th.thgim.com/sci-tech/technology/internet/c0sre/article34356539.ece/ALTERNATES/FREE_960/clubhouse-AFPjpg",
    "Link": "https://www.thehindu.com/sci-tech/technology/internet/clubhouse-app-says-hello-to-android/article34524181.ece",
    "Text": "As an increasing number of platforms are opening up their apps for audio-based chat forums, Clubhouse is doubling its efforts to get a slice of the Android pie.\n\n(Subscribe to our Today's Cache newsletter for a quick snapshot of top 5 tech stories. Click here to subscribe for free.)\n\nA little over a year after making its debut in iOS, audio-chatting app Clubhouse is now opening its account in Android. The app was launched last March exclusively for iOS users to let them connect with others via chat rooms sans cameras.\n\nBy the time it was ready for general use to all Apple users in June, ‘zoom fatigue’ was starting to set in, making people log on to Clubhouse to socialise. Within ten months of its launch, the app enabled over two million people, from musicians to stock traders, to meet, to talk and connect on the platform.\n\nClubhouse’s success has made several other social media firms start their own versions of audio-chatting feature. Twitter launched Spaces for its users to meet and join impromptu discussions started by those they follow. Facebook is said to be working on a similar interface that can be accessed by people via its Messenger app.\n\nEven enterprise chat service Slack is said to be experimenting a Clubhouse-like feature for its users. Most recently, Reddit said it is testing an audio-only chat feature to let its users host live discussions within its communities.\n\nAs an increasing number of platforms are opening up their apps for audio-based chat forums, Clubhouse is doubling its efforts to get a slice of the Android pie. Just a few weeks ago, Clubhouse closed a new round of funding led by Andrew Chen of venture capital firm Andreesen Horowitz - - the app was valued at $4 billion.\n\nNow, it is starting to test waters in a market where Twitter, Facebook and Reddit have already set sail. But Clubhouse founders Paul Davison and Rohan Seth are planning to wade through Android the same way they did in iOS, through invite-only sign ups. When Davison and Seth launched the app for iPhone users, people were given access through invitation links.\n\nWith its Android launch, Clubhouse plans to navigate the same way. “As a part of the effort to keep the growth measured, we will be continuing the waitlist and invite system, ensuring that each new community member can bring along a few close friends,” the company said in a blog post.\n\nThe app will be first rolled out in beta, starting with the U.S., followed by other English-speaking countries. In the next few weeks, Clubhouse plans to collect feedback from the community and fix any issues before a full roll out for all Android users.",
    "Title": "Clubhouse app says hello to Android"
  },
  {
    "Date": "Mon, 10 May 2021 00:16:04 +0530",
    "Description": "West Bengal CM wrote to PM Modi to waive taxes, duties on medical equipments, drugs.",
    "Image": "https://th.thgim.com/business/Economy/trevyw/article34520618.ece/ALTERNATES/FREE_960/NirmalaSitharaman",
    "Link": "https://www.thehindu.com/business/Economy/full-exemption-from-customs-duties-is-available-to-all-covid-relief-material-says-nirmala-sitharaman/article34520619.ece",
    "Text": "West Bengal CM wrote to PM Modi to waive taxes, duties on medical equipments, drugs.\n\nFinance Minister Nirmala Sitharaman on May 9 said GST exemption to domestic supplies and commercial import of COVID-19 drugs, vaccines and oxygen concentrators would make these items costlier for consumers as manufacturers would not be able to offset the taxes paid on inputs.\n\nEarlier in the day Ms. Banerjee wrote to Prime Minister Narendra Modi to consider exempting organisations, agencies and individuals supplying equipment and drugs related to the management of the COVID-19 pandemic from customs duty and other Central taxes.\n\nThe Finance Minister tweeted her response to Ms. Banerjee's letter:\n\n“A list of items for COVID relief granted exemption from IGST for imports was issued on May 3, 2021. These were given exemption from Customs Duty/health cess even earlier. Hon. CM @MamataOfficial, may notice that items in your list are covered,” she said, adding “Full exemption from Customs duties, including IGST, is already available to ALL COVID relief material [not confined to a list] imported by @IndianRedCross for free distribution in the country.”\n\n2/ A list of items for COVID relief granted exemption from IGST for imports was issued on 3rd May’21. These were given exemption from Customs Duty/health cess even earlier.\n\n\n\nHon. CM @MamataOfficial , may notice that items in your list are covered. @ANI @PIB_India @PIBKolkata pic.twitter.com/zuDJP1vOB0 — Nirmala Sitharaman (@nsitharaman) May 9, 2021\n\nMs. Sitharaman said: “With effect from 3 May, 2021, full exemption from all duties has been provided to Remdesivir injections, Remdesivir API, and for a chemical for the manufacture of this drug.\n\n“Also to Medical Oxygen, equipment used for the manufacture, storage and transportation of oxygen, equipment used for providing oxygen therapy to COVID patients such as Oxygen Concentrators, Ventilators, Non-invasive oxygen masks etc.\n\n“Also to Inflammatory diagnostic kits and reagents for COVID testing and COVID vaccines.\n\n“This exemption applies to all above mentioned goods when imported free of cost for free distribution in the country by any entity, State government, relief agency or autonomous body on the basis of a certificate issued by a State government.\n\n“In order to augment the availability of these items, government has also provided full exemption from basic customs duty and health cess to their commercial imports.”\n\nMs. Sitharaman further said: “GST at rates varying from 5% [on vaccines], 12% [COVID drugs, oxygen concentrators] is applicable to domestic supplies and commercial import of these items.\n\n“If IGST ₹100 is collected on an item, ₹50 accrues to the Centre and the States each as CGST and SGST respectively. Further 41% of the CGST revenue is devolved to States. So out of a collection of ₹100, as much as ₹70.50 is the States’ share.\n\n“If full exemption from GST were given, the domestic producers of these items would be unable to offset taxes paid on their inputs and input services and would pass these on to the end consumers by increasing their price.\n\n“COVID vaccines are being provided free of cost by the GoI to those who are 45 years of age & above and to all frontline workers. On Government supplies, GST is also paid by the government.”\n\n“From the GST collected on vaccine, half is earned by the Centre and the other half by the States. Further, 41% of Centre’s collections also get devolved to the States,” she noted, adding “So States end up receiving almost 70% of the total revenue collected from vaccines. In fact, a nominal 5% GST is in the interest of the domestic manufacturer of vaccine and in the interest of the citizens. If full exemption from GST is given, vaccine manufacturers would not be able to offset their input taxes and would pass them on to the end consumer/citizen by increasing the price.\"\n\n“A 5% GST rate ensures that the manufacturer is able to utilise ITC and in case of overflow of ITC, claim refund. Hence exemption to vaccine from GST would be counterproductive without benefiting the consumer,” Ms. Sitharaman said.",
    "Title": "Nirmala Sitharaman lists tax waiver on COVID-19 relief goods"
  },
  {
    "Date": "Mon, 10 May 2021 09:29:56 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/business/india-business/cipla-to-make-and-sell-eli-lillys-baricitinib-to-treat-covid-19/articleshow/82514234.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82514234.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a> Pharma major Cipla Limited on Monday announced that it has signed a royalty-free, non-exclusive voluntary licensing agreement with Eli Lilly and Company, USA, for the manufacturing and commercialization of rheumatoid arthritis drug Baricitinib for treatment of Covid-19 patients.",
    "Image": "https://static.toiimg.com/thumb/msid-82514248,width-1070,height-580,imgsize-547739,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/business/india-business/cipla-to-make-and-sell-eli-lillys-baricitinib-to-treat-covid-19/articleshow/82514234.cms",
    "Text": "HYDERABAD: Pharma major Cipla Limited on Monday announced that it has signed a royalty-free, non-exclusive voluntary licensing agreement with Eli Lilly and Company, USA, for the manufacturing and commercialization of rheumatoid arthritis drug Baricitinib for treatment of Covid-19 patients.Baricitinib was issued a restricted emergency use approval by the Central Drugs Standard Control Organization (CDSCO), Union Ministry of Health, for use of the drug in combination with Remdesivir for the treatment of suspected or laboratory confirmed Covid-19 in hospitalized adults requiring supplemental oxygen, invasive mechanical ventilation, or extracorporeal membrane oxygenation (ECMO).Cipla said this collaboration is a step further in the company’s efforts to enhance access to critical treatments for patients affected by the pandemic. Cipla will leverage its extensive distribution footprint to make this therapy accessible to more patients and markets.Commenting on the partnership, Umang Vohra, managing director & Global CEO, Cipla Limited said, “Enabling access to high-quality treatment and medication is core to our purpose of ‘Caring for life.’ Through the pandemic, Cipla has been at the forefront of Covid care and our partnership with Lilly is a demonstration of our unwavering commitment to care towards patients impacted by Covid-19.”",
    "Title": "Cipla to make, sell Eli Lilly's baricitinib to treat Covid-19"
  },
  {
    "Date": "Mon, 10 May 2021 09:12:00 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/business/india-business/companies-take-covid-relief-initiatives-for-employees/articleshow/82513889.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82513889.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>",
    "Image": "https://static.toiimg.com/thumb/msid-82514012,width-1070,height-580,imgsize-167785,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/business/india-business/companies-take-covid-relief-initiatives-for-employees/articleshow/82513889.cms",
    "Text": "BENGALURU: Companies are taking several steps to support employees and their families in battling Covid-19 . Wipro has said it will reimburse affected employees and family members if their treatment costs exceed the insurance coverage. CEO Thierry Delaporte wrote in a LinkedIn post that they would also offer extended time off to recover from the disease, or support family or friends, or prioritise mental health. He also wrote that the company has arranged \"fully-funded Covid isolation centres in various cities.\"TOI had reported that HCL Technologies is offering a Rs 30 lakh insurance cover and an additional Rs 7 lakh employee deposit linked insurance cover to employees for Covid-19. In the event of an HCL employee's unfortunate demise due to Covid, the families will get the full value of this cover, as also an amount equal to the one-year salary of the employee.For Infosys, Covid-related medical treatments are covered under the group employee insurance. Infosys has set up employee Covid care centres in Pune and Bengaluru. These centres would be managed by Ruby Hall hospital for Pune, and Manipal Hospitals for Bengaluru. Employees who have contracted or recovering from Covid-19 are given 21 days of additional paid leave by the company.Accenture said they have built several resources including 24/7 telemedicine services, care-at-home services, enhanced insurance coverage, virtual childcare, mental health support, and support for testing and vaccinations to support its over two lakh employees and their families in India. It has also created options for caregivers.Cognizant is providing access to vaccines for all its employees and their dependents, medical support for Covid-19 positive associates and their immediate family members, paid leave for Covid care or recovery, and emergency financial support for junior staff in dire cases to help cover medical expenses.Capgemini India has created a command centre that addresses the employees and their dependents' medical emergencies and needs related to the availability of hospital beds, ICU, ventilators, ambulance service, blood plasma donors, oxygen concentrators, and medicine requests. It has initiated a project to provide oxygen concentrators for employees and their dependent family members affected by Covid-19. In case of financial needs, employees can avail salary advance. Goldman Sachs is offering ten days of Covid-19 family leave to take care of pandemic-related disruptions. It is also providing a “Care for Others Day” off for its employees in India, to be used before the end of June.Arvind Krishna, chairman & CEO of IBM , said the firm is supplementing medical coverage for employees.",
    "Title": "Companies take Covid relief initiatives for employees"
  },
  {
    "Date": "Mon, 10 May 2021 05:01:09 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/business/india-business/gst-waiver-on-drugs-jabs-will-hit-users-fm/articleshow/82512439.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82512439.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>Finance minister Nirmala Sitharaman on Sunday turned down West Bengal CM Manerjee’s demand for GST waiver on items being used for battling Covid-19. “If full exemption from GST were given, domestic producers of these items would be unable to offset taxes paid on their inputs and input services and would pass these on to the end consumers by increasing their price,” the FM said.",
    "Image": "https://static.toiimg.com/thumb/msid-82512442,width-1070,height-580,imgsize-205019,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/business/india-business/gst-waiver-on-drugs-jabs-will-hit-users-fm/articleshow/82512439.cms",
    "Text": "Covid-19: GST waiver on drugs, jabs will hit users, says FM\n\nKOLKATA/ NEW DELHI: Finance minister Nirmala Sitharaman on Sunday turned down West Bengal CM Mamata Manerjee’s demand for GST waiver on some of the items being used for battling Covid-19, arguing that the levy was needed to ensure that domestic producers get tax credit for taxes paid on inputs and services and prices remain low.“If full exemption from GST were given, domestic producers of these items would be unable to offset taxes paid on their inputs and input services and would pass these on to the end consumers by increasing their price,” the FM said in a series of tweets in response to Banerjee’s letter. She also used the same argument for vaccines, while underlining that the Centre was providing free vaccines to those above 45 years as well as frontline workers and also bearing the GST.Banerjee had written to PM Modi seeking GST and customs duty waiver on medical equipment, medicines and oxygen, required to fight Covid 19.",
    "Title": "GST waiver on drugs, jabs will hit users: FM"
  },
  {
    "Date": "Mon, 10 May 2021 00:44:10 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/business/india-business/covid-deaths-cos-go-all-out-to-aid-families/articleshow/82507799.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82507799.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>In an attempt to ease the pain of families of deceased employees, several organisations are offering benefits like a one-time compassionate payment, financial sponsorship for education of their children and an employment opportunity to the spouses.",
    "Image": "https://static.toiimg.com/thumb/msid-82513259,width-1070,height-580,imgsize-71284,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/business/india-business/covid-deaths-cos-go-all-out-to-aid-families/articleshow/82507799.cms",
    "Text": "(With inputs from Mayur Shetty)\n\nMUMBAI: As India continues to battle a ravaging second wave of Covid, many companies are showing solidarity by extending monetary and non-monetary benefits to families of employees claimed by the coronavirus. India has recorded more than 2.4 lakh Covid deaths, according to the latest Union health ministry data.In an attempt to ease the pain of families of deceased employees, several organisations are offering benefits like a one-time compassionate payment, financial sponsorship for education of their children and an employment opportunity to the spouses. The number of Covid casualties at individual firms is, however, not known as regulations mandate listed companies to disclose the deaths of key managerial personnel only. J Sagar Associates, a leading law firm in India, said that as the count of Covid deaths is spiraling by the minute, companies are stepping forward to provide bereavement support to grieving families. “Apart from taking responsibility for children’s education and continuing disbursement of an employee’s full salary up to two years, companies are covering hospitalisation, funeral and vaccination expenses,” said Minu Dwivedi, a partner at J Sagar Associates.Many companies have expanded their group term insurance to include Covid protection for their employees. Tata Consultancy Services (TCS) is offering an insurance cover of Rs 23 lakh, or an amount equivalent to six times of an employee’s annual compensation, whichever is higher, to his/her family in the event of the person’s death due to Covid. TCS employs close to 5 lakh people — the largest employer of software professionals in the country (more than 70% of those are based in India).Muthoot Finance, India’s largest gold loan NBFC, has decided to pay the next 24 months’ salary to the spouse or mother of a deceased employee if s/he had completed three years of service. For employees whose total period of service is less than three years, the payout will be for the next 12 months.ICICI Lombard, the country’s leading private non-life insurer, will grant employment to the deceased staff’s spouse if the latter has suitable education qualifications and fits the available role. Among other support endeavours, it will also offer terminal benefits (like provident fund and gratuity) to the family of the deceased employee. This would be done even if s/he had not completed the designated period required to get the gratuity.Companies have extended the group term insurance to include Covid financial protection for distributors and third-party packaging units’ people too. “The second wave has affected many of our employees, partners and their families across India,” said Tata Consumer Products MD Sunil D’Souza. “We have covered all frontline employees, including partner workforce in sales and manufacturing through specific medical assistance, hospitalisations and insurance programmes,” D’Souza added.Last week, Kotak Mahindra Bank revealed it lost 17 employees to Covid in fiscal 2021 and another 17 last month. “What we lost in the (last fiscal), we have lost in April 2021 alone,” said Uday Kotak, MD of India’s third-largest private sector bank.K Raheja Corp, leading commercial and residential property developer, is offering a term cover equal to one-year gross salary to family members in the event of any employee succumbing to Covid. “While nothing can replace the loss of a loved one, we endeavour to assist in improving financial security with term insurance,” said the company’s HR chief Urvi Aradhya.In a LinkedIn post, glassware brand Borosil, which lost four employees to Covid, had said it will sponsor the education of their children up to graduation in India.HCL Technologies is offering Rs 30-lakh insurance, Rs 7-lakh employees deposit linked insurance and an amount equal to the annual salary of the deceased professional to the family members, as TOI reported in its Saturday edition.",
    "Title": "Covid deaths: Companies go all out to aid families"
  },
  {
    "Date": "Mon, 10 May 2021 07:39:38+5:30 ",
    "Description": "Share Market LIVE Updates: Benchmark indices opened strong on global cues. Asian markets were trading on a firm note, while Dow and S&amp;amp;P ended at record high on Friday",
    "Image": "https://images.livemint.com/img/2021/05/10/600x338/stocktraders-kZEB--621x414@LiveMint_1620612096239.jpg",
    "Link": "https://www.livemint.com/market/stock-market-news/share-market-live-updates-sensex-nifty-bse-nse-stock-market-today-10-05-2021-hero-motocorp-maruti-suzuki-11620611369034.html",
    "Text": "",
    "Title": "Market LIVE: Sensex gains 350 points; Nifty above 14,900; pharma, metal lead"
  },
  {
    "Date": "Mon, 10 May 2021 10:57:48+5:30 ",
    "Description": "Petrol has become costlier by 23-26 paise, as compared to Sunday, while the price of diesel has increased by 31-35 paise.",
    "Image": "https://images.livemint.com/img/2021/05/10/600x338/2020-06-24T095357Z_1_LYNXMPEG5N13Q_RTROPTP_3_INDIA-BUISNESS_1593323779020_1620623397177.JPG",
    "Link": "https://www.livemint.com/market/stock-market-news/ioc-bpcl-hpcl-shares-gain-on-fuel-price-hike-11620619599110.html",
    "Text": "Shares of oil marketing companies (OMCs) surged up to 2% in Monday's trading session after petrol and diesel prices were hiked on Monday after a two-day pause. As compared to Sunday, petrol has become costlier by 23-26 paise while the price of diesel has increased by 31-3 paise.\n\nIndian Oil Corporation (IOC) shares were trading 2.43% higher at ₹97 per share on the BSE at around 10:50 am. Shares of Hindustan Petroleum Corporation (HPCL) surged 1.25% to trade at around ₹254.75 apiece while Bharat Petroleum Corporation (BPCL) rose 1.2% to hover around ₹449 per share.\n\nIn Delhi, petrol prices were increased by 26 paise from ₹91.27 per litre to ₹91.53 per litre and diesel by 33 paise from ₹81.73 per litre to ₹82.06 per litre, according to the state-owned fuel retailers. Whereas, Petrol in Mumbai retailed at ₹97.86 per litre while diesel at ₹89.17 per litre.\n\nMaharashtra joined Rajasthan and Madhya Pradesh in the league of states where petrol rates breached the ₹100-a-litre mark. The fuel is sold at ₹102.42 a litre in Sri Ganganagar district of Rajasthan and at ₹102.12 in Anuppur of Madhya Pradesh.\n\nMaharashtra's Parbhani joined the league on Monday. Petrol in Parbhani was priced at ₹100.20 a litre, while in Bhopal it came for ₹99.55 a litre, as reported by PTI.\n\nFuel prices differ from state to state depending on the incidence of local taxes such as value added tax (VAT) and freight charges.\n\nOn the other hand, Crude prices climbed more than 1% on Monday after a major cyber attack forced the shutdown of critical fuel supply pipelines in the United States.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter.",
    "Title": "IOC, BPCL, HPCL shares gain on fuel price hike"
  },
  {
    "Date": "Mon, 10 May 2021 10:01:50+5:30 ",
    "Description": "The rally was led by better-than-expected earnings and gains in global equities",
    "Image": "https://images.livemint.com/img/2021/05/10/600x338/20210118023L_1615990836946_1620621003487.jpg",
    "Link": "https://www.livemint.com/market/stock-market-news/markets-open-higher-for-fourth-consecutive-session-11620619961570.html",
    "Text": "Indian markets opened higher for the fourth consecutive session on Monday led by better-than-expected earnings and gains in global equities.\n\nAt 9.40 am, the benchmark Sensex rose 0.56% to 49,480 points while Nifty gained 0.61% to 14,914 points.\n\n\"Markets focus on earnings, particularly future earnings. Trends indicate robust future earnings, particularly from segments such as IT, pharma, leading financials and metals. Consumer discretionary is, however, on a sticky wicket. This segment, particularly autos, might witness earnings downgrades\", said V. K. Vijayakumar, chief investment strategist at Geojit Financial Services.\n\n\"The global economic backdrop is favourable, with strong economic recovery led by the US, China and most parts of Europe. In India, fresh covid cases are declining in Maharashtra, Madhya Pradesh and Delhi,\" Vijayakumar added.\n\nGlobal markets climbed after S&P500 hit a record on weak jobs data that added to the case for ongoing stimulus. Australian stocks were set for an all-time high; Japan to South Korea stocks advanced.\n\n\"We are witnessing a rise in covid cases. Hope of recovery through vaccine drives and a positive global market helped the domestic market ride a positive wave during the week,\" said Vinod Nair, head of research at Geojit Financial.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter.",
    "Title": "Markets open higher for fourth consecutive session"
  },
  {
    "Date": "Mon, 10 May 2021 08:26:08+5:30 ",
    "Description": "Asian stocks rose on Monday amid speculation that interest rates will remain low due to receding inflationary pressure, while oil and gas prices jumped after a cyber attack on a US pipeline operator unnerved markets",
    "Image": "https://images.livemint.com/img/2021/05/10/600x338/367428892_0-14_1614081046333_1614081059311_1620615058418.jpg",
    "Link": "https://www.livemint.com/market/stock-market-news/markets-likely-to-consolidate-bandhan-bank-avenue-supermarts-in-focus-11620614958235.html",
    "Text": "Mumbai: Stock markets are likely to consolidate further on Monday while trends in SGX Nifty suggest a positive opening of Indian benchmark indices. On Friday the BSE Sensex ended at 49,206.47, up 256.71 points or 0.52%, and the Nifty closed at 14,823.15, up 98.35 points or 0.67%.\n\nAsian stocks rose on Monday amid speculation that interest rates will remain low due to receding inflationary pressure, while oil and gas prices jumped after a cyber attack on a US pipeline operator unnerved markets.\n\nAustralian stocks hit their highest in more than a year, boosted by gains in miners, and shares in China rose 0.46%. Japanese shares gained 0.91%.\n\nUS non-farm payrolls data on Friday showed jobs growth unexpectedly slowed in April, which gave equities a lift but put downward pressure on the dollar and US Treasury yields.\n\nOn Friday, the Dow Jones Industrial Average and the S&P 500 rose to record closing highs after disappointing data on the U.S. jobs market eased concerns about a spike in consumer prices.\n\nIn recent weeks, some investors had been placing bets that a robust US economic recovery from the coronavirus pandemic would force the Federal Reserve to raise interest rates earlier than the central bank has outlined.\n\nHowever, the weak nonfarm payrolls report caused a rapid reversal in some of these trades, which rippled through stocks, bonds, and major currencies.\n\nThe focus now shifts to US consumer price data due on Wednesday, which will help investors determine whether they need to scale back their inflation expectations even further.\n\nMSCI’s broadest index of global stock markets hit a record high on expectations that low rates will continue to spur lending and economic growth.\n\nBack home, Bandhan Bank shares will be in focus, as the lender on Saturday reported an 80% dip in its March quarter net profit at ₹103 crore, as it wrote off a huge portfolio of loans in the flagship microlending business by recognising stress upfront. The bank’s post-tax profit for FY21 also reduced by 27.1% to ₹2,205 crore as a result of the hit to the business in the last quarter.\n\nTwo-wheeler market leader Hero MotoCorp on Sunday said it is extending the shutdown of its plants across India by another week till May 16 in view of the prevailing covid-19 situation in the country.\n\nEven, Maruti Suzuki India on Saturday said it has extended maintenance shutdown of its plants till May 16 amid the ongoing surge in covid-19 cases across the country. The company had last month said it was advancing the annual plant maintenance shutdown to 1-9 May, which was originally scheduled for June.\n\nAvenue Supermarts Ltd, which owns and operates retail chain D-Mart, on Saturday reported an increase of 52.56% in its consolidated net profit to ₹413.87 crore for the fourth quarter ended March 2021.\n\nThe dollar index against a basket of six major currencies edged up to 90.252 but was still near its weakest since Feb. 25.\n\nThe British pound jumped to the highest in more than two months against the greenback, but worries about Scottish independence could curb sterling’s gains, traders said.\n\nThe yield on benchmark 10-year Treasury notes steadied at 1.5983% in Asia on Monday after having plunged to a two-month low of 1.4690% on Friday.\n\nOil and gasoline futures extended gains after a cyber attack shut down a U.S. pipeline operator that provides nearly half of the U.S. east coast’s fuel supply.\n\nU.S. crude ticked up 1.17% to $65.66 a barrel. Brent crude rose to 1.11% to $69.04 per barrel in Asian trading as the disruption to U.S. supplies rattled energy markets.\n\n(Reuters contributed to the story)\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter.",
    "Title": "Markets likely to consolidate; Bandhan Bank, Avenue Supermarts in focus"
  },
  {
    "Date": "Mon, 10 May 2021 08:05:31+5:30 ",
    "Description": "Crude prices climbed on Monday after a major cyber attack that forced the shutdown of critical fuel supply pipelines in the US, highlighting the fragility of oil infrastructure.",
    "Image": "https://images.livemint.com/img/2021/05/10/600x338/2021-05-05T163441Z_1071389653_RC2S9N9JTRIC_RTRMADP_3_PIONEER-NATURAL-RESOURCES-RESULTS_1620578273552_1620614018645.JPG",
    "Link": "https://www.livemint.com/market/commodities/oil-rises-1-after-cyber-attack-forces-closure-of-us-fuel-jugular-pipeline-11620610154131.html",
    "Text": "Crude prices climbed more than 1% on Monday after a major cyber attack that forced the shutdown of critical fuel supply pipelines in the United States, highlighting the fragility of oil infrastructure.\n\nBrent crude was up by 76 cents, or 1.1%, at $$69.04 a barrel by 0039 GMT, having risen by l.5% last week. U.S. West Texas Intermediate futures rose by 70 cents, or 1.1%, at $65.60 a barrel, after gaining more than 2% last week.\n\nSignalling the seriousness of the situation, the White House was working closely with Colonial Pipeline to help it recover from the ransomware attack, which forced the biggest U.S. fuel pipeline operator to shut a network supplying populous eastern states.\n\nColonial's network is the source of nearly half of the U.S. East Coast's fuel supply, transporting 2.5 million barrels per day of gasoline and other fuels, and the company had to shut all its pipelines after the cyber attack on Friday, which involved ransomware.\n\nIt was not clear who carried out the attack, but sources told Reuters the hackers were likely a professional cybercriminal group.\n\nColonial said on Sunday its main fuel lines remain offline but some smaller lines between terminals and delivery points are now operational. It didn't say when the network might return to full operational capacity.\n\n\"The major takeaway is the bad guys are very adept at finding new ways to penetrate infrastructure,\" Andrew Lipow, president of Lipow Oil Associates told Reuters. \"Infrastructure has not developed defences that can offset all the different ways that malware can infect one's system.\"\n\nA prolonged shutdown of the line, described as the \"jugular of infrastructure\" in the United States by one analyst, would cause prices to spike at gasoline pumps ahead of peak summer driving season, a potential blow to U.S. consumers and the economy.\n\nU.S. gasoline prices jumped nearly 2%, while heating oil was up by more than 1%.\n\nThe attack has prompted calls from American lawmakers to strengthen protections for critical U.S. energy infrastructure from hacking attacks.\n\nThe Department of Energy said it was monitoring potential impacts to the nation's energy supply, while the U.S. Cybersecurity and Infrastructure Security Agency and the Transportation Security Administration told Reuters they were working on the situation.\n\n\n\n\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter.",
    "Title": "Oil rises 1% after cyber attack forces closure of US fuel 'jugular' pipeline"
  },
  {
    "Date": "Mon, 10 May 2021 10:34:48+5:30 ",
    "Description": "The company’s first half of FY21 was terribly hit by the impact of the covid-19 pandemic but subsequent quarters saw improvement, and the March quarter saw revenue growth improve at 18%",
    "Image": "https://images.livemint.com/img/2021/05/10/600x338/d-mart-k5vC--621x414@LiveMint_1620623001443.JPG",
    "Link": "https://www.livemint.com/market/mark-to-market/dmart-ends-challenging-fy21-well-but-it-isn-t-stoic-to-new-covid-wave-11620621205934.html",
    "Text": "MUMBAI : When the going gets tough, the tough get going. That probably sums up what food and grocery retailer Avenue Supermarts Ltd’s financial year 2021 (FY21) has been like. Avenue runs the DMart chain of retail stores.\n\nThe company’s first half of FY21 was terribly hit by the impact of the covid-19 pandemic with standalone revenues declining by around 34% year-on-year in the June quarter. Revenue drop was curtailed to 12% in the September quarter. Subsequent quarters saw further improvement. In fact, revenues increased in the December quarter by 10% year-on-year. Revenue growth further improved in the March quarter at 18%.\n\nBut the big problem now is that India is witnessing a second wave and that means Avenue’s recovery would be cut short. JM Financial Institutional Securities Ltd’s analysts sum it up beautifully, “Progression here onwards could have been as if nothing had happened in between, had the second wave of the pandemic not struck.\"\n\nThe broker added in a report on 8 May, “DMart’s March quarter report reflects the business’ near-total return to normalcy within 9-12 months of lockdown-related disruptions first setting-in during March 2020. Revenue per store is up 8% versus March 2019 quarter level with margin also higher versus two-year ago level.\"\n\nThe new covid wave has led to the imposition of various restrictions across regions, which is likely to hit Avenue’s revenues in the foreseeable future. Taking note of this, analysts have trimmed their revenue estimates for FY22.\n\nAvenue said, “In general, more than 80% of our stores are operating for significantly lower number of hours (not exceeding four hours per day) or are even shut for operations for one to weeks or shut on weekends. These shut downs are having an adverse and severe impact on our revenues.\"\n\nIn FY21, the company opened 22 new stores and converted 2 stores into fulfilment centres for Avenue E-Commerce Ltd, taking the total store count to 234 as on March-end.\n\nComing to the March quarter results, earnings before interest, tax, depreciation, and amortization (Ebitda) margin stood at 8.4%, representing a decline of 86 basis points vis-à-vis the December quarter. One basis point is 0.01%. For perspective: Ebitda margin in the March 2020 and March 2019 quarters stood at 6.7% and 7.5%, respectively.\n\nOverall, for FY21, Avenue’s revenues declined by 3.6% year-on-year but net earnings fell at a sharper rate of almost 14%. Weak operating margin performance weighed on profitability for the year, as Ebitda margins contracted by 128 basis points. In FY21, foods, non-foods (FMCG) and general merchandise and apparel, accounted for 57.4%, 19.69% and 22.90% of the revenues, respectively.\n\nMeanwhile, in early deals on Monday, Avenue’s shares were trading marginally up on the National Stock Exchange. Understandably, covid-19 challenges have weighed on the sentiments for the stock, which has declined about 13% from its 52-weeks highs on 5 March. True, valuations have corrected a bit, but the stock still remains pricey.\n\nAs ICICI Securities Ltd’s analysts point out in a report on 9 May, “After the material (more than 35%) stock underperformance over last one year, valuations have become a tad more palatable (stock now trades at 73 times price-to-earnings ratio and 50 times Ebitda on FY2023e).\" The broker’s target price of Rs2,600 is around 12% lower than DMart current share price.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter.",
    "Title": "DMart ends challenging FY21 well, but it isn’t immune to new covid wave"
  },
  {
    "Date": "Mon, 10 May 2021 00:01:06+5:30 ",
    "Description": "Ceat has said it will focus on cost-cutting measures to partly offset the impact of cost inflation headwinds",
    "Image": "https://images.livemint.com/img/2021/05/09/600x338/tyre--621x414_1620585021012.jpg",
    "Link": "https://www.livemint.com/market/mark-to-market/margin-pressure-not-the-only-concern-for-ceat-s-investors-11620584808440.html",
    "Text": "Investors in the Ceat Ltd stock are in for a bumpy ride as input cost inflation has started to impact the tyre maker’s margins, despite price hikes. In the March quarter, consolidated gross margins contracted by 360 basis points (bps) sequentially to 42%. One basis point is one-hundredth of a percentage point. Compared to the year-ago period, gross margins shrank by 370bps. The decline in margins is 150-200bps higher than the Street’s expectations.\n\nRaw material cost per kilogram increased by 8-10% quarter-on-quarter in Q4FY21 due to a sharp surge in the raw material basket, the Ceat management said in a post-earnings conference call. Of this, a 6-7% impact was partially offset by a 3% price hike and the rest was reflected in the contraction in gross margin, it said.\n\nThe management said that raw material cost inflation is expected to further increase by around 10% sequentially in Q1FY22. Thus, there is a need for price hikes to maintain margins at the current level, it said. Also, an inferior product mix with a higher share of the original equipment manufacturer (OEM) segment added to the pressure.\n\nView Full Image Satish Kumar/Mint\n\n\n\n\n\nAnalysts warned of increased margin pressure in the coming quarters. Competitive pressure and demand slowdown because of the second covid wave would make it challenging for Ceat to raise prices further. Ceat did not hike prices in April. The Ceat management has said it will focus on cost-cutting measures to partly offset the impact of cost inflation headwinds. Still, a near-term margin compression is a given, analysts said.\n\nBesides, Ceat’s fresh capital expenditure plan is seen as a short-term dampener. Ceat has announced additional capital expenditure of ₹1,210 crore, which will be spent over the next four years for expansion at its Chennai unit. The rationale for the new capex was to expand market share in the truck and bus radial (TBR) segment and capitalize on the export opportunity.\n\n“As per our estimates, this will increase the TBR capacity by 40% from the existing capacity. This is a very aggressive capacity ramp-up plan by the company to make further inroads into the TBR segment,\" said Kotak Institutional Equities in a report on 6 May.\n\nWhile this greenfield expansion would be beneficial in the longer term, for now, it would weigh on the firm’s cash flows, cautioned analysts. Shares of the company ended Friday’s session down 4% on the NSE at ₹1,285. In the past one year, the stock has rallied by 75% and has already surpassed its pre-covid high of ₹1,068 seen in February 2020. Tailwinds of soft commodity prices drove this rally and with raw material cost now turning into a headwind some downside pressure on the stock is likely, analysts said.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter.",
    "Title": "Margin pressure not the only concern for Ceat’s investors"
  },
  {
    "Date": "Mon, 10 May 2021 08:13:37+5:30 ",
    "Description": "Investors are bracing for market fallout as state after state locks itself down in India to contain the spread of the coronavirus as infections and deaths surge.",
    "Image": "https://images.livemint.com/img/2021/05/10/600x338/20210509_DLI-IKS-MN_CP-004_1620575128164_1620614520039.jpg",
    "Link": "https://www.livemint.com/market/stock-market-news/investors-brace-for-fallout-as-states-lock-themselves-down-11620613094853.html",
    "Text": "Investors are bracing for market fallout as state after state locks itself down in India to contain the spread of the coronavirus as infections and deaths surge.\n\nMore than two thirds of states are shut if assessed by their contribution to national output, analysts at Jefferies calculated last week. Tamil Nadu, which houses foreign manufacturers including BMW and Dell, will also close from Monday, while Delhi extended its lockdown for another week. The measures come as pressure builds on Prime Minister Narendra Modi to impose strict nationwide curbs as he did last year.\n\nAll of that is forcing a reassessment among investors who had hoped that less-severe curbs would soften the blow to economic growth. Earlier in May, India’s central bank assured markets that it expects the dent in aggregate demand to be moderate in comparison with a year ago, with “containment measures being localized and targeted.\"\n\nThe news of strict lockdowns in several states may hurt sentiment ahead, Ajit Mishra, vice president for research at Religare Broking Ltd., wrote in a report. Investors will be watching key macroeconomic data including inflation and factory output this week as well as the vaccine drive, he said.\n\nVaccine shortages have complicated efforts to tame the outbreak, leaving investors assessing Modi’s next moves and guessing how long states will have to remain shut. Amid the uncertainty, foreign investors pulled $1.9 billion from India’s stocks and debt in April, the biggest outflow in a year, according to data compiled by Bloomberg.\n\n“While India has refrained from a national lockdown thus far given its huge economic costs, the scales are tipping fast towards humanitarian benefits of curbing mass transmission, as new infections continue to rise with no peak in sight,\" said Chang Wei Liang, an analyst at DBS Bank. “Even without a lockdown, mobility data for Indian cities are already showing that less and less people are moving out of their homes. This implies a natural brake to retail spending and business investment, until mass viral transmission ceases.\"\n\nHere’s how the crisis is impacting markets:\n\nSovereign Bonds\n\nRecent interventions from the Reserve Bank of India have kept yields on 10-year sovereign bonds in check. But, the lockdowns could make it hard to keep borrowing costs low for much longer\n\nAny revenue shortfall would stoke fears of a further rise in government borrowings, already near records, adding upward pressure on yields\n\nEarlier this month, the central bank announced the second tranche of its Government Securities Acquisition Programme -- India’s version of quantitative easing -- under which it will buy 350 billion rupees ($4.8 billion) of sovereign bonds on May 20. Read about more steps that the RBI can take here\n\nThe lockdowns risk higher prices for everything from essential drugs to cars, due to the disruption of supply chains. Consumer-price inflation was already on course to test the upper limit of the RBI’s 2%-6% target, and recent gains in wholesale prices signal more pressure. If those strains build, the RBI may struggle to sell bonds to investors at current yields\n\nRupee\n\nRelative progress fighting the pandemic has been an important factor in global currency markets. India and South Africa present a case study in that among the so-called Fragile Five emerging-markets: Turkey, Brazil, South Africa, India and Indonesia\n\nIndia’s rupee is down about 0.5% against the dollar this quarter even after a recent rebound, while South Africa’s rand has gained 5.1%. Read more about the rupee outlook\n\nIndia is facing the world’s worst outbreak, contributing to half of the fresh infections in the world, while South Africa has seen new cases fall about 90% from a recent peak in January. India reported 669 infections per 100,000 people over the past month, about 10 times that of South Africa, according to Bloomberg calculations based on data compiled by Johns Hopkins University\n\nThe rupee has slipped down the rankings relative to Asian peers after leading the pack in the first quarter. Any national lockdown could deal a further blow\n\nStocks\n\nJefferies forecasts India’s economy will grow 10.2% in the year through March 2022, down 3 percentage points from its initial outlook. The figure already must be taken with a grain of salt given the contraction in the year-ago period. Any slowdown could weigh on corporate earnings\n\nAnalysts have started to cut price targets for stocks of some of the biggest banks and automobile giants\n\n“Markets will correct if the government announces a nationwide lockdown,\" said Naveen Kulkarni, chief investment officer at Axis Securities Ltd. “However, the critical factor will be the duration. The longer any lockdown is, the greater will be the correction.\"\n\nCorporate Bonds\n\nGoldman Sachs turned neutral on Indian credits last month, expecting limited room for outperformance\n\nCiting headwinds due to lockdowns, research firm CreditSights also changed its recommendation last month on local companies including Indian Oil Corp. and Reliance Industries Ltd. to underperform\n\nDBS Bank warned that the market is getting complacent after India’s dollar bonds showed some signs of recovery after a sell-off in the first half of April\n\nInvestors may be too optimistic given the likelihood of a more persistent impact from the pandemic fallout on the finances of companies and households, it said\n\nThis story has been published from a wire agency feed without modifications to the text. Only the headline has been changed.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter.",
    "Title": "Investors brace for fallout as states lock themselves down"
  },
  {
    "Date": "Mon, 10 May 2021 08:29:36 +0530",
    "Description": "Stocks rose on Monday amid speculation that interest rates will remain low for an extended period due to the receding risk of a rapid acceleration in inflation",
    "Image": "https://c.ndtvimg.com/2020-02/nt3ob83g_marketssensex-budget-generic_625x300_01_February_20.jpg",
    "Link": "https://www.ndtv.com/business/stock-market-updates-may-10-2021-sensex-nifty-likely-to-have-a-gap-up-opening-2438530",
    "Text": "At 7:30 am, Nifty futures were trading higher by 0.97 per cent on Singapore Stock Exchange\n\nThe domestic stock markets are likely to have a gap-up opening due to favourable global cues. Trends on SGX Nifty indicate a gap-up opening for the index in India, with a 107-points gain. At 7:30 am, the Nifty futures were trading at 14,975, higher by 107 points or 0.97 per cent, on the Singapore Stock Exchange.\n\nStocks rose on Monday amid speculation that interest rates will remain low for an extended period due to the receding risk of a rapid acceleration in inflation, while oil prices jumped after a cyber attack on a U.S. pipeline operator unnerved markets. Futures for Japan's Nikkei rose 0.03 per cent.\n\nThe Dow and S&P 500 hit record closing highs on Friday and the Nasdaq recovered after U.S. jobs data eased concerns over prospects for rising rates. The Dow rose 0.66 per cent, S&P 500 gained 0.74 per cent and the Nasdaq Composite added 0.88 per cent.\n\nCrude prices climbed more than 1 per cent on Monday after a major cyber attack that forced the shutdown of critical fuel supply pipelines in the United States, highlighting the fragility of oil infrastructure.\n\nBrent crude was up by 76 cents, or 1.1 per cent, at $$69.04 a barrel by 0039 GMT, having risen by l.5 per cent last week. U.S. West Texas Intermediate futures rose by 70 cents, or 1.1 per cent, at $65.60 a barrel.\n\nOn Friday, the BSE Sensex climbed 256.71 points to 49,206.47 and the Nifty was up 98.40 points at 14,823.20.",
    "Title": "Sensex, Nifty Likely To Have A Gap-Up Opening"
  },
  {
    "Date": "Mon, 10 May 2021 00:28:28+5:30 ",
    "Description": "Analysts see the firm’s tie-ups in the recent past such as with Harley-Davidson and Gogoro Inc. for electric vehicles (EVs) should be beneficial in the coming quarters",
    "Image": "https://images.livemint.com/img/2021/05/09/600x338/hero--621x414_1620586442639.jpg",
    "Link": "https://www.livemint.com/market/mark-to-market/heros-q4-is-fine-but-second-wave-could-make-things-bumpy-11620586292828.html",
    "Text": "Hero MotoCorp Ltd’s Q4 numbers do have some things to cheer about, no doubt. With sales realizations improving, the operating metrics exceeded the Street’s expectations. But this could not quite prop up the stock, which dipped 1.8% on Friday.\n\nChallenges are plenty on the road ahead. With covid-19 roiling the markets, volume growth is likely to skid in the coming months.\n\nSome of that slowdown is already visible in Q4 sales volumes, which dipped 15% sequentially to 1.56 million vehicles. On a year-on-year (y-o-y) basis though, volumes grew 17.5% because of a low base as the nationwide lockdown hit sales in Q4 last year.\n\nAnalysts point out that after two successive quarters of decent sales of more than 1.8 million vehicles in Q2 and Q3, dealer inventories have increased. This resulted in Q4 revenues dipping about 11% sequentially. One positive takeaway is that Hero managed to improve realizations considerably after several quarters.\n\nView Full Image Satish Kumar/Mint\n\n\n\n\n\n“Fourth quarter volumes were down 15% quarter-on-quarter, but the average selling price improved 460 basis points sequentially. Gross profit per vehicle was commendably up 5% sequentially, despite commodity cost pressures,\" said a Jefferies India client note.\n\nAnalysts see the firm’s tie-ups in the recent past such as with Harley-Davidson and Gogoro Inc. for electric vehicles (EVs) should be beneficial in the coming quarters. “Hero’s longer-term strategy of global tie-ups for electric vehicles (Gogoro) and the premium segment (Harley) is encouraging. How long the current slowdown will last has to be monitored as the rural segment is now being impacted due to covid,\" said Aditya Makharia, analyst, HDFC Securities.\n\nBut the ongoing second wave of the pandemic is a dampener. Investors will again be banking on the annual monsoon for two-wheeler demand to revive as May and June could see sales decline due to partial lockdowns in several states. April wholesales have declined by about 35% over March, which is a steep drop.\n\nTo top it, input costs are rising. Thus, it could become more difficult to manage costs. International steel prices have surged 27% year-to-date which could squeeze operating margins in the coming quarters. Further, price increases may not be possible. “Price increases have to be calibrated as retail demand is weak, and might be required to be phased out,\" said analysts at Dolat Capital Market in a client note.\n\nAfter racing to an all-time high in February, backed by the strong recovery in the second half of FY21, the stock has hit potholes. It is down about 21% from its highs. For now, the stock’s valuations are not too stiff at about 14 times FY23 earnings as per Bloomberg consensus estimates, but the pressure on the stock may be high till domestic recovery starts to revive after the second wave of covid-19.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter.",
    "Title": "Second wave could make the ride bumpier for Hero Motocorp"
  },
  {
    "Date": "Mon, 10 May 2021 00:15:06+5:30 ",
    "Description": "The Tata Consumer stock fell about 4% on Friday after the firm’s Q4 results were announced last week",
    "Image": "https://images.livemint.com/img/2021/05/09/600x338/tetley--621x414_1620585830856.JPG",
    "Link": "https://www.livemint.com/market/mark-to-market/tata-consumer-s-gung-ho-investors-get-served-lukewarm-results-in-q4-11620585511676.html",
    "Text": "Tata Consumer Products Ltd’s shares have had investors’ attention for some time now. In calendar year 2020, the shares surged as much as 84% on the NSE, easily making it one of the best-performing consumer stocks. After the sharp re-rating, 2021 has begun on a relatively slow note with the shares gaining almost 7% so far.\n\nAgainst this backdrop, valuations are no doubt expensive. In fact, they are now higher than that of peer Britannia Industries Ltd. Based on Bloomberg data, the Tata Consumer stock now trades at 49 times one-year forward price-to-earnings ratio versus 45 times of Britannia. Of course, this wasn’t always the case. Before the impact of the pandemic started reflecting, Tata Consumer’s shares traded at around 34 times one-year forward price-to-earnings ratio on 1 January 2020 vis-à-vis Britannia’s 46 times.\n\nAs such, Tata Consumer’s investors appear to be factoring a good portion of optimism on the growth front. But March quarter (Q4FY21) results announced last week weren’t particularly encouraging, after which the stock fell about 4%. Consolidated earnings before interest, taxes, depreciation and amortization (Ebitda) declined by 2.6% over the same period last year to ₹300 crore vis-à-vis Bloomberg consensus estimates of ₹353 crore. “Consolidated Ebitda growth for the quarter was impacted by tea inflation in India and increased A&P investments,\" the company said.\n\nView Full Image Satish Kumar/Mint\n\n\n\n\n\nEbitda margins contracted by 294 basis points (bps) year-on-year to 9.9%. One basis point is 0.01%. While margins were expected to be hit due to a sharp rise in tea prices, Q4FY21 margin is lower than expectations. Nonetheless, Ebitda margin decline was better than the 623bps compression in gross profit margin.\n\nEven so, analysts at JM Financial Institutional Securities Ltd point have noted two aspects in the March quarter report that merit attention and monitoring. One, Sampann portfolio grew just 2% during the quarter. Tata Consumer has said the volatility in the pulses market has impacted growth. According to JM Financial, “A business that is all of ₹400 crore in size p.a. should not have been impacted so badly by such macro events.\" It is also worth noting that the growth in salt revenue was robust in Q4FY21, boosting the firm’s India foods segment.\n\nSecond, the international beverages business was especially weak. “Whilst there is some high-base effect here due to pantry-loading in March quarter last year, the imputed ‘normalized’ growth rate seems to remind us that these are businesses that would continue to exhibit low-growth characteristics over the medium-term, once low-hanging fruits therein are plucked,\" said JM Financial.\n\nGoing ahead, the pandemic brings some uncertainty in the foreseeable future. Inflation in tea is expected to moderate with new crop and that would be a key monitorable for investors. The firm has said it will continue to drive competitive volume growth. For now though, valuations are pricey and that could limit upsides.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter.",
    "Title": "Tata Consumer’s gung-ho investors get served lukewarm results in Q4"
  },
  {
    "Date": "Mon, 10 May 2021 08:21:18+5:30 ",
    "Description": "The development is just the latest twist in the saga over the digital token",
    "Image": "https://images.livemint.com/img/2021/05/10/600x338/2021-05-09T203836Z_2033338284_RC2KCN9MZQRL_RTRMADP_3_CRYOPTO-CURRENCY-SPACEX-DOGECOIN_1620614924805_1620614971414.JPG",
    "Link": "https://www.livemint.com/market/cryptocurrency/dogecoin-used-to-pay-for-lunar-satellite-mission-with-spacex-11620614819792.html",
    "Text": "The rise of the cryptocurrency Dogecoin has reached a new level after the token was used to pay for a lunar satellite launch.\n\nSpaceX, Elon Musk’s commercial rocket firm, will embark on a Moon voyage in 2022 carrying a so-called cubesat -- a mini-satellite used for space research -- from Geometric Energy Corp. that’s been paid for entirely in Dogecoin.\n\nThe development is just the latest twist in the saga over the digital token, which started as a joke in 2013 but is now a dominating Internet meme and sitting on a 21,000% rally in the past year. Musk has been a key player in the drama, boosting the price with a succession of tweets in recent months.\n\nThe so-called DOGE-1 Mission to the Moon is the first commercial lunar payload in history paid for entirely with Dogecoin, according to a statement from Geometric. The 40-kilogram (88 pounds) cubesat will launch aboard a SpaceX Falcon 9 rocket. The company did not specify the amount of Dogecoin involved in the transaction with SpaceX. There was no immediate response to questions emailed after-hours.\n\nGeometric’s website describes the firm as a private Canadian company originally founded to invent renewable energy technologies, and which has since expanded into areas like space.\n\n“DOGE has proven to be a fast, reliable, and cryptographically secure digital currency that operates when traditional banks cannot and is sophisticated enough to finance a commercial Moon mission in full,\" Geometric said in the statement. “It has been chosen as the unit of account for all lunar business between SpaceX and Geometric Energy Corporation and sets precedent for future missions to the Moon and Mars.\"\n\nMark Cuban, Snoop Dogg and Gene Simmons are among the other celebrities who have boosted Dogecoin. At the same time, warnings abound that its rally is unsustainable and that buyers could lose all their money.\n\nThe phrase “to the Moon\" is often used to express the hope that an asset’s price will continue to rise, and Musk employed the term in a Twitter post referring to the lunar deal. He also cited the token in a television appearance on Saturday Night Live over the weekend.\n\nThis story has been published from a wire agency feed without modifications to the text. Only the headline has been changed.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter.",
    "Title": "Dogecoin used to pay for lunar satellite mission with SpaceX"
  },
  {
    "Date": "Mon, 10 May 2021 10:32:59 +0530",
    "Description": "Hero MotoCorp had halted its plant operations temporarily in a staggered manner for four days from April 22-May 1, which was then extended till May 9",
    "Image": "https://c.ndtvimg.com/2021-05/qp3k55o_hero-motocorp-logo_625x300_09_May_21.png",
    "Link": "https://www.ndtv.com/business/hero-motocorp-edges-lower-on-extending-manufacturing-shutdown-amid-covid19-pandemic-2438589",
    "Text": "At 10:20 am, Hero MotoCorp shares were trading lower by 0.37 per cent on the BSE\n\nHero MotoCorp, India's largest motorbike maker, extended a shutdown at its manufacturing facilities across the country by another week till May 16. Hero MotoCorp had halted its plant operations temporarily in a staggered manner for four days from April 22-May 1, which was then extended till May 9. At 10:20 am, the shares of Hero MotoCorp were trading at Rs 2,845.60, down 0.37 per cent, on the BSE.\n\n\"In view of the prevailing Covid-19 situation across the country, Hero MotoCorp - the world's largest manufacturer of motorcycles and scooters - has decided to extend the shutdown at its manufacturing facilities across India, its Global Parts Center (GPC) in Neemrana and its R&D facility - the Centre of Innovation and Technology (CIT) in Jaipur - by another week, till May 16, 2021,\" Hero MotoCorp said in a regulatory filing to the stock exchanges. All corporate offices of the company are in Work from Home (WFH) mode.\n\nThe company is continuously monitoring the situation and is ready with its business continuity plans to be able to quickly resume and scale up operations as and when the situation improves. Hero MotoCorp added.\n\nThe centre has maintained that there will not be a nationwide lockdown and Prime Minister Narendra Modi had asserted in his nationwide address on April 21 that lockdowns should only be the last resort. However, many individual states have announced lockdowns to control the devastating second wave of covid-19 pandemic.\n\nThe BSE Sensex was trading at 49,528.35, higher by 319.73 points or 0.65 per cent and the NSE Nifty was at 14,926.65, up 102.45 points or 0.69 per cent at the time.",
    "Title": "Hero MotoCorp Extends Manufacturing Shutdown; Stock Edges Lower"
  },
  {
    "Date": "Mon, 10 May 2021 11:01:23+5:30 ",
    "Description": "With fourth quarter metrics disappointing and outlook rather weak, Bandhan Bank’s stock may continue to be under pressure beyond today’s 10% drop in early trade",
    "Image": "https://images.livemint.com/img/2021/05/10/600x338/Bandhanbank_1620624227373.JPG",
    "Link": "https://www.livemint.com/market/mark-to-market/bandhan-bank-s-fortunes-take-an-ugly-turn-with-weak-q4-second-wave-11620623748492.html",
    "Text": "That is not the worst part of the quarterly earnings. What went behind this profit miss are a huge chunk of interest reversal due to bad loans and the incremental need of setting aside large provisions. Bandhan Bank carved Rs1,594 crore out of its earnings to set aside as provisions for the quarter, 49% higher sequentially. The lender’s core income grew by a mere 4.6% and much of the support to profits came from other income. Needless to say, most brokerages have downgraded the company. “Our detailed analysis of its loan-book shows that over the next 4-6 qtrs, it will need to provide Rs3,000 crore-Rs3,500 crore (3.5-4% of loans) towards credit risks/ provision lift-up,\" wrote analysts at Jefferies India Pvt. Ltd in a note.\n\nIn essence, all trouble for the lender emerged from asset quality. As such, gross bad loans remain elevated, at 6.8% of total loan book, and the outlook, too, is far from sanguine. What surprised investors is the Rs1,930 crore worth of loans written off during the quarter. The lender said that this is towards strengthening the balance sheet and these write-offs are technical. Even so, written off accounts are typically the weakest of the stressed lot and recoveries from such accounts is minimal. Overall stress increased sharply. Bandhan Bank’s troubles are centred on two states that form a large part of its business, West Bengal and Assam. Analysts had anticipated weakness from Assam given a new law that caps the amount of loan an individual can borrow. However, most were expecting Bandhan Bank to come out largely unscathed from the political uncertainty due to elections. The argument has been that the lender has weathered many elections in the past.\n\nBut elections didn’t come alone, they came with a pandemic. Ergo, along with the general reluctance to honour repayments during an election, the economic impact of the second wave, too, began to manifest. Collection efficiency dropped to 83% in the March quarter from 88% the previous quarter for Assam. “With loan portfolio in key states such as West Bengal and Assam facing challenges due to multiple reasons and clarity on law change awaited, near-term outlook on overall asset quality is uncertain,\" wrote analysts at ICICI Securities Ltd in a note.\n\nShares of the bank have underperformed the sector index since April, a reflection of the concerns over asset quality in the wake of elections and the second wave. However, with fourth quarter metrics disappointing and outlook rather weak, Bandhan Bank’s stock may continue to be under pressure beyond today’s 10% drop in early trade.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter.",
    "Title": "Bandhan Bank’s fortunes take an ugly turn with weak Q4, second wave"
  },
  {
    "Date": "Mon, 10 May 2021 08:07:48+5:30 ",
    "Description": "Chambal Fertilizers, HFCL Ltd, JMC Projects, Venky’s India Ltd, Zydus Wellness Ltd are some of the companies that will announce March quarter earnings today",
    "Image": "https://images.livemint.com/img/2021/05/10/600x338/a533786c6e704a418a60001cb958eab1-a533786c6e704a418a60001cb958eab1-0_1613438518221_1613438532686_1620609753223.jpg",
    "Link": "https://www.livemint.com/market/stock-market-news/stocks-to-watch-dr-reddy-s-maruti-hero-moto-hdfc-bandhan-bank-interglobe-11620609728338.html",
    "Text": "New Delhi: Here are the top 10 stocks that could be in news today:\n\nHero MotoCorp: India's largest motorbike maker extended a shutdown at its manufacturing facilities across the country till May 16. Hero MotoCorp had suspended its manufacturing operations in April.\n\nMaruti Suzuki India: India's largest automaker said on Saturday it was extending a planned maintenance shutdown until May 16 from May 9 citing the pandemic.\n\nDr Reddy’s Laboratories: The Institute of Nuclear Medicine and Allied Sciences has developed an anti-covid-19 therapeutic application of drug 2-deoxy-D-glucose (2-DG) that helps in faster recovery of hospitalized patients and reduces supplemental oxygen dependence. This drug, approved by the DCGI, has been developed in collaboration with DRL, Hyderabad.\n\nHDFC: The housing finance major is selling 0.62% of its stake in general insurance subsidiary HDFC Ergo to foreign JV partner Ergo International for over ₹236 crore to meet regulatory norms. HDFC is required to reduce its shareholding in HDFC Ergo to 50 per cent or below as per an RBI directive.\n\nAvenue Supremarts: The company, which owns and operates retail chain D-Mart, reported 52% rise in consolidated net profit at Rs413.87 crore in the March quarter. Consolidated revenue of the Mumbai-based company rose 18.47% to ₹7,411.68 crore. It reported a 13.7% year-on-year decline in net profit to ₹1,165 crore for financial year 2020-21, hit by the pandemic.\n\nBandhan Bank: The bank posted a net profit of ₹103.03 crore in the quarter ended March on higher provisions. Operating profit increased by 13.7% to ₹1,730 crore while net interest income rose by 4.6% to ₹1,757 crore. Provisions jumped by 93%. MD & CEO Chandra Shekhar Ghosh is hopeful that the economy will rebound by the third and fourth quarters of the current fiscal, enabling the lender to meet its targets.\n\nUltraTech Cement: Aditya Birla Group firm on Friday reported a 45% decline in consolidated net profit to ₹1,774.13 crore for the quarter ended March on account of reversal of deferred tax liabilities. Its revenue from operations rose 32.72% to ₹14,405.61 crore.\n\nInterGlobe Aviation: The parent of the country's largest airline IndiGo plans to explore all options to raise funds to increase its liquidity amid the aviation sector grappling with coronavirus pandemic woes. The board of the company, during its meeting held on Friday, deliberated the possibility of raising funds through the qualified institutional placement route.\n\nSBI Life Insurance: Private equity firm Carlyle Group has divested 4% stake in the company for over ₹3,900 crore through an open market transaction. According to bulk deal data available with the BSE, Carlyle Group, through its entity CA Emerald Investment, sold 4.1 crore shares. The shares were offloaded at an average price of ₹960, much lower than Friday's closing price of ₹1,000.50 on the BSE.\n\nDCB Bank: The private lender reported a 13% increase in net profit to ₹78 crore for the January-March quarter compared to that of ₹69 crore in the year-ago quarter. Total income of the bank during the quarter fell to ₹971 crore from ₹1,012 crore a year ago. Income from interest as well as from investment fell during the reported quarter from a year ago.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter.",
    "Title": "Stocks to Watch: Dr Reddy’s, Maruti, Hero Moto, HDFC, Bandhan Bank, InterGlobe"
  },
  {
    "Date": "Mon, 10 May 2021 08:19:41 +0530",
    "Description": "In Delhi, petrol prices were increased by 26 paise to Rs 91.53 per litre and diesel became dearer by 33 paise to Rs 82.06 per litre, according to Indian Oil",
    "Image": "https://c.ndtvimg.com/2021-02/g08nod98_petrol-pump-hp_650x400_05_February_21.jpg",
    "Link": "https://www.ndtv.com/business/petrol-diesel-price-news-may-10-2021-petrol-diesel-prices-hiked-upto-33-paise-on-monday-2438525",
    "Text": "Fuel Prices: Domestic petrol and diesel prices vary across states due to value added tax (VAT).\n\nPetrol, diesel prices today: Petrol and diesel prices were hiked again by the country's largest fuel retailer - Indian Oil - on Monday, May 10, after a gap of two days. In Delhi, petrol prices were increased by 26 paise from Rs 91.27 per litre to Rs 91.53 per litre and diesel became dearer by 33 paise from Rs 81.73 per litre to Rs 82.06 per litre, according to Indian Oil. Currently, petrol and diesel prices are highest in the financial capital of the country. Petrol in Mumbai was retailed at Rs 97.86 per litre while diesel was sold at Rs 89.17 per litre.\n\nBelow are the latest petrol and diesel prices across four metro cities:\n\nCity Petrol Diesel Delhi 91.53 82.06 Mumbai 97.86 89.17 Chennai 93.38 86.96 Kolkata 91.66 84.90 Source: Indian Oil\n\nThe state-run oil marketing companies including, the Indian Oil Corporation, Bharat Petroleum and Hindustan Petroleum, align the rates of domestic fuel with the global crude oil prices by taking into account changes in the foreign exchange rates. The new changes in fuel prices are implemented with effect from 6 am every day.\n\nCrude prices climbed more than 1 per cent on Monday after a major cyber attack that forced the shutdown of critical fuel supply pipelines in the United States, highlighting the fragility of oil infrastructure.\n\nBrent crude was up by 76 cents, or 1.1 per cent, at $$69.04 a barrel by 0039 GMT, having risen by l.5 per cent last week. U.S. West Texas Intermediate futures rose by 70 cents, or 1.1 per cent, at $65.60 a barrel.",
    "Title": "Petrol, Diesel Prices Hiked After A 2-Day Pause"
  },
  {
    "Date": "Mon, 10 May 2021 09:02:08 +0530",
    "Description": "Hero MotoCorp, India's largest motorbike maker, extended a shutdown at its manufacturing facilities across the country till May 16",
    "Image": "https://c.ndtvimg.com/2019-08/uoai23sg_sensex-nifty-bse-nse-markets_625x300_26_August_19.jpg",
    "Link": "https://www.ndtv.com/business/stocks-to-watch-in-trade-today-may-10-2021-hero-motocorp-maruti-suzuki-ultratech-cement-2438541",
    "Text": "Maruti Suzuki has extended the shutdown at its plant till May 16, 2021 due to pandemic situation.\n\nThe domestic stock markets are likely to have a gap-up opening due to favourable global cues. Trends on SGX Nifty indicate a gap-up opening for the index in India, with a 107-points gain. At 7:30 am, the Nifty futures were trading at 14,975 on the Singapore Stock Exchange.\n\nOn Friday, the BSE Sensex climbed 256.71 points to 49,206.47 and the Nifty was up 98.40 points at 14,823.20.\n\nStocks to watch in trade in today's session\n\nHero MotoCorp\n\nHero MotoCorp, India's largest motorbike maker, extended a shutdown at its manufacturing facilities across the country till May 16. Hero MotoCorp had suspended its manufacturing operations in April.\n\nMaruti Suzuki\n\nMaruti Suzuki has extended the shutdown at its plant till May 16, 2021 due to the current pandemic situation.\n\nUltraTech Cement\n\nUltraTech Cement reported a 45.2 per cent YoY decline in consolidated net profit to Rs 1,774.13 crore for the fourth quarter ended March 2021 on account of reversal of deferred tax liabilities.\n\nIDFC First Bank\n\nIDFC First Bank reported a 78 per cent YoY jump in net profit at Rs 128 crore for the fourth quarter ended March 2021 as against a profit of Rs 72 crore during the corresponding quarter a year ago.\n\nBandhan Bank\n\nBandhan Bank reported an 80 per cent YoY dip in its March quarter net profit at Rs 103 crore, as it wrote off a huge portfolio of loans in the flagship microlending business by recognising stress upfront.",
    "Title": "Stocks To Watch: Hero MotoCorp, Maruti Suzuki, UltraTech Cement"
  },
  {
    "Date": "Mon, 10 May 2021 09:22:33 +0530",
    "Description": "Stocks in Asia rose on Monday amid speculation that interest rates will remain low for an extended period due to the receding risk of a rapid acceleration in inflation",
    "Image": "https://c.ndtvimg.com/2020-02/nt3ob83g_marketssensex-budget-generic_625x300_01_February_20.jpg",
    "Link": "https://www.ndtv.com/business/stock-market-updates-may-10-2021-sensex-rallies-over-300-points-nifty-above-14-900-2438551",
    "Text": "Tata Steel has hit a 52-week high of Rs 1218.45, up 3 per cent, on the BSE\n\nThe domestic stock markets opened more than half a per cent higher, continuing with the momentum witnessed in the previous session, on the back of favourable global cues. At 9:18 am, the BSE Sensex was at 49,557.45, higher by 355.75 points or 0.73 per cent and the NSE Nifty was at 14,937.10, up 120.20 points or 0.82 per cent. The broader markets are also trading strong, with the BSE Midcap and BSE Smallcap indices gaining 0.5 per cent and 0.9 per cent respectively.\n\nStocks in Asia rose on Monday amid speculation that interest rates will remain low for an extended period due to the receding risk of a rapid acceleration in inflation, while oil prices jumped after a cyber attack on a U.S. pipeline operator unnerved markets. Futures for Japan's Nikkei rose 0.03 per cent.\n\nThe Dow and S&P 500 hit record closing highs on Friday and the Nasdaq recovered after U.S. jobs data eased concerns over prospects for rising rates. The Dow rose 0.66 per cent, S&P 500 gained 0.74 per cent and the Nasdaq Composite added 0.88 per cent.\n\nMeanwhile, crude prices climbed more than 1 per cent on Monday after a major cyber attack that forced the shutdown of critical fuel supply pipelines in the United States, highlighting the fragility of oil infrastructure. Brent crude was up by 76 cents, or 1.1 per cent, at $$69.04 a barrel by 0039 GMT and U.S. West Texas Intermediate futures rose by 70 cents, or 1.1 per cent, at $65.60 a barrel.\n\nOn the stock-specific front, Tata Steel is the top gainer on the Sensex; the metal heavyweight has hit a 52-week high of Rs 1218.45, up 3 per cent, on the BSE. Coal India, Hindalco, IOC and Dr Reddy's have gained around 2 per cent each.\n\nOn the other hand, Ultratech Cement, Britannia and Tata Consumer Products have shed around a per cent each on the BSE.",
    "Title": "Sensex Rallies Over 300 Points; Tata Steel, Hindalco Top Gainers"
  },
  {
    "Date": "Mon, 10 May 2021 11:23:57+5:30 ",
    "Description": "Kansai's gross margin contracted sharply by 440 basis points year-on-year to 34.6% hit by elevated input costs",
    "Image": "https://images.livemint.com/img/2021/05/10/600x338/Kansai_Nerolac-1_1620625434013_1620625453658.jpg",
    "Link": "https://www.livemint.com/market/mark-to-market/kansai-nerolac-s-fading-margins-take-sheen-off-its-double-digit-volumes-growth-11620624774362.html",
    "Text": "MUMBAI : Sharply compressing margins take away the comfort generated by robust volumes growth for Kansai Nerolac’s investors. The shares of the company fell nearly 2% on NSE in Monday's opening trade.\n\nIn the March quarter, the company's decorative and industrial paints segments grew in high double-digits. Largely aided by a low base and demand from smaller cities and towns, paint makers were expected to see robust sales growth for the third consecutive quarter in March. Sales recovery in the automobile and consumer durables sectors has helped Kansai's industrial paints segment to make a comeback, analysts said. The company gets around 55% of its overall revenue from the decorative paints business and the remainder from industrial paints. Although near-term demand across segments is being impacted by the second wave of the pandemic, the company's management is optimistic of revival in demand going forward.\n\nKansai's gross margin contracted sharply by 440 basis points year-on-year to 34.6% hit by elevated input costs. One basis point is one-hundredth of a percentage point. Prices of titanium dioxide and other crude-based monomers have risen by more than 20% in the past year. Analysts at Nomura Inc. point out that the inflationary trend will likely continue to impact the company's gross margins over H1FY22 even as Kansai is yet to fully exhaust lower-cost raw material inventory from Q2FY21.\n\nThe recent price hikes of around 1.5-2% are not enough to mitigate the impact of inflation on margins, said analysts. However, the company's management has said that it would raise prices further. As for operating margin, even though the fall in Ebitda was curtailed by a decline in employee costs and other expenses, against the backdrop of cost inflation, it hardly brings cheer, analysts said. Ebitda is short for earnings before interest, tax, depreciation, and amortization.\n\nOn a consolidated basis, Ebitda margins expanded by 220bps year-on-yein the March quarter.\n\nBloomberg data shows that shares of the company trade at a one-year forward price-to-earnings multiple of 43 times. This is lower than peers Asian Paints Ltd and Berger Paints, which trade at PE multiples of around 75-80 times.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter.",
    "Title": "Kansai Nerolac's fading margins take sheen off its double-digit volumes growth"
  }
]