[
  {
    "Date": "Thu, 06 May 2021 08:48:30 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/business/india-business/us-lawmakers-applaud-indias-decision-to-not-allow-chinese-companies-to-conduct-5g-trials/articleshow/82423678.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82423678.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>Top US lawmakers have applauded India's decision to not allow Chinese telecom companies to conduct 5G trials in the country. The Department of Telecom in India on Tuesday had approved applications of telecom companies Reliance Jio, Bharti Airtel, Vodafone Idea and MTNL to conduct 5G trials but none of them would be using technologies of Chinese entities.",
    "Image": "https://static.toiimg.com/thumb/msid-82423725,width-1070,height-580,imgsize-155267,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/business/india-business/us-lawmakers-applaud-indias-decision-to-not-allow-chinese-companies-to-conduct-5g-trials/articleshow/82423678.cms",
    "Text": "Representative photo\n\nWASHINGTON: Top US lawmakers have applauded India's decision to not allow Chinese telecom companies to conduct 5G trials in the country.\n\nThe Department of Telecom in India on Tuesday had approved applications of telecom companies Reliance Jio, Bharti Airtel , Vodafone Idea and MTNL to conduct 5G trials but none of them would be using technologies of Chinese entities.\n\n\"India's decision to exclude Huawei and ZTE from its 5G trials is good news for the people of India and the world,\" House Foreign Affairs Committee Lead Republican and China Task Force Chairman Michael McCaul said in a statement on Wednesday.\n\n\"People's Republic of China law requires any Chinese company – including Huawei and ZTE – to work for the Chinese Communist Party if asked,” McCaul said.\n\nThe previous Trump administration had designated Chinese tech companies as posing a national security risk.\n\nThe US is also asking its friends and allies not to opt for a technology that is controlled by the Communist Party of China .\n\n\"It's a risk that can't be mitigated unless these companies are excluded from our networks, and I'm glad that India has recognized this threat. India has once again proven why it is a global leader in the fight against security threats posed by CCP-controlled technology,” McCaul said.\n\nCongressman Mike Waltz also thanked India for its decision.\n\n\"Thank you to India for denying the inclusion of CCP-run Huawei in their telecommunications,” he said.\n\n\"As the world's largest democracy, India will be a critical ally in confronting China and securing our supply chains,” Waltz said.\n\n",
    "Title": "US hails India's decision to not allow Chinese cos to conduct 5G trials"
  },
  {
    "Date": "Thu, 06 May 2021 01:54:02 +0000",
    "Description": "“We’re not going to deprive any of these executives of their second or third home, travel privately by jet,” the president said at the White House.",
    "Image": "https://static01.nyt.com/images/2021/05/05/us/politics/05dc-biden-tax/05dc-biden-tax-facebookJumbo.jpg",
    "Link": "https://www.nytimes.com/2021/05/05/business/biden-tax-increases-wealthy.html",
    "Text": "Republicans and business groups have blasted Mr. Biden’s plans to fund new spending on roads, bridges, low-carbon energy deployment, child care, education and a host of other initiatives by raising taxes on corporations, high earners and the wealthy. Mr. Biden has responded by amplifying his arguments: In recent remarks, he has focused almost as much on the tax increases as he has on the programs they would pay for.\n\nMr. Biden’s comments reflect both a read of public polling and a negotiating tactic. He is presenting the tax increases not simply as a method of paying for his sprawling agenda, but as a policy goal on their own, aimed at narrowing gaps in income and wealth that have been exposed in stark terms by the coronavirus pandemic. He and his aides see a chance to turn the issue against Republicans who have long preached tax cuts and hammered Democrats for supporting any tax increases.\n\nA wide range of polls now show broad public support for tax increases on high earners. A Pew Research poll last week found that Americans were much more likely to be upset that the wealthy and corporations did not pay “their fair share” in taxes than to be upset about the size of their own tax bills.\n\n“On taxes, Biden has flipped the script on Republicans,” said Rahm Emanuel, the former mayor of Chicago who worked in the Obama and Clinton administrations and is in line for an ambassadorship under Mr. Biden. “Especially since the Biden tax plan is popular with the G.O.P. base. Biden knows this and is taunting them head on.”\n\nRepublicans in Congress continue to warn that Mr. Biden’s tax increases could cripple an economy that is just beginning to recover from the pandemic downturn and hurt workers, even though the president has vowed not to raise taxes on individuals or households earning less than $400,000. They say that corporate tax increases will hurt business investment and growth, and that companies will pass some of those increases on to their workers in the form of lower wages.",
    "Title": "Biden Defends Plans to Tax the Rich"
  },
  {
    "Date": "Thu, 06 May 2021 07:26:58 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/business/india-business/govt-lic-ready-for-strategic-sale-of-idbi-bank/articleshow/82423107.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82423107.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>",
    "Image": "https://static.toiimg.com/thumb/msid-82423106,width-1070,height-580,imgsize-59883,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/business/india-business/govt-lic-ready-for-strategic-sale-of-idbi-bank/articleshow/82423107.cms",
    "Text": "NEW DELHI: After years of debate, the government on Wednesday cleared the strategic sale of IDBI Bank , in what will be the first instance of the disinvestment policy being used in the banking sector - so far a no-go area.\"The extent of respective shareholding to be divested by GoI and LIC shall be decided at the time of structuring of transaction in consultation with RBI,\" an official statement said.\n\nLIC is the largest shareholder with 49.2% stake, and is classified as the promoter and has management control. The Centre, which is a 45.5% owner, is the co-promoter. The statement said that the LIC board passed a resolution allowing the state-run insurance giant - which is due for a listing - to divesting its stake along with strategic stake sale.\n\n\"It is expected that strategic buyer will infuse funds, new technology and best management practices for optimal development of business potential and growth of IDBI Bank and shall generate more business without any dependence on LIC and government funds,\" it said.\n\nOver the last two decades, IDBI is proved to be the Centre's vehicle for experiments, with successive finance ministries trying out a new model.\n\nIDBI, which was a development financial institution, was converted into a bank with the seeds for change sowed when Yashwant Sinha was the FM. Like ICICI, the government had hoped to transform IDBI into a financial conglomerate but was weighed down by legacy term loans.\n\n\n\nFacebook Twitter Linkedin EMail",
    "Title": "Govt, LIC ready for strategic sale of IDBI Bank"
  },
  {
    "Date": "Thu, 06 May 2021 07:45:59 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/business/india-business/drones-set-to-deliver-your-orders-for-food-medicine/articleshow/82423199.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82423199.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>",
    "Image": "https://static.toiimg.com/thumb/msid-82423205,width-1070,height-580,imgsize-26660,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/business/india-business/drones-set-to-deliver-your-orders-for-food-medicine/articleshow/82423199.cms",
    "Text": "NEW DELHI: Restaurant, medicine and grocery delivery aggregators, including Swiggy and Dunzo, will soon be able to deliver through drones during the pandemic. Test runs in controlled environments have already started.\n\nThe government has allowed 20 entities, including Swiggy, Dunzo and SpiceJet, to carry out experimental flights of drones \"beyond visual line of sight (BVLOS)\". Once this protocol is established after successful experimental flights, drones could be used for various purposes like delivering Covid jabs, medicines and meals, while ensuring safety and security issues.\n\n\"This could be a hub-and-spoke model that will help cut down delivery times drastically,\" said a senior executive at a food delivery company. \"For instance, if the route is long, drones could be used to ferry the medicines or food to a central location from where delivery executives can collect them.\"\n\nLast-mile delivery through drones is difficult in India because rooftops do not have clear landing zones and are often obstructed with power lines, he added.\n\n\"The drone ecosystem has quickly established itself as a fundamental component of industry 4.0, having been successfully adopted in a vast spectrum of sectors such as medicine, logistics, defence, entertainment, film production & heavy industry,\" said Arjun Aggarwal, MD, Arc Ventures, one of India's leading investors in the drone space.\n\nIndia is preparing for drones operations \"beyond line of sight\" - which basically means flying them over a distance where the operator can't see this \"remotely piloted aircraft (RPA)\" during the flight while piloting it to the destination and back.\n\n\n\nFacebook Twitter Linkedin EMail",
    "Title": "Drones set to deliver your orders for food, medicine"
  },
  {
    "Date": "Thu, 06 May 2021 02:23:58 +0000",
    "Description": "Investors care more about economic data and corporate profits than an increase in the capital gains tax. It has usually been this way.",
    "Image": "https://static01.nyt.com/images/2021/05/03/business/00BIDEN-MARKETS-print/merlin_186764442_ebacf3c7-bf0a-42e6-8db2-6dcbe1cd909b-facebookJumbo.jpg",
    "Link": "https://www.nytimes.com/2021/05/03/business/biden-tax-plan-stock-market.html",
    "Text": "Investors have largely shrugged off President Biden’s proposal to raise taxes on investment income for wealthy Americans, as the stock market hovers near record highs after news of a strong economic rebound and blockbuster earnings reports from technology giants such as Apple and Amazon.\n\nThe indifference is well founded, analysts say.\n\nMr. Biden wants to raise taxes on the income that the country’s richest households make from investments — called capital gains — to fund his plans for economic-recovery and infrastructure projects. The increase would apply to people with annual income of a million dollars or more.\n\nIn theory, higher taxes on investments like stocks should make them less appealing. But the outlook for economic growth and corporate profits is often a much bigger factor in the decision to buy, sell or hold on to a stock. And in a resilient market — when politicians typically propose them — higher taxes are even less of a deterrent.\n\n“Markets can grow, and grow above trend, even if you’re taking the capital gains tax rate up,” said Lori Calvasina, head of U.S. equity strategy at RBC Capital Markets in New York. “That’s not the silver bullet that will kill the bull market.”",
    "Title": "Why Biden’s Plan to Raise Taxes for Rich Investors Isn’t Hurting Stocks"
  },
  {
    "Date": "Thu, 06 May 2021 04:31:35 GMT",
    "Description": "The social media platform will prompt users to review \"potentially harmful or offensive\" replies.",
    "Image": "https://ichef.bbci.co.uk/news/1024/branded_news/4298/production/_118384071_gettyimages-1232299817.jpg",
    "Link": "https://www.bbc.co.uk/news/business-57004794",
    "Text": "After testing and improving prompts that ask you to review a potentially harmful or offensive reply, we learned that this feature can help encourage more meaningful convos.\n\n\n\nWe’re now rolling out these prompts on iOS and soon Android. https://t.co/GdnEGrIvfM pic.twitter.com/5hrK0mrd8f",
    "Title": "Twitter tells users to be nice and think twice before replying"
  },
  {
    "Date": "Thu, 06 May 2021 00:29:44 +0530",
    "Description": "Small businesses, MSMEs to get relief.",
    "Image": "https://th.thgim.com/business/1slulz/article34492629.ece/ALTERNATES/FREE_960/TH06BUGOLD",
    "Link": "https://www.thehindu.com/business/Economy/rbi-steps-in-to-ease-covid-19-burden-small-businesses-msmes-to-get-relief/article34492630.ece",
    "Text": "Small businesses, MSMEs to get relief.\n\nWith India’s economic recovery threatened by the COVID-19 second wave, the Reserve Bank of India stepped in on Wednesday with measures aimed at alleviating any financing constraints for healthcare infrastructure and services, as well as small borrowers who may be facing distress due to a sudden spike in health expenditure.\n\nRBI Governor Shaktikanta Das used an unscheduled address to announce a Term Liquidity Facility of ₹50,000 crore with tenor of up to three years, at the repo rate, to ease access to credit for providers of emergency health services.\n\nUnder the scheme, banks will provide fresh lending support to a wide range of entities, including vaccine manufacturers, importers/suppliers of vaccines and priority medical devices, hospitals/dispensaries, pathology labs, manufacturers and suppliers of oxygen and ventilators, and logistics firms. “These loans will continue to be classified under priority sector till repayment or maturity, whichever is earlier,” Mr. Das said, adding that banks were expected to create a COVID loan book under the scheme.\n\nAs part of a “comprehensive targeted policy response”, the RBI also unveiled schemes to provide credit relief to individual and MSME borrowers impacted by the pandemic. “Restoring livelihoods has become an imperative,” Mr. Das said.\n\nThe RBI also announced measures to protect small and medium businesses and individual borrowers from the adverse impact of the intense second wave of COVID-19 buffeting the country.\n\nIn his address, Mr. Das unveiled a Resolution Framework 2.0 for COVID-related stressed assets of individuals, small businesses and MSMEs and also expressed the central bank’s resolve to do everything at its command to ‘save human lives and restore livelihoods through all means possible’.\n\nEligibility criteria\n\nConsidering that the resurgence of the pandemic had made these categories of borrowers most vulnerable, the RBI said those with aggregate exposure of up to ₹25 crore, who had not availed restructuring under any of the earlier restructuring frameworks (including under last year’s resolution framework), and whose loans were classified as ‘standard’ as on March 31, 2021, were eligible for restructuring under the proposed framework.\n\nIn respect of individual borrowers and small businesses who had already availed restructuring under Resolution Framework 1.0, lenders have been permitted to use this window to modify such plans to the extent of increasing the period of moratorium and/or extending the residual tenor up to a total of two years.\n\nIn respect of small businesses and MSMEs restructured earlier, lending institutions have been permitted as a one-time measure, to review the working capital sanctioned limits, based on a reassessment of the working capital cycle and margins.\n\nCredit support\n\nTo provide further support to small business units, micro and small industries, and other unorganised sector entities adversely affected during the current wave of the pandemic, the RBI decided to conduct special three-year long-term repo operations (SLTRO) of ₹10,000 crore at the repo rate for Small Finance Banks. The SFBs would be able to deploy these funds for fresh lending of up to ₹10 lakh per borrower. This facility would be available till October 31.\n\nIn view of the fresh challenges brought on by the pandemic and to address the emergent liquidity position of smaller MFIs, SFBs are now being permitted to reckon fresh lending to smaller MFIs (with asset size of up to ₹500 crore) for onlending to individual borrowers as priority sector lending. This facility will be available up to March 31, 2022.\n\nState governments\n\nTo enable the State governments to better manage their fiscal situation in terms of their cash flows and market borrowings, maximum number of days of overdraft (OD) in a quarter is being increased from 36 to 50 days and the number of consecutive days of OD from 14 to 21 days, the RBI said.\n\nSeparately, Mr, Das asserted that though the impact of the second wave was ‘debilitating’, it was ‘not insurmountable’. “We do not expect any broad deviations in our projections,” he added.",
    "Title": "RBI steps in to ease COVID-19 burden"
  },
  {
    "Date": "Thu, 06 May 2021 10:02:00 +0530",
    "Description": "Updates from the world of economy, markets, and finance",
    "Image": "https://th.thgim.com/business/markets/xgtts1/article34392569.ece/ALTERNATES/FREE_960/bse",
    "Link": "https://www.thehindu.com/business/businesslive-6-may-2021/article34495717.ece",
    "Text": "Baricitinib in combination with Remdesivir, is used for treatment of COVID-19 positive patients, the Natco Pharma said",
    "Title": "Business Live:"
  },
  {
    "Date": "Thu, 06 May 2021 07:22:03 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/business/india-business/rbi-in-battle-readiness-to-ensure-orderly-financial-conditions-das/articleshow/82423088.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82423088.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>",
    "Image": "https://static.toiimg.com/thumb/msid-82423081,width-1070,height-580,imgsize-42868,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/business/india-business/rbi-in-battle-readiness-to-ensure-orderly-financial-conditions-das/articleshow/82423088.cms",
    "Text": "NEW DELHI: The Reserve Bank of India (RBI) stands in \"battle readiness\" to ensure that financial conditions remain congenial and markets continue to work efficiently, governor Shaktikanta Das said on Wednesday, asserting that the dent to aggregate demand is expected to be moderate in comparison to the previous year.\"We will work in close co-ordination with the government to ameliorate the extreme travails that our citizens are undergoing in this hour of distress. We are committed to go unconventional and devise new responses as and when the situation demands,\" Das said in an unscheduled address amid the sharp surge in Covid cases.\"We must also stay focused on our future, which appears bright even at this juncture, with India set to emerge as one of the fastest growing economies in the world,\" the RBI governor said, emphasising that the growth prospects remained strong despite the ravaging impact of the virus.He said the immediate objective was to preserve human life and restore livelihoods through all means possible. \"The second wave, though debilitating, is not unsurmountable. It is during our darkest moments that we must focus on the light. We have lessons to draw from our experience of last year, when as a nation we came together and overcame the once-in-a-generation challenge imposed by the first wave of the pandemic,\" Das said as he unveiled measures to provide relief and financing for the healthcare sector.\"We must remain resolutely focused on a post-pandemic future of strong and sustainable growth with macroeconomic and financial stability. I call upon all stakeholders to come forward once again to address the challenges posed by the current wave of the pandemic, while remaining on guard against future waves,\" said Das.He said aggregate demand conditions, particularly in contact-intensive services, are likely to see a temporary dip, depending on how the Covid situation unfolds. With restrictions and containment measures being localised and targeted, businesses and households are learning to adapt, said Das.The RBI governor said a normal south-west monsoon, as forecast by the IMD, should help to contain food price pressures, especially in cereals and pulses. The build-up in input price pressures across sectors, driven in part by elevated global commodity prices, remains a concern.",
    "Title": "RBI in 'battle readiness' to ensure orderly financial conditions: Das"
  },
  {
    "Date": "Thu, 06 May 2021 10:51:51 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/business/india-business/now-us-approves-voluntary-departure-of-its-non-emergency-govt-employees-from-india/articleshow/82424608.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82424608.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>",
    "Image": "https://static.toiimg.com/thumb/msid-82425343,width-1070,height-580,imgsize-12796,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/business/india-business/now-us-approves-voluntary-departure-of-its-non-emergency-govt-employees-from-india/articleshow/82424608.cms",
    "Text": "NEW DELHI: The United States has “approved voluntary departure of non-emergency US government employees” from India. The US State Department updated its travel advisory for India on Wednesday, to authorise this. Last Wednesday (April 28), it had approved the voluntary departure of family members of US government employees from India. “US citizens who wish to depart India should take advantage of available commercial transportation options,” it says.The American Centers for Disease Control and Prevention (CDC) has issued a Level 4 Travel Health Notice for India — that advises US citizens not to travel there — due to Covid-19, indicating a very high level of pandemic in the country.From May 4, resections have been imposed on travel of non-citizens/residents from India to US with some exceptions. “We encourage US citizens who wish to depart India to take advantage of currently available commercial flights. Airlines continue to operate multiple direct flights weekly from India to the United States. Additional flight options remain available via transfers in Paris, Frankfurt , and Doha,” website of the US Embassy and Consulates in India says.",
    "Title": "Now, US approves ‘voluntary departure’ of its non-emergency Govt employees from India"
  },
  {
    "Date": "Thu, 06 May 2021 04:00:00 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/business/india-business/covid-drug-natco-eyes-patent-waiver/articleshow/82417797.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82417797.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>",
    "Image": "https://static.toiimg.com/thumb/msid-82423041,width-1070,height-580,imgsize-25293,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/business/india-business/covid-drug-natco-eyes-patent-waiver/articleshow/82417797.cms",
    "Text": "Hyderabad/Mumbai: In the first instance of a pharma company taking the compulsory licensing (CL) route to launch a Covid drug in India, Hyderabad-based Natco Pharma has filed for a waiver of patent rights to manufacture rheumatoid arthritis drug Baricitinib. The CL, if granted, will help in improving the accessibility and affordability of the drug, bringing its price down substantially.The USFDA had last November granted emergency authorisation for Baricitinib in combination with Remdesivir.At present, a limited quantity of the patented drug is available in the country, and that too, at an exorbitant price (see graphic). The patent is held by Incyte Holdings, with a licence to Eli Lilly, which markets the drug under the Olumiant brand name. The application has been filed under Section 92 of the Patents Act, which can be invoked by the Centre due to a national emergency, circumstances of extreme urgency or in case of public non-commercial use.In its application, Natco has cited the unmet medical needs due to the lack of supply and affordability in light of the grave and life-threatening national public health emergency caused by the second Covid wave as the main grounds for seeking the CL. Under the World Trade Organization TRIPS Agreement, CLs are legally recognised means to overcome barriers in accessing affordable medicines. Under the rules, governments allow a company to manufacture a patented drug without the consent of the innovator firm. In 2012, Natco became the first company to get a compulsory licence in India, which was related to a cancer drug called Nexavar. While there have been attempts to invoke the provisions again, the government has resisted regular use of the clause.Natco’s move is, however, expected to force the government to examine the application carefully given that former PM Manmohan Singh had pointed to the flexibility available under the law, although his reference was in the context of ramping up vaccination. The application puts pressure on the US drug maker, analysts said. It has only two choices — either give a voluntary licence or sue Natco for the patent, which could result in a public backlash given the soaring Covid case load and death toll in India.Natco has applied for a CL at a time when India and South Africa have approached the WTO for a temporary suspension of intellectual property rights of pharma companies so that Covid vaccines and other medicines can be accessible to poor countries. “It’s time India set up an independent committee of experts to consider and advice on compulsory licensing and use of other safeguards for Covid medical products, including medicines and vaccines,” lawyer and IP expert Leena Menghaney told TOI.In its application, Natco has urged the Controller General of Patents to grant it a CL to manufacture and market Baricitinib, both as bulk API (active pharmaceutical ingredient) and finished dosage only for Covid treatment in India till the pandemic prevails. It is also willing to pay a 7% royalty on net profits from Baricitinib sales to the patent-holder.Making its case, Natco’s application said Olumiant is not manufactured in India — less than 9,000 tablets were imported in 2019 and 2020, at an average cost of Rs 3,230 per tablet. Citing the pricing as a significant barrier, it said a 14-day regimen (one tablet a day) works out to approximately Rs 45,220 per patient, which most Indians can ill-afford.Natco said it would structure its pricing at Rs 30 each for a 4mg tablet, which translates to Rs 420 for a 14-day course, Rs 20 for a 2mg tablet (Rs 280 for the regimen) and Rs 15 for each 1mg tablet, costing only Rs 210 for the entire 14-day therapy.It also pointed out that the drug’s limited imports, which dropped from 8,870 tablets in 2019 to 8,385 tablets in 2020, would not be enough to cater the nearly 34 lakh Covid patients in India. “The tablets of Olumiant imported through 2020 by Lilly would serve at best to meet the needs of only approximately 600 patients,” Natco said in its application, a copy of which was reviewed by TOI.Why the drug mattersBaricitinib is a rheumatoid arthritis drug used in combination with Remdesivir for Covid treatment in some countries. The US Food and Drug Authority granted emergency use authorisation for Baricitinib in November 2020. The drug prevents a cytokine storm and calms down the immune system by inhibiting Janus Kinases (enzymes) that send signals to the cells to make more cytokines. The use of Baricitinib with Remdesivir reduces hospital time, increases chances of survival and also has minimal associated adverse events.",
    "Title": "Covid drug: Natco eyes patent waiver"
  },
  {
    "Date": "Thu, 06 May 2021 04:00:00 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/business/india-business/cos-give-staff-time-off-to-heal-handle-covid-stress/articleshow/82417750.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82417750.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>",
    "Image": "https://static.toiimg.com/thumb/msid-82423061,width-1070,height-580,imgsize-83837,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/business/india-business/cos-give-staff-time-off-to-heal-handle-covid-stress/articleshow/82417750.cms",
    "Text": "Mumbai: Given the rising anxiety levels among employees, several organisations are revealing their compassionate side by offering staff a much-needed break from work. Godrej Properties has closed offices for the week, starting Wednesday. Goldman Sachs has declared this Friday as a ‘self-care day’, encouraging employees to take the day off. RepIndia on Wednesday announced a 4-day mental health break for its staff. The Delhi- and Mumbai-based agency has decided to shut shop from May 6 to May 9 “to afford employees the requisite time for healing, being with their loved ones and get vaccinated”.The offices of philanthropic firm Dasra, on the other hand, have been closed for two weeks since April 26, for a “14-day work quarantine”. Employees have been asked to pause their immediate work deliverables and rather focus on caring for self, family and communities.Over the last few weeks, several other companies have announced mental health breaks and vaccination & Covid leaves to help employees navigate a rough patch. In an internal note to all India employees, Goldman Sachs shared, “Many of us have been affected directly or indirectly by the pandemic . We acknowledge it has put a lot of strain on our people physically and mentally, and encourage you to prioritise your health and wellbeing, and that of your families, above all else. To support you, this Friday, May 7 will be a ‘self-care day’ for colleagues in India.”“We also recognise that many of you are supporting family, friends or your communities during this time. To help you manage these priorities, we are also providing a ‘Care for Others Day’ off for our people in India, to be used before the end of June,” the firm said in the note.Godrej Properties MD & CEO Mohit Malhotra said, “The work-from-home burnout is real and the last 13 months of Covid and the second wave have taken a toll on people, emotionally and mentally. As a company it is our responsibility to be with our employees and we understand that in tough times like these, everyone deserves a break. We introduced ‘Taking a Pause to Heal’ initiative where these three days starting May 5 plus the weekend will be a complete break from everything work-related.” This is applicable to close to 2,000 permanent employees and approximately 600 contract employees working across all locations of Godrej Properties in India. “We have also proactively given a heads-up to our customers so that the sales and customer centricity teams can take a break too,” said Malhotra.Dasra’s associate director of talent management and internal operations, Ninad Ankleshwaria, said, “Our staff members have been volunteering to raise funds and as an emergency response team to fulfil urgent needs of Covid-affected people. We realised that many of our employees were distressed due to Covid affecting themselves, their loved ones or the community at large. Thus, we acknowledge that in such dark times, it’s essential to go beyond the words of being a people-first organisation and ensure that awe prioritise caring actions towards each and everyone’s well-being.”In a statement, RepIndia CEO Archit Chenoy said, “There is no denying that this is an incredibly difficult time for the entire nation — and our workforce is no exception to that reality. We’ve all been knocked off our feet, witnessing the devastation all around us. This is a small initiative we’ve taken to give our people breathing room — whether that’s used to grieve, to recuperate or to get vaccinated. The hard truth is that we’re in a full-blown national crisis and if giving people a few days off is going to ease a tiny bit of that pressure, it’s frankly the least we can do. I hope employers across the nation are supportive towards their teams who have worked relentlessly during the pandemic and at this time do not shy away from showing compassion and basic human decency.”",
    "Title": "Cos give staff time off to heal, handle Covid stress"
  },
  {
    "Date": "Thu, 06 May 2021 00:51:28 +0000",
    "Description": "",
    "Image": "https://static01.nyt.com/images/2021/05/05/multimedia/05economy-briefing-fox/merlin_146222118_694944c9-70dc-4f00-b8e4-5d287f25969e-facebookJumbo.jpg",
    "Link": "https://www.nytimes.com/live/2021/05/05/business/stock-market-today/",
    "Text": "Fox News Profits Grow Even as Viewership Declines This briefing has ended. Follow our latest coverage of markets, business and the economy.\n\nFox News keeps profits flowing at Murdoch’s Fox Corporation. Lachlan Murdoch, Fox Corporation’s chief executive, claimed victory as Fox News “reclaimed its leadership position as America’s No. 1 cable news network.” Credit... Mike Cohen for The New York Times Fox News, the cable news giant controlled by Rupert Murdoch, kept its parent company flush in the first three months of the year, notching a slight gain in profit and sales despite a drop in viewers. Altogether, Fox Corporation beat Wall Street expectations with a sevenfold increase in profit to $567 million and a 6.5 percent drop in revenue to $3.2 billion compared with the same period a year prior. A change in how the company valued some of its assets was a key reason for the profit surge. Investors were looking for a $332 million profit and $3.1 billion in sales. But revenue at most of its businesses dropped as fewer viewers tuned into the company’s cable channels and the Fox broadcast network, in part because Fox did not host the Super Bowl this year. Total advertising sales fell 24 percent to $1.2 billion, with the cable segment, primarily Fox News, seeing ad revenue drop 7 percent to $283 million. The decrease in advertising mirrors the performance at other media conglomerates and spotlights a significant shift in the advertising market. Ad revenue jumped at Facebook, Google and even smaller digital publishers in the first quarter as advertisers were more willing to spend their budget on digital platforms, often at the expense of television. Fox News still makes up the vast majority of Fox Corporation’s profits. The cable division that houses the news network generated $899 million in pretax income, accounting for 95 percent of the company’s total pretax profit. The company’s businesses include several sports cable networks and the free streaming platform Tubi. The company also announced on Wednesday the acquisition of OutKick Media, the publisher of its namesake sports news site. The company is run by Clay Travis, a sports commentator who has been known for making controversial statements. Last year, he called the coronavirus “overrated” and downplayed the severity of the brewing pandemic. In a statement announcing the acquisition, Lachlan Murdoch, chief executive of Fox Corporation and the son of Rupert Murdoch, welcomed Mr. Travis. “Clay and his team have quickly made OutKick a content powerhouse with a very large, loyal and engaged audience.” Despite the drop in viewers at Fox News, the network benefited from contractually triggered rate increases that cable operators pay to carry the channel. Licensing fees rose 6 percent to $1.07 billion. Advertising fell despite charging higher ad rates. The younger Mr. Murdoch claimed victory for Fox News in a call with investors after the earnings report. “Fox News reclaimed its leadership position as America’s No. 1 cable news network and the most-watched cable network in prime time,” he said before taking a moment to take a jab at rivals. “MSNBC lost more than one-third of its audience and CNN lost over half,” he said. “Over half.”\n\nUber shows signs of recovery from the pandemic slowdown. Although it is recovering, Uber is still losing money. Credit... Teresa Eng for The New York Times Uber said its business was recovering from the slowdown caused by the pandemic, although it continued to lose money. The company said on Wednesday that revenue was $2.9 billion in the first three months of the year, down 11 percent from the same period a year ago. The decline in earnings included $600 million that Uber has earmarked to pay for settlements with drivers in Britain, where the Supreme Court ruled in February that drivers should be classified as workers and be entitled to a minimum wage and vacation time. Excluding the settlement fund, Uber’s revenue was $3.5 billion, an 8 percent increase from the previous year that outpaced Wall Street expectations of $3.28 billion. Uber lost $108 million, an improvement from the previous year, when it lost $2.9 billion. Uber attributed the change to the sale of its autonomous vehicle unit, which was acquired by the self-driving truck start-up Aurora in December. Uber’s operating loss for the quarter was $1.5 billion — also made worse by the British driver settlement. On Tuesday, Uber’s primary competitor in the United States, Lyft, said that it was also recovering from the slowdown caused by the pandemic as riders began to return to the platform. Still, Lyft’s revenue for the quarter was $609 million, a 36 percent decline from the previous year. Losses were $427.3 million, 7 percent more than its losses the previous year. “Uber is starting to fire on all cylinders, as more consumers are riding with us again while continuing to use our expanding delivery offerings,” Dara Khosrowshahi, Uber’s chief executive, said in a statement. Uber’s stock price dropped more than 4 percent in after-hours trading on Wednesday evening. While consumers have avoided travel over the past year, Uber’s business has been bolstered by its food delivery service, Uber Eats. Revenue from delivery was $1.7 billion, a 270 percent increase from a year ago. Despite reopenings in Sydney and New York City, Uber said that customers have continued to order food delivery at a strong pace. But while riders have started returning to Uber and Lyft, drivers have been more hesitant. Both companies said they have faced driver shortages. During a call on Tuesday with financial analysts, Lyft’s president, John Zimmer, said he expected drivers who saw food delivery as a safer option during the pandemic would return to ride hailing because the pay is better and because drivers miss social interactions with riders. Uber said it had 3.5 million active drivers and couriers during the first three months of the year, down 22 percent from the previous year.\n\nAdvertisement Continue reading the main story\n\nTreasury urges Congress to lift the debt limit as government spending surges. The Treasury Department on Wednesday called on Congress to address a looming cap on the amount of debt the government can issue, warning that a surge of expenditures related pandemic could render its traditional tools for keeping the nation from breaching the debt limit less effective. A divided Congress passed a two-year budget deal in 2019 that suspended the so-called debt ceiling until July 31. The agreement, which was made before the pandemic struck, was intended to put off budget battles and give clarity over spending going into a presidential election year. Now, the Biden administration and a Congress controlled by Democrats must make sure the government can continue borrowing to pay its bills. “If Congress has not acted by July 31, Treasury, as it has in the past, may take certain extraordinary measures to continue to finance the government on a temporary basis,” said Brian Smith, Treasury’s deputy assistant secretary for federal finance. “In light of the substantial Covid-related uncertainty about receipts and outlays in the coming months, it is very difficult to predict how long extraordinary measures might last.” Negotiations over raising or suspending the debt limit are often fraught, and Treasury has developed tools over the years to give the federal government more flexibility as the deadline approaches. Those “extraordinary measures” include suspending sales of State and Local Government Series Treasury securities and suspending reinvestment of the Exchange Stabilization Fund. Treasury can also redeem existing investments of the Civil Service Retirement and Disability Fund and the Postal Service Retiree Health Benefits Fund and suspend reinvestment of the Government Securities Investment Fund. In the past, those measures have allowed the Treasury Department to extend the debt limit deadline on its own for months. But Mr. Smith said Treasury was studying potential scenarios “in which extraordinary measures could be exhausted much more quickly than in prior debt limit episodes.” Asked in a press briefing if Treasury was considering prioritizing payments if the deadline is missed, Mr. Smith said: “Congress needs to raise or suspend the debt limit, that’s the way to resolve this issue.” The debt limit warning came as part of the Treasury Department’s quarterly announcement about its financing plans. Treasury said this week that it expects to borrow more than $1 trillion during the rest of the fiscal year as the United States continues spending heavily to combat the coronavirus crisis.\n\nLawmakers slam Facebook oversight board’s decision to uphold Trump ban. Video transcript Back bars 0:00 / 0:48 - 0:00 transcript Facebook Oversight Board Upholds Ban of Trump A Facebook-appointed oversight board ruled to uphold the social network’s ban of former President Donald J. Trump at a panel on Wednesday. Our decision this morning is relatively simple and straightforward. First, we agree that Facebook had sufficient justification to remove Mr. Trump’s Jan. 6 posts for violation of the policy against praising or encouraging violent actors. Second, we agree that Facebook had sufficient justification to suspend Mr. Trump’s account, at least for the duration of what the Department of Homeland Security called a, quote, “heightened risk of violence.” But we hold that it was improper, that is to say, in violation of Facebook’s own rules, as well as generally accepted principles of freedom of expression, for Facebook to make that suspension indefinite. A Facebook-appointed oversight board ruled to uphold the social network’s ban of former President Donald J. Trump at a panel on Wednesday. Credit Credit... Erin Schaff/The New York Times Lawmakers lashed out at the ruling by Facebook’s oversight board on Wednesday to uphold the social network’s ban on former President Donald J. Trump, at least for now. Driving the discontent was that the oversight board, a quasi-court that confers over some of Facebook’s content decisions, did not make a black-and-white decision about the case. Mr. Trump had been blocked from the social network in January after his comments online and elsewhere incited the storming of the Capitol building. While the oversight board said on Wednesday that Facebook was justified in suspending Mr. Trump at the time because of the risk of further violence, it also said the company needed to revisit its action. The board said Facebook’s move was “a vague, standardless penalty” without defined limits, which needed to be reviewed again for a final decision on Mr. Trump’s account in six months. That angered both Republicans and Democrats. Republican lawmakers have pointed to Mr. Trump’s ouster by Facebook, Twitter and others as evidence of an alleged anti-conservative campaign by tech companies, calling the decisions a dangerous precedent for censorship of political figures. Senator Ted Cruz, Republican of Texas, tweeted that the board’s decision on Wednesday was “disgraceful” and warned it could have dangerous ripple effects. “For every liberal celebrating Trump’s social media ban, if the Big Tech oligarchs can muzzle the former President, what’s to stop them from silencing you?” Mr. Cruz said in his tweet. Senator Marsha Blackburn, Republican of Tennessee, said in a statement that the move showed that “it’s clear that Mark Zuckerberg views himself as the arbiter of free speech.” Republican members of the House judiciary committee tweeted that the decision was “pathetic,” and Jim Jordan of Ohio, the ranking member, tweeted about Facebook: “Break them up.” Democrats, also dissatisfied with the murky decision, took aim at how Facebook can be used to spread lies. Frank Pallone, the chairman of the House energy and commerce committee, tweeted: “Donald Trump has played a big role in helping Facebook spread disinformation, but whether he’s on the platform or not, Facebook and other social media platforms with the same business model will find ways to highlight divisive content to drive advertising revenues.” Representative Ken Buck, Republican of Colorado and the ranking member of the House antitrust subcommittee, accused the oversight board of political bias. “Facebook made an arbitrary decision based on its political preferences, and the Oversight Board, organized and funded by Facebook, reaffirmed its decision,” he said. But scholars who support free speech welcomed the decision. They have warned that as social media companies become more active in determining what stays online and what doesn’t, that could potentially lead to a slippery slope where tech giants have too much sway over digital speech. “The Facebook Oversight Board has said what many critics noted — the ban of former President Trump, while perhaps justified, was worrisome in its open-endedness and lack of process,” said Gautam Hans, a law professor at Vanderbilt University. “To the degree that the decision draws attention to how ad hoc, manipulable, and arbitrary Facebook’s own content policies get enforced, I welcome it.” Mike Isaac contributed reporting.\n\nAdvertisement Continue reading the main story\n\nA U.S. federal judge vacates the national freeze on evictions. Activists gathered outside Brooklyn Borough Hall on Monday to call for an extension of New York’s moratorium on evictions. Credit... Justin Lane/EPA, via Shutterstock A federal judge on Wednesday struck down the nationwide moratorium on evictions imposed by the Trump administration last year and extended by President Biden until June 30, a ruling that could affect tenants struggling to pay rent during the pandemic. The decision, by Judge Dabney Friedrich of the U.S. District Court for the District of Columbia, is the most significant federal ruling on the moratorium yet, and follows three similar federal court decisions. The Justice Department immediately appealed, and will seek an emergency stay of the decision, potentially delaying a final resolution of the case past the moratorium’s planned June 30 expiration. It remains unclear how wide an impact the decision will have on renters. It does not necessarily bind state housing court judges, who rule on eviction orders, and two other federal courts have upheld the moratorium, adding to the confusion about its fate. “There are now numerous conflicting court rulings at the district court level, with several judges ruling in favor of the moratorium and several ruling against,” said Diane Yentel, president of the National Low Income Housing Coalition, a national tenants advocacy group. Still, tenants’ rights groups said the decision on Wednesday could leave more low-income and working-class tenants vulnerable to eviction in coming weeks even as the Biden administration is beginning to disburse tens of billions of dollars in aid to help them catch up on unpaid rent. Landlords said the decision validated their arguments that the legal basis for the federal moratorium was unsound and overstepped the government’s power. The case was brought in November by the Alabama Association of Realtors and a group of real estate agents in Georgia who claimed the moratorium shifted the burden for rent payments from the tenants to landlords at a time when many owners have been struggling to meet their own expenses. The moratorium has had a substantial effect. Despite the sharp economic downturn created by the pandemic, eviction filings declined 65 percent in 2020 over the usual annual rate, according to an analysis of court data by the nonprofit group Eviction Lab. Housing analysts warned that Wednesday’s ruling could embolden more landlords to begin eviction proceedings against tenants before the federal government can disburse $45 billion in emergency housing assistance appropriated by Congress. “It couldn’t come at a worse time,” said Mary K. Cunningham, who studies housing with the Urban Institute, a nonpartisan policy group. “This is happening just as communities are trying to beat the clock, waiting for the federal government to get its new housing subsidies out the door before the moratorium expires on June 30. It’s terrible news.” Landlords and real estate agents downplayed concerns that lifting the moratorium will create an eviction crisis. “With rental assistance secured, the economy strengthening and unemployment rates falling, there is no need to continue a blanket, nationwide eviction ban,” a spokesman for the National Association of Realtors said in a statement. The executive order covers any single renter making less than $99,000 a year and families making twice that much. About 8.2 million tenants reported that they had fallen behind in their rent payments during the pandemic, according to Census Bureau estimates. Federal decisions, like the one issued Wednesday, are significant but serve as guidance rather than an order — although an unequivocal ruling from a prominent federal court is likely to sway some local judges, said Eric Dunn, director of litigation for the National Housing Law Project, a tenant advocacy group.\n\nG.M. made $3 billion profit in the first quarter but expects a chip shortage to hurt business. At a General Motors assembly plant in Ontario. Credit... Nathan Denette/The Canadian Press, via Associated Press A global shortage of computer chips that has forced automakers to idle plants in recent weeks is expected to take an even heavier toll on the industry in second quarter. General Motors said on Wednesday that it made a $3 billion profit in the first three months of the year, up from just $294 million a year earlier. But the company warned that its profit would be significantly smaller in the second quarter because of the shortage. “Every region of the world has been dealing with the supply-demand imbalance for semiconductors, and we’ve been working through some significant disruptions to production,” G.M.’s chief executive, Mary Barra, said in a conference call with reporters. The company expects net income for the first half of the year to total about $3.5 billion, implying a profit of around $500 million in the second quarter. It said it expected a rebound in the second half of 2021 and predicted net income for the full year to range from $6.8 billion to $7.6 billion. The G.M. forecast comes a week after Ford Motor said the shortage would likely cut its output of cars and trucks in half in the second quarter of the year from its previously planned level. Separately, Stellantis, the company formed by the merger of Peugeot SA and Fiat Chrysler, said on Wednesday that its production in the first quarter was 11 percent lower than planned because of the chip shortage, and it also warned that the second quarter would be weaker than the first. Stellantis reported revenue of 34 billion euros ($41 billion) since the merger was completed on Jan. 17. Had the merger been completed earlier, the new company’s revenue for the full first quarter would have been 37 billion euros, up 14 percent over the same period a year ago. Modern vehicles require dozens of computer chips for the electronics that control everything from brakes and transmissions to entertainment and navigation systems and tire-pressure monitors. Last year, as many automakers closed factories to prevent the spread of the coronavirus, sales of consumer electronics like laptops and game consoles took off, and semiconductor manufacturers shifted their production. Now, chip makers are struggling to meet demand to the type of chips used by automakers, which are seeing a strong rebound in demand for cars and trucks. Ms. Barra said G.M. was helped in the first quarter by directing the chips it did have to plants making its more profitable and top-selling models. “A lot of really good work is being done across our company to source semiconductors, allocate them to our most in-demand, capacity-constrained products,” she said. One positive from the shortage for automakers is that tight inventories of new vehicles has forced consumers to pay close to list prices for many models. G.M. said the average price paid for the vehicles it sold in North America in the first quarter was $3,500 higher than a year ago, lifting the company’s profit in the region.\n\nDogecoin continues its scarcely believable surge. Dogecoin, the cryptocurrency that started as a joke, is on a tear. A surge in the past day pushed it to another record, sending it some 14,000 percent higher than it started the year. Year-to-date performance of cryptocurrency prices One theory is that the upcoming appearance of Elon Musk, the Tesla chief executive and noted Dogecoin superfan, as the host of “Saturday Night Live” on May 8 could get more people interested in trading the crypto token. It’s as good a reason as any for those who try to rationalize its movements. The latest bout of Dogecoin mania has somewhat overshadowed what’s going on in Ethereum, the second-largest cryptocurrency, which also set records this week and made its 27-year-old co-creator, Vitalik Buterin, a billionaire (in dollars). The price of Ether, the crypto token built on the Ethereum blockchain, is up more than 350 percent for the year to date, outpacing Bitcoin’s relatively pedestrian 90 percent gain — which, for context, outpaces every stock in the S&P 500 over that period.\n\nAdvertisement Continue reading the main story\n\nEurope will tighten controls on Chinese firms as tensions rise. Valdis Dombrovskis, the European commissioner for trade. Efforts to approve an investment agreement between the European Union and China are on hold, he said. Credit... Pool photo by Yves Herman The European Union’s administrative arm said Wednesday that it would take action against foreign companies that received financial support from their governments, a move clearly aimed at China amid signs of deteriorating ties. The tougher line against China comes only four months after Brussels and Beijing seemed to be moving closer, working out an agreement in December intended to make it easier for European companies to invest in what has become the bloc’s most important trading partner for goods. But since then, relations have gone downhill because of tension over Chinese policy toward minority groups in the Xinjiang region. Legislation proposed by the European Commission on Wednesday would give it power to investigate and take measures against foreign companies that used government subsidies to get an unfair advantage over domestic competitors, an accusation often leveled at China. A separate proposal, also announced Wednesday, is intended to make Europe less dependent on China for crucial goods like semiconductors, drugs and batteries. A day earlier, Valdis Dombrovskis, the European commissioner for trade, said work on making the December investment agreement with Beijing final was on hold because of repressive Chinese policies. In March, the European Commission issued sanctions against four Communist Party officials after accusing them of being responsible for human rights violations against members of the Muslim Uyghurs and other minority groups in Xinjiang. China retaliated with sanctions against numerous members of the European Parliament, several scholars, and employees of human rights organizations and think tanks that have been critical of China. In light of the sanctions war, Mr. Dombrovskis told Agence France-Presse on Tuesday that “it’s clear the environment is not conducive for ratification of the agreement.” This is what @VDombrovskis told @AFP on the ratification of #CAI with China - not first time he’s said it & not breaking news.\n\n\n\nTo be clear: this is not a formal suspension decision, just means there’s no political outreach right now to promote the agreement - see end of quote. pic.twitter.com/P1CgzkMu8e — Vanessa Mock (@vanessamock) May 4, 2021 Europe’s tougher line toward China brings it closer to the stance adopted by the Biden administration, which objected to the investment agreement. But Europe remains divided over how to approach an important trading partner that is also a geopolitical rival. Markus J. Beyrer, director general of BusinessEurope, a leading business lobby, said in a statement Wednesday that the proposal on subsidies was “a step in the right direction in addressing existing legal loopholes and preventing market distortions.” But a prominent business group in Germany, which is highly dependent on exports to China, was critical. “The proposed regulation is very complex, and there is a risk that its implementation will lead to considerable additional bureaucracy and legal uncertainty for our member companies,” said Ulrich Ackermann, managing director of foreign trade at V.D.M.A., which represents German makers of industrial equipment.",
    "Title": "Fox News Profits Grow Even as Viewership Declines"
  },
  {
    "Date": "Thu, 06 May 2021 07:31:31+5:30 ",
    "Description": "Share Market LIVE Updates: Indian markets on Thursday erased all gains made earlier and were trading largely flat amid concerns of continued surge in covid cases. Bajaj Auto, HDFC were the top gainers",
    "Image": "https://images.livemint.com/img/2021/05/06/600x338/2021-03-09T042536Z_1_LYNXMPEH28076_RTROPTP_3_INDIA-BONDS-GAINS_1616069053613_1620264348261.JPG",
    "Link": "https://www.livemint.com/market/stock-market-news/share-market-live-updates-sensex-nifty-bse-nse-stock-market-today-06-05-2021-tata-steel-adani-green-11620263982133.html",
    "Text": "",
    "Title": "Market LIVE: Sensex flat; Nifty around 14,650; Bajaj Auto, HDFC top gainers"
  },
  {
    "Date": "Thu, 06 May 2021 10:25:30+5:30 ",
    "Description": "Gold price in the international market is oscillating in $30 range of $1,770 to $1,800, say experts",
    "Image": "https://images.livemint.com/img/2021/05/06/600x338/AFP_8ZC3N6_1616382936949_1620276633222.jpg",
    "Link": "https://www.livemint.com/market/gold-price-today-yellow-metal-shines-amid-experts-bullish-tag-should-you-buy-11620276446362.html",
    "Text": "Gold price today at the Multi Commodity Exchange (MCX) opened ₹120 higher from its yesterday closing and hit ₹47,120 per 10 gm. The yellow metal had managed to close on the higher side yesterday too but these shines in the yellow metal is still not enough to pare the gap of near ₹9,000 between the current gold price and its all-time high of ₹56,191.\n\nAccording to commodity experts, gold price in the international market is facing resistance at $1,800 to $1,805 per ounce levels and it has immediate support at $1,770 levels. They said that in the recent few trade sessions, gold price in the international market is oscillating in this $30 range of $1,770 to $1,800. Bullish or bearish trend in the gold price in immediate short-term can be decided on breakage of the either side of the range. However, they maintained that overall trend for gold price is bullish and any 3-4 per cent dip in the precious metal price should be seen as a buying opportunity.\n\nSpeaking on the gold price outlook Anuj Gupta, Vice President — Commodity & Currency Trade at IIFL Securities said, \"It will take time for the gold price to scale around its all-time high of ₹56,191 at MCX. Currently, gold price in the international market is range-bound as it is oscillating in $1,770 to $1,800 per ounce levels. It has touched near $1,800 per ounce levels twice but failed to break the current resistance at around $1,800 to $1,805 mark.\"\n\nElaborating upon his gold price forecast in terms of MCX Anuj Gupta of IIFL Securities said, \"Gold price in the domestic market has immediate support at ₹46,700 while it has resistance at ₹47,500 per 10 gm levels. But, this is for the immediate short-term range. Overall the gold price outlook is positive. Any dip in the gold price should be seen as buying opportunity and one should avoid selling on rise as breakage of $1,800 resistance in the international market will lead to the next target of $1,820 per ounce that means at MCX we can see gold price hitting ₹48,000 per 10 gm levels.\"\n\nAdvising gold investors to remain cautious about the current gold price range in the international market Amit Sajeja, Vice President — Research at Motilal Oswal said, \"Gold price in the international market has strong support in $1,735 to $1,750 range and it may go up to this range if the current support at $1,770 to $1,760 per ounce is broken. But, this dip should be seen as buying opportunity and one should accumulate on every 3-4 per cent dip in the gold price.\"\n\nSajeja said that gold price at MCX has strong support at ₹46,550 to ₹46,600 but on the breakage of this support it may go up to ₹45,500 per 10 gm levels. He advised gold investors to keep accumulating on every dip as overall trend for the gold price is 'bullish.'\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter.",
    "Title": "Gold price today: Yellow metal shines amid experts' 'bullish' tag — should you buy?"
  },
  {
    "Date": "Thu, 06 May 2021 09:12:58+5:30 ",
    "Description": "Delta Corp is one Rakesh Jhunjhunwala stock, to which, the experts have given 'buy' tag and said that the stock is positive if an investor invests keeping log-term time-horizon in mind",
    "Image": "https://images.livemint.com/img/2021/05/06/600x338/jhunjhunwala_5C--621x414_1620272317083.jpg",
    "Link": "https://www.livemint.com/market/stock-market-news/rakesh-jhunjhunwala-portfolio-experts-give-buy-tag-to-this-tech-stock-11620272128159.html",
    "Text": "Rakesh Jhunjhunwala portfolio stocks are in news these days as the market magnet has overhauled its share holdings in 12 companies. While the Big Bull increased stake in 5 companies, he decided to lower stake in 7 companies. Stock market experts are of the opinion that this overhaul could have been caused by the reasons better known to Rakesh Jhunjhunwala only as they still see some of the Rakesh Jhunjhunwala stocks to go northward from current market price. Delta Corp is one such stock, to which the experts have given 'buy' tag and said that the stock is positive if an investor invests keeping log-term time-horizon in mind.\n\nSpeaking on the fundamentals of Delta Corp shares Avinaskh Gorakshkar, Head of Research at Profitmart Securities said, \"Delta Corp has business in two sectors — online hotel booking and gaming. Its hotel booking business is hit due to the recent Covid-19 pandemic spread in India but at the same time the pandemic has helped its online gaming business.\" Gorakshkar said that once the Covid-19 crisis stablises one can expect the Delta Corp share price among the sharp upside moving stocks. However, he maintained that the stock is recommended for those who are investors and have long-term time-frame in mind.\n\nEye on third wave of Coronavirus\n\nOn what should be the ideal trade strategy if an investor decides to invest in Delta Corp shares Ravi Singhal, Vice Chairman at GCL Securities said, \"Delta Corp share price at NSE closed yesterday at ₹148.80. One can buy this counter at current market price for the long-term targets of ₹240 and ₹270 keeping stop loss at ₹124. However, I would advise investors to have an eye on how the third wave of Coronavirus pans out in India as the Government of India (GoI) has expected third wave of Covid-19 by November this year. If the GoI fails to contain the third wave, then the hospitality industry will have a huge hit in December, especially in Goa and Maharashtra.\"\n\nRavi Singhal of GCL Securities said that if the Indian government fails to contain the third wave of Covid-19, then it is advisable for the Delta Corp share holders to exit at ₹200 per stock levels and wait for the right time to re-enter.\n\nRakesh Jhunjhunwala net worth in Delta Corp Company\n\nAs per the Delta Corp shareholding pattern available at the BSE website bseindia.com, Rakesh Jhunjhunwala and his wife Rekha Jhunjhunwala together hold 7.50 per cent company shares in March 2021 quarter, which means the investor duo didn’t changed their holdings in Delta Corp Company.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter.",
    "Title": "Rakesh Jhunjhunwala Portfolio: Experts give 'buy' tag to this tech stock"
  },
  {
    "Date": "Thu, 06 May 2021 08:09:52+5:30 ",
    "Description": "Key companies that will announce March quarter results today are Hero MotoCorp, Tata Consumer, Adani Transmission, Adani Power, Proctor and Gamble Health and Blue Star",
    "Image": "https://images.livemint.com/img/2021/05/06/600x338/BSE_1616957711557_1620268753299.jpg",
    "Link": "https://www.livemint.com/market/stock-market-news/markets-likely-to-be-steady-tata-motors-hero-motocorp-adani-power-in-focus-11620268437556.html",
    "Text": "Mumbai: Indian equity markets are likely to be steady on Thursday following global peers, while SGX Nifty suggests a positive opening for Indian benchmark indices. On Wednesday, BSE Sensex ended at 48,677.55, up 424.04 points or 0.88%. The Nifty closed at 14,617.85, up 121.35 points or 0.84%.\n\nStock indices rose globally, with the Nasdaq leading gains on Wall Street, while the U.S. dollar eased off its more than two-week high hit earlier. Asia Pacific markets were mostly higher.\n\nInvestors across markets were also trying to position ahead of Friday’s U.S. monthly jobs report.\n\nIn India, key companies that will announce March quarter results today are Hero MotoCorp, Tata Consumer, Adani Transmission, Adani Power, Proctor and Gamble Health and Blue Star.\n\nTata Steel on Wednesday posted a consolidated net profit of ₹7162 crore for the quarter ended March 2021, on account of higher income. This is against a loss of ₹1615 crore during the quarter ended March 2020.\n\nMeanwhile, the Competition Commission of India has ordered a probe into allegations of anti-competitive practices against Tata Motors Ltd on behalf of two auto dealers.\n\nUnion finance minister Nirmala Sitharaman on Wednesday said the resurgence of the pandemic has adversely impacted the nascent recovery process in India, but maintained that the country will sail through the storm with the focus of the government on robust public health measures, timely treatment of infected persons, sound macro-economic management, and strong macro fundamentals.\n\nThe dollar was near flat after moving off more than two-week highs followed some softer-than-expected U.S. economic data.\n\nIn the US Treasury market, yields backpedaled from earlier highs. An announcement of second quarter auction sizes and economic data did not move the market out of its holding pattern.\n\nThe benchmark 10-year yield, which hit a session high of 1.626%, was last up less than a basis point at 1.5996%, holding below a 14-month high of 1.776% reached on March 30.\n\nOil prices rose for a third day. Brent crude was up 59 cents at $69.47 a barrel.\n\nSpot gold added 0.2% to $1,782.76 an ounce. U.S. gold futures gained 0.29% to $1,780.90 an ounce.\n\n(Reuters contributed to the story)\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter.",
    "Title": "Markets likely to be steady; Tata Motors, Hero MotoCorp, Adani Power in focus"
  },
  {
    "Date": "Thu, 06 May 2021 11:03:43+5:30 ",
    "Description": "India recorded fresh covid-19 cases at 412,000 in 24 hours, which is the highest so far and continued rise in death counts remain a matter of concern for markets",
    "Image": "https://images.livemint.com/img/2021/05/06/600x338/BSE_1616957711557_1620279167532.jpg",
    "Link": "https://www.livemint.com/market/stock-market-news/markets-erase-opening-gains-trade-flat-11620278500001.html",
    "Text": "Indian markets on Thursday erased all the morning gains and were trading marginally lower amid concerns of continued surge in covid cases.\n\nEarlier in opening, Sensex gained nearly 240 points while Nifty climbed 80 points. At 11 am, Sensex rose 0.096% to 48,724.30 points while Nifty rose 0.21% to 14,649 points.\n\nIndia recorded fresh covid-19 cases at 412,000 in 24 hours, which is the highest so far and continued rise in death counts remain a matter of concern for markets. While several states had started showing signs of reversal in daily caseload, sharp rise in daily cases again raises concerns, analysts say.\n\nOn Wednesday the Reserve Bank of India in its unscheduled speech announced measures to cushion the fallout of the second wave, via incentivizing lending to most-affected borrowers, alongside extension of previous relief measures.\n\n\"Going forward, markets are likely to remain range bound along with increase in volatility. Resurgence of the second covid wave has dented sentiments and weakened FY22E earnings visibility. While the market is currently looking beyond the short-term impact, if the pandemic doesn’t subside soon, it opens up downside risks,\" said Siddhartha Khemka, head-retail research, Motilal Oswal Financial.\n\n\"4QFY21 earning season is progressing well so far, but earnings downgrades are now rising, given the widespread restrictions in various states, which is hurting mobility and economic recovery. Thus, the interplay of resurgence in covid-19 cases and the pace of vaccination would decide the trajectory of economic recovery going forward,\" Khemka added.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter.",
    "Title": "Markets erase opening gains; trade flat"
  },
  {
    "Date": "Thu, 06 May 2021 06:12:09+5:30 ",
    "Description": "Sebi has imposed a penalty of  ₹10 lakh each on them. The penalty needs to be paid within 45 days",
    "Image": "https://images.livemint.com/img/2021/05/06/600x338/7f7205b2-713e-11eb-8917-e93c7f105681_1613608931154_1620261472829.jpg",
    "Link": "https://www.livemint.com/market/stock-market-news/biocon-share-trading-case-sebi-bans-6-entities-for-2-yrs-for-manipulative-trade-11620259691425.html",
    "Text": "Sebi on Wednesday barred six entities from the capital markets for two years for indulging in manipulative trading in the shares of Biocon Limited in the cash market.\n\nThose banned are — Gangwal Sunil Kumar, Vihit Investment, Mohd Faisal, AKG Securities and Consultancy, Paramount Incorporation and Minesh Jormalbhai Mehta (collectively referred to as noticees).\n\nIn addition, the regulator has imposed a penalty of ₹10 lakh each on them. The penalty needs to be paid within 45 days.\n\nSebi had conducted an investigation in the trading activities of certain entities in the scrip of Biocon.\n\nThe focus of the investigation was to ascertain whether there was any violation of the securities laws by certain entities in the cash market on June 29, 2017 at NSE during the last half an hour of trading so as to benefit certain entities who were holding net long positions in the derivative contracts.\n\nThe regulator, in its probe, found that all the six entities had engaged in price manipulation in the scrip of Biocon at NSE cash market during the last half an hour on June 29, 2017 and managed to establish higher settlement price in the futures of Biocon.\n\n\"Noticees have acted as a group and had entered into these trades in the cash segment for the purpose of securing a higher settlement price in the futures market where noticees no. 2, 3, 4 and 6 (Vihit Investment, Mohd Faisal, AKG Securities and Mehta) had taken long position in the last half an hour on June 29, 2017,\" Sebi noted.\n\nThese four entities had taken the long positions to increase their profit arising out of their long positions, it added.\n\n\"... noticees acted in concert to manipulate the settlement price in order to enable noticees no. 2, 3, 4 and 6, to make wrongful gains from their long position in futures,\" Sebi said in its 86-page order.\n\nIn addition, the regulator has directed these four entities to disgorge the unlawful gains made by them along with an interest of 12 per cent per annum.\n\nBy indulging in such trades, all the six entities violated the provisions of PFUTP (Prohibition of Fraudulent and Unfair Trade Practices) norms, Sebi noted.\n\nThis story has been published from a wire agency feed without modifications to the text. Only the headline has been changed.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter.",
    "Title": "Biocon share trading case: Sebi bans 6 entities for 2 yrs for manipulative trade"
  },
  {
    "Date": "Thu, 06 May 2021 07:59:58+5:30 ",
    "Description": "Tata Consumer Products and Hero MotoCorp are the Nifty companies that will announce their March quarter earnings on Thursday. Adani Power, Adani Transmission, Century Textiles, and Praj Industries are among a host of companies that will also report their earnings today",
    "Image": "https://images.livemint.com/img/2021/05/06/600x338/AFP_8U246K_1604066320719_1604066336091_1620265519355.jpg",
    "Link": "https://www.livemint.com/market/stock-market-news/stocks-to-watch-tata-motors-idbi-bank-tata-steel-hero-motocorp-adani-green-11620265477462.html",
    "Text": "New Delhi: Here are the top ten stocks that will be in news today:\n\nTata Steel: The company on Wednesday posted a consolidated net profit of ₹7162 crore for the quarter ended March 2021, on account of higher income. This is against a loss of ₹1615 crore during the quarter ended March 2020. Consolidated revenue from operations stood at ₹49,977 crore, up by 38.8% over ₹36,009 crore reported in the corresponding quarter of the last fiscal.\n\nIDBI Bank: The Cabinet on Wednesday cleared the proposal for strategic disinvestment along with transfer management control of the bank. The government and Life Insurance Corporation together own more than 94% stake in IDBI Bank with 45.48% and 49.24% individual stakes respectively.\n\nTata Motors: The Competition Commission of India has ordered a probe into allegations of anti-competitive practices against the automaker on behalf of two auto dealers. The lawyer representing a Tata Motors’ dealer from Uttar Pradesh alleged that the company’s terms for the dealership encompassed both manufacturing and financing of commercial vehicles through NBFCs, Tata Capital Financial Services Ltd and Tata Motors Finance Ltd, which was “abusive, anti-competitive\".\n\nHero MotoCorp: The country’s largest two-wheeler manufacturer will report its March quarter earnings on Thursday. The company reported a 23% year-on-year increase in net profit to ₹1,084 crore for the quarter ending 31 December. Net sales improved 40% to ₹9776 crore .\n\nAdani Green Energy: The company reported a rise of over 8% in its consolidated net profit to ₹105 crore in March quarter. Total income of the company rose 50.49% to ₹1082 crore in the quarter.\n\nCipla: Roche India has received emergency use authorization for the antibody cocktail of casirivimab and imdevimab, which will be marketed and distributed in India through a strategic partnership with Cipla Ltd, which is also the exclusive importer and distributor of tocilizumab, patented by Roche India.\n\nAdani Enterprises: The company reported 282% rise in consolidated net profit at ₹233.95 crore for the quarter ended March. Consolidated income during the January-March quarter was at ₹13,688.95 crore compared with ₹13,698.09 crore in the year-ago period.\n\nMaruti Suzuki India: The country's largest carmaker said its total production in April stood at 159,955 units, down 7% from March this year. The company had produced a total of 172,433 units in the year-ago period.\n\nWipro Limited: The company has partnered Transcell Oncologics to transform vaccine safety assessment using augmented intelligence. This partnership combines Transcell’s innovative stem cell technology with the advanced augmented intelligence capabilities of Wipro HOLMES® to improve the safety of global vaccine immunization programs.\n\nGodrej Industries: The board of directors of the company has approved the information memorandum for issuance of up to 7,500 rated, listed, unsecured, redeemable, non-convertible debentures having face value of ₹10 lakh each, aggregating to ₹750 crore on a private placement basis.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter.",
    "Title": "Stocks to Watch: Tata Motors, IDBI Bank, Tata Steel, Hero MotoCorp, Adani Green"
  },
  {
    "Date": "Thu, 06 May 2021 11:03:44 +0530",
    "Description": "Tata Steel reported a net profit of Rs 6,593.5 crore for the quarter ended 31 March, 2021 as against a net loss of Rs 436.8 crore in the year-ago period",
    "Image": "https://i.ndtvimg.com/i/2013-08/71376508587_625x300.jpg",
    "Link": "https://www.ndtv.com/business/tata-steel-soars-over-3-on-jump-in-net-profit-in-march-quarter-2435061",
    "Text": "At 10:45 am, the shares of Tata Steel were trading higher by 3.16 per cent on the BSE\n\nTata Steel shares gained more than 3 per cent in a subdued market after the steel major's profit jumped in the fourth quarter ended March 2021. At 10:45 am, the shares of Tata Steel were trading at Rs 1,103.95, higher by 3.16 per cent, on the BSE.\n\nTata Steel on Wednesday reported a net profit of Rs 6,593.5 crore for the quarter ended 31 March, 2021. The company had posted a net loss of Rs 436.8 crore in the year-ago period.\n\nThe company's total income jumped to Rs 50,249.59 crore in the March 2021 quarter from Rs 37,322.68 crore a year earlier.\n\nTotal sales volumes rose 0.43 per cent quarter-on-quarter to 4.67 million tonnes due to robust marketing network and improved market conditions.\n\nThe BSE Sensex was trading at 48,722.40, higher by 38.85 points and the NSE Nifty was at 14,640.75, up 23 points at the time.",
    "Title": "Tata Steel Soars Over 3% On Jump In March Quarter Net Profit"
  },
  {
    "Date": "Thu, 06 May 2021 08:03:12 +0530",
    "Description": "In Delhi,petrol prices have been increased by 25 paise to Rs 90.99 per litre and diesel prices have been raised by 30 paise to Rs 81.42 per litre, according to Indian Oil Corporation",
    "Image": "https://c.ndtvimg.com/2021-02/g08nod98_petrol-pump-hp_650x400_05_February_21.jpg",
    "Link": "https://www.ndtv.com/business/petrol-diesel-price-today-may-6-2021-petrol-diesel-prices-hiked-across-metros-for-third-consecutive-day-check-latest-rates-here-2432654",
    "Text": "Fuel Prices: Domestic petrol and diesel prices vary across states due to value added tax (VAT).\n\nPetrol and diesel prices have been hiked up to 30 paise across the metros on Thursday, May 6, 2021. In Delhi, petrol prices have been increased by 25 paise from Rs 90.74 per litre to Rs 90.99 per litre and diesel prices have been raised by 30 paise from Rs 81.12 per litre to Rs 81.42 per litre, according to Indian Oil Corporation. In Mumbai, the revised prices of petrol and diesel are Rs 97.34 per litre and Rs 88.49 per litre respectively, according to the state-run oil refiner. Presently, fuel prices are the highest in Mumbai among the four metro cities. Petrol and diesel prices vary across states in India due to the value-added tax. (Also Read: How To Find Latest Petrol, Diesel Rates In Your City)\n\nBelow are the latest petrol and diesel prices across the four metro cities:\n\nCity Petrol Diesel Delhi 90.99 81.42 Mumbai 97.34 88.49 Chennai 92.90 86.35 Kolkata 91.14 84.26 Source: Indian Oil\n\nThe state-run oil marketing companies, Indian Oil Corporation, Bharat Petroleum and Hindustan Petroleum, align the rates of domestic fuel with the global crude oil prices by taking into account changes in the foreign exchange rates. The new changes in fuel prices are implemented with effect from 6 am each day.\n\nMeanwhile, oil prices fell on Thursday as gasoline inventories in the United States, the world's largest oil consumer, rose for a fifth consecutive week although a draw in crude stockpiles helped to underpin prices.\n\nBrent crude oil futures fell by 16 cents, or 0.2 per cent to $68.80 barrel by 0123 GMT, and U.S West Texas Intermediate (WTI) crude futures dropped by 20 cents or 0.3 per cent to $65.43 a barrel. Both Brent and U.S crude futures hit their highest since mid-March on Wednesday before retreating.",
    "Title": "Petrol, Diesel Prices Hiked Across Metros For Third Consecutive Day"
  },
  {
    "Date": "Thu, 06 May 2021 11:11:22 +0530",
    "Description": "Gold prices were mostly unchanged on Wednesday as the possibility of higher US interest rates supported the dollar.",
    "Image": "https://c.ndtvimg.com/2019-06/4f99r7oo_gold-prices-gold-gold-jewellery-gold-rates-reuters_625x300_26_June_19.jpg",
    "Link": "https://www.ndtv.com/business/gold-silver-price-today-update-6-may-2021-gold-trades-marginally-higher-on-mcx-silver-gains-2435173",
    "Text": "In the spot market, silver was sold at Rs 70,205 per kilogram on Wednesday evening.\n\nGold, Silver Price Today: Gold price for delivery of June 4 rose as much as 0.3 per cent to hit an intraday high of Rs 47,151 per gram on the Multi Commodity Exchange. In the spot market, fine gold with (999) purity was sold at Rs 46,750 per 10 gram, according to India Bullion & Jewellers Association (IBJA). Gold with 22 carat purity was retailed at Rs 45,160 per 10 gram, 18 carat gold was sold at Rs 37,400 per 10 gram and gold with purity of 14 carat was priced at Rs 31,090 per 10 gram. The spot rates mentioned above are exclusive of 3 per cent goods and services tax and making charges, IBJA noted on its website.\n\nOvernight, gold prices were mostly unchanged on Wednesday as the possibility of higher US interest rates supported the dollar, while palladium held near record highs hit in the previous session amid supply worries.\n\n\"The dollar index bounced back last week and has generally risen this week. That's kind of providing some downward pressure on gold prices,\" said Fawad Razaqzada, analyst with ThinkMarkets.\n\n\"Treasury Secretary Janet Yellen clearly said that rates need to go up higher at some point of time. The key question is how fast they will rise as the Federal Reserve has remained quite dovish.\"\n\nBack home, silver prices also rose in-line with gold as silver futures contracts for delivery on July 5, 2021 rose as much as 0.45 per cent to hit an intraday high of Rs 69,926 per 1 kilogram.\n\nIn the spot market, silver was sold at Rs 70,205 per kilogram on Wednesday evening, according to IBJA.\n\nIn the international market, silver futures fell 1.5 per cent to $26.56 per ounce.\n\n(With inputs from Reuters)",
    "Title": "Gold Trades Marginally Higher On MCX, Silver Rises Above Rs 69,850"
  },
  {
    "Date": "Thu, 06 May 2021 08:14:56 +0530",
    "Description": "Asian markets were mostly higher; Nikkei 225 jumped 1.98 per cent, while Topix index was up 1.97 per cent and South Korea's Kospi rose 0.7 per cent",
    "Image": "https://c.ndtvimg.com/2020-02/nt3ob83g_marketssensex-budget-generic_625x300_01_February_20.jpg",
    "Link": "https://www.ndtv.com/business/stock-market-updates-may-6-2021-sensex-nifty-to-open-firm-on-positive-global-cues-2432764",
    "Text": "At 7:30 am, the Nifty futures were trading higher by 0.55 per cent on Singapore Stock Exchange\n\nThe domestic stock markets are likely to open in the green, extending the gains witnessed in the previous session, on the back of positive global cues. Trends on SGX Nifty indicate a positive opening for the index in India, with a 66-points gain. At 7:30 am, the Nifty futures were trading at 14,759, higher by 66 points or 0.55 per cent, on the Singapore Stock Exchange.\n\nAsian markets were mostly higher as investors look ahead to the U.S. jobs report due later this week for clues about how long the Fed will stay on hold. Nikkei 225 jumped 1.98 per cent, while the Topix index was up 1.97 per cent and South Korea's Kospi rose 0.7 per cent. In Hong Kong, the Hang Seng index was up 1.15 per cent.\n\nWall Street's main indexes and the Dow hit a record high on Wednesday, as growth stocks bounced from a steep selloff in the previous session and a survey showed private jobs rose in April. The Dow Jones was up 0.46 per cent, S&P 500 was up 0.54 per cent and Nasdaq Composite was up 0.63 per cent.\n\nMeanwhile, oil prices fell on Thursday as gasoline inventories in the United States, the world's largest oil consumer, rose for a fifth consecutive week although a draw in crude stockpiles helped to underpin prices. Brent crude oil futures fell by 16 cents, or 0.2 per cent to $68.80 barrel by 0123 GMT, and U.S West Texas Intermediate (WTI) crude futures dropped by 20 cents or 0.3 per cent to $65.43 a barrel. Both Brent and U.S crude futures hit their highest since mid-March on Wednesday before retreating.\n\nOn Wednesday, the BSE Sensex had jumped 424.04 points to 48,677.55 and Nifty rose 121.40 points to 14,617.90.",
    "Title": "Sensex, Nifty To Open Firm On Positive Global Cues"
  },
  {
    "Date": "Thu, 06 May 2021 09:21:27 +0530",
    "Description": "Tata Steel shares soared more than 4 per cent on the BSE after the steel major posted a consolidated profit of Rs 6,644.1 crore in March quarter as against a loss of Rs 1,481.3 crore in the same...",
    "Image": "https://c.ndtvimg.com/2020-02/nt3ob83g_marketssensex-budget-generic_625x300_01_February_20.jpg",
    "Link": "https://www.ndtv.com/business/stock-market-updates-may-6-2021-sensex-gains-over-100-points-nifty-above-14-650-2433548",
    "Text": "ITC, Bajaj Auto and Hero Motocorp were other significant gainers among Sensex stocks\n\nThe domestic stock markets have opened in the positive, extending the gains witnessed in the previous session, on the back of positive global cues. At 9:18 am, the BSE Sensex was trading at 48,7420.55, higher by 68.70 points or 0.15 per cent and the NSE Nifty was at 14,646.15, up 24.70 points or 0.15 per cent. The broader markets are also trading in the positive, with the BSE Midcap index and BSE Smallcap index gaining 0.4 per cent respectively.\n\nAsian markets were mostly higher as investors look ahead to the U.S. jobs report due later this week for clues about how long the Fed will stay on hold. Nikkei 225 jumped 1.98 per cent, while the Topix index was up 1.97 per cent and South Korea's Kospi rose 0.7 per cent. In Hong Kong, the Hang Seng index was up 1.15 per cent.\n\nWall Street's main indexes and the Dow hit a record high on Wednesday as growth stocks bounced from a steep selloff in the previous session and a survey showed private jobs rose in April. The Dow Jones was up 0.46 per cent, S&P 500 was up 0.54 per cent and Nasdaq Composite was up 0.63 per cent.\n\nMeanwhile, oil prices fell on Thursday as gasoline inventories in the United States, the world's largest oil consumer, rose for a fifth consecutive week although a draw in crude stockpiles helped to underpin prices.\n\nBrent crude oil futures fell by 16 cents, or 0.2 per cent to $68.80 barrel by 0123 GMT, and U.S West Texas Intermediate (WTI) crude futures dropped by 20 cents or 0.3 per cent to $65.43 a barrel. Both Brent and U.S crude futures hit their highest since mid-March on Wednesday before retreating.\n\nOn the stock-specific front, Tata Steel soared more than 4 per cent to top the gainers list on the BSE after the steel major posted a consolidated profit of Rs 6,644.1 crore in the fourth quarter ended March 2021 as against a loss of Rs 1,481.3 crore in the same quarter last year. Other metal shares were also going strong, with JSW Steel and Hindalco adding over 2 per cent each. ITC, Bajaj Auto and Hero Motocorp were the other significant gainers among Sensex stocks.\n\nOn the other hand, UPL, HCL Teh and Sun Pharma had shed around a per cent each.\n\nThe BSE market breadth is strong. Out of 2222 stocks traded on the BSE, there were 1414 advancing stocks as against 712 declines.",
    "Title": "Sensex Rises Over 100 Points; Tata Steel Top Gainer Post March Quarter Earnings"
  },
  {
    "Date": "Thu, 06 May 2021 08:38:15 +0530",
    "Description": "Tata Steel posted a consolidated profit of Rs 6,644.1 crore in the fourth quarter ended March 2021 as against a loss of Rs 1,481.3 crore in the same quarter last year",
    "Image": "https://c.ndtvimg.com/2019-08/uoai23sg_sensex-nifty-bse-nse-markets_625x300_26_August_19.jpg",
    "Link": "https://www.ndtv.com/business/stocks-to-watch-in-trade-today-may-6-2021-tata-steel-maruti-suzuki-wipro-2433029",
    "Text": "Maruti Suzuki's total production in April 2021 fell 7 per cent to 1,59,955 units\n\nThe domestic stock markets are likely to open in the green, extending the gains witnessed in the previous session, on the back of positive global cues. Trends on SGX Nifty indicate a positive opening for the index in India, with a 66-points gain. At 7:30 am, the Nifty futures were trading at 14,759, higher by 66 points or 0.55 per cent, on the Singapore Stock Exchange.\n\nOn Wednesday, the BSE Sensex had jumped 424.04 points to 48,677.55 and Nifty rose 121.40 points to 14,617.90.\n\nStocks to watch in trade in today's session\n\nTata Steel\n\nTata Steel posted a consolidated profit of Rs 6,644.1 crore in the fourth quarter ended March 2021 as against a loss of Rs 1,481.3 crore in the same quarter last year.\n\nMaruti Suzuki\n\nMaruti Suzuki's total production in April 2021 fell 7 per cent to 1,59,955 units from 1,72,433 units in March 2021.\n\nWipro\n\nWipro has partnered with Transcell Oncologics to transform vaccine safety assessment using augmented intelligence.\n\nIDBI Bank\n\nThe Cabinet Committee on Economic Affairs has granted approval for strategic disinvestment of IDBI.",
    "Title": "Stocks To Watch: Tata Steel, Maruti Suzuki, Wipro"
  }
]