[
  {
    "Date": "Mon, 10 May 2021 09:46:54 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/home/education/news/iit-madras-incubated-startup-sets-guinness-record-in-upskilling-people-in-python-programming/articleshow/82514480.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82514480.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>",
    "Image": "https://static.toiimg.com/thumb/msid-82514509,width-1070,height-580,imgsize-1694632,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/home/education/news/iit-madras-incubated-startup-sets-guinness-record-in-upskilling-people-in-python-programming/articleshow/82514480.cms",
    "Text": "Congratulations! You have successfully cast your vote Login to view result\n\nCHENNAI: Beating the previous record by 50 times, IIT Madras-incubated startup GUVI and All India Council for Technical Education (AICTE) has set the Guinness world record in upskilling Indians in Python programming language. They set the record for \"most numbers of users to take a programming lesson in 24 hours\".As many as 1,12,319 people participated in the 'AI-for-India' Initiative organized on April 24-25, 2021 by GUVI and AICTE which primary aim to reach out one million Indians and upskill them in the Python programme language.\"More than six lakh users across 28 states registered for their highly anticipated AI-For-India event and around 1.12 lakh users completed building the face recognition app in the online workshop,\" SP Balamurugan, Co-Founder & CEO, GUVI told ANI.Participants from various backgrounds like school kids, high school students, college graduates, job seekers, and experienced IT and non-IT professionals took part in the event.\"Students and working professionals from all parts of the country, from the urban centres to those in remote villages, worked on their mobile phones and laptops to take programming lessons in Python during this landmark event. The visuals are from a local village in Tamil Nadu. Students and professionals in these villages arranged a dozen streaming devices to attend a free online workshop based on Artificial Intelligence,\" Balamurugan said.\"The host of the workshop was guiding them on how to build a facial recognition app from scratch,\" he added.Tech aspirants can avail of a professionally curated over 100-course catalog for a minimal amount of 399/month or 1499/year. The certification for that Python course will be available on paying a minimal fee of Rs. 1770/- as it is issued by IIT-Madras.",
    "Title": "IIT Madras incubated startup sets Guinness record in upskilling people in Python programming"
  },
  {
    "Date": "Mon, 10 May 2021 09:14:47 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/home/education/news/indefinite-wait-for-board-exams-making-students-anxious/articleshow/82509068.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82509068.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>With uncertainty on when and how the exams will be held as the pandemic continues to surge, students feel the academic year is dragging on.",
    "Image": "https://static.toiimg.com/thumb/msid-82514070,width-1070,height-580,imgsize-111698,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/home/education/news/indefinite-wait-for-board-exams-making-students-anxious/articleshow/82509068.cms",
    "Text": "Congratulations! You have successfully cast your vote Login to view result\n\nBENGALURU: What started as excitement and relief when various boards announced postponement of class 12 exams is now slowly turning into fatigue and stress among city students.With uncertainty on when and how the exams will be held as the pandemic continues to surge, students feel the academic year is dragging on.Bhadra Anil, a student of Whitefield Global School, said: “When they announced the decision, I was really happy as I thought I’d get more time to study. But now I do not even know how to plan my studies as there is no clarity on the exams. Last week, I just took a break because I was tired. Sometimes I am really kicked about studying, at other times, it’s quite demotivating.”Agreed Deepak Ram, a science student at Harvest International School. “All these days there was a rhythm to the preparation. Now there’s a hiccup in the flow. To keep yourself prepared and motivated for an exam about which there is no clarity is tough.”Teens say the lockdown is only making things tougher for them. “We cannot even go out to relax. We now resort to combined study online,” said Bhadra.Schools say students are worried about their future academic plans too. Many of them who have applied to foreign universities are finding the wait taxing. “Students are emotionally drained out. Many schools started class 12 portions in March, some as early as January 2020. It has been 1.5 years and it is dragging on. It’s too risky to hold exams. Children are stuck, some of them have withdrawn. It’s tough to keep them motivated,” said J Bhuvaneswari, principal, Presidency School, Bangalore south.Psychologists and counsellors say they have been getting cases of students reeling under anxiety due to the uncertainty. “Students need to learn by understanding concepts and not rote learn as they tend to forget faster if answers are just memorised. Have a fixed routine till exams. Spend some time studying and focus on learning some new skills. Parents should be careful not to overstress on revisions as students will be put off by it, considering they have been struggling with it for many months now,” said Sulata Shenoy, director, Turning Point, centre for counselling and psychological assessment.",
    "Title": "Indefinite wait for class 12 board exams making students anxious"
  },
  {
    "Date": "Mon, 10 May 2021 11:13:17 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/home/education/news/bnp-recruitment-2021-application-process-to-commence-on-may-12-check-vacancy-salary-here/articleshow/82515594.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82515594.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>",
    "Image": "https://static.toiimg.com/thumb/msid-82515624,width-1070,height-580,imgsize-1172702,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/home/education/news/bnp-recruitment-2021-application-process-to-commence-on-may-12-check-vacancy-salary-here/articleshow/82515594.cms",
    "Text": "Congratulations! You have successfully cast your vote Login to view result\n\nPost No. of vacancies Welfare Officer 1 Supervisor 2 Junior Office Assistant 15 Junior Technician 113\n\nPost No. of vacancies Secretarial Assistant 1 Junior Office Assistant 3\n\nEvent Date Application process begins 12.05.2021 Last date to apply 11.06.2021 Stenography test & typing test July/ August Online exam July/August 2021\n\nNEW DELHI: Bank Note Press, Dewas (M.P) has invited online applications from Indian nationals for the recruitment of various posts of the Dewas unit. Interested candidates can apply for the BNP recruitment 2021 through the official website of BNP — bnpdewas.spmcil.com — from May 12, 2021.The last date to submit online applications for BNP recruitment 2021 is June 11. The last date to make the application fee payment will also end on June 11.The Stenography test and Typing test on computer are likely to be held in July or August 2021.Junior Office AssistantRs.21540-77160Junior TechnicianRs.18780-67390Secretarial AssistantRs.23910-85570Welfare OfficerRs.29740-103000SupervisorRs.27600-95910",
    "Title": "BNP Recruitment 2021: Application process to commence on May 12, check vacancy, salary here"
  },
  {
    "Date": "Mon, 10 May 2021 08:55:29 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/home/education/news/kiss-gets-new-chancellor/articleshow/82507947.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82507947.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a> Satya S Tripathi, a former assistant secretary-general of the United Nations, has taken over as chancellor of Kalinga Institute of Social Sciences (KISS) deemed to be university.",
    "Image": "https://static.toiimg.com/thumb/msid-82513859,width-1070,height-580,imgsize-110107,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/home/education/news/kiss-gets-new-chancellor/articleshow/82507947.cms",
    "Text": "Congratulations! You have successfully cast your vote Login to view result\n\nBHUBANESWAR: Satya S Tripathi, former assistant secretary-general of the United Nations (UN), has taken over as the chancellor of Kalinga Institute of Social Sciences (KISS) Deemed to be a university.Tripathi, a native of the Cuttack district, has 40 years of rich and varied experience, which includes key positions in the UN around the world. He is also the secretary-general of the Global Alliance for a Sustainable Planet.Upendra Tripathy, who has served as the secretary in the Union ministry of new and renewable energy, has joined as the Pro-Chancellor. This Ganjam native had also been the first director-general of the International Solar Alliance, the first treaty-based international organisation headquartered in India.Deepak Kumar Behera, a Sambalpur native, and an anthropologist has taken charge as the vice-chancellor of KISS. He has served as the vice-chancellor of Sambalpur University, Berhampur University, and Rajendra University, Balangir.Pitabasa Sahoo, dean, department of development studies at Rajiv Gandhi National Institute of Youth Development, Tamil Nadu, has joined as the Pro-Vice-Chancellor on deputation. This Keonjhar native has 20 years of research experience in the domain of tribal development, regional studies, rural development, sustainable development, and social sector development.Kanhu Charan Mahali, a native from the Mayurbhanj district and a Tamil Nadu cadre retired IPS officer, has joined as the director-general, KISS, after his retirement as additional director-general.KIIT and KISS founder Achyuta Samanta, KISS Alumni Association, KISS Students’ Association, and KISS Adivasi Parents’ Association have welcomed and congratulated them for joining the institution.",
    "Title": "KISS gets new chancellor, vice-chancellor"
  },
  {
    "Date": "Mon, 10 May 2021 08:49:57 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/home/education/news/sundargarh-angul-dists-to-get-kendriya-vidyalayas/articleshow/82507938.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82507938.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a> The Board of the Mahanadi Coalfields Limited (MCL), a public sector undertaking, has approved the setting up of a Kendriya Vidyalaya (KV) each at Basundhara in Sundargarh district and Talcher Coalfields in Angul.",
    "Image": "https://static.toiimg.com/thumb/msid-82513770,width-1070,height-580,imgsize-1783707,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/home/education/news/sundargarh-angul-dists-to-get-kendriya-vidyalayas/articleshow/82507938.cms",
    "Text": "Congratulations! You have successfully cast your vote Login to view result\n\nBHUBANESWAR: The Board of the Mahanadi Coalfields Limited (MCL), a public sector undertaking, has approved the setting up of a Kendriya Vidyalaya (KV) each at Basundhara in Sundargarh district and Talcher Coalfields in Angul.In a letter to Union petroleum minister Dharmendra Pradhan, state coal and mines minister Pralhad Joshi confirmed this information. Pradhan had requested Joshi in September last year to set up KVs in these areas for the benefit of the children of these districts.In fact, Pradhan had received letters from Sundargarh MP Jual Oram, Dhenkanal MP Mahesh Sahoo, and Bargarh MP Suresh Pujari seeking the establishment of three MCL-sponsored KVs in Sundargarh, Angul, and Jharsuguda districts. The gross enrolment ratio at the primary level of the three districts is below the national average.In his letter to Joshi, the petroleum minister had said MCL’s extensive presence in the mining and industrial belts of Odisha is cherished by the people of the state. “It would be most apt of MCL to extend its management prowess in undertaking welfare activities for people living around its operational areas. I understand that there is an existing provision for the establishment of KVs funded by central public sector enterprises like MCL,” he had written in the letter.On September 20 last year, he had requested Joshi to establish KVs in the three districts for the benefit of the residents of the operational areas of MCL and the wards of the MCL staff. Before this on April 22, Joshi had sent a letter to Pradhan in the same connection.",
    "Title": "Odisha: Sundargarh, Angul dists to get Kendriya Vidyalayas"
  },
  {
    "Date": "Mon, 10 May 2021 09:55:46 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/home/education/news/himanta-biswa-sarma-to-sworn-in-today-cotton-university-celebrates-its-very-own-cm/articleshow/82514535.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82514535.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>",
    "Image": "https://static.toiimg.com/thumb/msid-82514559,width-1070,height-580,imgsize-18125,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/home/education/news/himanta-biswa-sarma-to-sworn-in-today-cotton-university-celebrates-its-very-own-cm/articleshow/82514535.cms",
    "Text": "Congratulations! You have successfully cast your vote Login to view result\n\nGUWAHATI: The Cotton University — erstwhile Cotton College — fraternity was elated after receiving the news of their most popular student union leader from the late 1980s becoming the 15th chief minister of Assam.One of the breeding grounds of future politicians, Cotton College produced six former chief ministers of Assam- Gopinath Bordoloi, Mahendra Mohan Choudhury, Sarat Chandra Singha, Jogendra Nath Hazarika, Hiteswar Saikia, and Bhumidhar Barman- in the post-independence era. Despite the Cotton alumni playing an influential role across the political spectrum of the state all along, a Cottonian could not adorn the chief minister's chair in Assam since 1996. As Himanta Biswa Sarma is set to be sworn in as the new chief minister on Monday, both the alumni and students of the leading higher education institution have pinned high hopes from him, which is far broader than transforming the education scenario of the state.“He (Himanta) had a great zeal to work for students and society. At his initiative, Cotton College was announced as a Centre of Excellence. It was because of his efforts that Cotton College got transformed into a university. With sheer hard work, he came a long way to become a political stalwart of the northeast and the new CM is our very own CM,” said Jagadish Dutta, general secretary of Cotton Alumni Association. He was hopeful that under Himanta’s leadership, Assam will become one of the top-3 states of the country.Himanta drew severe criticism from the Cottonians, who took the lead in intensifying the protests against the Citizenship (Amendment) Act (CAA) when the legislation was passed in December 2019. However, many said they trusted Himanta’s faith in Cotton University, despite differences on a range of political issues. Besides being a frontline leader of the All Assam Students’ Union (Aasu), Himanta was a three-time general secretary of Cotton College Union Society (CCUS) in 1988-89, 1989-90, and 1991-1992.Incumbent general secretary of Cotton University Students’ Union, Rahul Bordoloi, said on personal grounds, they never attacked Himanta. He, however, said on socio-political issues such as CAA, Cottonians will continue to remain firm on the stance. “We feel proud at Himanta Biswa Sarma’s elevation to the chief minister’s post. He is fond of his alma mater and we consider him as our guardian,” said Bordoloi, a border of the Sitanath Brahma Choudhury Hostel of the university, where Himanta spent a significant period of his student life.The general students, who could not come out to the streets to celebrate the occasion, were equally jubilant after the end of the week-long dilemma on the new CM of Assam. \"Dr. Himanta Biswa Sarma, a three-time general secretary of CCUS paved his way from being a popular student leader to 15th chief minister of Assam. How does he address the issue of CAA and also implementation of Clause 6 of the Assam Accord is what we are looking for. As of now, we expect an eligible cabinet under his leadership that plans and works to tackle the pandemic that has affected our state,\" said Rahul Gupta, a postgraduate fourth-semester student of the state university.",
    "Title": "Himanta Biswa Sarma to swear in today; Cotton University celebrates its ‘very own CM’"
  },
  {
    "Date": "Mon, 10 May 2021 01:33:33 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/home/education/news/shut-schools-hit-free-neet-coaching-hard/articleshow/82509285.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82509285.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>",
    "Image": "https://static.toiimg.com/thumb/msid-82513924,width-1070,height-580,imgsize-18025,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/home/education/news/shut-schools-hit-free-neet-coaching-hard/articleshow/82509285.cms",
    "Text": "Congratulations! You have successfully cast your vote Login to view result\n\nTRICHY: While free coaching is underway for government school students preparing for the national eligibility-cum-entrance test (NEET) since November, teachers have been struggling to make students focus after schools shut last month. Now, with lockdown being imposed, things have only got more uncertain for those dreaming of an MBBS seat.The government had started free residential training for interested students a few years ago due to fewer government school students from Tamil Nadu clearing NEET. It was shifted to online mode last year due to the pandemic. A private firm was hired for providing NEET coaching on the E-Box platform and online training began in November last year for those slated to appear for the test this year. Presently, there are 486 students undergoing training, but the number was more than 600 including students from government-aided schools.“Many students from the aided schools didn’t show interest as 10.5% horizontal reservation for students from government schools in MBBS admission is not applicable for them,” said officials at Trichy district chief education office. But keeping the existing students focused on training has been challenging for teachers, especially after the schools were closed last month.While schools reopened for students of class XII by January end of this year, they were being prepared for the board examinations. It was also helping the teachers to give necessary instructions in person. But the closure has come as a setback as students could not be monitored, said a government school teacher. “Since all the 486 students are not showing interest in the training, we have narrowed down the focus to 76 students,” said M Joan of Arc, coordinator for free NEET coaching in Trichy.",
    "Title": "Shut schools hit free NEET coaching hard"
  },
  {
    "Date": "Mon, 10 May 2021 09:23:37 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/home/education/news/online-attendance-dips-in-city-schools/articleshow/82510195.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82510195.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>",
    "Image": "https://static.toiimg.com/thumb/msid-82514227,width-1070,height-580,imgsize-113409,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/home/education/news/online-attendance-dips-in-city-schools/articleshow/82510195.cms",
    "Text": "Congratulations! You have successfully cast your vote Login to view result\n\nKOLKATA: Several schools have decided to advance the summer vacation following a rise in absenteeism as families struggle with Covid-19.Sensing the need for a break now as students and teachers battle Covid, many private schools affiliated to CISCE and CBSE have either brought the summer vacation forward or is contemplating suspending online classes to declare summer holidays. Government schools have already announced summer vacation due to the pandemic situation.School heads said while absenteeism was not an issue last year, it has become an issue now students of various age group are either suffering from Covid themselves or are unable to attend classes because of household chores as other family members are struck by the virus.“Last year, the students led a regimented life at home and were less prone to falling ill. Also, the first wave spared children. But not so in the second wave,” said Sujoy Biswas, principal of the Ram Mohan Mission School.Usually, students fall ill around March or September due to a change of season. During monsoon, too, many fall ill. In the past, dengue has also been a problem, particularly among students from southern and northeastern pockets of the city. But this time, students from across the city are facing Covid crisis.Richard Gasper, principal of St Augustine’s Day School, Ripon Street said students were applying for sick leave citing Covid. “After receiving requests from parents to excuse them from the online sessions, sick leaves were granted,” Gasper said.Krishna Damani, spokesperson of South Point School, too, said many students and teachers were reporting Covid. “We had arranged for substitute teachers to hold classes. We were flexible and allowed students to take leave,” he said. But with parents getting infected and sending kids to a separate place for quarantine, the school decided to give families some respite and bring forward summer break.Heritage School principal Seema Sapru has sent a mail to the parents that highlights the challenges the school is facing with many teachers, students and their families contracting the infection.Though most of the afflicted children are being treated at home, the weakness induced by the virus is so much that students are unable to attend online classes. Doctors too recommend complete rest. “Students must remain hydrated and consume adequate vitamin C and protein,” said a doctor.",
    "Title": "Kolkata: Online attendance dips in city schools"
  },
  {
    "Date": "Mon, 10 May 2021 09:04:57 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/home/education/news/srmjeee-2021-entrance-exam-to-be-held-in-may-and-july/articleshow/82513931.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82513931.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>",
    "Image": "https://static.toiimg.com/thumb/msid-82513913,width-1070,height-580,imgsize-195332,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/home/education/news/srmjeee-2021-entrance-exam-to-be-held-in-may-and-july/articleshow/82513931.cms",
    "Text": "CHENNAI: SRM Institute of Science and Technology (SRMIST) will be conducting SRM Joint Engineering Entrance Exam (SRMJEEE) 2021 online in two phases in May and July. Phase I will be held on May 23 and 24 while phase II will be on July 25 and 26.The exams will through remote proctored online mode (RPOM) and the last day to apply for it is May 15 and July 20 for Phase l and Phase II respectively. Students aspiring to join BTech programmes in SRM need to take this exam. For more details, students can visit www.srmist.edu.in.",
    "Title": "SRMJEEE 2021 entrance exam to be held in May and July"
  },
  {
    "Date": "Mon, 10 May 2021 09:12:53 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/home/education/news/career-in-petroleum-engineering-heres-list-of-courses-jobs/articleshow/82514004.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82514004.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>",
    "Image": "https://static.toiimg.com/thumb/msid-82514023,width-1070,height-580,imgsize-1281405,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/home/education/news/career-in-petroleum-engineering-heres-list-of-courses-jobs/articleshow/82514004.cms",
    "Text": "Congratulations! You have successfully cast your vote Login to view result\n\nDrilling Engineer\n\nProduction Engineer\n\nChief Petroleum Engineer\n\nOffshore Drilling Engineer\n\nReservoir Engineer\n\nPetroleum Engineering\n\nPetrochemical Engineering\n\nApplied Petroleum Engineering\n\nPetroleum Refinery Engineering\n\nPetroleum Reservoir and Production Engineering\n\nM.E./M.Tech in Petroleum Exploration\n\nM.Tech Petroleum Refinery Engineering\n\nM.Tech in Petroleum Refining and Petrochemical Engineering\n\nM.Tech + B.Tech in Petroleum Engineering – 5 Years Duration (Dual Degree)\n\nNEW DELHI: Covid-19 has slowed down everything. From schools to the market all are closed. The economy has taken a nosedive. Despite the gloomy picture around us, there is still a ray of hope in the engineering field.Engineers are getting jobs and are still in demand especially in the field of petroleum engineering. Graduates in Petroleum engineering are called Petroleum Engineers. Petroleum engineers study the production of hydrocarbons such as crude oil or natural gas. Petroleum engineering deals with the study, exploration, extraction, and distribution of oil and natural gas reserves available on the earth.Petroleum Engineering is not only good from the perspectives of job opportunities but it is for those who care for the environment. Petroleum engineers provide the world with energy while safeguarding the environment for future generations.A degree in Petroleum Engineering is required to work as a petroleum engineer however candidates having a degree in mechanical or chemical engineering can also work as a Petroleum Engineer.There is no different way for doing B. Tech in Petroleum Engineering. The process is the same as we do B.E. or B.Tech in other fields of engineering like Computer Science etc. Candidates are required to clear the JEE Main exam and for taking admission in IITs, NITs and other prestigious institutions candidates will be required to clear the JEE Advanced.Similarly, admission to masters is also done through entrance exams. Graduate Aptitude Test in Engineering (GATE) is the most popular test that provides entry to the first-year Master of Technology/Master of engineering courses.",
    "Title": "Career in Petroleum Engineering: Here's a list of courses & jobs"
  },
  {
    "Date": "Mon, 10 May 2021 09:10:30 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/home/education/news/chennai-colleges-plan-to-conduct-online-exams-during-lockdown/articleshow/82513976.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82513976.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>",
    "Image": "https://static.toiimg.com/thumb/msid-82513995,width-1070,height-580,imgsize-11552698,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/home/education/news/chennai-colleges-plan-to-conduct-online-exams-during-lockdown/articleshow/82513976.cms",
    "Text": "Congratulations! You have successfully cast your vote Login to view result\n\nCHENNAI: While some city colleges are planning to go ahead with their online semester exams during the lockdown, state universities like Madras University and Anna University are likely to conduct their exams only after the lockdown is over.Due to the assembly elections in the state, many colleges had scheduled their online exams from May 3. The Tamil Nadu government announced lockdown from May 10 to 24.The directorate of collegiate education on Sunday asked the particulars from colleges including the number exams completed so far and number of days needed to complete the remaining exams to take a call on online exams.Loyola College has completed four exams and three exams are scheduled till May 15. \"Students and faculty members want to complete the remaining online exams as per the schedule. Since the exam is conducted online, students need not come out of their houses to write the exam. The staff members can also invigilate the exams from their houses. So, we would like to continue with the exams,\" said Thomas Amirtham, principal of the college.Students will write the exams in pen and paper mode and scan the answer sheets and send it to colleges online. The 90-minute exams will be monitored online by faculty members.Guru Nanak College asked the faculty members to prepare to conduct and monitor exams from their houses. \"Unless the government says no to conducting online exams, we will continue with our exams as per the schedule,\" said M G Ragunathan, principal of the college. As per the schedule, the exams will be conducted till June 5.However, some colleges like DG Vaishnav College postponed their online semester exams to June. \"We planned to conduct online exams from May 17. But, all students may not have internet connections at their houses. So, we have decided to postpone it,\" said S Santhosh Baboo, principal of DG Vaishnav College.Meanwhile, colleges like Madras Christian College and Women's Christian College have completed their exams.Madras University also planned to start the online semester exams for affiliated colleges from May 17. However, exams were delayed due to setting question papers and non-payment of exam fees by students. \"We will start the online exams only after the lockdown for affiliated college students,\" an official from the university said.Anna University announced a retest for students who could not appear for exams due to technical glitches from May 17 for students studying in its four campuses. \"The university has not taken any decision on the retest so far,\" sources in the university said. For affiliated colleges, the university is yet to schedule exams for BE, BTech students due to the confusion over the delay in deciding the mode of exams. The exams are likely to be scheduled only after the lockdown.",
    "Title": "Chennai colleges plan to conduct online exams during lockdown"
  },
  {
    "Date": "Mon, 10 May 2021 08:57:42 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/home/education/news/colleges-told-not-to-hold-offline-exams-before-june-16/articleshow/82511111.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82511111.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>",
    "Image": "https://static.toiimg.com/thumb/msid-82513842,width-1070,height-580,imgsize-1114634,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/home/education/news/colleges-told-not-to-hold-offline-exams-before-june-16/articleshow/82511111.cms",
    "Text": "Congratulations! You have successfully cast your vote Login to view result\n\nPANAJI: Goa University, in a circular, has said that no offline examinations should be conducted for PG as well as UG programme students in affiliated colleges before June 16, in view of the Covid-19 pandemic.“Students will be given two weeks’ notice before the commencement of the offline examinations. Online examinations in the affiliated general education colleges and colleges under faculty of education shall not be conducted earlier than June 8, 2021,” the circular issued on May 7 stated.The last date for submission of project/dissertation by the final year students shall be June 1, registrar Radhika Nayak has said. “The projects/dissertation shall be submitted by the students in soft copy format. The viva shall be conducted strictly online mode with no physical interaction between student(s), guide and external examiner,” Nayak said.While exams for the first and second year students of the BA, BSc, BCom, BCA, BBA programme, etc, are set to be held online, those for final year students were scheduled to be conducted offline.As the academic schedule earlier declared by Goa University, the second semester for the academic year 2020-21 was to begin on February 2, 2021. General stream colleges were set to have their instructional days upto June 5 and examinations were to be conducted from June 7 to July 17.The new academic year 2021-22 is scheduled to begin from August 10, as of now, as per the delayed academic schedule due to the ongoing pandemic.",
    "Title": "No offline exams for UG, PG courses before June 16: Goa University"
  },
  {
    "Date": "Mon, 10 May 2021 09:00:31 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/home/education/news/maharashtra-ssc-students-may-be-assessed-based-on-online-learning/articleshow/82509388.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82509388.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>With uncertainty looming over the evaluation process for SSC students, the state has now turned to principals and teachers to find out if internal assessment based on online teaching is possible.",
    "Image": "https://static.toiimg.com/thumb/msid-82509387,width-1070,height-580,imgsize-124409,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/home/education/news/maharashtra-ssc-students-may-be-assessed-based-on-online-learning/articleshow/82509388.cms",
    "Text": "Congratulations! You have successfully cast your vote Login to view result\n\nMUMBAI: With uncertainty looming over the evaluation process for SSC students, the state has now turned to principals and teachers to find out if internal assessment based on online teaching is possible.The board exams were cancelled due to the Covid crisis but an alternative assessment format is yet to be finalised. CBSE and ICSE boards have begun evaluation based on internal tests.State board schools were instructed not to take online exams due to connectivity issues in rural areas. While many private institutions have conducted internal tests, aided schools followed the state directives.Principals of aided schools have communicated to the state the challenges of internal assessment-based rating. Students have to be evaluated for 600 marks (best of five subjects). The state now wants principals, teachers and managements to respond through a survey. Over 17 lakh students were to take SSC exams. A CET for Class 11 admission is also being discussed.Principals underlined the need for a sound methodology so that it can be applied the next academic year too. “Last year, very little assessment was done. Some evaluation was possible in January and February, but evaluating them based on two months will be unfair,” said the principal of a school in Bandra.Students have begun scrambling to submit assignments. About 10-15% are out of the city due to the pandemic. “We have been told to get these students to submit assignments and projects in case internal evaluation becomes inevitable,” said a teacher from a Goregaon school. The state has also asked schools to give details of evaluation processes.India Wide Parents Association president and child rights activist, advocate Anubha Sahai, said, “Not all schools have a back-up if the state decides to opt for internal assessment. On the other hand, students are not ready for an offline CET.”",
    "Title": "Maharashtra 10th results 2021: SSC students may be assessed based on online learning"
  }
]