[
  {
    "Date": "Thu, 06 May 2021 09:53:09 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/home/education/news/schools-rely-on-entrance-tests-for-class-11-admissions/articleshow/82417529.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82417529.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>",
    "Image": "https://static.toiimg.com/thumb/msid-82424465,width-1070,height-580,imgsize-1390923,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/home/education/news/schools-rely-on-entrance-tests-for-class-11-admissions/articleshow/82417529.cms",
    "Text": "Congratulations! You have successfully cast your vote Login to view result\n\nHYDERABAD: With the Central Board of Secondary Education (CBSE) and Council for Indian School Certificate Examinations (CISCE) cancelling class 10 exams, many city schools are laying more emphasis on entrance tests and pre-board results for class 11 admissions.While entrance exams have been a common practice in many schools, this year it gets added weightage. “We conducted two rounds of entrance examinations due to Covid-19 this year for class 11 admissions. We have close to 300 class 11 seats for which we had more than 1,500 aspirants who appeared for the entrance exams,” said Lata Shankar, principal, P Obul Reddy Public School, adding that classes for class 11 are set to commence from June first week.While some schools conduct additional rounds of entrance tests, others are giving out provisional admissions either on the basis of objective criterion developed by the CBSE or on the pre-board results. The CBSE has released the evaluation policy and all schools have to form result committee on May 5 and the board would declare class 10 results on June 20.“We did not find it conducive to conduct an entrance test in the prevailing conditions. Hence, we have decided to consider the pre-board performance of students for class 11 admissions,” said Narasimha Reddy, principal, Hyderabad Public School, Ramanthapur.In CICSE schools as well, the admissions for ISC (class 11) has commenced following the council’s go ahead to do so. “In addition, schools should prepare a schedule to begin online classes for class 11 students at the earliest. The syllabus to be followed is the ISC 2023 syllabus,” read the notification from the CICSE.",
    "Title": "With no board exams, schools rely on entrance tests for class 11 admissions"
  },
  {
    "Date": "Thu, 06 May 2021 04:24:00 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/home/education/news/maharashtra-college-admissions-in-20-21-wont-be-affected-by-verdict/articleshow/82418007.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82418007.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>",
    "Image": "https://static.toiimg.com/thumb/msid-82418006,width-1070,height-580,imgsize-189476,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/home/education/news/maharashtra-college-admissions-in-20-21-wont-be-affected-by-verdict/articleshow/82418007.cms",
    "Text": "Congratulations! You have successfully cast your vote Login to view result\n\nMUMBAI: Admissions to almost all courses in the state for 2020-21 will remain unaffected after the Supreme Court decision on Maratha reservation on Wednesday. The apex court stated that admissions of Maratha students under the quota before September 9 will remain secured.Many degree colleges had almost completed their admissions by September first week and the state had completed the first round of junior college (FYJC) admissions. After the SC interim order, admissions across courses were stalled for over two months even as the state appealed to the court. The state, in November, decided to apply the interim order and continue admissions without the Maratha quota for 2020-21 academic year. Students from the Maratha community were then asked to apply under the open quota.Of the 3.1 lakh first-year junior college seats in the Mumbai Metropolitan Region, 17,844 seats were reserved under the quota and 2,923 students had applied. Of these students, 2,309 were allotted a seat in the first merit list that was announced before the Supreme Court interim stay on the quota on September 9. Their admissions remain safe even after Wednesday’s order.A month later, the state allowed Maratha candidates to avail themselves of the benefit of the 10% Economically Weaker Sections (EWS) quota. Despite allowing Maratha candidates to apply as EWS, the quota had a 68% vacancy across the state when admissions concluded. Next year, the decision will basically mean around 40,000 more FYJC seats will be open for students.Medical aspirants, students and their parents from the open category, who were also one of the petitioners’ group, are relieved after the order. Medical students were the worst affected with the additional quota as their seats shrank by 12%, when they only have a few thousand seats available in the state. Dr Aparna Ranadive, one of the petitioners, said that the fight was not only for this batch, but for all students in future.",
    "Title": "Maharashtra college admissions in 2020-21 won’t be affected by Maratha reservation verdict"
  },
  {
    "Date": "Thu, 06 May 2021 09:38:24 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/home/education/news/mp-varsities-to-conduct-open-book-exams-for-ug-pg-courses/articleshow/82424262.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82424262.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>",
    "Image": "https://static.toiimg.com/thumb/msid-82424250,width-1070,height-580,imgsize-1480817,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/home/education/news/mp-varsities-to-conduct-open-book-exams-for-ug-pg-courses/articleshow/82424262.cms",
    "Text": "Congratulations! You have successfully cast your vote Login to view result\n\nBHOPAL: Amid Covid-19 crisis, Madhya Pradesh higher education department declared Open Book exams for UG and PG exams of all classes in June and July. The department issued a circular in this regard on Wednesday.As per the notification, final year exams of UG and PG will be organised in June. Their results will be declared in July. First year and second year of UG alongwith second semester of PG will be organised in July. Results of these exams will be declared in August. Practical exams of these classes will be conducted after Open Book exams are completed, stated the notification.Notably, higher education minister Mohan Yadav had last month announced that Open-Book exams will be held for final year students of UGand PG programmes.\"Amid increasing Covid cases, there will be Open-Book exams for final year students of UG and PG, just like it was during 1st and 2nd-year exams. There won't be any exam in college. We expect to continue with normal routine in July,\" Yadav had said in April.",
    "Title": "Open Book exams for UG, PG courses in Madhya Pradesh"
  },
  {
    "Date": "Thu, 06 May 2021 09:32:04 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/home/education/news/assam-shuts-all-educational-institutes-indefinitely-amid-rising-covid-cases/articleshow/82424198.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82424198.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>",
    "Image": "https://static.toiimg.com/thumb/msid-82424191,width-1070,height-580,imgsize-1799559,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/home/education/news/assam-shuts-all-educational-institutes-indefinitely-amid-rising-covid-cases/articleshow/82424198.cms",
    "Text": "Congratulations! You have successfully cast your vote Login to view result\n\nGUWAHATI: The Assam government on Wednesday declared closure of all educational institutions for an indefinite period, irrespective of the severity of the Covid situation in districts. Despite a continuous spike in new Covid cases, physical classes were going on in some Assam districts, where the cumulative number of positive cases recorded in the last 10 days were below 300.To date, the local administrations were declaring closure of educational institutions, including hostels and coaching institutes, as and when the cumulative number of positive cases touched the 300-mark in the respective districts. Superseding all previous orders, the state education department ordered closure of all kinds of educational institutions up to the university level. But the official works of the educational institutions will be guided by the latest directives issued by the Assam State Disaster Management Authority (ASDMA).“From today, all educational institutions will remain closed till an indefinite period. Whether a district has touched 300 cases or not, every institution will have to be closed in the backdrop of the direction by the state government to close shops, commercial establishments, etc., from 2 pm everyday starting today,” said education minister Himanta Biswa Sarma.An official notification by the state secondary education department on Wednesday stated that the directive will be implemented in both government and private institutions — starting from pre-primary section to university level — from Thursday (May 6) until further orders. It, however, instructed the institutions that an online mode of education should be made available for students.All educational institutions, including the coaching institutes and hostels in Guwahati were closed on Tuesday last week, soon after the daily number of positive cases crossed the 1,000-mark in Kamrup (Metropolitan) district. Apart from the academic institutions in the city, those in 23 other districts were also closed by Wednesday, as these districts crossed 300 positive cases in the last 10 days. Barring some districts, mostly comprising rural areas, the educational institutions were already closed in the rest of the districts.Assam Class X and XII state board exams were postponed on Tuesday, until further orders. The exams were scheduled from May 11, however, the boards were in a dilemma on conducting the exams due to closure of the institutions in the districts.“The virus doesn’t understand age group. In Assam, the elementary students were at home but in higher classes, students were coming out of homes in many districts for classes, risking their lives. It was illogical when the government was appealing to people to stay at home. We are happy that the decision has been taken, though late,” Gobinda Kalita, general secretary of the Asom Madhyamik Sikshak Aru Karmachari Santha, said.",
    "Title": "Assam shuts all educational institutes indefinitely amid rising Covid cases"
  },
  {
    "Date": "Thu, 06 May 2021 08:50:06 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/home/education/news/creative-courses-after-12th/articleshow/82423752.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82423752.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>As you might be aware, it is not an easy feat to do what you love, especially in career life. However, pursuing a course that you are passionate about can certainly pave the way to your dream career.",
    "Image": "https://static.toiimg.com/thumb/msid-82423757,width-1070,height-580,imgsize-1237237,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/home/education/news/creative-courses-after-12th/articleshow/82423752.cms",
    "Text": "Congratulations! You have successfully cast your vote Login to view result\n\nDo you think big and want to express it creatively? What restricts you from showing your creativity? If the answer is career, then read on.As you might be aware, it is not an easy feat to do what you love, especially in career life. However, pursuing a course that you are passionate about can certainly pave the way to your dream career. Finding a course that enhances your creativity not only helps you to earn income but also gives you true satisfaction.Here are some creative courses that you can pursue after class 12.First and foremost, the stream of your class 12 does not matter to join for photography courses. These days, various institutes and universities offer photography courses. This course covers the technical aspects of photography and camera use from the foundations up to post-production. If interested, you can consider an undergraduate programme such as photojournalism to widen the career opportunities. You can also explore a career in the advertising or fashion industry, and media.Designing is a vast area that offers numerous career opportunities in streams such as fashion designing, interior designing, footwear designing, apparel designing, graphic designing, web designing, etc. Students who complete class 12 can pursue designing courses. However, to pursue some courses, students should have studied the Science stream. Diploma courses are also available for students who want to pursue designing as their career.'Fine Arts' is the learning and making of visual works of art in the form of dancing, paintings, photography, film, architecture, etc. There are numerous certificate, diploma, and degree level courses in fine arts courses that are being offered by various Institutions. Students who pass in class 12 can join for Bachelor of Arts (BA) in Fine Arts. This course is more apt for students who are interested in sketching, drawing, and creativity.The animation field is one of the most sought-after creative courses as it offers lucrative career opportunities. This course is a blend of art and technology. Candidates who complete class 12 can apply for animation courses such as Diploma in Animation-3D, BA (Hons) Animation, BFA (Animation), BA in Animation & Digital Arts, etc.Besides these courses, students can also consider courses such as Culinary Arts, Theatre or Performing Arts, Architecture, Filmmaking, etc.",
    "Title": "Creative courses after 12th"
  },
  {
    "Date": "Thu, 06 May 2021 10:06:51 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/home/education/news/rte-beneficiaries-worried-as-admission-halts-for-now/articleshow/82416347.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82416347.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>",
    "Image": "https://static.toiimg.com/thumb/msid-82424652,width-1070,height-580,imgsize-1150703,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/home/education/news/rte-beneficiaries-worried-as-admission-halts-for-now/articleshow/82416347.cms",
    "Text": "Congratulations! You have successfully cast your vote Login to view result\n\nPUNE: The admissions to 25% reservation quota under Right to Education (RTE) Act that halted as a result of the lockdown. after the lottery was drawn with school allotments to beneficiaries but with confirmation pending is making parents anxious.The confirmation will take place once the beneficiary parents reach the allotted school with the documents and verify them followed by the allotment.Sunil Raut, parent of a student who got admission for Std I, said, “Schools are shut so we are unsure of what to do. Our calls are unanswered.”The RTE admissions cell in Maharashtra has decided to begin the process as soon as the lockdown is lifted. In-charge Dinkar Temkar, said, “We have instructed all schools to hold the admission process in the wake of the restrictions. Parents tend to visit schools so we have told the school managements to halt the processing of admissions for now. We will issue fresh instructions regarding the admissions after a nod from the state government.”",
    "Title": "RTE beneficiaries worried as admission halts for now"
  },
  {
    "Date": "Thu, 06 May 2021 09:41:19 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/home/education/news/pil-wants-class-x-board-examinations-cancelled/articleshow/82416210.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82416210.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>",
    "Image": "https://static.toiimg.com/thumb/msid-82424314,width-1070,height-580,imgsize-162299,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/home/education/news/pil-wants-class-x-board-examinations-cancelled/articleshow/82416210.cms",
    "Text": "Congratulations! You have successfully cast your vote Login to view result\n\nAHMEDABAD: A PIL was filed in the Gujarat high court on Wednesday seeking directions to the state government and the Gujarat Secondary and Higher Secondary Education Board (GSHSEB) to cancel the Class X board exams to avoid risking the lives of students on account of the surge in Covid-19 cases.All-Gujarat Parents Association’s Naresh Shah filed the PIL taking exception to the board’s decision of April 16 that Class X exams would be postponed and could be scheduled for between May 10 and May 25. He demanded that the exams be cancelled completely and the results should be declared on the basis of internal assessment and promotions be given.The petitioner also sought an immediate stay on the board’s decision to postpone exams to the second and third week of May and submitted that unless this is done, grave and irreparable loss would be caused to the public at large. He submitted that students have a right to life, which is endangered blatantly by the decision to not cancel the exams. Students have a right to write their exams in a better atmosphere, without danger.The petitioner cited the examples of CBSE and ICSE, which have announced their decisions cancelling the examinations for Class X students on May 1 and April 19, respectively. He submitted that any further delay by the state board in taking a decision on cancelling or postponing the board exams and declaration of results would adversely affect the future of students, as they would not be able to apply for higher education in the absence of results.The petitioner also submitted that seven states — Delhi, Tamil Nadu, Punjab, Haryana, Telangana, Uttarakhand, and Maharashtra and Jammu & Kashmir — have already cancelled their board exams. These states have adopted a system of declaring results on the basis of internal assessment. Gujarat should also not have postponed the exams but cancelled them.",
    "Title": "GSHSEB 10th board exam 2021: PIL wants Gujarat Class 10 board exams cancelled"
  },
  {
    "Date": "Thu, 06 May 2021 09:44:28 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/home/education/news/college-asks-students-to-fill-up-exam-forms-in-campus/articleshow/82417348.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82417348.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>",
    "Image": "https://static.toiimg.com/thumb/msid-82424366,width-1070,height-580,imgsize-189476,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/home/education/news/college-asks-students-to-fill-up-exam-forms-in-campus/articleshow/82417348.cms",
    "Text": "Congratulations! You have successfully cast your vote Login to view result\n\nNAGPUR: Even as Maharashtra government has extended lockdown-like restrictions till May 15, some Nagpur University colleges are calling students to campus to fill up exam forms, pay fees and complete other works. This is happening despite NU authorities clearly telling colleges to strictly avoid inviting students to campus, to protect them from getting infected by the Covid-19 virus.A popular girls’ college in West Nagpur issued a circular for students from BA, BCom, BSc and postgraduate courses, asking them to collect and fill up exam forms in the college. A copy of the circular sent by the students to TOI clearly states that those in fourth and sixth semesters need to fill up forms and also bring their earlier marksheets.After TOI sent a copy of the circular to vice chancellor Subhash Chaudhari and Board of Examinations and Evluation (BOEE) director Prafulla Sable, the worried students and their parents finally got relief.“When I called the principal, it came to fore that the college registrar had issued that circular. He cited the reason that hardcopy of previous semester marksheet has to be collected and attached to the exam forms. But when I told them to avoid calling students to college campuse in view of spike in cases, they withdrew the circular,” Chaudhari told TOI.TOI had on May 1 highlighted how some NU colleges were asking students to appear for offline exams, even as government had directed all varsities to conduct online exams only.Soon after VC’s censure, the college principal issued a notice to all students on WhatsApp, asking them to fill up exam forms in online format only and even make the payment through apps or net banking. It was also clarified that they don’t need to submit marksheets of previous exams.“Due to the ongoing pandemic situation, all senior college, undergraduate and postgraduate students are informed not to visit the college in person for submission of exam forms for Summer-2021. Online payment for exam should be paid on or before May 15. Also note that exam forms of only those students who have done online payment will be filled up and forwarded by college office to the university,” the principal’s message mentioned.The VC added that NU had already sent instructions to all colleges not to invite students to campuses in view of pandemic and also due to restrictions in force. “Their management didn’t read the instructions carefully. They should understand the gravity of the situation. Even during the recent meeting with the principal’s forum, we had issued similar instructions not to invite students to colleges for any purpose,” Chaudhari said.",
    "Title": "Nagpur colleges ask students to fill up exam forms in campus"
  }
]