[
  {
    "Date": "Mon, 10 May 2021 08:43:41 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/entertainment/hindi/web-stories/anniversary-special-neha-dhupia-and-angad-bedis-most-adorable-moments/photostory/82513489.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82513489.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>Anniversary Special! Neha Dhupia and Angad Bedi's most adorable moments",
    "Image": "https://static.toiimg.com/thumb/msid-82513504,width-900,height-1200,imgsize-281228,resizemode-6.cms",
    "Link": "https://timesofindia.indiatimes.com/entertainment/hindi/web-stories/anniversary-special-neha-dhupia-and-angad-bedis-most-adorable-moments/photostory/82513489.cms",
    "Text": "Painting the town red\n\nThe couple is all smiles for the camera in their stylish ethnic wear.",
    "Title": "Neha-Angad Bedi's most adorable moments"
  },
  {
    "Date": "Mon, 10 May 2021 05:00:07 +0000",
    "Description": "An ESPN documentary looks at life inside the W.N.B.A. bubble. And a mini-series about L.G.B.T.Q. rights in America debuts on FX.",
    "Image": "https://static01.nyt.com/images/2021/05/10/arts/10tvcol-144/10tvcol-144-facebookJumbo.jpg",
    "Link": "https://www.nytimes.com/2021/05/10/arts/television/whats-on-tv-this-week-144-pride.html",
    "Text": "Between network, cable and streaming, the modern television landscape is a vast one. Here are some of the shows, specials and movies coming to TV this week, May 10-16. Details and times are subject to change.\n\nMonday\n\nPOV: THROUGH THE NIGHT (2020) 10 p.m. on PBS (check local listings). In this documentary, the director Loira Limbal captures life at Dee’s Tots day care center in New Rochelle, N.Y. To do so involved filming around the clock: The center operates 24 hours a day, seven days a week, under the watch of a couple, Deloris and Patrick Hogan, who runs the business out of their home. Limbal shows both the warmth and the extreme labor required to keep the business running. She also follows some of the parent clients, whose own demanding lives — working multiple jobs, taking on night shifts — led them to the center in the first place. The documentary “bears witness to the struggles of these working people, to their tenderness and mercy,” Teo Bugbee wrote in her review for The New York Times. Limbal, Bugbee added, “keeps her gaze steady, and her vérité rigor becomes an act of solidarity.”\n\nLIFETIME PRESENTS VARIETY’S POWER OF WOMEN THE COMEDIANS 8 p.m. on Lifetime. The performers honored in Variety magazine’s “Power of Women” issue this year are Mindy Kaling, Maya Rudolph, Julia Louis-Dreyfus, Sofía Vergara, Michaela Coel and Kate McKinnon. This companion special is built around conversations with the honorees. Interviewers will include Aidy Bryant, Bowen Yang and Natasha Lyonne. Tina Fey will also lead a tribute to Gilda Radner.",
    "Title": "What’s on TV This Week: ‘144’ and ‘Pride’"
  },
  {
    "Date": "Mon, 10 May 2021 00:38:16 +0530",
    "Description": "Ahead of the release of Discovery+ docu-miniseries ‘The Queen of Meth’, Lori Arnold talks about lessons learned from addiction and introducing dangerous drugs to a quiet part of the American Midwest. Her brother, actor Tom Arnold, also reflects on the project",
    "Image": "https://th.thgim.com/entertainment/au4bbh/article34512321.ece/ALTERNATES/FREE_960/IDQueenofMeth20200123",
    "Link": "https://www.thehindu.com/entertainment/lori-tom-arnold-interview-dicovery-docuseries-the-queen-of-meth-america-queenpin/article34512323.ece",
    "Text": "Ahead of the release of Discovery+ docu-miniseries ‘The Queen of Meth’, Lori Arnold talks about lessons learned from addiction and introducing dangerous drugs to a quiet part of the American Midwest. Her brother, actor Tom Arnold, also reflects on the project\n\n“You know, I was never scared,” starts Lori Arnold, ‘If anything, I felt empowered, respected, feared, and you feed into that kind of stuff. I was always a bad*ss, I like being a bad*ss. I liked running sh*t. I wanted people to look up to me, be scared of me. Selling came easy to me – I was the brains, and Floyd [my partner] was the muscle. But I would say that I’m more addicted to the power. That fed my ego. I want people to look up to me, respect me.”\n\nAlso Read | Get ‘First Day First Show’, our weekly newsletter from the world of cinema, in your inbox. You can subscribe for free here\n\nIf you do not know Lori Arnold, you may have gotten a little sense of ‘is this woman a drug dealer?’ Yes, Lori indeed was – in fact, she is known as ‘the original Walter White.’ Her journey from a young teenager being addicted to methamphetamines to her Midwest-wide drug empire as a grown woman is documented in a Discovery+ series aptly titled The Queen of Meth.\n\nMetroPlus got talking with Lori and her more well-known brother Tom Arnold (of Roseanne fame), about their return to Ottumwa, as they recall Lori’s arc through the years. Was it hard to return to these ‘old stomping grounds’?\n\n“Ottumwa is my hometown and I love it. It’s a quintessential middle American town. Not many changes there, which makes it special and comforting, but for someone like me with a past and triggers with addiction, it can make it somewhat difficult,” admits Lori.\n\nThe true story\n\nIf you have run a methamphetamine empire in a quiet state, chances are you will be approached by dozens of filmmakers who want to tell your story. This was certainly the case with Lori over the years, but she turned down opportunities for years until it felt right.\n\nTom Arnold | Photo Credit: Discovery+\n\nTom commends series director Julian P Hobbs and says he connected with the filmmaker on many levels but especially in terms of family. “The thing that sold me the most was when his daughter came over to my house to go through some of my pictures, I saw their relationship and that told me, ‘this guy gets family, and I think he knows where we were coming from,’ but it’s always a risk and I felt like it was worth taking it with him. He knows how to produce shows like this and show humanity, but also deal with crime and truth.”\n\nLori states that whether or not America or the world liked her story was not a factor to her; the most prevalent element was the truth. She elaborates, “I was very adamant about ‘you better tell the truth or don’t tell it at all.’ I want it told the way it is. Julian was extremely professional about it. His whole team made me feel comfortable. I wasn’t like Tom with hundreds of movies, I had never been on TV except in handcuffs and shackles, so it was different for me.”\n\nTom, 62, adds that Lori’s story has been in existence but in a private and unpublished book form. “I told her, ‘you need to just write a book about yourself.’ Anytime you write, there’s something very spiritual about that. And I thought, with my sister being in prison for a long time, she could just get up and write something about her life. So she wrote a very thick book not to be published or anything and they do use some of that in this documentary series.”\n\nThe global fascination with the true crime genre skyrocketed during the pandemic and Tom comments, “People that like to watch crime shows, and they also like to watch ‘reality-family.’ The Queen of Meth has both and there’s redemption too. And hopefully entertaining, and real.”\n\nAs parents...\n\nNaturally, Tom was indeed nervous about how he and his sister would appear but is pleased with how the project turned out. He still feels protective of Lori, who is a year-and-a- half younger. How did working on The Queen of Meth further shape their relationship? “Through her childhood, drug business and marriages, she was very tough, but thinking back, I do remember her being vulnerable as a kid. I was afraid that, given all she’s been through, that you couldn’t penetrate her shell. And the director wanted me to do that, but I said, ‘I’m not here to do that.’ But what ended up happening was because of her son who grew up with this (when he was 10, his parents went away to prison and we got to raise him), her son got to confront his mother in ways that just would not have happened.”\n\nAn old photograph of Lori Arnold and son Josh Stockdall in 1981. | Photo Credit: Lori Arnold\n\nLori says the hardest part was anything to do with her son but she is proud of the man he is now. “He was only 10 at the time Floyd and I were arrested, and he lost his home and parents all at once.”\n\nTom, a father himself, says, “There are a lot of ghosts in Ottumwa, but I was happy with the way it turned out that I’m a father with an eight-year-old son and a five-year-old daughter. And I don’t want them to have anything close to the life that Lori and I had. Just seeing and remembering how things were and being honest about it, it only helped me to be sober, healthy and a better parent. And that’s what life’s all about.”\n\nLooking forward, what does Lori hope for herself? She concludes, “The ‘Queen of Meth’ title is not something to be proud of, but it’s something I’ll never get away from. I got out of prison, but I'm doing pretty much a life sentence for selling drugs.”\n\nThe Queen of Meth drops on Discovery+ on May 7",
    "Title": "Meet Lori Arnold, America’s queenpin and ‘the original Walter White’"
  },
  {
    "Date": "Mon, 10 May 2021 01:11:17 GMT",
    "Description": "The former Gogglebox star told BBC Breakfast about \"horrific trolling\" that led to her reaching out for help.",
    "Image": "https://ichef.bbci.co.uk/images/ic/400xn/p09gz5wt.jpg",
    "Link": "https://www.bbc.co.uk/news/uk-57030285",
    "Text": "Former Gogglebox star and I'm A Celebrity winner Scarlett Moffatt has revealed how \"horrific\" trolling led to her reaching out to the Samaritans.\n\nShe told BBC Breakfast how she felt exhausted by negativity, but that now she tries to communicate with online bullies.\n\nIf you’ve been affected by any issues in this story, you can find support at BBC Action Line.",
    "Title": "Former Gogglebox star Scarlett Moffatt on the 'hope' offered by Samaritans"
  },
  {
    "Date": "Mon, 10 May 2021 09:15:14 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/jackie-shroff-reveals-what-his-son-tigers-girlfriend-disha-calls-him-exclusive/articleshow/82514017.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82514017.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>While 'Radhe' is just round the corner, Jackie Shroff was out talking to journalists (not in person, the COVID wave is scaringly showing no signs of abetting). ETimes had a chat with the Bhidu star and slipped in the interesting question that what does Tiger Shroff's special friend Disha Patani call him. The fact that Disha is the upcoming film's leading lady, there must have been conversations between the two of them on the film's sets.",
    "Image": "https://static.toiimg.com/thumb/msid-82514044,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-143067/82514044.jpg",
    "Link": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/jackie-shroff-reveals-what-his-son-tigers-girlfriend-disha-calls-him-exclusive/articleshow/82514017.cms",
    "Text": "While 'Radhe' is just round the corner, Jackie Shroff was out talking to journalists (not in person, the COVID wave is scaringly showing no signs of abetting). ETimes had a chat with the Bhidu star and slipped in the interesting question that what does Tiger Shroff 's special friend Disha Patani call him. The fact that Disha is the upcoming film's leading lady, there must have been conversations between the two of them on the film's sets. 'Radhe' stars Salman Khan, Disha, Jackie Shroff and Randeep Hooda, the film is up for digital and theatrical release on May 13.For those who've come in late, here's Jackie's unmissable interview:Does she call him 'Sir'? Or, does she call him 'Jackie uncle'? Or is it anything else? Jackie smiled and said that more often than not, Disha does not address him in any particular way but the occasions that she has, it has always been 'Sir'.Jackie explained that he finds the word 'uncle' being indiscriminately used as a bit weird. \"It means that I am your father's brother! Lekin parivaar toh dono ke alag hain na? So how does the word uncle justify?\"Well, so that's that!",
    "Title": "Jackie reveals what Disha Patani calls him"
  },
  {
    "Date": "Mon, 10 May 2021 09:45:26 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/heres-what-saba-ali-khan-commented-on-kareena-kapoor-khans-mothers-day-post/articleshow/82514455.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82514455.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>On the occasion of Mother’s Day Kareena Kapoor Khan had shared a candid picture with her mother-in-law, paying a tribute to her strength. Commenting on her post, Saif Ali Khan’s sister Saba Ali Khan wrote, “Rock stars ...both professionally n personally. Mahshallah.” Saba also revealed that she had clicked this picture and praised Bebo for her caption.",
    "Image": "https://static.toiimg.com/thumb/msid-82514455,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-96654/82514455.jpg",
    "Link": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/heres-what-saba-ali-khan-commented-on-kareena-kapoor-khans-mothers-day-post/articleshow/82514455.cms",
    "Text": "Read Also\n\nOn the occasion of Mother’s Day Kareena Kapoor Khan had shared a candid picture with her mother-in-law, paying a tribute to her strength. Commenting on her post, Saif Ali Khan ’s sister Saba Ali Khan wrote, “Rock stars ...both professionally n personally. Mahshallah.” Saba also revealed that she had clicked this picture and praised Bebo for her caption.Saba Ali Khan has recently become an active user on Instagram, where she shared doting memories from her family album. And while Saba treats her users to happy moments, her sister Soha Ali Khan joined forces with her mother Sharmila Tagore for a charitable cause. The decided to auction clothes from their personal wardrobe and proceeds from the same will be donated towards animal welfare and social causes.Sharing a recent parenting episode involving her daughter Inaaya and mother Sharmila Tagore, Soha had told BT, “Inaaya, Amma and I were in Pataudi recently, when I got into an argument with my daughter. Inaaya was not interested in listening to me. My mother was right when she said that you can’t win against a three-year-old. You need to empathise with the child at that moment. Later, you can explain these things to her when she is in the space to listen. She was right about that and many such things. I love the fact that my mother is never overbearing when it comes to giving advice.”",
    "Title": "Saba comments on Bebo's Mother’s Day post"
  },
  {
    "Date": "Mon, 10 May 2021 09:45:40 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/salman-khan-shares-sweet-pictures-of-salma-khan-and-helen-on-the-occasion-of-mothers-day-sangeeta-bijlani-is-all-hearts/articleshow/82514420.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82514420.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>Superstar Salman Khan, who is gearing up for his upcoming Eid release, ‘Radhe: Your Most Wanted Bhai’, shared adorable pictures of his mothers, Salma Khan and Helen. He took to social media on Sunday and posted their pictures on the occasion of Mother’s Day.",
    "Image": "https://static.toiimg.com/thumb/msid-82514433,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-411780/82514433.jpg",
    "Link": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/salman-khan-shares-sweet-pictures-of-salma-khan-and-helen-on-the-occasion-of-mothers-day-sangeeta-bijlani-is-all-hearts/articleshow/82514420.cms",
    "Text": "Read Also\n\nSuperstar Salman Khan , who is gearing up for his upcoming Eid release, ‘ Radhe : Your Most Wanted Bhai’, shared adorable pictures of his mothers, Salma Khan and Helen . He took to social media on Sunday and posted their pictures on the occasion of Mother’s Day.Salman shared throwback pictures of his moms and it is all things love. Along with the pictures, the actor wrote, “Happy Mother’s Day . . #staysafe” Have a look:Soon after he posted the pictures, Sangeeta Bijlani was quick to drop comments on it. She posted heart emoji on Helen’s picture while she wrote, “Mom 😍😍😍❤️❤️❤️” on Salma’s picture.Meanwhile, Randeep Hooda , who will be seen with Salman in ‘Radhe’, recently spoke about him and revealed that he has never felt overshadowed by anyone on screen. Randeep told IANS, “You have to do your work in the film, to the best of your ability. Being overshadowed and such things have never been part of my vocabulary or thought process. I am doing my part and someone else is doing their part. We are not doing the same part that we can overshadow each other. I have never given in to these things. People say 'kha gaya' and all (but I don't).”Her further added, “Yes, it is a Salman Khan film and his films are about that. I have worked with him twice before and I have got reception for those roles. I stood out in those roles and there has been no insecurity. A lot of people have worked hard on the film.”‘Radhe’ also stars Jackie Shroff and Disha Patani in key roles. The film is set to release on 13 May.",
    "Title": "Salman posts pictures of Salma Khan-Helen"
  },
  {
    "Date": "Mon, 10 May 2021 11:01:30 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/priceless-pictures-of-waheeda-rehman-asha-parekh-and-helen-holidaying-in-andaman-go-viral/articleshow/82515417.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82515417.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>Tanujj Garg has shared unseen pictures of yesteryear actresses Waheeda Rehman, Asha Parekh and Helen on a holiday. Enjoying the sunshine and breeze during a boat ride, the popular stars are snapped living it up during their holiday in Andamans. Dressed in breezy pants and tunics, Waheeda Rehman, Asha Parekh and Helen were cheerfully smiled for the pictures. In another picture Waheeda Rehman was also snapped enthusiastically trying to drive the boat.",
    "Image": "https://static.toiimg.com/thumb/msid-82515423,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-177018/82515423.jpg",
    "Link": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/priceless-pictures-of-waheeda-rehman-asha-parekh-and-helen-holidaying-in-andaman-go-viral/articleshow/82515417.cms",
    "Text": "Tanujj Garg has shared unseen pictures of yesteryear actresses Waheeda Rehman, Asha Parekh and Helen while on a holiday. Enjoying the sunshine and breeze during a boat ride, the popular stars are snapped living it up during their vacation in Andamans . Dressed in breezy pants and tunics, Waheeda Rehman, Asha Parekh and Helen cheerfully smiled for the pictures. In another picture Waheeda Rehman was also snapped enthusiastically trying to drive the boat.“If \" Dil Chahta Hai \" were to get remade with three grand dames, it would be with these #legends - Waheeda Rehman, Asha Parekh and Helen. Enjoying their retirement years, holidaying in the Andamans. Filled with joie de vivre. Put a massive smile on my face. Eventually what we're left with when we're old is youth of the ilk, memories, love and a few good mates,” the filmmaker had captioned the priceless pictures.Previously, Shaina NC had shared a picture with the trio from a beach in Andaman. She had captioned the click, “With the #wonderwomen of the film industry, timeless grace #helen aunty , #waheedarehman #ashaparekh in #andamanislands.”",
    "Title": "Waheeda Rehman, Helen holiday in Andaman"
  },
  {
    "Date": "Mon, 10 May 2021 08:36:37 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/kangana-ranaut-instagram-has-deleted-my-post-where-i-threatened-to-demolish-covid/articleshow/82513596.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82513596.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>Bollywood actress Kangana Ranaut on Sunday alleged that Instagram has deleted her post where she speaks about demolishing Covid.",
    "Image": "https://static.toiimg.com/thumb/msid-82513737,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-305073/82513737.jpg",
    "Link": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/kangana-ranaut-instagram-has-deleted-my-post-where-i-threatened-to-demolish-covid/articleshow/82513596.cms",
    "Text": "Read Also\n\nBollywood actress Kangana Ranaut on Sunday alleged that Instagram has deleted her post where she speaks about demolishing Covid Kangana took a sarcastic jibe at Instagram saying there is a Covid fan club.\"Instagram has deleted my post where I threatened to demolish Covid because some were hurt. Matlab terrorists and communists sympathisers suna tha Twitter pe lekin Covid fan club awesome. It's been two days here on Insta but don't think will last here more than a week,\" the actress wrote on her Instagram story on Sunday.Kangana on Saturday shared the news that she has tested positive for Covid-19 and has quarantined herself.\"I was feeling tired and weak with slight burning sensation in my eyes for past few days, was hoping to go to Himachal so got my test done yesterday and today the result came I am covid positive,\" Kangana wrote in an Instagram post along with a photograph of herself.\"I have quarantined myself, I had no idea this virus is having a party in my body, now that I know I will demolish it, people please don't give anything any power over you, if you are scared it will scare you more, come let's destroy this Covid-19 it is nothing but a small time flu which got too much press and now psyching few people. Har Har Mahadev,\" she further wrote in the now deleted post.Recently, Kangana's Twitter account was suspended, after she posted a series of tweets perceived to be controversial.",
    "Title": "Kangana Ranaut: Instagram deleted my post"
  },
  {
    "Date": "Mon, 10 May 2021 08:59:54 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/sunny-leone-gives-a-glimpse-of-mothers-day-celebration-with-nisha-noah-and-asher-in-kerala/articleshow/82513861.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82513861.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>Sunny Leone recently took to her social media handle to give us a glimpse of the Mother's Day celebration with hubby Daniel Weber and kids- Nisha, Noah and Asher. The actress revealed that they made her day amazing despite a complete lockdown in Kerala.",
    "Image": "https://static.toiimg.com/thumb/msid-82513861,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-572373/82513861.jpg",
    "Link": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/sunny-leone-gives-a-glimpse-of-mothers-day-celebration-with-nisha-noah-and-asher-in-kerala/articleshow/82513861.cms",
    "Text": "Very few actors start facing the camera since the age of two and are blessed enough to work with stalwarts right from their debut film. But Jugal Hansraj struck gold. In a career spanning over 35 years, the actor moved the audience to tears with his act as a child actor in 'Masoom' and then, years later, terrorised them in 'Kahaani 2'. In an exclusive interview, he spills the beans on how he could have had a better career, what's keeping him busy these days, and more.",
    "Title": "Sunny celebrates Mother's Day in Kerala"
  },
  {
    "Date": "Mon, 10 May 2021 09:00:00 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/alankrita-sahai-i-have-never-succumbed-to-the-bullies-nor-tried-to-impress-people-for-work/articleshow/82500955.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82500955.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>In an exclusive interview with ETimes, the gorgeous diva Alankrita Sahai opened up about her initial days in showbiz, being an outsider in the industry, and people who have inspired her.",
    "Image": "https://static.toiimg.com/thumb/msid-82500955,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-495456/82500955.jpg",
    "Link": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/alankrita-sahai-i-have-never-succumbed-to-the-bullies-nor-tried-to-impress-people-for-work/articleshow/82500955.cms",
    "Text": "After winning the title of Miss India Earth in 2014, Alankrita Sahai decided to make a career in Bollywood and has come a long way since. She is bold, beautiful, talented, and determined to make it on her own. In an exclusive interview with ETimes, the gorgeous diva opened up about her initial days in showbiz, being an outsider in the industry , and people who have inspired her. Excerpts…I look back at my journey with gratitude and hope that I keep progressing and becoming a better version of myself, both professionally and personally. I believe it was definitely a different path than what people had expected of me, but I found myself amidst the chaos in Mumbai and it was life-changing. I enjoyed both the successes and the failures.It wasn’t easy at all. People perceive women in this industry in a very different light. I don’t understand why and who created these misconceptions. People had various things to say and do to stop me from growing but my family and my friends stood by me. It is a general perception that models are dumb or can’t act or perform, but we are much more than just models and actors, we are humans.I was trained in dancing and acting since I was a kid, thanks to my school and university. However, to explore the camera was a different ball game altogether. So, I enjoyed learning the tricks of the trade. After pageants, people expect a lot from you; they think you will become an overnight success, which doesn’t happen. You have got to work on it. Priyanka Chopra has inspired me. I don’t even need to say how and why she is the epitome of strength, perseverance, and ambition. Even Dia Mirza is great for all the work she does to save our planet and how simple and beautiful she’s been throughout her journey. It is just so easy to relate with her.A lot has been said about the industry and while some things are true, others are false. But I have had a blast here. The good came with the bad. There has been favouritism but no one dared to cross the line because I make sure I look really arrogant and unapologetic for being me; I have never succumbed to the bullies nor tried to impress people for work.I am very honest with my work because I like to sleep peacefully at night knowing that I did this on my own, for myself and by myself. I have had a wonderful team always backing me and protecting me. So, I have been fortunate. Bollywood gave me an identity of my own, financial abundance, and independence and I am still trying to make it big here. The journey never ends.",
    "Title": "Alankrita: Have never succumbed to bullies"
  },
  {
    "Date": "Mon, 10 May 2021 08:44:05 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/nick-jonas-lucky-to-have-the-best-mother-and-mother-in-law-in-the-world/articleshow/82513685.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82513685.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>Nick Jonas penned a loving note on the occasion of Mother’s Day, paying an ode to his mother Denise Jonas and Priyanka Chopra’s mother, Madhu Chopra. Sharing candid clicks with the two, Nick wrote, “Happy mother’s day to all the moms out there. I am so lucky to have the best mother and mother in law in the world. Love you @mamadjonas and @madhumalati #happymothersday.”",
    "Image": "https://static.toiimg.com/thumb/msid-82513685,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-142558/82513685.jpg",
    "Link": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/nick-jonas-lucky-to-have-the-best-mother-and-mother-in-law-in-the-world/articleshow/82513685.cms",
    "Text": "Very few actors start facing the camera since the age of two and are blessed enough to work with stalwarts right from their debut film. But Jugal Hansraj struck gold. In a career spanning over 35 years, the actor moved the audience to tears with his act as a child actor in 'Masoom' and then, years later, terrorised them in 'Kahaani 2'. In an exclusive interview, he spills the beans on how he could have had a better career, what's keeping him busy these days, and more.",
    "Title": "Nick: Lucky to have the best mother"
  },
  {
    "Date": "Mon, 10 May 2021 10:28:11 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/sonu-sood-feels-india-was-never-prepared-for-a-pandemic-says-we-have-to-admit-we-went-wrong/articleshow/82514998.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82514998.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>Sonu Sood has been working diligently to help people in need ever since the first wave of COVID-19 hit India last year. Now, the actor says that he is collaborating with companies in China, France and Taiwan to set up oxygen plants in India.",
    "Image": "https://static.toiimg.com/thumb/msid-82514998,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-696118/82514998.jpg",
    "Link": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/sonu-sood-feels-india-was-never-prepared-for-a-pandemic-says-we-have-to-admit-we-went-wrong/articleshow/82514998.cms",
    "Text": "Birthday boy Vijay Deverakonda stormed the silver screen as the endearing Arjun Reddy in 2017. Refusing to slow down, the actor delivered entertaining performances with ‘Mahanati’ (2018) and ‘Geetha Govindam’ (2018). He is now making inroads into Bollywood and is enjoying his stint in front of the camera. In an exclusive chat with ETimes, Vijay spoke about not looking back and his social media presence.",
    "Title": "Sonu feels India not prepared for pandemic"
  },
  {
    "Date": "Mon, 10 May 2021 10:33:31 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/rift-between-nawazuddin-siddiqui-and-his-brother-shamas-latter-undergoes-nasal-surgery-exclusive/articleshow/82514969.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82514969.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>It has not been an easy time at Nawazuddin Siddiqui's household, recently. The actor has had big friction with his brother Shamas, which the latter confirms it in mild words, \"We have had creative differences over my film 'Bole Chudiyan'.\"",
    "Image": "https://static.toiimg.com/thumb/msid-82515096,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-117077/82515096.jpg",
    "Link": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/rift-between-nawazuddin-siddiqui-and-his-brother-shamas-latter-undergoes-nasal-surgery-exclusive/articleshow/82514969.cms",
    "Text": "It has not been an easy time at Nawazuddin Siddiqui 's household, recently. The actor has had big friction with his brother Shamas , which the latter confirms it in mild words, \"We have had creative differences over my film ' Bole Chudiyan '.\"Eyebrows had been raised when Shamas had condemned Nawaz's recent outburst over celebs vacationing in Maldives amid COVID . See below:What are the creative differences, we asked? He replied, \"Those normal things which happen between a director and an actor.\"Shamas was very excited about the songs in his film during the chat, which also made us ask: Is Nawaz not happy with the songs? Shamas shot back, \" Mujhe farak nahin padta, people are liking it. Nawaz tweeted two songs and did not tweet the third, though,\" and then added, \"He wants the film to be very real and I want it to be commercial.\"Shamas has also had a bit of rough time of late when he had to undergo an urgent nasal surgery in Dubai as he suffered from nose-bleeding which was causing him a lot of discomfort from some time. \"I wanted to get it done in Mumbai's Kokilaben Ambani Hospital but later looking at the recent spike in COVID in India, I opted for Dubai's NMC Hospital,\" Shamas concluded.",
    "Title": "Rift between Nawazuddin and Shamas"
  },
  {
    "Date": "Mon, 10 May 2021 10:38:17 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/neliima-azeem-heaps-praise-on-shahid-kapoor-as-he-completes-18-years-in-bollywood/articleshow/82515098.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82515098.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>Recently, Shahid Kapoor completed 18 years in Bollywood. The actor took to his social media handle to pen a heartfelt note for his fans.",
    "Image": "https://static.toiimg.com/thumb/msid-82515098,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-393257/82515098.jpg",
    "Link": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/neliima-azeem-heaps-praise-on-shahid-kapoor-as-he-completes-18-years-in-bollywood/articleshow/82515098.cms",
    "Text": "Read Also\n\nRecently, Shahid Kapoor completed 18 years in Bollywood. The actor took to his social media handle to pen a heartfelt note for his fans.He shared a selfie of himself with a heartwarming message. The post was captioned as, ''Thank you all for all the wishes. It’s always special to turn 18. Keep it real. Be the change. Find every possible moment to be grateful. Make it count you all. Tomorrow is today.''Check out his post here:As soon as he shared the post, his mother Neliima Azeem commented, ''Lovely..so proud of you darling son😍❤️🙌 for the next great 18 years.. blessings''. She further added, ''Love the pic... The gaze straight into the 💕 heart''.The actor made his big Bollywood debut in 2003 with the film 'Ishq Vishk'. He impressed fans with his performances in ' Vivah ', 'Jab We Met', ' Udta Punjab ', ' Kabir Singh ' and many more.Meanwhile, on the work front, Shahid will be next seen in the remake of the Telugu sports film ' Jersey '. Kapoor will be essaying the role of a cricket player in the film. He has wrapped up shooting for it. It also stars Mrunal Thakur and Pankaj Kapur, among others.As per reports, the actor will be next seen in an upcoming OTT project which will also feature actor Raashii Khanna.",
    "Title": "Neliima Azeem praises Shahid Kapoor"
  },
  {
    "Date": "Mon, 10 May 2021 09:04:27 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/celina-jaitly-opens-up-on-her-twin-pregnancies-the-babies-pressed-on-my-heart-so-breathing-was-difficult/articleshow/82513899.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82513899.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>Celina Jaitly has had two twin pregnancies, which is as rare as one in 7,000,00! On the occasion of Mother’s Day, the actress opened up about the difficulties she faced during her first pregnancy and her second pregnant as a mother of twins was equally tough. Sharing pictures from her twin pregnancies the actress wrote, “I was diagnosed with gestational diabetes in both my pregnancies due to twin baby hormones, I had to really watch what I ate and went through a extremely strict restrictions throughout both pregnancies.”",
    "Image": "https://static.toiimg.com/thumb/msid-82513899,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-153873/82513899.jpg",
    "Link": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/celina-jaitly-opens-up-on-her-twin-pregnancies-the-babies-pressed-on-my-heart-so-breathing-was-difficult/articleshow/82513899.cms",
    "Text": "Very few actors start facing the camera since the age of two and are blessed enough to work with stalwarts right from their debut film. But Jugal Hansraj struck gold. In a career spanning over 35 years, the actor moved the audience to tears with his act as a child actor in 'Masoom' and then, years later, terrorised them in 'Kahaani 2'. In an exclusive interview, he spills the beans on how he could have had a better career, what's keeping him busy these days, and more.",
    "Title": "Celina Jaitly on her twin pregnancies"
  },
  {
    "Date": "Mon, 10 May 2021 05:28:48 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/05/Nayattu.jpg",
    "Link": "https://indianexpress.com/article/entertainment/movie-review/nayattu-movie-review-kunchako-boban-joju-george-and-nimisha-sajayan-starrer-thriller-shows-the-truth-of-political-circus-7309008/",
    "Text": "Nayattu movie cast: Kunchako Boban, Joju George, Nimisha Sajayan\n\nNayattu movie director: Martin Prakkat\n\nNayattu movie ratings: 3.5 star\n\nNayattu, which means the hunt, is a sad reflection of the times we live in. We are part of the period in human history where truth seems to have little or no value. In the post-truth era, we don’t want facts. We don’t want a thorough investigation into a case to get to the bottom of it; all we want is a good show. We want a show of justice without procedural fairness. Who gets justice (however shallow or imaginary it might be) and who gets sent to jail depends on the political agenda of the time.\n\nSo, it is election season in Kerala. The people in the government are busy chalking their winning strategies and fully focused on consolidating their vote base, while the governance of the state takes a back seat. It is that time of the year, where even low-ranking cadres in a political party get to make their demands. “Sir, after the election, please get those troublesome police officers suspended,” tells a party functionary to the chief minister. It is not a request. It is a polite order. And the all-powerful CM nods his head in affirmation while clenching his fist.\n\nKunchako Boban’s CPO Praveen Michael gets posted to a new police station, where he becomes friends with ASI Maniyan (Joju George) and constable Sunitha (Nimisha Sajayan). The three stand by each other and in the process, they cross an egoistical youngster who belongs to a political outfit that has ties with the government in power. The man in question never seems to miss an opportunity to rub it in the faces of cops, given it makes him feel more powerful and gives meaning to his existence. The script is so dense that we could clearly see between the lines, what is causing such a massive power imbalance between a nobody and a bunch of cops, including high-ranking officers.\n\nFollowing an unfortunate incident, Praveen, Maniyan and Sunitha become prime suspects in a murder case. Spoiler alert: nobody murdered anybody. Due to an unfortunate road accident, one of the party workers of the government dies. Against his best judgment, Maniyan gives in to Praveen’s request and decides to take the injured motorist to the hospital and save his life. And that jeopardizes all the plans of Praveen, Maniyan and Sunitha.\n\nPraveen may have overcome his heartbreak and married Sunitha. And Maniyan may have finally gone to his daughter’s school event. But, even in their wildest dreams, they would have never imagined that they would become the subject of a witch hunt spearheaded by their colleagues. Maybe, if there had been a fair system that functioned on objective facts, Praveen, Maniyan and Sunitha may have continued to pursue the plans they had for themselves. But, in cases, where political masters dictate the outcomes of the investigation, facts and justice are the first casualties.\n\nNayattu is as much a thriller as it is the indictment of the failure of the public to be reasonable. As long as the circus is good, we never really care what’s going behind the curtain. Writer Shahi Kabir’s strong and direct observations resonate with us considering how the power brokers use the media to whip up anger against a target that benefits them politically. Director Martin Prakkat has done a terrific job in visually bringing out all the keen observations of Kabir and painting a bigger picture of the system, which is bent to keep the public in dark.",
    "Title": "Nayattu movie review: Kunchako Boban, Joju George, Nimisha Sajayan’s thriller shows the truth of political circus"
  },
  {
    "Date": "Mon, 10 May 2021 05:59:15 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/05/Shahid-Kapoor-1200-2.jpg",
    "Link": "https://indianexpress.com/article/entertainment/bollywood/neelima-azeem-calls-daughter-in-law-mira-kapoor-a-gift-shahid-kapoor-ishaan-khatter-7309091/",
    "Text": "Actor Neelima Azeem and daughter-in-law Mira Kapoor, wife of actor Shahid Kapoor, have often shared words of praise for each other. After calling her a friend in a previous interview, Neelima Azeem opened up on how Mira is another child for her who is “extremely intelligent and well-informed.” She credits her daughter-in-law for bringing the family together.\n\n“Mira has given me the tag of a cool mother in law. She has often called me so in several instances. It gives me a great sense of satisfaction. I feel happy about myself. What could be better that you have another child. Whether it is a son-in-law or daughter-in-law, suddenly you a child that you have not laboured for, brought up or this and that. It is like a gift,” the actor told Bollywood Bubble in a recent interview.\n\nShe added, “Mira has brought us the biggest joys. She brought Misha and Zain into our lives. She brought the whole family together. Ever since Misha and Zain have been born, Mira has set up all the family gatherings. She always has interesting new stuff to contribute. I find her very creative. Now, of course, she has broken out into her own and doing very well. She is extremely intelligent and educated and well-informed. She is very calm and easy. No drama, tantrums or wanting to get attention. She glued our family together. She deserves the praise, she earned it. She is not a demanding brat. She has graced her lives. She loves her husband, brother-in-law and her kids. Our interests are also very personal.”\n\nOn Mother’s Day, Mira Kapoor posted a picture of herself with Neelima Azeem and wrote that her “positivity and zest for life is so inspiring.” She also mentioned that she loves that they are always on the same side.\n\nDuring the interview, Azeem also spoke a bit about Shahid Kapoor and Ishaan Khatter and their growing up years. She said she carried both of them to her work when they were babies. Addressing her separation with Pankaj Kapur and how it affected Shahid, if at all, the actor revealed that Shahid was brought up under the care of her parents and her extended family.\n\nShe concluded talking about how Ishaan and Shahid are never a part of nepotism conversation, “I never told my Guru that I had link with Nawab of Rampur. When years later he got to know, I told him that the reason was to built on my own. I have seen that in life when you work on yourself all alone, you polish yourself in a beautiful way. I have seen Ishaan spending most of his time growing, imbibing and learning on his own, which is wonderful because he is very individual because of that and his work reflects it.”\n\nNeelima’s interview came right after Shahid’s Instagram post for her on Mother’s Day in which he wrote that she is “always the wind beneath our wings.”\n\n“Her gaze is loving and forgiving and always sees us as the best version of ourselves. She has nurtured us with so much love that we are capable of passing it on and spreading it into the world. Being the older one by almost 14 years my bond with mom has been very unique, like a friend. And our journey has been beyond words. There is no one who can be you mom,” he wrote.",
    "Title": "Neelima Azeem calls daughter-in-law Mira Kapoor ‘a gift’: She glued our family together"
  },
  {
    "Date": "Mon, 10 May 2021 05:07:15 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/05/lady-gaga-1200by667.jpg",
    "Link": "https://indianexpress.com/article/entertainment/hollywood/lady-gaga-wraps-up-shoot-for-house-of-gucci-7308954/",
    "Text": "Lady Gaga's House of Gucci is set to the big screens on November 24. (Photo: ladygaga/Instagram)\n\nPop star-actor Lady Gaga has completed shooting for the upcoming biographical crime film House of Gucci, directed by Hollywood veteran Ridley Scott. The Shallow hitmaker took to Instagram on Saturday night to make the announcement.\n\n“That’s a wrap, Rid. #HouseOfGucci,” she shared the photo that sees an out-of-frame Gaga pounding her fists with Scott’s.\n\nView this post on Instagram A post shared by Lady Gaga (@ladygaga)\n\nThe movie stars Gaga as Patrizia Reggiani, the ex-wife of Maurizio Gucci (played by Adam Driver), the grandson of the Gucci fashion house founder Guccio Gucci.\n\nReggiani was abandoned after 12 years of marriage by Maurizio Gucci in 1985 for a younger woman. She was tried and convicted of orchestrating her ex-husband’s assassination on the steps of his office in Italy in 1995.\n\nShe got the nickname the Black Widow during the trial and served 18 years before being released from prison in 2016.\n\nAccording to Variety, House of Gucci also stars Jeremy Irons, Jared Leto, Al Pacino, Jack Huston, Salma Hayek and Reeve Carney.\n\nThe film, which hails from MGM, is based on Sara Gay Forden’s book The House of Gucci: A Sensational Story of Murder, Madness, Glamour, and Greed.\n\n\n\nRoberto Bentivegna has adapted the book for the big screen.\n\nHouse of Gucci is set to the big screens on November 24.",
    "Title": "Lady Gaga wraps up shoot for House of Gucci"
  },
  {
    "Date": "Mon, 10 May 2021 03:31:35 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/05/gal-gadot-joss-whedon-1200.jpg",
    "Link": "https://indianexpress.com/article/entertainment/hollywood/gal-gadot-confirms-joss-whedon-threatened-her-career-during-justice-league-reshoots-7308958/",
    "Text": "This was the first time Gal Gadot herself has confirmed that Joss Whedon misbehaved her. (Photo: AP)\n\nWonder Woman actor Gal Gadot has said in a recent interview that Joss Whedon threatened her career while they were working together on the set of 2017’s Justice League. This revelation comes in the wake of more than a year of reports talking about Whedon’s less than ideal behaviour on the sets of the movie.\n\nIn an interview with Israel’s N12 News, Gadot said, “What I had with Joss basically is that he kind of threatened my career and said if I did something he would make my career miserable. I handled it on the spot.”\n\nWhile there were various reports circulating that Whedon misbehaved with Gadot, but this was the first time the actor herself has confirmed it.\n\nOne report in The Hollywood Reporter had said that Gadot had concerns with the direction the movie and her character was taking. The report also said Whedon disparaged Patty Jenkins, Wonder Woman’s director.\n\nRay Fisher, who played the role of Victor Stone or Cyborg, was the first actor to open up about Whedon’s alleged misconduct with cast members. On July last year, he tweeted, “Joss Wheadon’s on-set treatment of the cast and crew of Justice League was gross, abusive, unprofessional, and completely unacceptable. He was enabled, in many ways, by Geoff Johns and Jon Berg. Accountability>Entertainment.”\n\nJohns and Berg were two of the producers on Justice League. Joss Whedon was also accused by various cast members of Buffy the Vampire Slayer. In February this year, Charisma Carpenter, who played the role of Cordelia Chase, said Whedon has a “history of creating toxic and hostile work environments.”\n\nFollowing Fisher’s accusations, Warner Bros conducted an investigation and later said remedial action was taken. Though not disclosed, it is said that Whedon losing the HBO fantasy series The Nevers was part of it.\n\nWhedon was brought to Justice League by Warner Bros executives as they did not like the darker tone Zack Snyder’s original cut had. When Snyder had to leave the project altogether due to a personal tragedy, Whedon was handed the reins and he went on to do extensive reshoots. The finished version that hit theatres in 2017 was said to be his cut of the movie. The film was panned by critics and was also a commercial disaster and also derailed the DCEU.",
    "Title": "Gal Gadot confirms Joss Whedon threatened her career during Justice League reshoots"
  },
  {
    "Date": "Mon, 10 May 2021 04:34:19 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/05/Amitabh-Bachchan.jpg",
    "Link": "https://indianexpress.com/article/entertainment/bollywood/amitabh-bachchan-contributes-rs-2-cr-to-delhi-covid-19-facility-addresses-abuse-and-filth-of-distasteful-comments/",
    "Text": "Amitabh Bachchan on his blog said that \"is painful to see the misery around and the inability to be able to do something for them.\" (Photo: Amitabh Bachchan/Instagram)\n\nAmitabh Bachchan, along with several prominent personalities such as Ben Affleck, Chrissy Teigen, Jimmy Kimmel, Sean Penn, David Letterman, was a part of Vax Live: The Concert to Reunite the World, which went live on Saturday. The Global Citizen fundraising concert advocating the importance of vaccine equity has pulled in 302 million dollars, exceeding the goal for the organisation’s campaign, AP reported.\n\nApart from Big B, the show, which was hosted by Selena Gomez, was attended by several thousand fully-vaccinated concertgoers who cheered on performances by Eddie Vedder, Foo Fighters, J Balvin, H.E.R. and Lopez, who enjoyed a duet with her mom. The concert was shot earlier this month but aired on Saturday evening.\n\nAmitabh Bachchan, who said he was “privileged to be a part of the concert and the fight for India”, posted a video in which he urged global citizens to rise and help India in fighting the deadly second wave of Covid-19.\n\nT 3900 – Privileged to be a part of the concert .. and the fight for India .. pic.twitter.com/vlyhKVc6QG — Amitabh Bachchan (@SrBachchan) May 9, 2021\n\n“Namaskar, this is Amitabh Bachchan. My country India is battling with the sudden surge of the second wave of Covid 19. As a global citizen I appeal to all global citizens to rise up, speak to your governments, pharmaceutical companies and ask them to donate, to give, to extend a helping hand, to the public that needs it the most. Every effort counts. As Mahatma Gandhiji said: ‘In a gentle way you can shake the world’. thank you,” he said in the video.\n\nThe event also emphasised the importance of vaccination.\n\nOn Saturday, Big B wrote a long post on his blog in which he spoke about how celebrities are criticised for not publicising their contribution during the difficult times. He said that him and his family have hardly succumbed to the pressure of social media and the “every day abuse and the filth of distasteful comments” and contributed or made their effort in the quiet. “Only the receiver knew and that was the end,” wrote the actor. While the actor has not spoken about his contribution, it has come to light that he has contributed Rs 2 crore towards a Covid-19 facility in Delhi.\n\nIn the blog, he went on to divulge details on his contribution during the Covid-19 pandemic.\n\n“Over a 1500 farmers bank loans paid off by my personal fund and prevented them from suicide , as the suicided grew .. from Andhra Pradesh, Maharashtra, UP et al .. calling them over after identifying with respective banks and getting them all to Janak and in the presence of the bank representatives, paying them in person and getting them to strike off the loan , giving each farmer the document that they did not owe any more , that their loan was over and completed and paid back to the bank .. some 300 odd from UP could not all be present .. a bogie in the train booked for a limited number of 30 to 50 of them , from their respective cities in UP, received in Mumbai , put in buses , given a drive of the city of Mumbai, brought over to Janak, fed and given the loan cancellation certificate and put back on the train to their homes .. all at my expense ..\n\nThe brave soldiers at the border of the Country who had been martyred , their lists sought and their families , young wives and their children, some wives pregnant and expectant , given succour ..\n\nThe martyr s at Pulwama after the terrible terrorist attack , their families spread all over the land contacted and brought to Janak and given succour .. at the hands of Abhishek and Shweta ..\n\nThose that suffered during the CoViD last year .. providing food for over 400,000 daily wage earners in the country for a month .. feeding almost 5000 in the city each day lunch and dinner ..\n\nProvided masks , PPE units to front line warriors, Police Hospitals in the thousands .. through personal funds .. donating to the Sikh Committee that was helping the migrants to travel back home in the Inter State busses , where the drivers were mostly Sikhs ..\n\nWhen the migrants were walking back home, some without the benefit or affordability of shoes .. provided hundreds of chappals and shoes to them .. due to lack of travel facility, booked 30 buses to locations in UP and Bihar and supplied them food and water for the overnight travel ..\n\nBooked an entire train from Mumbai to UP to carry 2800 migrant passengers free of cost at my expense .. and when the destination State blocked the tarin from coming into their State and cancelled the train .. immediately chartered 3 Indigo Airline planes and flew almost 180 migrants in each flight to UP and Bihar and some to Rajasthan and J&K ..\n\nAnd as the virus spread, donated an entire Diagnostic Centre .. opened at Bangla Sahib Gurudwara in Delhi through the Delhi Sikh Gurudwara Management Committee, set up in the premises of the Gurudwara for medical help for the poor and needy .. an MRI machine and other Sonographic and Scan equipments of expenses beyond my means, but set up inspite .. in the memory of my Nana , Naani and my Mother ..\n\nA 250 to 450 bed care center set up with further donation at the Rakabganj Sahib Gurudwara today in Delhi and soon to procure for them O2 ( Oxygen ) concentrators, not in stock or easily available , from overseas limited stock to be donated to Delhi where the need is immense and some to Mumbai .. coming in within the week .. 50 of them coming in from Poland by 15th and the rest around 150 from perhaps the US .. orders placed , some have arrived and given to the Hospital in need ..\n\nVentilators of immediate need to the BMC and to the Municipal Hospitals ordered .. around 20 of them , of course within my limited means , to be in, in a few days .. some 10 have arrived today and on custom release shall be delivered ..\n\nA 25-50 bed Hospital care center setting up at Juhu Army location at a School Hall , the Ritambhara School, with all facilities and should be up by the 12th of May .. donated funds to set up ..\n\n3 very important detection machines donated to Nanavati Hospital , last week to help in the detection of CoviD ..\n\nFeeding about a 1000 in the slums and poor sections of the city ..\n\nYoung children .. orphaned by the sudden death of the parents, left in oblivion .. have adopted 2 and shall be put in an orphanage in Hyderabad .. their study board and lodging free till they finish School .. from the 1st to the 10th .. and if they turn out bright to provide them with free upper education ..\n\n.. and more , as and when the means are affordable ..”\n\nHe often said;\n\n“आप पैसों की चिंता मत कीजिए… बस कोशिश करिये कि हम ज़्यादा से ज़्यादा जानें बचा पाएँ!”@SrBachchan Ji contributed a huge Amt & also took the pain to ensure oxygen concentrators get shipped frm abroad & reach on time He is not just a REEL Hero but a Real life Hero https://t.co/5NEFgsZid5 pic.twitter.com/DA1onuT4RE — Manjinder Singh Sirsa (@mssirsa) May 9, 2021\n\nALSO READ | Amitabh Bachchan announces Kaun Banega Crorepati 13 open, registration begin from May 10\n\nPolitician Manjinder Singh Sirsa tweeted on Saturday to thank Amitabh Bachchan for his contribution to Delhi’s Guru Tegh Bahadur Covid Care facility. He revealed the actor contributed Rs 2 crore. “Amitabh Bachchan Ji contributed a huge Amt & also took the pain to ensure oxygen concentrators get shipped from abroad & reach on time. He is not just a REEL Hero but a Real life Hero,” he tweeted.",
    "Title": "Amitabh Bachchan contributes Rs 2 cr to Delhi Covid-19 facility, addresses ‘abuse and filth of distasteful comments’"
  },
  {
    "Date": "Mon, 10 May 2021 05:11:07 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/05/rakeysh-omprakash-mehra-1200by667.jpg",
    "Link": "https://indianexpress.com/article/entertainment/bollywood/rakeysh-omprakash-mehra-arbaaz-khan-get-their-dose-of-covid-19-vaccine-7308987/",
    "Text": "Rakeysh Omprakash Mehra took to social media to share his Covid-19 vaccination update. (Photo: rakeyshommehra/Instagram)\n\nFilmmaker Rakeysh Omprakash Mehra and actor-producer Arbaaz Khan on Sunday received their dose of the Covid-19 vaccine. The duo took to social media to share the update. It was, however, unclear if the shot was their first or second.\n\nWhile Mehra, 57, got the vaccine via a drive through, Khan received the dose at a vaccination centre here.\n\n“Thank you – BMC #covid vaccination drive through – most effective, not crowded, all it took 10 minutes,” the Rang De Basanti director wrote on Instagram alongside a photo of him getting the jab.\n\nView this post on Instagram A post shared by Rakeysh Omprakash Mehra (@rakeyshommehra)\n\nKhan, known for backing the Dabangg franchise, shared a video of him taking the shot.\n\n“I got vaccinated now it’s your turn,” the 53-year-old producer captioned the clip.\n\nView this post on Instagram A post shared by Arbaaz Khan (@arbaazkhanofficial)\n\nThe countrywide vaccination drive was rolled out on January 16 with healthcare workers getting vaccinated first and immunisation of frontline workers, followed by the next phase meant for over 60 years of age and for people aged 45 and above with specified co-morbid conditions, which started from March 1.\n\nThe Covid-19 tally in Mumbai increased by 2,403 on Sunday to touch 6,76,475, while 68 deaths during the day took the toll to 13,817, an official said.",
    "Title": "Rakeysh Omprakash Mehra, Arbaaz Khan get their dose of Covid-19 vaccine"
  },
  {
    "Date": "Mon, 10 May 2021 06:00:25 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/05/Rohit-Roy-1200.jpg",
    "Link": "https://indianexpress.com/article/entertainment/bollywood/rohit-bose-roy-on-difficult-childhood-mom-had-to-teach-kids-to-make-ends-meet-after-dad-passed-away-7309120/",
    "Text": "Rohit Bose Roy celebrated Mumbai Saga’s success with an emotional post. On Monday, he posted a still from the film and revisited his journey in the industry. Expressing his “gratitude,” Rohit said that he is thankful about the fact that he is still a part of the film business. In a post on Instagram, he revisited his “difficult childhood” but how he has no “sob stories” to tell.\n\n“‪Yes, I had a difficult childhood.. Yes, my mom had to teach the neighbourhood kids to make ends meet after my Dad passed when I was hardly 15 yeas old.. Yes, I had to really struggle for whatever lil success I have achieved. Yes I had to spend countless sleepless nights.. I still do! BUT…..I have no SOB STORIES!!! It’s all good! I’m still here!” he wrote.\n\nView this post on Instagram A post shared by Rohit Bose Roy (@rohitboseroy)\n\nAs soon as he dropped the post, a couple of his friends commented praising his role in Mumbai Saga. “You did very good,” wrote casting director Mukesh Chhabra. Raj Kundra wrote, “You were brilliant in the movie. Your achievements are all thanks to the struggles.” Filmmaker Nadeem Shah praised Rohit, in response to which the actor wrote, “Thank you for your help all through, especially in my placements. It’s our secret.”\n\nEven Rohit’s fans flooded the comment section, lauding his performance in the Sanjay Gupta directorial. One of the fans wrote, “You were absolutely brilliant,” the other mentioned that his journey in the industry is quite inspiring.\n\nMumbai Saga, which is currently streaming on Amazon Prime Video, released at the theatres on March 19, before the second wave of the coronavirus forced theatres to shut down once again.\n\nSet in the backdrop of the early 90s, Mumbai Saga presents a fictional story of the duel between Amartya Rao (John Abraham) and Senior Inspector Vijay Sawarkar (Emraan Hashmi) that explores the various shades of emotions — from hopes, aspirations to friendship and betrayal. The Sanjay Gupta directorial also defines the journey of Bombay becoming Mumbai, and how it changed the lives of its people.\n\nThe film also stars Mahesh Manjrekar, Suniel Shetty, Prateik Babbar, Rohit Roy, Amole Gupte, Samir Soni, Gulshan Grover, and Anjana Sukhani.",
    "Title": "Rohit Bose Roy on difficult childhood: ‘Mom had to teach kids to make ends meet after dad passed away’"
  },
  {
    "Date": "Mon, 10 May 2021 04:05:32 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/05/salman-aishwarya-mothers-day-1200.jpg",
    "Link": "https://indianexpress.com/article/entertainment/bollywood/salman-khan-aishwarya-rai-aaradhya-mothers-day-post-throwback-photos-7308946/",
    "Text": "Bollywood celebs flooded the social media to celebrate Mother's Day on Sunday. (Photos: Aishwarya and Salman/Instagram)\n\nActor Aishwarya Rai Bachchan went down the memory lane on Mother’s Day by sharing throwback pictures of daughter Aaradhya, on Instagram. Though her posts came in late in the day, they marked a perfect conclusion to the global celebration of mothers. Aishwarya was also joined in by her former co-star from Hum Dil De Chuke Sanam and superstar Salman Khan, and star wife Gauri Khan. Salman shared photos of mother Salma Khan and Helen on social media.\n\nAishwarya took to her official Instagram handle and posted the first click holding little Aaradhya in her arms. Her daughter is comfortable in her arms as she kisses her to sleep. In her caption, Aishwarya wrote, “My love… My life… Eternally, Infinitely, Unconditionally.”\n\nView this post on Instagram A post shared by AishwaryaRaiBachchan (@aishwaryaraibachchan_arb)\n\nView this post on Instagram A post shared by AishwaryaRaiBachchan (@aishwaryaraibachchan_arb)\n\nAishwarya also shared a throwback photo with her parents and an infant Aaradhya. Her caption read, “Love of my life.”\n\nSalman, who’s awaiting the release of Radhi this week, also shared clicks of his two mothers – Salma Khan and Helen, in separate social media posts, wishing fans a “Happy Mother’s Day”.\n\nView this post on Instagram A post shared by Salman Khan (@beingsalmankhan)\n\nComing to Gauri Khan, wife of Shah Rukh Khan, she shared a collage of photos with her mother, and wrote along, “The strength of a mother is like no other. Stay safe and calm # happy Mother’s Day. Love you.”\n\nView this post on Instagram A post shared by Gauri Khan (@gaurikhan)\n\nBollywood celebs flooded their social media handles on Sunday to mark the special occasion. From Kareena Kapoor Khan to Sushmita Sen, Akshay Kumar, Priyanka Chopra, Karan Johar, Janhvi Kapoor, Sara Ali Khan and several others wished their mothers.\n\nStars from south film industries like Kamal Haasan, Chiranjeevi, Mahesh Babu and more marked Mother’s Day too. Many countries, including India, celebrate Mother’s Day on the second Sunday of May every year.",
    "Title": "Salman Khan, Aishwarya Rai celebrate Mother’s Day with adorable throwback photos, she calls daughter Aaradhya ‘love of her life’"
  }
]