[
  {
    "Date": "Thu, 06 May 2021 01:48:07 +0000",
    "Description": "Starting late next year, an X-wing from “Star Wars: The Rise of Skywalker” will go on display at the National Air and Space Museum in Washington.",
    "Image": "https://static01.nyt.com/images/2021/05/05/multimedia/05xp-xwing/merlin_187327002_73ecb795-14b6-4809-908f-246986bdc24b-facebookJumbo.jpg",
    "Link": "https://www.nytimes.com/2021/05/05/us/star-wars-smithsonian-x-wing.html",
    "Text": "The National Air and Space Museum holds some of the most hallowed objects of the aerial age.\n\nVisitors can marvel at the 1903 Wright Flyer that skimmed over Kitty Hawk, N.C., the bright red Lockheed 5B Vega that Amelia Earhart piloted alone across the Atlantic Ocean and the bell-shaped Friendship 7 capsule that made John H. Glenn Jr. the first American to orbit the Earth.\n\nNow, the museum said, it will display a spacecraft that has flown only onscreen, in an entirely fictional galaxy where good and evil seem locked in eternal battle.\n\nThat’s right: An X-wing Starfighter will grace the museum’s newly renovated building on the National Mall sometime late next year, the museum said on Tuesday, which was celebrated by “Star Wars” fans as a holiday because it was May 4 (May the 4th be with you).\n\nThe Hollywood prop, with a wingspan of 37 feet, appeared in “Star Wars: The Rise of Skywalker” in 2019 and is on long-term loan from Lucasfilm, the movie’s production company.",
    "Title": "Smithsonian Will Display Star Wars X-Wing Fighter"
  },
  {
    "Date": "Thu, 06 May 2021 11:11:44 +0530",
    "Description": "Dancer Methil Devika was down with COVID-19 while working on production on ‘solitude’",
    "Image": "https://th.thgim.com/news/national/kerala/bxoj2e/article34496089.ece/ALTERNATES/FREE_460/06tvallMethilDevikaJPG",
    "Link": "https://www.thehindu.com/entertainment/dance/when-life-imitates-art-during-pandemic/article34496090.ece",
    "Text": "Dancer Methil Devika was down with COVID-19 while working on production on ‘solitude’\n\nLife imitates art. Methil Devika found that out recently, the hard way.\n\nThe accomplished Mohiniyattam dancer had come down with COVID-19 and was hospitalised for a few days. And this happened at a time when she was working on an international project titled ‘Ahalya’ on the theme of ‘solitude’ imposed by the pandemic.\n\nDevika is one of the four Indian dancers commissioned by the Canada-based Sampradaya to make productions on the theme. Rama Vaidyanathan (Bharatanatyam), Aditi Mangaldas (Kathak) and Bijayini Satpathy (Odissi) are the others.\n\nDevika showed all the classical symptoms of COVID-19 while she was on working on the music of her production. Besides writing the script, in collaboration with Valmiki, she would tell you, smiling, she has also composed the music.\n\n“I was suffering from breathlessness, but the deadline to finish my film was fast approaching. So I sang the track in that condition and mailed it to my musicians,” says Devika. “It was indeed a severe form of COVID-19 that struck me.”\n\nAfter leaving the private hospital in Thiruvananthapuram, she had to isolate herself in accordance with the COVID-19 protocol. That experience came in handy when she enacted the role of Ahalya during the shoot of her production.\n\n“I chose the tale of Ahalya for my film because I thought we all could relate, during these tough times, to her isolation and loneliness as she waited for Rama to end her curse,” says Devika. “I interpreted her character from my own perspective rather than those of other poets like Ezhuthachan. After reading different versions of The Ramayana, I went back to the original work by Valmiki.”\n\nThe production, which she has choreographed and performed, is in the Mohiniyattam style, of course. She roped in ace cinematographer Madhu Ambat to shoot the film.\n\nAhalya premieres on shaale.com on May 9.",
    "Title": "When life imitates art during pandemic"
  },
  {
    "Date": "Thu, 06 May 2021 01:25:41 GMT",
    "Description": "New York's major theatres have been closed since March 2020 because of the coronavirus pandemic.",
    "Image": "https://ichef.bbci.co.uk/news/1024/branded_news/13F4A/production/_118383718_mediaitem118383475.jpg",
    "Link": "https://www.bbc.co.uk/news/world-us-canada-57004304",
    "Text": "Broadway supports more than 96,000 jobs in New York and contributed nearly $15bn (£11.2bn) to the city's economy in 2019, according to the Broadway League, a theatre union. That number does not just take into account ticket sales but also the investment to put on and run a show, and the money tourists spend when they come to New York to see a performance.",
    "Title": "Broadway tickets to go on sale for September reopening"
  },
  {
    "Date": "Thu, 06 May 2021 01:07:04 +0530",
    "Description": "Kawasaki Versys’ engine is its crowning jewel, to say nothing of its impressive handling and comfortable seating",
    "Image": "https://th.thgim.com/entertainment/movies/jup5gv/article34487681.ece/ALTERNATES/FREE_960/1DSC2641",
    "Link": "https://www.thehindu.com/life-and-style/motoring/versys-1000-makes-for-a-breezy-ride/article34487682.ece",
    "Text": "Kawasaki Versys’ engine is its crowning jewel, to say nothing of its impressive handling and comfortable seating\n\nEvery time I step off an adventure tourer, I am left with a sense of conviction about their aptness for our roads. They have the ability to gobble serious miles without compromising on comfort and also have a touch of sportiness sewn in. And that is where motorcycles like the Kawasaki Versys 1000 appear to make a strong case for themselves.\n\nThe Design\n\nFirstly, it is the sheer size of the Kawasaki Versys 1000 that captures your attention, leaving you a little intimidated as well. With its new ZX-6R inspired face, the Versys 1000 is a little easier on the eyes, but it is still not what you would call pretty.\n\nStep to the side and it becomes even more apparent that this motorcycle is built to chew miles all day long. The 21-litre tank, massive fairing and spacious seating are all indicative of the Versys’ touring orientation. But there is no getting away from the fact that the bodywork is so huge that the relatively small 17-inch wheels make the motorcycle appear disproportionate, despite running sport-bike tyre sizes.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe other advantage of so much real estate is what is possibly the roomiest and comfiest rider and pillion seat in the class. The ergonomics are pretty relaxed, with a slightly pared-back footrest and an easy reach to the bar. That, along with the windscreen, takes the fatigue out of spending a whole day in the saddle.\n\nEngine & Performance\n\nThe Versys’ engine is the crowning jewel of the whole package; it is the same engine that also powers the Ninja 1000SX, however, it makes less power and torque in the Versys. Nevertheless, 120hp and 102Nm are decent figures.\n\nWhen you fire up the engine, the sweet hum at idle feels like the calm before the storm. Once on the move, the loud intake howl is accompanied by a surge in acceleration that belies this motorcycle’s size and weight. You get to unmentionable speeds in no time and the engine doesn’t feel strained at any point. Slot the slick gearbox in sixth, and the Versys transforms into an effortless cruiser with enough juice in reserve to pull a quick overtake, sometimes even without down-shifting. Even in the city, the engine’s tractability and heat management is impressive, making it capable of dealing with a city commute, if necessary.\n\nThe 2019 update to the Versys 1000 also brought in IMU assisted, three-step traction control (TC) and lean-sensitive ABS. Adding another layer of safety are the two power modes — Full and Low. The ‘Low’ mode chops power down to 75% and also softens the power delivery. This makes riding this big Kawasaki quite easy, whether in the wet or dry. However, we did find the TC to be too intrusive in some situations and it cuts power rather abruptly. A smoother throttle action does help to an extent, but Kawasaki needs to refine the system further so that it doesn’t upset the chassis the way it currently does on loose and slippery surfaces.\n\nHandling\n\nIt is not just the performance but also the way this 255kg motorcycle handles that impresses. Get past the initial trepidation of riding a tall motorcycle and you will be surprised to see how well this motorcycle takes to the bends. There is oodles of grip and feedback through the chassis while the 17-inch wheels make life easy during quick direction changes.\n\nThe suspension does a pretty good job of absorbing undulations, and the ride quality over bad roads is comfortable enough despite the firm edge. Adjustability, however, is limited and one can tune the 43mm fork and monoshock for preload and rebound only.\n\nFor those wondering if they should wander off-road on this Versys, the motorcycle can only handle a mild trail. Because, the 17-inch wheels, fat tyres and 150mm of ground clearance aren’t encouraging specifications to venture off the beaten path. The 310mm discs do a good job of hauling down the motorcycle to a stop while the ABS is well-calibrated to prevent unnecessary intervention.\n\nVerdict\n\nAt ₹11.44 lakh, the Kawasaki Versys 1000 is nothing but a steal for the kind of performance it offers. Not to mention the sweet sound and character of an inline-four engine. In fact, at this price point, its biggest competition comes from its sibling the Ninja 1000SX. It may not have the ergonomics, suspension travel and all-day comfort of the Versys 1000 but it is more powerful and better equipped. That said, the Versys offers unbeatable value for someone looking for a supremely comfortable and fast road-biased touring motorcycle.",
    "Title": "Why the Versys 1000 makes for a breezy ride"
  },
  {
    "Date": "Thu, 06 May 2021 11:21:52 +0530",
    "Description": "Yasmin Zaidi’s new artworks reflect on the COVID pandemic, isolation and grief",
    "Image": "https://th.thgim.com/entertainment/art/v3ijkb/article34481635.ece/ALTERNATES/FREE_960/Zaidi1",
    "Link": "https://www.thehindu.com/entertainment/art/yasmin-zaidi-paints-the-pandemic/article34481356.ece",
    "Text": "Yasmin Zaidi’s new artworks reflect on the COVID pandemic, isolation and grief\n\nYasmin Zaidi has begun to paint grief. It comes through in her two new works: one shows a young woman holding chrysanthemums in her arms, with graves behind; another has masked, socially distant people along a stairway (to heaven?).\n\nShe asked her family what to name them, and got a number of replies: Viral Apartheid 2021, Loveliness and Loneliness. “I realised that everyone is feeling personally involved during this pandemic… They will give their own names to the paintings,” says the 70-year-old artist who paints flowers and people.\n\nZaidi has lived across India — Firozpur Jhirka (in Haryana), JK Puram and JK Gram (in Rajasthan), Delhi and many more — where she worked as an educationalist through her life, mostly in administrative positions, though she trained as an English and Social Studies teacher. “I taught art sometimes because I was just able to,” says the hobbyist, whose home, when growing up, was filled with letters and pictures. Her father, Syed Ali Jawad Zaidi, was an Urdu poet and scholar, and her grandfather dabbled in art.\n\nShe draws from the various elements of Nature she has encountered through life: The stairway in her current oil on canvas leads towards birch trees she retrieved from mental images of Kashmir. The red bottle brush and yellow tecoma in the ‘girl with chrysanthemums’ are from her ground floor flat in Mumbai, where she has a little garden. “My mother was very fond of gardening,” she remembers.\n\nYasmin Zaidi | Photo Credit: Special arrangement\n\nThis time though, flowers have been used as a metaphor for the departed. Urdu poet Afzal Ahmed Syed’s Hamein Bahut Sare Phool Chahiye, which seems to allude to war and talks about how we need a lot of flowers to cover our dead, played in her head as she painted.\n\n“When I paint, personal things come in — a book by Annie (her daughter, a writer), but the whole world was becoming personal,” she says of the shock waves that seemed to have affected everyone.\n\nShe hasn’t thought of selling: “I hardly think of the paintings as belonging to me.” She adds she wouldn’t know how to, and even if she did, it would go to COVID relief.\n\nRight now, she’s recovering from a gall bladder surgery and is with her son in Pune. “I want to paint more, but I have run out of canvas, and it’s difficult to get it right now,” she says.",
    "Title": "Yasmin Zaidi paints the pandemic"
  },
  {
    "Date": "Thu, 06 May 2021 10:33:29 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/web-series/news/english/house-of-the-dragon-first-look-photos-of-matt-smith-as-daemon-targaryen-olivia-cooke-as-alicent-hightower-are-here-and-theyll-get-you-excited-for-the-game-of-thrones-spinoff/articleshow/82424916.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82424916.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>The first look character photos of 'House of the Dragon', the prequel to the epic fantasy series 'Game of Thrones', are here and they are all things impressive.",
    "Image": "https://static.toiimg.com/thumb/msid-82424999,width-1070,height-580,imgsize-296152,resizemode-6,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/web-series/news/english/house-of-the-dragon-first-look-photos-of-matt-smith-as-daemon-targaryen-olivia-cooke-as-alicent-hightower-are-here-and-theyll-get-you-excited-for-the-game-of-thrones-spinoff/articleshow/82424916.cms",
    "Text": "The first look character photos of ' House of the Dragon ', the prequel to the epic fantasy series 'Game of Thrones', are here and they are all things impressive.The makers dropped the official first photos of the cast featuring Emma D’Arcy as Princess Rhaenyra Targaryen and Matt Smith as Prince Daemon Targaryen, Steve Toussaint as Lord Corlys Velaryon aka The Sea Snake, Olivia Cooke as Alicent Hightower and Rhys Ifans as Otto Hightower The spinoff is based on 'Fire & Blood', a companion book to George R.R. Martin ‘s 'Song of Fire and Ice' saga.The pilot of the new prequel is set 300 years before the events of the flagship series and tells the story of House Targaryen, rich in the dragonlord ancestors of Daenerys , played by Emilia Clarke 'House of the Dragon' was one of the four remaining spinoffs in the works at the network. The others are on hold, which could be indefinite — or temporary.While the series has gone into production, it is currently eyeing a 2022 release.",
    "Title": "House Of The Dragon first look pics are here"
  },
  {
    "Date": "Thu, 06 May 2021 11:32:49 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/chhichhore-actress-abhilasha-patil-passes-away-after-testing-positive-for-covid-19/articleshow/82425748.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82425748.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>Abhilasha Patil, who had featured in several Bollywood films, passed away on Tuesday after she tested positive for COVID-19. The 47-year-old actress had featured in Sushant Singh Rajput starrer ‘Chhichhore’ and was also a part of Bollywood hits like ‘Badrinath Ki Dulhania’ and Akshay Kumar-Kareena Kapoor Khan starrer ‘Good Newwz’. Abhilasha is survived by her mother, husband and son.",
    "Image": "https://static.toiimg.com/thumb/msid-82425748,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-85948/82425748.jpg",
    "Link": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/chhichhore-actress-abhilasha-patil-passes-away-after-testing-positive-for-covid-19/articleshow/82425748.cms",
    "Text": "Streaming platforms opened up a plethora of opportunities for actors during 2020 and several Bollywood celebrities have swiftly migrated from the big screen to OTT. From Kajol enthralling the audience with her performance in ‘Tribhanga’ to Abhishek Bachchan entertaining fans with ‘The Big Bull’ – Bollywood actors exploded on multiple streaming platforms ever since the country went under a lockdown last year. And this year too, some interesting OTT debuts are being planned. From Ajay Devgn to Shahid Kapoor–take a look at promising web debuts of 2021.",
    "Title": "'Chhichhore' actress Abhilasha passes away"
  },
  {
    "Date": "Thu, 06 May 2021 10:42:27 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/anurag-basu-pays-an-emotional-tribute-to-barfi-editor-ajay-sharma-he-was-my-core-team/articleshow/82425128.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82425128.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>Anurag Basu penned an emotional note remembering Ajay Sharma, who had worked on the editing of his films like 'Jagga Jasoos' and 'Ludo'. Ajay Sharma, who was hospitalised due to COVID-19, passed away on May 4. Mourning his untimely demise, Anurag Basu wrote, “This is still difficult to accept. I barely have courage to write this. Ajay independently edited Jagga Jasoos, Ludo but he was associated with me since Life in a Metro, Barfii, Kites . He was my core team, my creative soundboard, my friend.”",
    "Image": "https://static.toiimg.com/thumb/msid-82425128,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-104853/82425128.jpg",
    "Link": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/anurag-basu-pays-an-emotional-tribute-to-barfi-editor-ajay-sharma-he-was-my-core-team/articleshow/82425128.cms",
    "Text": "Streaming platforms opened up a plethora of opportunities for actors during 2020 and several Bollywood celebrities have swiftly migrated from the big screen to OTT. From Kajol enthralling the audience with her performance in ‘Tribhanga’ to Abhishek Bachchan entertaining fans with ‘The Big Bull’ – Bollywood actors exploded on multiple streaming platforms ever since the country went under a lockdown last year. And this year too, some interesting OTT debuts are being planned. From Ajay Devgn to Shahid Kapoor–take a look at promising web debuts of 2021.",
    "Title": "Anurag Basu pays a tribute to Ajay Sharma"
  },
  {
    "Date": "Thu, 06 May 2021 10:54:50 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/bobby-deol-opens-up-about-reuniting-with-family-for-apne-2/articleshow/82425249.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82425249.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>Director Anil Sharma is bringing together Dharmendra, Sunny and Bobby Deol in the sequel of his 2007 release Apne",
    "Image": "https://static.toiimg.com/thumb/msid-82425230,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-309698/82425230.jpg",
    "Link": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/bobby-deol-opens-up-about-reuniting-with-family-for-apne-2/articleshow/82425249.cms",
    "Text": "It was a treat for the fans of Deols back in 2007, when Dharmendra , Sunny and Bobby appeared together on the big screen in Apne. With the positive response he received back then, director Anil Sharma announced the film’s sequel Apne 2 that reunites the trio.Bobby who in an earlier interaction with BT mentioned that he wished to do a lot more films with his father, has been gung-ho about this film. The current state, due to the pandemic, might have thrown film schedules for a toss, but this hasn’t spoilt the excitement around the project.About the film, Bobby said, “Apne was made long time back, but Apne 2 is being written keeping in mind the view point of the new generation. Having said that, it will have all those elements associated with families and the issues around them.” This time around, the film also stars a new member of the Deol family, Karan, who’s Sunny’s son.Earlier in an interaction with Bombay Times , the director of the film had opened up about the project saying, “This film is an extension to the story of the last one. I must say it is Dharam ji who is most excited about the project. He always thinks ki camera unki mehbooba hai aur woh unhe baar baar bula rahi hai. As far as Karan is concerned, he will be trained under American boxers for the film.”",
    "Title": "Bobby on reuniting with family for Apne 2"
  },
  {
    "Date": "Thu, 06 May 2021 01:00:00 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/vaani-kapoor-for-me-films-are-the-greatest-de-stressor-even-today/articleshow/82407969.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82407969.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>The actress talks about watching movies",
    "Image": "https://static.toiimg.com/thumb/msid-82408132,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-176379/82408132.jpg",
    "Link": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/vaani-kapoor-for-me-films-are-the-greatest-de-stressor-even-today/articleshow/82407969.cms",
    "Text": "Even though she was among the first actresses to step out of her home to start shooting when the COVID19 restrictions were relaxed last year, Vaani Kapoor is now a participant in the waiting game, with the rest of the industry. With stricter norms in place and an escalation in the number of cases, she will have to wait longer to see Bell Bottom and Chandigarh Kare Aashiqui make their way to the cinemas. While she does that, she continues to watch movies and shows like an avid cinema fan in her me-time. Talking about it, Vaani says, “As a child, I used to daydream a lot. I had a protective family, and I led a super sheltered life. My dad and I would watch films together. He loves movies. Sometimes you just love doing things without a reason. Watching films was one of them for him and me. There are so many lives, so many stories and moments that you can live through cinema. It’s one thing that would feel real to me even when I was a kid. It’s the greatest de-stressor even today. With every story I watch, I explore a life that I won’t be able to live in this one lifetime.”Vaani may have spent only seven years in the business, but she has been an ardent follower of cinema and has grown up to acquire a taste for cinema that blends both her parents’ individual choices. “You’ll laugh, but my sister and I would watch The Bold and The Beautiful. It aired at 3 pm in those days. We’d return from school just in time, finish lunch and watch the show with mom. It’s ridiculous for kids to watch such things, but I have fond memories of watching it with my mother and sister. With papa, it was Hindi films, all the way from Seeta Aur Geeta and Guide to Chaalbaaz. We completely enjoyed Madhuri Dixit and Sridevi’s films. Dharmendra is my dad’s favourite hero. I hope that someday I can have my dad meet him. My cousins and I would watch Shah Rukh Khan ’s films - all of them. My mother exposed me to Hollywood films, too. The Bridges of Madison County is my favourite. It could be any genre or actor, I can watch a film if it has great content. My inspirations range from Meryl Streep to Sridevi and Madhuri ma’am.”As an actress in the business, was she ever star-struck when she met some of her matinee idols? “Strangely, I don’t get carried away when I am in their presence,” says Vaani, adding, “I don’t let it affect me in that way. I love to see them. I have not overtly been intimidated in their presence, but I can’t walk up to someone like Shah Rukh Khan and start a conversation on my own. I am a little reserved in that sense. I can stare like a stalker from a distance and appreciate their work on screen. Now, when I am in this profession, I know what we all do is a job. So, I don’t get star-struck.”",
    "Title": "Vaani: Films are the greatest de-stressor"
  },
  {
    "Date": "Thu, 06 May 2021 11:05:29 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/harshvardhan-rane-arranges-oxygen-concentrators-in-hyderabad-through-his-bike-sale/articleshow/82425469.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82425469.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>Harshvardhan Rane recently announced on Instagram that he is planning to trade his motorcycle for oxygen concentrators and do his bit for those in need. Sharing pictures of his mean machine, the actor sought help in Hyderabad and received prompt offers from netizens. Sharing pictures of him with his Royal Enfield bike, Harshvardhan Rane’s post announcing his decision to sell it received a lot of praise from social media users.",
    "Image": "https://static.toiimg.com/thumb/msid-82425469,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-102164/82425469.jpg",
    "Link": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/harshvardhan-rane-arranges-oxygen-concentrators-in-hyderabad-through-his-bike-sale/articleshow/82425469.cms",
    "Text": "Streaming platforms opened up a plethora of opportunities for actors during 2020 and several Bollywood celebrities have swiftly migrated from the big screen to OTT. From Kajol enthralling the audience with her performance in ‘Tribhanga’ to Abhishek Bachchan entertaining fans with ‘The Big Bull’ – Bollywood actors exploded on multiple streaming platforms ever since the country went under a lockdown last year. And this year too, some interesting OTT debuts are being planned. From Ajay Devgn to Shahid Kapoor–take a look at promising web debuts of 2021.",
    "Title": "Harshvardhan arranges oxygen concentrators"
  },
  {
    "Date": "Thu, 06 May 2021 08:36:57 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/radhe-your-most-wanted-bhai-south-korean-stunt-director-myeong-haeng-heo-added-martial-arts-sword-fighting-to-salman-khans-stunts/articleshow/82423635.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82423635.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>Although Salman Khan’s films are known to be high on action scenes, the actor has never dabbled into martial arts, sword fighting and other forms of action in his earlier films and this is exactly what we will be seeing the ‘Dabangg’ star do in ‘Radhe: Your Most Wanted Bhai’.",
    "Image": "https://static.toiimg.com/thumb/msid-82423635,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-866388/82423635.jpg",
    "Link": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/radhe-your-most-wanted-bhai-south-korean-stunt-director-myeong-haeng-heo-added-martial-arts-sword-fighting-to-salman-khans-stunts/articleshow/82423635.cms",
    "Text": "Read Also\n\nAlthough Salman Khan ’s films are known to be high on action scenes, the actor has never dabbled in martial arts sword fighting and other forms of action in his previous films and this is exactly what we will be seeing the ‘Dabangg’ star do in ‘ Radhe : Your Most Wanted Bhai’.According to the latest buzz about the film, fans will see the superstar give his fists a break to take on these martial art forms in ‘Radhe: Your Most Wanted Bhai’. Talking to a news portal about Salman’s stunts in the movie, South Korean stunt director Myeong-haeng Heo reportedly said that he, along with his team watched some of Salman’s previous films and developed a different style for the actor. He added that they have incorporated martial arts, sword fighting and fight sequences with props in the film.Elaborating further, Heo added that Salman too worked with his team to perfect the stunts. According to him, the superstar was also enthusiastic about the new action sequences that they would suggest. He added that they would do a couple of rehearsals with him, and he was adaptive.‘Radhe: Your Most Wanted Bhai’ also stars Disha Patani Jackie Shroff and Randeep Hooda in key roles. The film is slated to release on the occasion of Eid this month.",
    "Title": "Salman to do martial arts in 'Radhe...'"
  },
  {
    "Date": "Thu, 06 May 2021 11:00:00 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/againtallodds-vivan-bhatena-i-had-a-tough-time-moving-from-tv-to-films-i-didnt-have-work-for-5-years/articleshow/82408360.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82408360.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>The actor who was crowned Mr India World in 2001, made his debut with the popular television show ‘Kyunki... Saas Bhi Kabhi Bahu Thi’. After being an eminent face on television for around 7-8 years, Vivan moved to films and has been a part of films like 'Chak De! India', 'Rab Ne Bana Di Jodi', 'Karthik Calling Karthik', 'Judwaa 2', 'Hate Story 4' among many others. Now, the actor is all set to make his web debut with the upcoming MX Player show ‘Ramyug’.",
    "Image": "https://static.toiimg.com/thumb/msid-82408362,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-158577/82408362.jpg",
    "Link": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/againtallodds-vivan-bhatena-i-had-a-tough-time-moving-from-tv-to-films-i-didnt-have-work-for-5-years/articleshow/82408360.cms",
    "Text": "\"I think the image that I have in the industry is changing,\" shares Vivan Bhatena , recollecting the days when people just considered him to be good-looking and not good at acting. The actor who was crowned Mr India World in 2001, made his debut with the popular television show ‘Kyunki... Saas Bhi Kabhi Bahu Thi’. After being an eminent face on television for around 7-8 years, Vivan moved to films and has been a part of films like 'Chak De! India', 'Rab Ne Bana Di Jodi', 'Karthik Calling Karthik', ' Judwaa 2', 'Hate Story 4' among many others. Now, the actor is all set to make his web debut with the upcoming MX Player show ‘Ramyug’. In an exclusive chat with ETimes, he opened up on his journey, the struggles of switching medium, and how he manages to stay relevant in showbiz. Read on:With time, I’ve actually got very levelheaded; I do things that motivate me and inspire me. I've been winning at a very slow pace. I believe that you need to evolve, when you're just going to stagnate. I am saying this because, I have constantly switched careers the moment I felt I was not growing enough. At the end of the day, it's all down to you. And you can't blame anyone for success or failure. It’s important to be part of good projects; do good work and people will remember you. In the end, it's not about the quantity of work that you have, but the quality of work.I was modelling for about three-five years and had got bored of it. It was getting a little stale for me, moving up and down on ramps, changing clothes, were not inspiring me. It wasn't really stable enough for me; I wanted to do something which moved me more. Hence, I started doing theatre, and understanding acting and seeing what I could do on stage really made a lot of difference.I randomly jumped into television, because all my friends were working on some show or the other with Balaji Telefilms . I got ‘Kyunki...Saas Bhi Kabhi Bahu Thi' which just skyrocketed; I found myself doing television for seven years. That gave me a great understanding of acting and let me have my own place in the universe. And then, it got a little stale for me again. So, I moved on. I was reaching almost the top of the ladder and the only name ahead of me was Ronit Roy . I quit and rejected a few offers as it was not taking me anywhere. And at that point in time, there was a sudden shift happening where a lot of people who had worked on television shifted to films and left us with the rejects of small town actors who were very disrespectful and didn't speak very well. I just kind of felt that this is not a place for me anymore.I also lost a lot of work in television. There were many fights that I've gone into for getting the right screen space in television; there were people who were badmouthing me. I couldn’t get work, and eventually, lost a lot of work. But I made sure that it didn’t dampen me. I moved on to films, but yes, I had a very tough time because nobody was willing to give me a part in anything. And for five years, I had to sit at home and do nothing, It was very, very difficult.I lived with my savings. At that time, I had bought a new apartment. It was crazy and the hardest time of my life. But persevered through that and I had my wife’s support. She told me to just stick to it and asked me to hold on. I picked up odd jobs like anchoring just to pay bills and keep moving ahead. Eventually, my patience led me to venture into films. I got some really good projects.People have had massive success in their 40s. So, I'm now hanging in there. Let's see what happens. I’ve already started writing scripts, I’ve been pitching for movies and slowly moving towards direction too. I’ve recently directed an ad film. For me, it's a constant movement, constant evolution. And that's what, life is, for me. I like to live one day at a time. I don’t plan much which keeps me motivated. I like to challenge myself to something new and with things which I have to focus on at the moment.I think the image that I have in the industry is changing. People know that I can act. Young people and younger generation are coming up to me and saying, ‘You’re one of those guys who's good looking and can act’. I don’t know how to respond to that, but I am glad people are actually acknowledging my work (laughs). I am being recognised and that's good. There’s a change and shift that's coming. There's a lot of work that's being done. And OTT is giving people a lot of work. So yes, I’m very happy.But yeah, I find a lot of people complaining of negativity towards Bollywood. But honestly, it's not that bad. I don't know why people make it out to be like this whole hornet's nest, calling out people as evil. Eventually, if you're good at your job, nobody can hold you down.You may lose a little bit of work here, a little bit of work there but eventually, they're going to get bored.‘Sooryavanshi’, which I am hope gets a theatrical release. It’s one of those movies which is meant for the halls. I also have a Telugu film and a few more exciting things to look forward to.",
    "Title": "#AgaintAllOdds! Vivan Bhatena on his journey"
  },
  {
    "Date": "Thu, 06 May 2021 08:19:31 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/laal-singh-chaddha-aamir-khan-to-shoot-war-sequence-in-ladakh-with-a-four-member-team-goes-to-kargil-for-recce/articleshow/82423464.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82423464.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>The shooting of Aamir Khan starrer ‘Laal Singh Chaddha’ in Ladakh was cancelled last year in July after India-China military stand-off in Galwan valley. Now, the actor has headed to Ladakh with a four-member team for a recce.",
    "Image": "https://static.toiimg.com/thumb/msid-82423464,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-507343/82423464.jpg",
    "Link": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/laal-singh-chaddha-aamir-khan-to-shoot-war-sequence-in-ladakh-with-a-four-member-team-goes-to-kargil-for-recce/articleshow/82423464.cms",
    "Text": "Read Also\n\nThe shooting of Aamir Khan starrer ‘ Laal Singh Chaddha ’ in Ladakh was cancelled last year in July after India-China military stand-off in Galwan valley. Now, the actor has headed to Ladakh with a four-member team for a recce.According to a report in a news portal, Aamir has reportedly handpicked a four-member team who flew down to Ladakh with him. The superstar has turned down the idea of creating a set in Mumbai as he feels the war sequences will look grand only when filmed in real locations. The report also added that after Aamir zeroes in on the locations, the shoot will be conducted with minimal crew in the coming months.‘Laal Singh Chaddha’ is an official Hindi adaptation of Hollywood's ‘ Forrest Gump ’ that starred Tom Hanks in the lead role. The film will also star Kareena Kapoor Khan in the lead role. It will reportedly examine India’s political and cultural milestones through the lens of the titular character.",
    "Title": "Aamir to shoot war sequence in Ladakh"
  },
  {
    "Date": "Thu, 06 May 2021 09:14:59 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/ram-gopal-varma-clarifies-irrfan-khan-was-never-considered-for-manoj-bajpayees-role-in-daud/articleshow/82423899.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82423899.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>Recently, an old video interview of Manoj Bajpayee was doing the rounds on social media where he revealed that he was auditioning for a role in Daud with Irrfan Khan and others in the race. However, Ram Gopal Varma has now clarified that Irrfan was never considered for that role.",
    "Image": "https://static.toiimg.com/thumb/msid-82423899,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-751359/82423899.jpg",
    "Link": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/ram-gopal-varma-clarifies-irrfan-khan-was-never-considered-for-manoj-bajpayees-role-in-daud/articleshow/82423899.cms",
    "Text": "Read Also\n\nRecently, an old video interview of Manoj Bajpayee was doing the rounds on social media where he revealed that he was auditioning for a role in Daud with Irrfan Khan and others in the race. However, Ram Gopal Varma has now clarified that Irrfan was never considered for that role.Taking to his Twitter handle, the filmmaker revealed that he never registered Irrfan Khan for the role and he only saw the late actor much later on a set.He wrote, ‘Just to set the record straight I was meeting quite a few actors at that time and Manoj caught my eye because of Bandit Queen ..I never registered Irrfan and I consciously remembered seeing him only much later when he came to the set of some other shoot.’In the interview, Manoj reportedly stated that Kannan Iyer, who made ‘Ek Thi Daayan’, was assisting Shekhar Kapur in ‘Bandit Queen’. He was writing the ‘Daud’ movie for Ram Gopal Varma. According to Manoj, Kannan told him Irrfan and Vineet Kumar have also been asked to come for the auditions. Kannan also told Bajpayee that they will pay him Rs 35,000 for that role. It starred Urmila Matondkar and Sanjay Dutt in the lead roles.‘Daud’ starred Sanjay Dutt and Urmila Matondkar in lead roles. It also featured Manoj Bajpayee and Paresh Rawal in key roles.",
    "Title": "RGV: Never considered Irrfan Khan for 'Daud'"
  },
  {
    "Date": "Thu, 06 May 2021 10:14:58 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/did-you-know-mujhse-dosti-karoge-child-artist-barkha-singh-who-played-young-kareena-kapoor-khan-is-all-grown-up-now/articleshow/82424785.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82424785.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>Time sure does fly! Child actor Barkha Singh, who played young Kareena Kapoor Khan in ‘Mujhse Dosti Karoge’ is all grown up now and looks absolutely stunning. In a recent interview, the actress opened up about auditioning for the role.",
    "Image": "https://static.toiimg.com/thumb/msid-82424785,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-605127/82424785.jpg",
    "Link": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/did-you-know-mujhse-dosti-karoge-child-artist-barkha-singh-who-played-young-kareena-kapoor-khan-is-all-grown-up-now/articleshow/82424785.cms",
    "Text": "Read Also\n\nTime sure does fly! Child actor Barkha Singh, who played young Kareena Kapoor Khan in ‘ Mujhse Dosti Karoge ’ is all grown up now and looks absolutely stunning. In a recent interview, the actress opened up about auditioning for the role.Talking to a news portal, Barkha revealed that the audition process for the role wasn’t easy as she was chosen amongst 600 to 700 children. She also added that people still refer to her as young Kareena and she is actually not surprised that they remember. They even say that her face is still the same, although she admits she doesn’t know if she should take it as a compliment.Although Barkha did not take up many projects as a child artist in films, she eventually found her way back to the industry when she grew up. She has been a part of a number of web series so far.‘Mujhse Dosti Karoge’ starred Kareena Kapoor Khan, Hrithik Roshan Rani Mukerji and Uday Chopra in lead roles. The movie was loved by the audience and had some chartbuster songs.",
    "Title": "Barkha on playing young Kareena's role"
  },
  {
    "Date": "Thu, 06 May 2021 05:56:18 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/05/pandu.jpg",
    "Link": "https://indianexpress.com/article/entertainment/tamil/tamil-comedy-actor-pandu-dies-of-covid-19-at-74-7303972/",
    "Text": "Popular comedy actor Pandu passed away on Thursday due to Covid-19 related complications. He and his wife Kumudha had tested positive for the virus recently and were admitted to a private hospital. His condition deteriorated on Thursday morning and he breathed his last at the hospital. He was 74.\n\nPandu is a household name among Tamil movie fans. He joined the film industry following in the footsteps of his brother, Idichapuli Selvaraj, who was also a well-known comedian in the industry. Before joining show business, he was pursuing his interest in painting. It is noteworthy that he played a vital role in designing the flag of the AIADMK party, which was founded by matinee icon MG Ramachandran.\n\nPandu made his screen debut in the 1970s. And he went onto work with leading stars and directors spanning three generations. He has shared screen space with titans like MGR and Sivaji Ganesan and went on to work with Kamal Haasan and Rajinikanth. He has also worked with Vijay and Ajith. One of his noted roles was in the romantic drama, Kadhal Kottai. He played the sidekick to Ajith’s character in the film, which was released in 1996. The film was a huge box office hit and became a pop culture sensation at the time, establishing him as an actor.\n\nPandu’s other memorable role was in Vijay’s blockbuster film, Ghilli. In the 2004 action film, he played the role of a cop, and was appreciated for his performance.\n\nAlso Read | Tamil director-cinematographer KV Anand dies at 54\n\nHe is also known for his roles in films like Gokulathil Seethai, Kaalamellam Kadhal Vaazhga, Mannava, Vaali, Poomagal Oorvalam, Jodi, James Pandu, Badri among others.\n\nAlso Read | Tamil film director Thamira passes away due to Covid-19\n\nPandu is the third member of the Tamil film fraternity to succumb to the virus in the last few weeks. Recently director Thamira and KV Anand had also died of Covid-19. Pandu is survived by his wife and three sons, Pintu, Prabhu and Panju.",
    "Title": "Tamil comedy actor Pandu dies of Covid-19 at 74"
  },
  {
    "Date": "Thu, 06 May 2021 03:38:48 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/05/ramyug-first-impression-.jpg",
    "Link": "https://indianexpress.com/article/entertainment/web-series/ramyug-first-impression-kunal-kohli-mx-player-7303122/",
    "Text": "“The audience is very smart and will not accept everything that is dished out to them. However extravagant the product may be, they want to relate to it before accepting it wholeheartedly. Even if it is a remake, they want it to be at par or above the original, which rarely happens. Many times, it is done when the makers are fascinated or like a particular film and think they can make it better than the first one.”\n\nActor-director Satish Kaushik’s words ring true whenever a remake of a classic is on the anvil. That happened when Ramyug, which streams on MX Player starting today, was announced. Filmmaker Kunal Kohli wanted to “breathe life” into the story of Lord Rama for “younger audiences on an unparalleled scale.”\n\nMuch before the release of the magnum opus, the makers created hype by releasing its song “Jai Hanuman” in the voice of Amitabh Bachchan, with Ustad Zakir Hussain at the tabla. The actors of the 1986 original – Arun Govil, Dipika Chikhlia and Sunil Lahri – amplified the series.\n\nOver the years, we have watched multiple versions of Ramyana — from Ramanand Sagar’s TV show to Siya Ke Ram on Star Plus (2013) and Gurmeet Chaudhary-Debina Bonnerjee starrer on NDTV Imagine. Kunal Kohli’s modernised version gets its target audience right as it is youth-oriented in its approach, but that is served along with awful CGI, ghastly acting and cringeworthy modification of the original.\n\nFrom a web series that is mounted on such a large scale with probably a lot of money spent on the visual effects, the least you’d expect is that it would look picturesque. But, what you get instead is a lot of greenscreen work, which doesn’t blend with the human drama. Even the action sequences look clumsy.\n\nThe storytelling of Ramyug is disappointing as it proceeds in a non-linear manner. Lord Rama, Sita and Lakshman are in the jungle but it takes until the third episode to understand the ‘how’ and ‘why’ behind it. In one of the scenes, when we meet Ravana for the first time, we see his ten heads circling and talking to him. Instead of adding to the impact of the scene and the persona of this crucial character, Ravana’s introduction seems comic.\n\nView this post on Instagram A post shared by Akkshay A Dogra (@iakshaydogra)\n\nBut that’s the challenge with replicating an epic, the comparisons are inevitable and sometimes unfair. If you are tuning to Ramyug just after watching the rerun of Ramanand Sagar’s original on Doordarshan, chances are you will miss the warmth, divinity and calmness of Ram brought to the character by Arun Govil. Here, Ram, played by Diganth Manchale, is not a divine figure. Rather, he has a chiselled physique who belongs to this era. Even Sita is not the serene figure that Dipika Chikhlia brought to life. But I wish actor Aishwarya Ojha would have taken a lesson or two on acting from her counterpart. Kabir Singh Dohan also fails to create that sinister aura of Ravana. It is only Vivaan Bhatena (Hanuman) and Akshay Dogra (Lakshman) who do justice to their roles.\n\nIn my opinion, if you are in a mood to indulge in some nostalgia or want your kids to revel in the mythological drama, choose between the 1986 Ramayan and Siya Ke Ram (2013). Hoping Ramyug gets on track in the remaining five episodes.",
    "Title": "Ramyug first impression: Kunal Kohli’s retelling of Lord Ram’s story misses the mark"
  },
  {
    "Date": "Thu, 06 May 2021 06:10:58 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/05/sriprada.jpeg",
    "Link": "https://indianexpress.com/article/entertainment/bollywood/sriprada-dies-due-to-covid-19-complications-7303985/",
    "Text": "Bollywood and Bhojpuri actor Sriprada has passed away due to Covid-19 complications.\n\nCINTAA General Secretary Amit Behl told The Times of India, “The second wave of covid has taken too many precious lives. What has already been written in the media about the people who have passed away don’t need to reiterate but yes Sripada was a senior member of our fraternity.”\n\nAmit further told the publication, “She has done incredible work down South and as well as in Hindi cinema. It is very unfortunate that we have lost a very senior actress. We pray that her soul rests in peace. We also pray that the second wave of the pandemic doesn’t snatch too many precious lives especially from our trade.”\n\nSriprada worked with Bhojpuri film star Ravi Kishan in the 2015 film Hum To Ho Gayi Ni Tohar. She worked in a few south films and television shows as well.\n\nSome of the popular films that she featured in include Batwara, Dharam Sankat, Umar 55 Ki Dil Bachpan Ka, Reshma, among others.",
    "Title": "Actor Sriprada dies due to Covid-19 complications"
  },
  {
    "Date": "Thu, 06 May 2021 04:49:23 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/05/kim-kardashian.jpg",
    "Link": "https://indianexpress.com/article/entertainment/hollywood/kim-kardashian-denies-importing-stolen-roman-sculpture-7303923/",
    "Text": "Kim Kardashian has ended up at the centre of an illegal art smuggling row after an ancient Roman sculpture was imported in her name to California. The US officials claim that the statue was stolen from Italy.\n\nAs per AFP, the court documents list the importer name “Kim Kardashian dba Noel Roberts Trust in Woodland Hills, California.” An invoice states, “for the sale of the defendant statue by Vervoordt to Noel Robert Trust, dated March 11, 2016.” The Noel Roberts Trust is linked to Kim Kardashian and her estranged husband Kanye West’s real estate purchases in the US, as per the report.\n\nKim has, however, denied purchasing the sculpture. A spokesperson for Kardashian told CNN, “We believe that it may have been purchased using her name without authorisation and because it was never received (and) she was unaware of the transaction. We encourage an investigation and hope that it gets returned to the rightful owners.”\n\nArt dealer and interior designer Axel Vervoordt, named in the court papers, has worked with Kardashian and West on many of their properties, as per CNN.\n\nReferred to as ‘Fragment of Myron Samian Athena’, the statue is said to be from the early-to mid-Roman Empire. The report states that it was seized in May 2016 “as part of a larger 5.5-ton (5,000 kg) shipment worth $745,000.” The suspicion under which it was seized was “protected cultural property from Italy.”",
    "Title": "Kim Kardashian denies importing stolen Roman sculpture, spokesperson says it was purchased ‘using her name without authorisation’"
  },
  {
    "Date": "Thu, 06 May 2021 02:50:17 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/05/iulia-vantur-seeti-maar-radhe-1200.jpg",
    "Link": "https://indianexpress.com/article/entertainment/bollywood/iulia-vantur-on-singing-seeti-maar-radhe-salman-khan-disha-patani-allu-arjun-zoom-zoom-7302837/",
    "Text": "Singer Iulia Vantur says Salman Khan and Disha Patani’s performance on “Seeti Maar” in Radhe: My Most Wanted Bhai is amazing. Iulia, who has voiced the song along with Kamaal Khan, however, says making a new version of an existing chartbuster was a challenge.\n\n“Seeti Maar” has been recreated from the song by the same name from Telugu film, DJ: Duvvada Jagannadham, starring Allu Arjun and Pooja Hegde. In an interview with indianexpress.com, Iulia spoke about how she came on board Radhe and why the mixed response to the “Seeti Maar” song is normal.\n\n“Of course, the song has been a huge hit in the south, so the challenge was even bigger to bring something new. Kamaal Khan has changed his voice completely for the song. There’s the risk of audience not accepting the new version. But, the whole team has done an amazing job. They’ve managed to give a version, as good (as the original),” Iulia said in the exclusive interview.\n\nSpeaking about the critical reception that the song received, Iulia added, “Considering this song was made a huge hit by Allu Arjun, so obviously people would get emotionally attached to it. Also, you can’t satisfy everyone, the tastes are different. That’s why music has so many genres.”\n\nThere’s however a section of listeners that is swearing by “Seeti Maar”. So much so, that it is nearing 92 million views on YouTube.\n\nHow much credit would Iulia give to the lead pair of Radhe, for the success of the song? “Salman and Disha’s moves are amazing. People love Salman’s songs, his hook steps. They are very catchy, popular and easy to follow, that’s the beauty. And he always comes up with something totally unexpected, interesting and funny. You just have to follow it. Of course, everyone including the music composer, choreographer, actors and dancers has put their efforts,” the singer said.\n\nIulia also revealed that it was her test recording of the song for music composers Sajid-Wajid, which got incorporated in the final version. “Sajid used to give me different songs to practice and to test my voice. Later he called me and said he’s sent my recording to composer Devi Sri Prasad, who has liked my voice and will keep it in the movie. Honestly, when I recorded the song, I thought it will be a test practice. And I’ll get more time to practice. It was super unexpected for me,” she said.\n\nIulia, however, laughed off when asked how she reacts when some people say that Salman Khan still promotes her in Bollywood. “I feel blessed that I sing in Bollywood. The fact that I have someone to advice me from the music industry and Bollywood, again, is a big blessing. But, sometimes, you have to put much more to prove that you worked being in that place. Everyone’s journey comes with plus and minus.”\n\n“There are songs where you feel the pressure of singing it right. There are many songs that I recorded, which aren’t out yet. There are songs which didn’t suit my voice, my style. Not all the songs see the light,” she added.\n\nIulia has also crooned “Zoom Zoom” in Radhe, which is yet to release. “That’s again a very good song. I loved it. It’s more teasing, playful and romantic. I feel it’s catchy,” Iulia revealed.\n\nRadhe, also starring Randeep Hooda and Jackie Shroff, is set to have a simultaneous release on theatre and ZEE5’s pay per view platform ZeePlex on May 13, coinciding with Eid.",
    "Title": "Iulia Vantur on singing ‘Seeti Maar’ in Radhe: ‘Salman Khan always comes up with something unexpected, you just have to follow it’"
  },
  {
    "Date": "Thu, 06 May 2021 03:39:05 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/05/Steven-Soderbergh-1200by667.jpg",
    "Link": "https://indianexpress.com/article/entertainment/hollywood/steven-soderbergh-accepts-chadwick-boseman-nomination-was-the-reason-why-oscars-show-order-was-changed-7303815/",
    "Text": "Oscars producer Steven Soderbergh does not regret his decision to switch the awards order at the ceremony, a decision that has attracted a lot of criticism. The ceremony usually ends with the announcement of best picture winner but this year, it ended with best actor winner announcement, which went to Anthony Hopkins.\n\nWith the 83-year-old actor not in attendance and the producers not allowing Zoom acceptance speeches, many felt that the switch did not come off well for the pandemic era Oscars.\n\nSoderbergh, however, is not too concerned. “So the goal was to really do something different and let the academy sift through the response and decide what they would do going forward,” Soderbergh told the Los Angeles Times in an interview.\n\nThe director had not allowed zoom acceptance speeches into the ceremony, which ended on a down note with the best actor winner Anthony Hopkins not there to accept his trophy in person.\n\nHopkins win for The Father had come as a surprise to many as fans were expecting a posthumous win for late Chadwick Boseman for Ma Rainey’s Black Bottom. When asked by the Times that, in hindsight, he would rethink the decision to prohibit attendance via Zoom. Soderbergh said, “No.”\n\nThe director, however, said the decision to not end the show with the standard best picture award was out of a respectful conscience.\n\n\n\n“We thought it might be fun to mix it up, especially if people didn’t know that was coming,” Soderbergh said.\n\n“So that was always part of the plan. And then when the nominations came out and there was even the possibility that Chadwick could win posthumously, our feeling was if he were to win and his widow were to speak on his behalf, there would be nowhere to go after that. So we stuck with it.”",
    "Title": "Steven Soderbergh accepts Chadwick Boseman’s nomination was the reason why Oscars show order was changed"
  },
  {
    "Date": "Thu, 06 May 2021 05:56:43 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/05/arijit-singh-1200.jpg",
    "Link": "https://indianexpress.com/article/entertainment/music/arijit-singhs-mother-hospitalised-dil-bechara-actor-swastika-mukherjee-shares-news-7304023/",
    "Text": "Dil Bechara actor Swastika Mukherjee on Thursday morning shared an Instagram post, informing that A- blood group donors are needed for popular singer Arijit Singh’s mother. The well-known Bengali actor captioned her post, “Urgent SOS SOS.”\n\n“Need A- blood for singer Arijit Singh’s mother, admitted in Amri Dhakuria. Need it today. Pls contact @swatihihihi with verified MALE DONORS (sic),” read the actor’s complete post.\n\nView this post on Instagram A post shared by Swastika Mukherjee (@swastikamukherjee13)\n\nShared only sometime ago on her Instagram handle, the post has been receiving multiple comments, with people asking her to share any contact number, and the exact location that Swastika might have.\n\nDirector Srijit Mukherjee had also requested people to help Arijit in this challenging time. The filmmaker’s tweet was posted in Bengali, “#Copied. Need A– donor for singer Arijit Singh’s mother in Dhakuria Amri tomorrow. Interested blood donors can contact Nitasha on 801719747647.”\n\nSinger Arijit Singh’s career kicked off when he first participated in the singing reality show Fame Gurukul in 2005. However, fame didn’t reach to him until his romantic ballad “Tum Hi Ho” struck a chord with the listeners. Since then, Arijit has gone on to sing for a number of popular movies with big stars. For his work in the playback singing field, Arijit has won a National Award and six Filmfare awards in total.\n\nArijit Singh recently turned a music composer with the Netflix movie Pagglait, which featured Sanya Malhotra in the lead role.",
    "Title": "Arijit Singh’s mother hospitalised, Swastika Mukherjee and Srijit Mukherjee request for help: ‘Urgent SOS’"
  },
  {
    "Date": "Thu, 06 May 2021 05:02:08 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/05/neetu-kapoor-do-kaliyaan-1200.jpg",
    "Link": "https://indianexpress.com/article/entertainment/bollywood/neetu-kapoor-says-put-a-lot-of-actor-in-do-kaliyaan-as-child-actor-alia-bhatt-mother-soni-razdan-responds-7303851/",
    "Text": "Do Kaliyaan released in 1968, when Neetu Kapoor was 10-year-old. (Photo: Neetu Kapooor/Instagram)\n\nVeteran actor Neetu Kapoor was already a successful child artiste before she made her debut as a leading actor in Rickshawala (1973). Many might remember her younger self for her innocent roles and mischievous smile. But, Kapoor has a different way of looking back at her work as a child actor.\n\nIn an Instagram post, she shared a clip from the song “Murga Murgi Pyar Se Dekhe” from her hit film Do Kaliyaan (1968). Neetu took note of the amount of make-up she had to use back then, even at the age of 10. “#dokaliyan thopoed a lot of make up though,” wrote Neetu along with the video, sung by Lata Mangeshkar.\n\nView this post on Instagram A post shared by neetu Kapoor. Fightingfyt (@neetu54)\n\nDo Kaliyaan is a remake of Tamil movie Kuzhandaiyum Deivamum, which was an adaptation of The Parent Trap (1961). It also starred Biswajeet and Mala Sinha, and had Neetu in a double role of daughters Ganga and Jamuna.\n\nHer Instagram post received reactions from several B-town celebs. While daughter Riddhima Kapoor Sahni called her “cutest”, Saba Ali Khan Pataudi commented, “My favourite movie Neetu aunty. Do kaliyan…. addict back then lol …stay safe.”\n\nSoni Razdan also wrote, “Omg. You haven’t changed a bit you know ! Cute then and now.” Others who commented included Pakistani actor Mawra Hocane who believes her granddaughter Samara is a reflection of Neetu’s expressions. She wrote, “So cute Neetu aunty!! Samara gives the same expressions now! Haha.”\n\nView this post on Instagram A post shared by neetu Kapoor. Fightingfyt (@neetu54)\n\nNeetu had last month too, taken a jibe at her song “Tere Chahne Wale Aaye Hain” from Aatish (1979). Posting a clip, she wrote, “I always wondered why I was made to look like a bird.”\n\nHaving worked in over half a dozen films during childhood, Neetu was already a popular face before she did Rickshawala. Her work as child artiste includes movies like Suraj, Dus Lakh, Waris, Ghar Ghar Ki Kahani and Pavitra Paapi.\n\nNeetu made her Bollywood debut in the main lead at the age of 15 and went on to star with almost all the mainstream male actors of 1970s. Her onscreen pairing with Shashi Kapoor, Rajesh Khanna and late husband Rishi Kapoor were among the most successful ones.\n\nAlso read | Rishi Kapoor death anniversary: The Kapoor who kept on getting better with age\n\nNeetu, however, retired early at the age of 22 and tied the knot with Rishi Kapoor. She later made a comeback with Love Aaj Kal (2009). She went on to do Do Dooni Chaar, Jab Tak Hai Jaan and Besharam.\n\nHer upcoming film is Jug Jugg Jeeyo, alongside Anil Kapoor, Varun Dhawan and Kiara Davani.",
    "Title": "Neetu Kapoor says she put a lot of makeup as child actor in Do Kaliyaan, Soni Razdan responds"
  },
  {
    "Date": "Thu, 06 May 2021 02:50:21 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/05/watch1200.jpg",
    "Link": "https://indianexpress.com/article/entertainment/web-series/what-to-watch-on-may-6-ramyug-hai-taubba-and-monster-hunter-7303004/",
    "Text": "Perhaps nothing is safer and more reassuring right now than knowing all your loved ones are keeping well. And if you are one of the lucky ones who is staying with a well-wisher, then nothing can be more comforting than watching some of the latest fun titles from around the world on your personal device. Today, we bring you interesting titles on popular streaming platforms. Are you ready for your daily dose of escapist drama?\n\nFrom Kunal Kohli’s highly anticipated MX Player series Ramyug to the ‘monster movie’ Monster Hunter, here’s everything you can stream on May 6.\n\nRelease Date Title Platform Language May 6 Ramyug MX Player Hindi May 6 Hai Taubba ALTBalaji Hindi May 6 And Tomorrow the Entire World Netflix German May 6 Monster Hunter BookMyShow Stream English, Hindi, Tamil, Telugu\n\nRamyug: MX Player\n\nFilmmaker Kunal Kohli is here with his take on the epic Ramayan, told with new eyes and some mind-boggling visual effects. The series features the likes of Tisca Chopra, Dalip Tahil, Anup Soni and Vivan Bhaten in significant parts. Kohli had earlier shared his excitement about bringing such a beloved tale on screen once again.\n\nHe said, “The story of Rama has been retold by some of India’s greatest writers both in Sanskrit and regional languages. I am honoured to have been able to breathe life into this narrative for younger audiences on an unparalleled scale with the help of in-depth writing, VFX, visually appealing direction, editing and post-production efforts.”\n\nAlso Read | Monster Hunter review: A mindless video game adaptation\n\nMonster Hunter: Book My Show stream\n\nDespite action stars like Tony Jaa and Milla Jovovich, Monster Hunter doesn’t always live up to its potential, or even to the original source material (Monster Hunter is a video game adaptation). However, what it does offer is plenty of visual effects and good action choreography. Don’t go in hoping for an engaging plot, and you might just end up having a blast.\n\nAnd Tomorrow the Entire World: Netflix\n\nAnd Tomorrow the Entire World was Germany’s entry for 2021 Oscars in the Best International Feature category. The official synopsis of the movie reads, “20-year-old law student Luisa, who comes from an upper-class family, joins Antifa because she is opposed to the rise of the political right in Germany. The plot is partly inspired by the biography of director Julia von Heinz, who belonged to Antifa herself when she was younger. The political design of the movie’s right-wing Liste 14 party is also a reference to that of the Alternative for Germany.”\n\nHai Taubba: ALTBalaji\n\nAnd if you have nothing better to do today, head over to ALTBalaji for an erotic drama titled Hai Taubba. It is an anthology of four stories dealing with ‘taboo love’.",
    "Title": "What to watch on May 6: Ramyug, Hai Taubba and Monster Hunter"
  },
  {
    "Date": "Thu, 06 May 2021 04:20:23 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/05/Dillon-Buss-and-Tallulah-Willis-1200by667.jpg",
    "Link": "https://indianexpress.com/article/entertainment/hollywood/bruce-willis-and-demi-moore-daughter-tallulah-willis-engaged-to-dillon-buss-7303890/",
    "Text": "Dillon Buss and Tallulah Willis announced their engagement on Instagram. (Photo: dillonbuss/Instagram)\n\nActor Tallulah Willis has announced her engagement to boyfriend and budding filmmaker Dillon Buss. Tallulah Willis, the youngest daughter of Hollywood veterans Bruce Willis and Demi Moore, shared the news on Instagram Tuesday.\n\nThe Whole Ten Yards actor posted a series of photos on her official account in which Buss can be seen getting down on one knee.\n\nShe wrote that she accepts his hand in marriage “with absolute most certainty”.\n\nView this post on Instagram A post shared by tallulah (@buuski)\n\nBuss also shared several photos on his page in the honour of their Star Wars Day engagement date.\n\n“I can finally call you my fiance. Love you forever Buuski Lu, you are my best friend. #maythefourthbewithus,” he wrote.\n\nView this post on Instagram A post shared by 𝐷𝑖𝑙𝑙𝑜𝑛 (@dillonbuss)\n\nTallulah Willis later shared a close-up video of her emerald-cut engagement ring.\n\n\n\n“HANDS STILL SHAKIN’ – MOMS SPAGHETTI – I’m FIANCENCHED (sic)” she wrote.\n\nView this post on Instagram A post shared by tallulah (@buuski)\n\nAlthough it is unclear when the couple started dating, they made their relationship internet official last February.",
    "Title": "Bruce Willis and Demi Moore’s daughter Tallulah Willis engaged to Dillon Buss"
  },
  {
    "Date": "Thu, 06 May 2021 03:20:55 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/05/lucky-ali-fb.jpeg",
    "Link": "https://indianexpress.com/article/entertainment/music/lucky-ali-quashes-death-rumours-resting-in-peace-at-home-instagram-7303812/",
    "Text": "After veteran actor Nafisa Ali quashed rumours of Lucky Ali’s death on Twitter, the singer took to Instagram on Wednesday and issued a statement.\n\n“Hi everyone, just addressing the rumours. I’m alive and well and resting in peace at home. Haha. Hope you all are staying in and staying safe. May God protect us all during this devastating time,” he shared in an Instagram story.\n\nLucky Ali addressed the death rumours on Instagram. (Photo: Lucky Ali/Instagram) Lucky Ali addressed the death rumours on Instagram. (Photo: Lucky Ali/Instagram)\n\nThe rumours of the “O Sanam” singer passing away started doing the rounds on Tuesday. Soon after, Nafisa took to Twitter and wrote, “Lucky is totally well and we were chatting this afternoon. He is on his farm with his family. No Covid. In good health.”\n\nView this post on Instagram A post shared by Nafisa Ali Sodhi (@nafisaalisodhi)\n\nShe told The Times of India, “I chatted with Lucky Ali 2-3 times today. He is fine. He does not have COVID. In fact, he has antibodies. He is busy planning his music and concerts. We were talking about virtual concerts happening and all such things. He is on his farm in Bengaluru and his family is there with him. I just spoke to him, everybody is fine.”\n\nIn December 2020, a video of Lucky’s performance at a local Goan restaurant went viral on social media. Nafisa had shared the video on her social media and shared that the performance was shot at Arambol in North Goa.",
    "Title": "Lucky Ali quashes death rumours: ‘Resting in peace at home’"
  }
]