[
  {
    "Date": "Thu, 06 May 2021 09:58:07 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/india/us-vp-kamala-harris-to-deliver-message-of-solidarity-with-people-of-india-on-friday/articleshow/82424525.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82424525.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>Vice President Kamala Harris on Friday will deliver a message of solidarity with the people of India, as the US partners with the country to save lives and hasten the end of the coronavirus pandemic, the State Department has said. Harris is slated to deliver her address at the top of an online event “Bolstering US CovidRelief Efforts in India: Perspectives from the Diaspora” organised by the State Department.",
    "Image": "https://static.toiimg.com/thumb/msid-82424515,width-1070,height-580,imgsize-68720,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/india/us-vp-kamala-harris-to-deliver-message-of-solidarity-with-people-of-india-on-friday/articleshow/82424525.cms",
    "Text": "Harris is slated to deliver her address at the top of an online event “Bolstering US Covid Relief Efforts in India: Perspectives from the Diaspora” organised by the State Department.\n\nWASHINGTON: Vice President Kamala Harris on Friday will deliver a message of solidarity with the people of India, as the US partners with the country to save lives and hasten the end of the coronavirus pandemic, the State Department has said.\n\nHarris is slated to deliver her address at the top of an online event “Bolstering US CovidRelief Efforts in India: Perspectives from the Diaspora” organised by the State Department.\n\nHarris, 56, is the first woman, the first Black American, and the first South Asian American to be elected US Vice President.\n\n“Kamala Harris will provide an opening message on US solidarity with the people of India as we partner to save lives & hasten the end of the pandemic,” the South and Central Asia Bureau of the State Department announced on Wednesday.\n\nThe event on Friday noon local time will be hosted by Ervin Massinga, senior advisor in the South and Central Asia Bureau of the State Department.\n\nMassinga will provide an overview of the US government's relief efforts and panelists will discuss commercial and civil society-led efforts to address the current emergency, what support will be needed to re-open India after the second wave, and how they can align efforts to bring the two countries closer together moving forward.\n\nHarris's remarks would be followed by a panel discussion featuring diaspora leaders including Virginia State Senator Ghazala Hashmi; Lata Krishnan from American Indian Foundation; Indiaspora founder M R Rangaswami and Gunisha Kaur, Assistant Professor at Weill Cornell Medicine , Medical Director, Weill Cornell Center for Human Rights.\n\n",
    "Title": "US VP Kamala Harris to deliver message of solidarity with people of India on Friday"
  },
  {
    "Date": "Thu, 06 May 2021 11:16:21 IST",
    "Description": "The Union home ministry has formed a four-member fact finding team to look into reasons for the post poll violence in West Bengal and also assess the ground situation in the state, officials said on Thursday. The team, led by an additional secretary of the ministry, has left for the state.",
    "Image": "https://static.toiimg.com/thumb/msid-47529300,width-1070,height-580,imgsize-110164,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/india/mha-forms-four-member-team-to-probe-post-poll-violence-in-west-bengal/articleshow/82425632.cms",
    "Text": "NEW DELHI: The Union home ministry has formed a four-member fact finding team to look into reasons for the post poll violence in West Bengal and also assess the ground situation in the state, officials said on Thursday.\n\nThe team, led by an additional secretary of the ministry, has left for the state.\n\nOn Wednesday, the ministry had sent a terse reminder to the West Bengal government to submit a detailed report on the post-poll violence and to take necessary measures to stop such incidents \"without any loss of time\".\n\nAt least six people were killed in post-poll violence in different parts of the state till Tuesday.\n\n\n\nFacebook Twitter Linkedin EMail",
    "Title": "MHA forms four-member team to probe post poll violence in West Bengal"
  },
  {
    "Date": "Thu, 06 May 2021 11:13:54 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/india/british-airways-flies-aircraft-with-emergency-aid-to-delhi/articleshow/82425589.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82425589.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>British Airways on Thursday said it operated a Boeing 777-200 aircraft carrying emergency aid, including oxygen cylinders and concentrators, to Delhi amid the country battling with rising coronavirus cases.",
    "Image": "https://static.toiimg.com/thumb/msid-82425656,width-1070,height-580,imgsize-76158,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/india/british-airways-flies-aircraft-with-emergency-aid-to-delhi/articleshow/82425589.cms",
    "Text": "Representative Image. (Reuters)\n\nMUMBAI: British Airways on Thursday said it operated a Boeing 777-200 aircraft carrying emergency aid , including oxygen cylinders and concentrators, to Delhi amid the country battling with rising coronavirus cases.\n\nWhile IAG Cargo and British Airways have maintained a vital air link between London and India throughout the pandemic and sending aid on scheduled flights, this airlift was done through a special charter. It was fully funded by the two companies, according to a release.\n\nBritish Airways said it commissioned a special project team to organise the flight (BA257F), which landed in Delhi at 5:45am (local time) on Thursday.\n\nThe aircraft was loaded with more than a thousand items from the Indian High Commission and charities. It included hundreds of urgent life-saving oxygen cylinders and shipments of oxygen concentrators, respirators, and blood oxygen saturation monitors.\n\nBesides, the airline is donating care packages for families in need.\n\n\"The British Airways family has been deeply affected by the terrible scenes in India of the deepening humanitarian crisis that has impacted the lives of many of our people. We are fortunate to be in a position to help transport aid and I am so proud of the volunteers from across the airline and IAG Cargo who have stepped up to make this happen,\" British Airways' CEO Sean Doyle said.\n\nHe said British Airways will continue to stand with its friends in India as the country endures one of the \"worst crises\" it has ever known.\n\nBritish Airways is working in partnership with the Disasters Emergency Committee (DEC), which is organising the UK's humanitarian response.\n\nDEC's CEO Saleh Saeed said DEC brings together 14 leading UK aid charities to respond quickly and effectively to disasters, with the fantastic support of partners in the corporate sector, including British Airways.\n\n\"We are hugely grateful to British Airways for springing into action to support our emergency appeals, enabling us to provide life-saving humanitarian assistance to people in India and elsewhere across the world when disaster strikes,\" he added.",
    "Title": "British Airways flies aircraft with emergency aid to Delhi"
  },
  {
    "Date": "Thu, 06 May 2021 07:53:55 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/india/us-supplies-of-vaccine-components-to-india-to-enable-manufacturing-of-two-crore-doses-of-covishield/articleshow/82423264.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82423264.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>The US on Wednesday said the vaccine components it has supplied to India this week will enable the manufacturing of two crore doses of the Covishield vaccine even as the sixth shipment of American medical aid arrived as part of the Biden administration's assistance to the country's response to a rising number of Covid-19 cases.",
    "Image": "https://static.toiimg.com/thumb/msid-82423254,width-1070,height-580,imgsize-100026,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/india/us-supplies-of-vaccine-components-to-india-to-enable-manufacturing-of-two-crore-doses-of-covishield/articleshow/82423264.cms",
    "Text": "The United States also sent a separate shipment of over 81,000 vials of Remdesivir injections that was delivered in Mumbai.\n\nNEW DELHI: The US on Wednesday said the vaccine components it has supplied to India this week will enable the manufacturing of two crore doses of the Covishield vaccine even as the sixth shipment of American medical aid arrived as part of the Biden administration's assistance to the country's response to a rising number of Covid-19 cases.\n\nThe United States also sent a separate shipment of over 81,000 vials of Remdesivir injections that was delivered in Mumbai.\n\nAs India continues to reel under a record-breaking wave of the coronavirus infection, the European Union (EU) announced an initial Euro 2.2 million (approximately Rs 19 crore) in emergency funding to support the World Health Organization 's (WHO) measures to curb the spread of the coronavirus in the country.\n\nThe 27-nation grouping said the funding announced by the European Commission is in addition to the medical assistance being provided to India by the EU member states.\n\n\"Today, the commission has announced that it will allocate an initial Euro 2.2 million in emergency funding to respond to the drastic surge in Covid-19 cases in India,\" the EU said.\n\n\"The funding will support the World Health Organization (WHO) for a six-month case management of Covid-19 patients as well as for strengthening the laboratory capacity for Covid-19 testing,\" it said.\n\nIn line with its announcement to support India in its fight against the pandemic, the US delivered the sixth shipment of its aid on Wednesday.\n\n\"The American people continue to deliver life-saving assistance to India, with the 6th flight of emergency relief in 6 days! This shipment includes a climate-friendly oxygen generation unit which can turn air into oxygen. Thanks to the people of California!\" the US embassy said in a tweet.\n\nSeparately, US Chargé D'Affaires in India Daniel B Smith said both the countries will together defeat the pandemic.\n\n\"The #USIndia partnership involves all aspects of the relationship: government, business, and people. This week, vaccine components arrived in India from the U.S. that will enable the manufacturing of 20 million doses of the Covishield vaccine. Together we will defeat Covid-19!\" he said in a tweet.\n\nProviding raw materials for the production of anti-coronavirus vaccines was a major component of the Biden administration's announcement on medical aid to India.\n\nThe Covishield vaccine is produced in India by the Serum Institute of India (SII), based in Maharashtra 's Pune.\n\nLast month, SII CEO Adar Poonawalla appealed to US President Joe Biden to lift the embargo on the export of raw materials needed to manufacture the vaccines.\n\nMinistry of External Affairs (MEA) Spokesperson Arindam Bagchi said a shipment of over 81,000 vials of Remdesivir from the US arrived in Mumbai on Wednesday morning.\n\n\"Further elevating the India and the United States Strategic Partnership! Appreciate the shipment of over 81000 vials of Remdesivir from the US that arrived early this morning in Mumbai,\" he tweeted.\n\nMeanwhile, Israel delivered its first consignment of medical supplies comprising oxygen concentrators to India on Wednesday. The consignment was brought to the country in a special flight.\n\nThe Israeli embassy said more such flights will bring emergency medical aid, including thousands of group and individual oxygen generators, respirators, medications and additional medical equipment.\n\n\"In this hour of need, our two democracies stand solidly side by side. The State of Israel is happy to lend a helping hand to our friend India in this complicated and difficult time,\" Israeli ambassador Ron Malka said.\n\n\"Our friendship is strong and collaboration during the Covid-19 crisis will only make it stronger. I see great importance in the cooperation with India in this joint fight against the global pandemic,\" he added.\n\n",
    "Title": "US supplies of vaccine components to India to enable manufacturing of two crore doses of Covishield"
  },
  {
    "Date": "Thu, 06 May 2021 07:50:33 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/india/pressure-on-congress-to-show-its-worth/articleshow/82423239.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82423239.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>It is felt that Congress will have to demonstrate its ability to take on and tame the BJP - given the bipolar politics of a large swathe spanning MP, Chhattisgarh, HP, Uttarakhand, Rajasthan, Assam, Karnataka - to earn the respect of the regional forces.",
    "Image": "https://static.toiimg.com/thumb/msid-82423239,width-1070,height-580,imgsize-175915,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/india/pressure-on-congress-to-show-its-worth/articleshow/82423239.cms",
    "Text": "It is felt that Congress will have to demonstrate its ability to take on and tame the BJP - given the bipolar politics of a large swathe spanning MP, Chhattisgarh, HP, Uttarakhand, Rajasthan, Assam, Karnataka - to earn the respect of the regional forces.\n\nNEW DELHI: With the regional parties proving the bulwark against Modi-led election machine in the recent batch of elections and triggering talks of an anti-communal front at the national level, the pressure has mounted on the Congress to prove its worth in the opposition ranks.\n\nContrary to the marquee contests this time involving regional parties, the next set will witness a direct \" Congress vs BJP \" face-off in Uttarakhand and Goa. Both states are ruled by BJP which makes it imperative for Congress to wrest them from the rival.\n\nBut the stakes are set to be higher because the victory of TMC in West Bengal, DMK in Tamil Nadu and CPM in Kerala has given the impression that the regional parties have managed to shut out an expectant BJP while Congress failed in Assam. While these results have kicked off a chatter about a national anti-BJP front, many in the opposition view Congress as the weak link that is unable to confront the saffron party even though Congress insists it is the principal anti-BJP voice.\n\nIt is felt that Congress will have to demonstrate its ability to take on and tame the BJP - given the bipolar politics of a large swathe spanning MP, Chhattisgarh, HP, Uttarakhand, Rajasthan, Assam, Karnataka - to earn the respect of the regional forces.\n\nThe tone for the 2019 Lok Sabha polls was set by the Congress sweep of the BJP-ruled Chhattisgarh, Rajasthan and Madhya Pradesh but the dynamics of the polls changed after the Pulwama attacks, Congressmen regret.\n\nWhile the biggest prize of all, Uttar Pradesh, and Punjab also go to the polls with Goa and Uttarakhand, Congress is not a factor in UP while BJP is absent from the latter. Uttarakhand and Goa would thus be watched for the direct confrontation between the national parties. A stumble there would deal a serious setback to Congress's political positioning.\n\n",
    "Title": "Assembly elections: Pressure on Congress to show its worth in opposition ranks"
  },
  {
    "Date": "Thu, 06 May 2021 07:40:21 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/india/three-terrorists-killed-in-encounter-with-security-forces-in-jks-shopian/articleshow/82423148.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82423148.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>Three terrorists were killed, while one surrendered before security forces during an encounter in Shopian district on Thursday. The terrorists turned down the offer to surrender and opened firing and lobbed a grenade on the security forces, a police official said.",
    "Image": "https://static.toiimg.com/thumb/msid-82423165,width-1070,height-580,imgsize-361640,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/india/three-terrorists-killed-in-encounter-with-security-forces-in-jks-shopian/articleshow/82423148.cms",
    "Text": "SRINAGAR: Three terrorists were killed, while one surrendered before security forces during an encounter in Shopian district of Jammu and Kashmir on Thursday, police said.\n\nThe security forces launched a cordon and search operation in Kanigam area of the South Kashmir district during the night following information about the presence of terrorists there, a police official said.\n\nHe said as the presence of four newly recruited local terrorists of Al-Badr outfit got ascertained, the security forces exercised maximum restraint and tried their best to persuade them to surrender.\n\nThe terrorists turned down the offer to surrender and opened firing and lobbed a grenade on the security forces, the official said.\n\nThe security forces retaliated, ensuing an encounter, the official said.\n\nHowever, during the encounter one of the terrorists surrendered before the security forces while three others were killed.\n\nThe surrendered terrorist has been identified as Tausif Ahmad, the official said.\n\n\n\nFacebook Twitter Linkedin EMail",
    "Title": "Three terrorists killed in encounter with security forces in J&K's Shopian"
  },
  {
    "Date": "Thu, 06 May 2021 10:48:43 +0530",
    "Description": "A well known artist, Pandu had designed the ‘two leaves’ symbol and the flag of the All India Anna Dravida Munnetra Kazhagam (AIADMK).",
    "Image": "https://th.thgim.com/migration_catalog/e3a0dr/article14268662.ece/ALTERNATES/FREE_960/TH01TwoLeavesTH01PANDUjpgjpg",
    "Link": "https://www.thehindu.com/news/cities/chennai/actor-pandu-who-designed-aiadmk-flag-no-more/article34495934.ece",
    "Text": "A well known artist, Pandu had designed the ‘two leaves’ symbol and the flag of the All India Anna Dravida Munnetra Kazhagam (AIADMK).\n\nActor Pandu, who has starred in several Tamil films, passed away in Chennai on Thursday morning. He was 74 years old and was hospitalised after testing positive for COVID-19. He is survived by his wife and three sons.\n\nMr. Pandu made his acting debut in the 1981 film Karaiyellam Shenbagapoo and went on to essay comedy roles in over 550 films including Kaadhal Kottai, Badri, Citizen, Pammal K. Samandham and Kanchana 2.\n\nA well known artist, Pandu had designed the ‘two leaves’ symbol and the flag of the All India Anna Dravida Munnetra Kazhagam (AIADMK).\n\nIn a 2016 interview to The Hindu, Pandu recalled how he had been called by AIADMK founder M G Ramachandran (MGR) the day the announcement about the floating the party had been made to design the party flag. Before the 1977 election, he was once again called by MGR to design the party’s two leaves symbol.\n\nHis association with MGR, he had said, began in 1973 when he designed stickers for the actor's film Ulagam Suttrum Valiban.\n\nPandu was also running a company called ‘Capital Letters’ and had designed name boards for the residences and offices of many members of the Tamil film fraternity.",
    "Title": "Actor Pandu, who designed AIADMK flag, no more"
  },
  {
    "Date": "Thu, 06 May 2021 04:38:43 GMT",
    "Description": "The current surge of the virus has already overwhelmed India's healthcare system.",
    "Image": "https://ichef.bbci.co.uk/news/1024/branded_news/C312/production/_118383994_hi066415505.jpg",
    "Link": "https://www.bbc.co.uk/news/world-asia-india-57004764",
    "Text": "India is sequencing just over 1% of all samples at the moment. \"In comparison, the UK was sequencing at 5-6% at the peak of the pandemic. But you can't build such capacity overnight,\" he said.",
    "Title": "India Covid: Government says 'double mutant' linked to surge"
  },
  {
    "Date": "Thu, 06 May 2021 04:31:35 GMT",
    "Description": "The social media platform will prompt users to review \"potentially harmful or offensive\" replies.",
    "Image": "https://ichef.bbci.co.uk/news/1024/branded_news/4298/production/_118384071_gettyimages-1232299817.jpg",
    "Link": "https://www.bbc.co.uk/news/business-57004794",
    "Text": "After testing and improving prompts that ask you to review a potentially harmful or offensive reply, we learned that this feature can help encourage more meaningful convos.\n\n\n\nWe’re now rolling out these prompts on iOS and soon Android. https://t.co/GdnEGrIvfM pic.twitter.com/5hrK0mrd8f",
    "Title": "Twitter tells users to be nice and think twice before replying"
  },
  {
    "Date": "Thu, 06 May 2021 11:41:51 +0530",
    "Description": "The aircraft was loaded with more than thousand items from the Indian High Commission and charities.",
    "Image": "https://th.thgim.com/news/national/m1yk4y/article34496264.ece/ALTERNATES/FREE_960/British-Airways",
    "Link": "https://www.thehindu.com/news/national/british-airways-flies-aircraft-with-emergency-aid-to-delhi/article34496265.ece",
    "Text": "The aircraft was loaded with more than thousand items from the Indian High Commission and charities.\n\nBritish Airways on Thursday said it operated a Boeing 777-200 aircraft carrying emergency aid, including oxygen cylinders and concentrators, to Delhi amid the country battling with rising coronavirus cases.\n\nWhile IAG Cargo and British Airways have maintained a vital air link between London and India throughout the pandemic and sending aid on scheduled flights, this airlift was done through a special charter. It was fully-funded by the two companies, according to a release.\n\nBritish Airways said it commissioned a special project team to organise the flight (BA257F), which landed in Delhi at 5.45 am (local time) on Thursday.\n\nThe aircraft was loaded with more than thousand items from the Indian High Commission and charities. It included hundreds of urgent life-saving oxygen cylinders and shipments of oxygen concentrators, respirators and blood oxygen saturation monitors.\n\nBesides, the airline is donating care packages for families in need.\n\n\"The British Airways family has been deeply affected by the terrible scenes in India of the deepening humanitarian crisis that has impacted the lives of many of our people. We are fortunate to be in a position to help transport aid and I am so proud of the volunteers from across the airline and IAG Cargo who have stepped up to make this happen,\" British Airways' CEO Sean Doyle said.\n\nHe said British Airways will continue to stand with its friends in India as the country endures one of the \"worst crises\" it has ever known.\n\nBritish Airways is working in partnership with the Disasters Emergency Committee (DEC), which is organising the UK's humanitarian response.\n\nDEC's CEO Saleh Saeed said DEC brings together 14 leading UK aid charities to respond quickly and effectively to disasters, with the fantastic support of partners in the corporate sector, including British Airways.\n\n\"We are hugely grateful to British Airways for springing into action to support our emergency appeals, enabling us to provide life-saving humanitarian assistance to people in India and elsewhere across the world when disaster strikes,\" he added.",
    "Title": "British Airways flies aircraft with emergency aid to Delhi"
  },
  {
    "Date": "Thu, 06 May 2021 04:44:41 GMT",
    "Description": "He also asked China to take back 1,000 Sinopharm vaccines that it had donated to the country",
    "Image": "https://ichef.bbci.co.uk/news/1024/branded_news/A828/production/_118384034_hi067133186.jpg",
    "Link": "https://www.bbc.co.uk/news/world-asia-57004924",
    "Text": "By comparison the Moderna and Pfizer vaccines being developed in the West are mRNA vaccines. This means part of the coronavirus' genetic code is injected into the body, triggering the body to begin making viral proteins, but not the whole virus, which is enough to train the immune system to attack.",
    "Title": "Philippines' Duterte apologises for taking unapproved China jab"
  },
  {
    "Date": "Thu, 06 May 2021 03:56:26 GMT",
    "Description": "The Tiananmen vigil commemorated the deaths of up to thousands of pro-democracy protesters in China.",
    "Image": "https://ichef.bbci.co.uk/news/1024/branded_news/EEDC/production/_118384116_gettyimages-1150363858.jpg",
    "Link": "https://www.bbc.co.uk/news/world-asia-china-57005120",
    "Text": "However, there have been questions over whether or not the vigil will be allowed in Hong Kong again, after Beijing imposed the national security law last year which targets dissent in the city.",
    "Title": "Hong Kong: Joshua Wong jailed over banned Tiananmen vigil"
  },
  {
    "Date": "Thu, 06 May 2021 11:03:22 +0530",
    "Description": "The patients collapsed before they could be taken to the COVID-19 block, which is operating at full capacity, officials said",
    "Image": "https://th.thgim.com/news/national/tamil-nadu/h3qxua/article34496038.ece/ALTERNATES/FREE_960/06MAYTH--Salem",
    "Link": "https://www.thehindu.com/news/national/tamil-nadu/three-covid-19-patients-die-waiting-in-ambulances-at-salem-gh/article34496041.ece",
    "Text": "The patients collapsed before they could be taken to the COVID-19 block, which is operating at full capacity, officials said\n\nThree COVID-19 patients, who were waiting at the triage zone of the Government Mohan Kumaramangalam Medical College Hospital, died late Tuesday evening, according to sources.\n\nThe patients, who were waiting in ambulances at the COVID-19 triage zone of the hospital, collapsed before they could be shifted to the COVID-19 block here. According to doctors, the patients included a 30-year-old woman and two men aged above 40 years.\n\nThe Salem GH is the tertiary care centre for COVID-19 treatment in the district and besides patients from its vicinity, patients from far ends of the district including Thalaivasal and Attur travel here for triaging after testing positive for COVID-19. The hospital is also receiving patients referred from private hospitals in critical condition. “The COVID-19 block is operating at full capacity and patients are being referred to the hospital from private hospitals without first confirming bed availability here,” Dean R. Murugeshan had said.\n\nAccording to doctors, patients are brought to the hospital in critical condition and though they are attended to in ambulances, they can be shifted to the block only once a bed becomes available.\n\nThe Salem GH is now working on increasing its bed strength with oxygen facilities to take in more patients. It has designated 800 beds for COVID-19 treatment with oxygen supply through pipe or cylinders and is operating at full capacity, Dr. Murugeshan said.",
    "Title": "Three COVID-19 patients die waiting in ambulances at Salem GH"
  },
  {
    "Date": "Thu, 06 May 2021 11:11:44 +0530",
    "Description": "Dancer Methil Devika was down with COVID-19 while working on production on ‘solitude’",
    "Image": "https://th.thgim.com/news/national/kerala/bxoj2e/article34496089.ece/ALTERNATES/FREE_460/06tvallMethilDevikaJPG",
    "Link": "https://www.thehindu.com/entertainment/dance/when-life-imitates-art-during-pandemic/article34496090.ece",
    "Text": "Dancer Methil Devika was down with COVID-19 while working on production on ‘solitude’\n\nLife imitates art. Methil Devika found that out recently, the hard way.\n\nThe accomplished Mohiniyattam dancer had come down with COVID-19 and was hospitalised for a few days. And this happened at a time when she was working on an international project titled ‘Ahalya’ on the theme of ‘solitude’ imposed by the pandemic.\n\nDevika is one of the four Indian dancers commissioned by the Canada-based Sampradaya to make productions on the theme. Rama Vaidyanathan (Bharatanatyam), Aditi Mangaldas (Kathak) and Bijayini Satpathy (Odissi) are the others.\n\nDevika showed all the classical symptoms of COVID-19 while she was on working on the music of her production. Besides writing the script, in collaboration with Valmiki, she would tell you, smiling, she has also composed the music.\n\n“I was suffering from breathlessness, but the deadline to finish my film was fast approaching. So I sang the track in that condition and mailed it to my musicians,” says Devika. “It was indeed a severe form of COVID-19 that struck me.”\n\nAfter leaving the private hospital in Thiruvananthapuram, she had to isolate herself in accordance with the COVID-19 protocol. That experience came in handy when she enacted the role of Ahalya during the shoot of her production.\n\n“I chose the tale of Ahalya for my film because I thought we all could relate, during these tough times, to her isolation and loneliness as she waited for Rama to end her curse,” says Devika. “I interpreted her character from my own perspective rather than those of other poets like Ezhuthachan. After reading different versions of The Ramayana, I went back to the original work by Valmiki.”\n\nThe production, which she has choreographed and performed, is in the Mohiniyattam style, of course. She roped in ace cinematographer Madhu Ambat to shoot the film.\n\nAhalya premieres on shaale.com on May 9.",
    "Title": "When life imitates art during pandemic"
  },
  {
    "Date": "Thu, 06 May 2021 01:56:27 +0530",
    "Description": "Navy brings 54 tonnes of liquid oxygen from Bahrain, Germany to set up massive oxygen plant in Delhi",
    "Image": "https://th.thgim.com/news/national/fynmlc/article34494261.ece/ALTERNATES/FREE_960/6th-bahrain2",
    "Link": "https://www.thehindu.com/news/national/covid-19-assistance-continues-to-pour-in-from-abroad/article34494262.ece",
    "Text": "Navy brings 54 tonnes of liquid oxygen from Bahrain, Germany to set up massive oxygen plant in Delhi\n\nA 500-bed COVID-19 hospital set up by the Defence Research and Development Organisation (DRDO) in Lucknow was opened on Wednesday.\n\nNavy ship INS Talwar entered the New Mangalore port with 54 tonnes of liquid oxygen from Bahrain, while more ships are on their way with emergency supplies from friendly countries, the Navy said. “Nine warships have been diverted to various ports in the region extending from Kuwait in the West to Singapore in the East,” said Deputy Chief of Naval Staff Vice Admiral M.S. Pawar.",
    "Title": "COVID-19 assistance continues to pour in from abroad"
  },
  {
    "Date": "Thu, 06 May 2021 02:19:48 +0530",
    "Description": "Study shows wealth of the current elected representatives has also increased",
    "Image": "https://th.thgim.com/news/national/tamil-nadu/wav92q/article34494303.ece/ALTERNATES/FREE_460/TH06Final-CIty-MLA-ARD-Reportcol",
    "Link": "https://www.thehindu.com/news/national/tamil-nadu/new-assembly-will-have-more-mlas-facing-criminal-cases/article34494304.ece",
    "Text": "Study shows wealth of the current elected representatives has also increased\n\nThe average worth of the assets of Members of the Legislative Assembly and the percentage of legislators with criminal cases went up in 2021 when compared to 2016, an analysis by the Association for Democratic Reforms, released on Wednesday, showed.\n\nAccording to the analysis, while 34% of the elected MLAs were facing criminal cases in 2016, it increased to 60% in 2021. In absolute numbers, at least 134 MLAs elected in 2021 faced criminal cases, of whom 57 had criminal cases for offences of a serious nature.\n\nADR’s analysis included only 224 of the 234 MLAs. Details of eight MLAs from the DMK and two from the Congress were not included in the analysis due to lack of availability of proper data, the organisation said.\n\nFor similar reasons, the comparison to 2016 included only 223 of the 234 MLAs, it said.\n\n85% crorepatis\n\nMore than 85% of the elected MLAs are crorepatis, compared to 76% in 2016. Consequently, the analysis showed that the average worth of assets of MLAs increased by nearly 50% from ₹8.21 crore in 2016 to ₹12.27 crore in 2021.\n\nE. Subaya of AIADMK, who got elected from Ambasamudram constituency in Tirunelveli district, is the wealthiest candidate with a total worth of ₹246 crore. K. Marimuthu of the Communist Party of India, who got elected from Thiruthuraipoondi constituency in Tiruvarur district, is the poorest with assets worth ₹3.3 lakh.\n\nThis election also saw a marginally higher number of graduates entering the Assembly, compared to 2016. Around 65% of the elected candidates were aged 60 or above, the analysis showed.",
    "Title": "New Assembly will have more MLAs facing criminal cases"
  },
  {
    "Date": "Thu, 06 May 2021 11:11:21 +0530",
    "Description": "In his chequered political career, he was Minister in the Vajpayee government and during the second term of the United Progressive Alliance government.",
    "Image": "https://th.thgim.com/news/national/other-states/wa50qu/article25973339.ece/ALTERNATES/FREE_460/12TH-AJITs",
    "Link": "https://www.thehindu.com/news/national/other-states/rld-chief-ajit-singh-passes-away-due-to-covid-19-complications/article34495707.ece",
    "Text": "In his chequered political career, he was Minister in the Vajpayee government and during the second term of the United Progressive Alliance government.\n\nFormer Union minister and chief of the Rashtriya Lok Dal (RLD) Ajit Singh, 82, passed away on Thursday in a Gurgaon hospital of COVID19 related complications. His son, Jayant Chaudhary confirmed the demise of his father early on Thursday morning.\n\nAlso read: Obituary | Ajit Singh, an engineer-turned-politician who drew strength from rural UP\n\nMr. Singh, the son of former Prime Minister Chaudhary Charan Singh, was one of the first IITians in Indian politics, and became Rajya Sabha member in 1986 as his father fell ill and fought and won from the Baghpat seat from 1989 till 2009.\n\n\n\nAfter his own father’s demise he headed the Lok Dal (A), and the Janata Party and through the vissitudes of coalition politics of the 1990s allied with the Janata Dal, BJP and Congress before going it on his own in 2014. He was minister for agriculture in the Vajpayee government between 2001-2003, and minister for civil aviation in the second term of the UPA government. His politics stemmed from the rural hinterland of Wester Uttar Pradesh especially the agrarian communities including Jats and Muslims, a constituency that his father Chaudhary Charan Singh had built in the 1960s.\n\n\n\nTributes poured in from all quarters at the demise of Mr Singh, with Prime Minister Narendra Modi saying that Mr Singh was “devoted to the interests of farmers all his life”.",
    "Title": "RLD chief Ajit Singh passes away due to COVID-19 complications"
  },
  {
    "Date": "Thu, 06 May 2021 04:20:37 +0530",
    "Description": "She was treated for COVID-19 at a private hospital",
    "Image": "https://th.thgim.com/news/national/tamil-nadu/btv13w/article34494084.ece/ALTERNATES/FREE_460/th06law-varsity",
    "Link": "https://www.thehindu.com/news/national/tamil-nadu/tamil-nadu-law-universitys-first-vice-chancellor-passes-away/article34494085.ece",
    "Text": "She was treated for COVID-19 at a private hospital\n\nP. Nagabhooshanam, the first Vice-Chancellor of Tamil Nadu Dr. Ambedkar Law University, died on May 4.\n\nShe was being treated for COVID-19 at a private hospital in Vadapalani. She was 78.\n\nDr. Nagabhooshanam was the third daughter of advocate Kolathur Panchatcharam.\n\nShe was a lecturer at the Madras Law College (now Dr. Ambedkar Law College) between 1977 and 1988 and also served as professor in the Department of Legal Studies at the University of Madras.\n\nWhen the Tamil Nadu Dr. Ambedkar Law University was constituted in 1997, Dr. Nagabhooshanam was appointed as its Vice-Chancellor. She drew up the Syndicate and the University Statutes.\n\nShe had a master’s degree in Tamil and an M.L. in Constitutional Law and International Law. Her doctoral thesis was on ‘Social Justice and Weaker Sections – the role of judiciary’. She had served as a lecturer in Tamil in P.S.G.R. Krishnammal College for Women in Coimbatore and was translator in the Tamil Nadu Language (legislative) Commission, Chennai. She married Krishna Shetty, professor in the Department of Legal Studies, Madras University.\n\nHer tenure as V-C was peppered with several challenges. Several acrimonious academic, senate and syndicate meetings made it difficult for the V-C to introduce policies that could have benefited the students, according to academicians quoted in a report in The Hindu.\n\nHer effort to hold the convocation before her term ended was also thwarted.",
    "Title": "Law varsity’s first V-C dead"
  },
  {
    "Date": "Thu, 06 May 2021 09:47:56 +0530",
    "Description": "He was the founder of Raaga Priya orchestra",
    "Image": "https://th.thgim.com/news/cities/chennai/r72pki/article34495684.ece/ALTERNATES/FREE_960/WhatsApp-Image-2021-05-06-at-94503-AM",
    "Link": "https://www.thehindu.com/news/cities/chennai/visually-impaired-musician-comagan-passes-away/article34495685.ece",
    "Text": "He was the founder of Raaga Priya orchestra\n\nM.J.C. Comagan, a visually impaired singer and founder of the Raaga Priya orchestra, died here in the city on Thursday. He was 48 and is survived by his wife and two children.\n\nComagan and his orchestra, whose members were visually impaired as well, had featured in the hugely popular Tamil song Ovvoru Pookalume in director Cheran’s 2004 film Autograph. The song was picturised on the Raaga Priya orchestra, with actor Sneha singing along.\n\nCheran, in a tweet, said that Mr. Comagan was someone who instilled belief and confidence through his voice and mind.\n\n\"For the 25 members of his troupe and their families, he was their eyes. My heart is shattered after hearing about his demise,\" he said.\n\nRaaga Priya, which was started in 1991 by Comagan with nine members, soon grew to a 25-member orchestra. In 1999, they performed for 16 hours non-stop with 183 songs and entered the Limca Book of World Records. Over the years, the troupe has performed over 3,000 light music shows as well as for fundraising events, and was also given the Tamil Nadu State Award in 2006.\n\nComagan has also done small roles in the films Kanukkulle and Sura. He had also composed music for a Tamil film Muthal Muthalai in 2007.\n\nDisability Rights Activist and TARATDAC secretary S. Namburajan said that Comagan was also a part of the first Tamil Nadu Welfare Board for the disabled that was set up in 2008. “He was always keen on highlighting issues faced by persons with disabilities, the visually impaired in particular. Raaga Priya was an extremely unique initiative for the upliftment of blind musicians,” he said.\n\nA family member said that the singer was hospitalised around 12 days ago and passed away at around 1 a.m. on Thursday. “While the troupe was actively performing before the COVID-19 pandemic, over the last one year they have all been conducting online classes. Comagan too was taking vocal and instrumental classes,” she said.",
    "Title": "Visually impaired musician Comagan passes away"
  },
  {
    "Date": "Thu, 06 May 2021 06:41:51 +0530",
    "Description": "An official said an exchange of fire is going on in the area.",
    "Image": "https://th.thgim.com/news/national/xt50x8/article34292635.ece/ALTERNATES/FREE_960/Shopian",
    "Link": "https://www.thehindu.com/news/national/other-states/many-al-badr-militants-trapped-in-shopian-operation-on-police/article34495328.ece",
    "Text": "An official said an exchange of fire is going on in the area.\n\nFour militants were trapped in a pre-dawn operation of the security forces on Thursday, resulting in an encounter in south Kashmir’s Shopian.\n\n“Exercising maximum restraint, the police and security forces tried to persuade trapped terrorists to surrender. However, turning down the surrender offer, they opened fire and lobbed a grenade on joint search party,” a police spokesman said.\n\nThe police said all the four were fresh recruits of the Al-Badr outfit. “All of them are locals,” the police said.\n\nAn official said an exchange of fire is going on in the area.\n\nAt the time of filing the report, there were no reports of any casualties.",
    "Title": "4 Al-Badr militants trapped in Shopian, operation on: Police"
  },
  {
    "Date": "Thu, 06 May 2021 11:02:50 +0530",
    "Description": "He had brought out a book containing long conversations with the Senior Metropolitan",
    "Image": "https://th.thgim.com/todays-paper/tp-national/tp-kerala/srz637/article34494668.ece/ALTERNATES/FREE_460/05kisanBaby-onG7J8I8RAU2jpgjpg",
    "Link": "https://www.thehindu.com/news/national/kerala/he-worked-for-the-weak-and-the-persecuted-baby/article34493491.ece",
    "Text": "He had brought out a book containing long conversations with the Senior Metropolitan\n\nSenior Metropolitan of the Mar Thoma Church Philipose Mar Chrysostom stood with and worked for the weak and the persecuted, just as Jesus Christ, recalls M.A. Baby, CPI(M) Polit Bureau member.\n\n“He was active, alert to the happenings around him,” Mr. Baby, on his way back after paying tributes to Mar Chrysostom, told The Hindu over the phone.\n\nMr. Baby had an enduring and enriching relationship with Mar Chrysostom which led to the former bringing out a volume, Christ, Marx and Sree Narayana Guru; A Colloquy by Mar Chrysostom Senior Metropolitan and MA Baby.\n\nThe book, containing long conversations between the duo, was initially published in Malayalam. The conversations weren’t forced and veered around the issues of faith, atheism, the Charvaka philosophy and touched on figures such as Karl Marx, Friedrich Engels, Sree Narayana Guru, even Pope Francis. It also had short pieces written by Pinarayi Vijayan, Kodiyeri Balakrishnan, and several others on their impression of the senior Church functionary. “A part of the conversations had been telecast on Kairali TV following which we held long conversations which resulted in that book. CPI(M) general secretary Sitaram Yechury wrote an introduction to it when it was published in English,” says Mr. Baby.\n\nMar Chrysostom took an active interest in the People’s Planning Programme of the LDF government in the late 1990s. “He once called me, expressing his desire to donate his eyes after death. I went over and saw that he had completed all formalities to donate his eyes after death. This was inspirational for the government to launch its Darshanam programme. An organ donated by you is harvested after your death, but it also shows that the organs stay alive for some more time after you’re dead. It has philosophical dimensions,” says Mr. Baby.\n\n“He was sharp and witty and there was this incident of him coming home for lunch. At an event later, he said when he was fiddling with the sharp bones of fried pearl spot (karimeen pollichathu), I, a minister then, just kept staring at him while my wife carefully removed the fish bones, as his mother would have done, to help him out. So, she deserves to be the minister, not Baby sir, he announced with a smile, as he looked at me from the corner of his eye,” recalls Mr. Baby.",
    "Title": "Philipose Mar Chrysostom worked for the weak and the persecuted: M.A. Baby"
  },
  {
    "Date": "Thu, 06 May 2021 11:34:02 +0530",
    "Description": "Bengaluru’s Relief Riders started helping vulnerable groups with delivery of medicines and essentials. Several cities have now followed suit",
    "Image": "https://th.thgim.com/news/national/fm6vyn/article34496186.ece/ALTERNATES/FREE_960/ReliefRiders-1",
    "Link": "https://www.thehindu.com/news/national/cycling-relief-riders-covid-19/article34496187.ece",
    "Text": "Bengaluru’s Relief Riders started helping vulnerable groups with delivery of medicines and essentials. Several cities have now followed suit\n\nDivi K wanted to take some home-cooked food for her elderly aunt, who was unwell, on May 1 in Bengaluru. She stays in Halasuru which is about 20 kilometres from her aunt’s house in Yelahanka. Due to the lockdown in Karnataka, she was unable to drive there herself. She could not find a delivery service either. That is when she came across a helpline number for Relief Riders, a group of cyclists who are volunteering to deliver medicines and other essentials, including food, to vulnerable people in the city. Within minutes of dialling the number, a volunteer — Kunal Bohra, a second-year BCom student — reached her doorstep. The food was delivered within an hour.\n\nRelief Riders is headed by Bengaluru’s ‘bicycle mayor’ Sathya Sankaran, who is a part of BYCS, a Dutch social enterprise that heads a worldwide network of international cycle mayors. Along with the Bengaluru cycling community, he formed Relief Riders during the first wave of the pandemic. With the city in the midst of a two-week lockdown, the cyclists returned to volunteer again. Now, more cities have joined the programme.\n\nThe programme kicked off in Chennai from May 3. Felix John, Chennai’s bicycle mayor, says, “We are aware the situation is much worse than last year. Hence, it’s probably riskier for us to move around. But the people in need of essentials and medicines have also grown which is why we decided to volunteer.”\n\nRelief Riders helplines Bengaluru: 9886491982, 9731905685, 9591975791, 9535554071\n\n9886491982, 9731905685, 9591975791, 9535554071 Chennai: 8939233053, 9840059830, 9840728071\n\n8939233053, 9840059830, 9840728071 Gurugram: 8383940349, 9643002469\n\n8383940349, 9643002469 Hyderabad: 9566170334\n\n9566170334 Mumbai: 8591441671, 9820063141, 9619316254, 9820994495\n\nIn Bengaluru, the team serves from 6 am to 10 am (on other times as well, in case of emergencies) every day. Once a person in need contacts a helpline number, the request is shared on a WhatsApp group. Then, whoever is available to help, takes it up. Volunteers have made about 90 deliveries so far. They also check on people with physical and mental disabilities. The Bengaluru team has tied up with the elders helpline (1090) as well.\n\n“There are about 190 volunteers in Bangalore and 29 in Hubli-Dharwad,” says Sathya. Five more cities — Mumbai, Chennai, Gurugram, Hyderabad, and Belagavi — have joined the programme.\n\nThe Hyderabad edition of Relief Riders, which started on May 1, has done about 10 deliveries so far. “I think the number of requests we get will increase as the helpline numbers are just beginning to reach more people,” says Santhana Selvan, Hyderabad’s bicycle mayor.\n\n“The disease is now believed to be airborne. So, we are extra careful this time. There are a few guidelines one has to agree before signing up to be a volunteer,” says Sathya.\n\nIn Gurugram, Vineet Chopra and his local cycling group, the Rock Riders, formed a couple of years ago with a bunch of people in his apartment complex, are volunteering under the Relief Riders banner. “We have been getting about 40 to 50 calls a day, most asking for oxygen cylinders or Remdesivir. Sometimes, whole families are COVID positive, and even the chemist won’t go to these houses,” he says.\n\nPayments are usually cashless. But, occasionally, volunteers help with cash transactions if an elderly person is unfamiliar with digital payments. Santhana Selvan says a volunteer in Hyderabad even paid for medicines as the person in need of it could not afford them. “It’s really heartening to earn the gratitude of such people,” he adds.\n\nMost of these volunteers who are used to riding long distances operate within neighbourhoods. “We used to cycle long distances for our own health. We don’t get to ride long distances now. But we ride for the health and safety of others,” says Sathya.\n\n(With inputs from Sunalini Mathew)",
    "Title": "How cycling communities are helping Indian cities deal with the second wave of COVID-19"
  },
  {
    "Date": "Thu, 06 May 2021 11:26:46 +0530",
    "Description": "A four-member team, led by an Additional Secretary of the Ministry of Home Affairs, has left for the State.",
    "Image": "https://th.thgim.com/news/national/k1yznn/article34496179.ece/ALTERNATES/FREE_960/Nadda-in-Kolkata",
    "Link": "https://www.thehindu.com/news/national/mha-forms-four-member-team-to-probe-post-poll-violence-in-west-bengal/article34496181.ece",
    "Text": "A four-member team, led by an Additional Secretary of the Ministry of Home Affairs, has left for the State.\n\nThe Union Home Ministry has formed a four-member fact finding team to look into reasons for the post- poll violence in West Bengal and also assess the ground situation in the State, officials said on May 6.\n\nThe team, led by an Additional Secretary of the Ministry, has left for the State.\n\nOn May 5, the Ministry had sent a terse reminder to the West Bengal government to submit a detailed report on the post-poll violence and to take necessary measures to stop such incidents “without any loss of time”. The Ministry had warned that the matter will be taken “seriously” in case the State fails to do so.\n\nAt least six people were killed in post-poll violence in different parts of the State till May 4. The BJP has alleged that TMC-backed goons have killed a number of its workers, attacked its women members, vandalised houses, looted shops of its members and ransacked its offices.\n\nClaiming that at least 14 BJP workers were killed and nearly one lakh people fled their homes in post-poll violence in West Bengal, party president J.P. Nadda alleged on May 5 that Chief Minister Mamata Banerjee’s silence speaks of her involvement.\n\nMs. Banerjee rejected the charges, saying violence and clashes were taking place in those areas where the BJP candidates emerged victorious in the election.",
    "Title": "MHA forms four-member team to probe post-poll violence in West Bengal"
  },
  {
    "Date": "Thu, 06 May 2021 11:26:20 +0530",
    "Description": "The party’s lone Muslim MLA lost the Sonai seat in Barak Valley to his AIUDF rival.",
    "Image": "https://th.thgim.com/elections/assam-assembly/edc95h/article34496174.ece/ALTERNATES/FREE_960/assam-bjp",
    "Link": "https://www.thehindu.com/elections/assam-assembly/assam-bjp-dissolves-minority-cell-after-poor-performance-in-muslim-dominated-seats/article34496175.ece",
    "Text": "The party’s lone Muslim MLA lost the Sonai seat in Barak Valley to his AIUDF rival.\n\nThe Assam unit of the Bharatiya Janata Party (BJP) has dissolved its minority cell after none of the nine Muslim candidates the party had fielded managed to win a seat in the recently-concluded Assembly election.\n\nThe BJP had won 60 of the 126 seats in the State. Its two regional allies bagged 15.\n\n“The Sankhyaloghu Morcha (minority cell) and all its units have been dissolved,” party’s State general secretary Rajdeep Roy said in a notification on Wednesday.\n\nAmong the losers in the Muslim-dominated seats was Deputy Speaker Aminul Haque Laskar, who had won the Sonai seat in Barak Valley in 2016. He lost the seat to Karim Uddin Barbhuiya of the All India United Democratic Front (AIUDF) by 19,654 votes.\n\nAssam has 34 Assembly constituencies where Muslims are the largest chunk of voters. Of the 31 Muslim candidates who won from these seats, 16 were fielded by the Congress and 15 by its ally, the AIUDF.\n\nThe Congress won a total of 29 seats and the AIUDF 16.",
    "Title": "Assam BJP dissolves minority cell after poor performance in Muslim-dominated seats"
  },
  {
    "Date": "Thu, 06 May 2021 11:22:55 +0530",
    "Description": "Ajit Singh, a computer engineer by training, was one of the first IITians to enter politics",
    "Image": "https://th.thgim.com/news/national/other-states/x664jv/article27584035.ece/ALTERNATES/FREE_960/07THAJIT-SINGH",
    "Link": "https://www.thehindu.com/news/national/other-states/rld-chief-ajit-singh-obituary/article34496024.ece",
    "Text": "Ajit Singh, a computer engineer by training, was one of the first IITians to enter politics\n\nFormer Union Minister and chief of the Rashtriya Lok Dal (RLD) Ajit Singh passed away on Thursday in a hospital in Gurugram of COVID-19 complications. He had been admitted to hospital on April 20 and passed away on Thursday morning, according to a statement put out by his son, former MP Jayant Chaudhary.\n\nMr. Ajit Singh, 82, a computer engineer by training, was one of the first IITians to enter politics, and became a Rajya Sabha member after his father, former Prime Minister Chaudhary Charan Singh, fell ill.\n\nIn his chequered political career, Mr. Ajit Singh’s political party and his alignments went through several avatars — from heading the Lok Dal (A) and the Janata Party in 1987 and 1988, before being general secretary of the Janata Dal in 1989 with V.P. Singh, he founded the RLD in 1998 and was Minister in the Vajpayee government from 2001-2003 and the Congress-led second United Progressive Alliance government till 2014 — but all political formations he headed or was part of saw him drawing strength from the rural hinterland of western Uttar Pradesh.\n\nThe frequent changes in his political alliances did not add much to his heft but kept him relevant in the coalition era of the 1990s and early 2000s. He was elected to the Lok Sabha from Baghpat from 1989 to 2009, losing the seat only in the bypoll of 1998 and the general elections of 2014.\n\nJat, Muslim support\n\nThe strong support base of Jats and Muslims in western Uttar Pradesh, the State that sends the largest contingent of Lok Sabha members to Parliament, made him an essential part of many of the coalition governments in the 1990s and 2000s. The communal riots in Muzzaffarnagar in 2013, however, saw this support base splinter and his party suffered a major defeat in 2014 without a single seat. In the last year or so his party vigorously campaigned against the three controversial farm laws, an issue which is of concern to agrarian communities over and above communal considerations.\n\nPersonal warmth\n\nFormer colleagues of Mr. Ajit Singh recalled his personal warmth towards them, whatever his political alignment happened to be at a particular time. One of the first calls that former Chief Minister of Karnataka Siddaramaiah made to a Union Minister in Delhi after becoming Chief Minister was to Mr. Ajit Singh, a gesture underlining the fact that it was on a Lok Dal ticket in the 1970s that the former had fought his first election.\n\nBashishstha Narayan Singh, Rajya Sabha MP and former Bihar unit president of the Janata Dal, had been a close associate of both Chaudhary Charan Singh and Mr. Ajit Singh. “What stood out with Ajit Singhji was his personal warmth and courtesy to colleagues and former colleagues. I have visited his home and his attitude would be the same warm one, whether you were political fellow travellers at that point or not.”\n\nPM’s tribute\n\nPrime Minister Narendra Modi also paid tribute to Mr. Ajit Singh stating that the latter was always at the forefront of fighting for the interests of farmers.",
    "Title": "Ajit Singh, an engineer-turned-politician who drew strength from rural Uttar Pradesh"
  },
  {
    "Date": "Thu, 06 May 2021 11:28:14 +0530",
    "Description": "Police and Chennai Corporation personnel are enforcing the new restrictions, which include limited timings for shops and restaurants and limited passengers in public transport",
    "Image": "https://th.thgim.com/news/cities/chennai/y62sxy/article34496135.ece/ALTERNATES/FREE_960/06MAYTH--Lockdown",
    "Link": "https://www.thehindu.com/news/cities/chennai/coronavirus-new-lockdown-restrictions-come-into-force-in-tn/article34496136.ece",
    "Text": "Police and Chennai Corporation personnel are enforcing the new restrictions, which include limited timings for shops and restaurants and limited passengers in public transport\n\nNew COVID-19 lockdown restrictions came into force in Tamil Nadu from dawn on Thursday. As per the restrictions, only provisional stores and grocery shops would remain open till noon and restaurants will offer only takeaway services with restricted timings. The restrictions will be in place till the morning of May 20.\n\nIn Chennai, police personnel along with staff of the Chennai Corporation are on streets to implement the new restrictions.\n\nAs part of the restrictions, government and private offices shall function with a minimum staff strength of 50%. Transport facilities like rail, metro and bus services will be allowed with 50% passengers only. No shops except grocery and vegetable shops without air-conditioning will be allowed to function with 50% customers till noon. Tea shops will be allowed to open till noon.\n\nAuditoriums, open air meetings and cultural events are banned. Only 20 people will be allowed in funerals and 50 persons at weddings.\n\nE-commerce services like Swiggy and Zomato will be allowed to take food from restaurants which will be allowed to function from 6 to 10 a.m, noon to 3 p.m. and 6 p.m. to 9 p.m. Essential services, media, freight and medical emergencies are allowed at all times and the night curfew will continue from 10 a.m to 4 a.m\n\nDeputy Commissioner of Pulianthope S.Rajesh Kannan said, “We have formed teams to implement the regulations effectively. Each police station has sector-wise teams and Inspectors and Sub-Inspectors have been patrolling. Beat officers are also deployed to do rounds on their bikes in their sectors. Our personnel advise shopkeepers and residents to follow all norms. If any violation such as non-wearing of masks or failure to follow physical distancing norms is found, we are imposing fines. If any major violation is noticed, the staff of Chennai Corporation is duly informed for further action.”\n\nCommercial establishments that have been found violating lockdown norms are being locked and sealed by the zonal enforcement teams led by assistant revenue officers of the Chennai Corporation. The teams have members from the police and district collectorate. Iron barricades have been placed on roads and the strength of police personnel has been increased to curb vehicle movement in the suburban areas of the city.\n\n“Our personnel have been on the streets and are repeatedly asking residents and shopkeepers to follow COVID-19 guidelines and extend cooperation to us to implement the new regulations. We are also booking cases for not wearing of masks and failure to follow physical distancing norms,” said Deputy Commissioner K. Prabhakar.",
    "Title": "Coronavirus | New lockdown restrictions come into force in TN"
  },
  {
    "Date": "Thu, 06 May 2021 11:31:40 +0530",
    "Description": "Official sources said that the nine-day lockdown will come into effect from 6 a.m. on May 8.",
    "Image": "https://th.thgim.com/photos/8y2ojp/article31452657.ece/ALTERNATES/FREE_960/12TH28LOCKDOWNSS9",
    "Link": "https://www.thehindu.com/news/national/kerala/lockdown-in-kerala-from-may-8-to-may-16-2021/article34496164.ece",
    "Text": "Official sources said that the nine-day lockdown will come into effect from 6 a.m. on May 8.\n\nThe Kerala government has announced a State-wide lockdown from May 8 to 16.\n\nThe directive was issued by the Chief Minister Pinarayi Vijayan taking into consideration the surge in COVID-19 cases in the State during the second wave of the coronavirus pandemic.\n\nOfficial sources said that the nine-day lockdown will come into effect from 6 a.m. on May 8 (Saturday). At present, lockdown is enforced from 9 p.m. to 5 a.m., with semi-lockdown-like curbs during weekends.\n\nKerala had reported 41,593 COVID-19 positive cases on May 5 and a test positivity rate of 25.69%. The cumulative death toll had touched 5,565 on Wednesday.",
    "Title": "Lockdown in Kerala from May 8 to 16"
  },
  {
    "Date": "Thu, 06 May 2021 01:45:08 +0530",
    "Description": "Initiative involves buses laden with concentrators",
    "Image": "https://th.thgim.com/news/national/tamil-nadu/on78g7/article34494242.ece/ALTERNATES/FREE_960/2615552021154926202OXYGENONWHEELSKVSJPG",
    "Link": "https://www.thehindu.com/news/national/tamil-nadu/oxygen-on-wheels-launched-in-city/article34494243.ece",
    "Text": "Initiative involves buses laden with concentrators\n\nThe Jain International Trade Organisation (JITO), in association with the Greater Chennai Corporation, has launched “Oxygen on Wheels”, an initiative where buses laden with oxygen concentrators will be deployed outside government hospitals.\n\nJITO has set up four dedicated specialty buses, each laden with six oxygen concentrators, which will be deployed outside government hospitals. Each bus can handle six patients and can provide relief to those queuing up for admission. The facility is free for patients, according to a press release.\n\nD.K. Jain, chairman, JITO Seva, said the vehicles would operate 24x7, catering to the urgent requirement of government hospitals in the city.\n\nAnil Jain, president of the JITO Administrative Training Foundation, said they had launched a COVID-19 helpline — “Jito for you helpline” — 94343 43430, for people to reach out.\n\nAmong others, Bharat Kanti Doshi, chief secretary of the organisation, and Pramod Chordia, convener, were present.",
    "Title": "‘Oxygen on Wheels’ launched in city"
  },
  {
    "Date": "Thu, 06 May 2021 07:55:23 +0530",
    "Description": "Contrary to expectations, the BJP’s appeal among backward classes and the rural poor has petered out",
    "Image": "https://th.thgim.com/opinion/op-ed/cx3ul5/article27140842.ece/ALTERNATES/FREE_960/16THWB",
    "Link": "https://www.thehindu.com/elections/west-bengal-assembly/csds-lokniti-survey-finds-whether-subaltern-hindutva-is-on-the-wane/article34494129.ece",
    "Text": "Contrary to expectations, the BJP’s appeal among backward classes and the rural poor has petered out\n\nThe phrase ‘subaltern Hindutva’ was bandied about quite a lot in academic and journalistic circles during the recently concluded West Bengal Assembly election. Many journalists and scholars covering stories from the field had a common account, that a large section of rural poor, backward classes, Dalits and Adivasis had firmly shifted towards the Bharatiya Janata Party (BJP) under the influence of the Hindutva ideology, and that the Trinamool Congress, which owed its rise to the backward classes in 2011, had become extremely unpopular among them. Some described the movement of these subaltern classes towards the BJP as cultural and political solidarity among Hindus and also a reflection of the dominance of ‘anti-Bhadralok’ (anti-upper caste/class) sentiments in rural areas that the Trinamool Congress had once benefited from.\n\nThe post-poll survey data, however, suggest that both the subaltern and bhadralok shift that had taken place towards the BJP on a massive scale in the 2019 Lok Sabha election waned this time and the Trinamool Congress managed to retain much of its lost support among these sections.\n\nData show that the decline in support for the BJP compared to the Lok Sabha election was the steepest among OBC communities (Yadavs, Kurmis, Kumhars, Lohars, Telis, etc., taken together), falling from over two-thirds (68%) to just half (49%) this time around. Like OBC voters, Adivasi voters, too, were far less enthused by the BJP, and their support fell drastically from 62% to 46%. Most of them made their way back to the Trinamool, which also explains why the ruling party regained lost ground in some of the State’s tribal areas and Scheduled Tribes-reserved seats.\n\nErosion of Dalit support\n\nAmong Dalit communities, too, on whom the BJP invested considerable time and energy this time, the party was simply unable to retain the huge level of support it had garnered two years ago, and much of this was due to the erosion of the Rajbanshi support. The BJP’s vote share among Rajbanshis declined from three-fourths in 2019 to three-fifths this time. This is counter-intuitive since the BJP did well in north Bengal, but the survey data suggest that it was more on account of support from groups other than Rajbanshis and other communities. The only segment of Dalits that the BJP was able to hold on to were the Namashudras (including Matua refugees), but among them, too, the party managed to make only meagre progress, and even that was limited to certain regions. In fact, for the BJP to have had any chance at defeating the Trinamool Congress, it needed to build on its 2019 base among Dalits as a whole. Far from it, it ended up losing some of them.\n\nFinally, as far as the upper castes (Brahmins, Kayasthas, Baidyas, etc.) are concerned, the story for the BJP was no different. Among them, too, the party registered some losses instead of making any gains, falling from 50% in 2019 to 46% this time. However, this modest loss of upper-caste support should not be misinterpreted as a loss of upper-class support for the BJP. Our data do not find them to be synonymous. The BJP actually led the Trinamool Congress by a good 13 and 14 percentage points among upper-class and middle-class Hindus, respectively. It faced some tough competition among the backward classes and the poorest Hindus — the party’s vote share among the poorest Hindus registered a massive 17-percentage-point decline compared to 2019.\n\nThe author is a Research Associate at Lokniti-CSDS, Delhi",
    "Title": "West Bengal Assembly Elections | Subaltern Hindutva on the wane?"
  },
  {
    "Date": "Thu, 06 May 2021 01:45:31 +0530",
    "Description": "Modi government “complete failure” in handling pandemic, vaccination and employment, he says",
    "Image": "https://th.thgim.com/news/national/jg822v/article34399108.ece/ALTERNATES/FREE_960/rahul-g",
    "Link": "https://www.thehindu.com/news/national/rahul-gandhi-seeks-transparency-demands-answers-in-distribution-of-foreign-aid/article34494240.ece",
    "Text": "Modi government “complete failure” in handling pandemic, vaccination and employment, he says\n\nFormer Congress president Rahul Gandhi on Wednesday asked Prime Minister Narendra Modi to be transparent about the foreign aid received to fight pandemic and demanded answers from the government.\n\n“Questions about COVID foreign aid: What all supplies has India received? Where are they? Who is benefiting from them? How are they allocated to States? Why no transparency? Any answers, GOI,” he asked in a tweet.\n\nAlso read: Need to be patient over foreign aid distribution, calls for transparency premature: German Ambassador\n\nMr. Gandhi also tweeted a short video clip of a Gurugram hospital where six patients were found dead after doctors abandoned them because of oxygen shortage. “This is murder. And cover up! My condolences to the families of the victim,” he said and tagged several other news reports from across the country about patients dying from lack of oxygen.\n\nAmidst reports that the relief material including critical medical supplies had been lying in Delhi airport as the Centre had been slow in preparing standard operating procedures, the Congress has been pressing the government to make details public about how much aid has been received and how it has been used.\n\n“1. @MoHFW_INDIA must inform nation what criterion is being used to distribute foreign aid? 2. How much has been donated/gifted by which nation? 3 . Which State & institutions has it gone too? 4. Who has taken the decisions with regards to it’s allocation? 5. Dashboard Required,” tweeted Lok Sabha member Manish Tewari.\n\nHis Lok Sabha colleague, Shashi Tharoor, joined in by tweeting that these are precisely the questions that international media is asking of the Indian government.\n\nTagging a special report on the collapse of healthcare in a government hospital in Uttar Pradesh because of the rush of patients and shortage of oxygen, former Finance Minister P. Chidambaram asked on twitter, “Will @drharshvardhan and @DrSJaishankar please watch this video telecast by CNN? This is what the rest of the world sees everyday. Do the two Ministers still deny there is acute shortage of oxygen and people are dying in hospitals for lack of oxygen?”\n\n“If the hearts of the two Ministers do not grieve after seeing these visuals, we will know what those hearts are made of,” he said.\n\nEarlier, Mr. Gandhi had tweeted that the Modi government has been a “complete failure” in handling the pandemic, vaccination and employment to people.\n\n“Neither vaccine, nor employment. People are facing the brunt of coronavirus. The Modi government has completely failed,” he said, citing a media report that mentioned the Centre for Monitoring Indian Economy (CMIE) claiming about 75 lakh job losses in April alone and unemployment rate touching the 8%-mark.",
    "Title": "Rahul Gandhi seeks transparency, demands answers in distribution of foreign aid"
  },
  {
    "Date": "Thu, 06 May 2021 01:06:55 +0530",
    "Description": "167 deaths recorded; 6,291 cases in Chennai",
    "Image": "https://th.thgim.com/news/national/tamil-nadu/tjrz6z/article34494032.ece/ALTERNATES/FREE_960/TH06-TN-DASH-BOARDcol",
    "Link": "https://www.thehindu.com/news/national/tamil-nadu/covid-19-daily-tally-surges-past-the-23000-mark/article34494033.ece",
    "Text": "167 deaths recorded; 6,291 cases in Chennai\n\nTamil Nadu’s COVID-19 daily tally hit a new high with 23,310 people testing positive on Wednesday. The State reported 167 deaths (73 in private and 94 in government hospitals), the highest number on a single day since the start of the pandemic.\n\nThe Health Department bulletin listed a few deaths that had occurred in the previous week.\n\n58 deaths in Chennai\n\nThe State’s toll rose to 14,779. Chennai reported 58 fatalities while 16 persons died in Chengalpattu. Kanniyakumari, Madurai and Ranipet accounted for eight deaths each. The dead included three persons aged in their 20s and 12 persons in their 30s.\n\nAmong the deceased was a 25-year-old man from Chennai, who was admitted to the Government Stanley Medical College Hospital on May 1. He had no co-morbidities and died on May 4 due to respiratory failure, lower respiratory tract infection and clinical COVID-19 pneumonia.\n\nA 30-year-old man from Coimbatore, who did not have co-morbid conditions, died at the Coimbatore Medical College Hospital on May 3 due to bilateral bronchopneumonia.\n\nChennai continued to report 6,000-plus fresh cases, with 6,291 people testing positive, taking its tally to 3,64,081.\n\nCoimbatore’s COVID-19 daily count soared past the 2,000-mark for the first time. The district recorded 2,029 cases, taking the total number of cases recorded so far to 86,261. Chengalpattu reported 1,755 cases while there were 1,385 cases in Tiruvallur. Madurai recorded 914 cases and Thoothukudi recorded 741 cases. No district had less than 100 cases on Wednesday. Twenty-four returnees tested positive for the infection in the State on Wednesday.\n\nThe fresh cases pushed the State’s overall tally to 12,72,602. A total of 1,28,311 people were under treatment across the State. As many as 20,062 people were discharged. Till date, 11,29,512 people have been discharged. after treatment.\n\nOn Wednesday, 1,55,382 samples were tested. Till date, 2,33,93,857 samples have been tested in the State.\n\nA total of 56,203 people, including 27,918 people aged 45 to 59 and 19,093 senior citizens, were vaccinated on Wednesday. With this, the overall coverage stood at 61,37,213. Vaccination was held in 3,027 sessions — Covishield 2,702 and Covaxin 325, according to the report by the Directorate of Public Health and Preventive Medicine.",
    "Title": "COVID-19 daily tally surges past the 23,000-mark"
  },
  {
    "Date": "Thu, 06 May 2021 08:42:11 +0530",
    "Description": "A select list of stories to read before you start your day.",
    "Image": "https://th.thgim.com/news/national/on4p4y/article34493712.ece/ALTERNATES/FREE_960/105075520211452481VIS5657JPG",
    "Link": "https://www.thehindu.com/news/national/morning-digest-may-6-2021/article34493713.ece",
    "Text": "A select list of stories to read before you start your day.\n\nThe current COVID-19 surge in India may begin to start tapering between the middle and end of May, virologist Gagandeep Kang said on Wednesday. At a virtual interaction with members of the Indian Women Press Corps, Dr. Kang said, “Best guess estimates from a number of models put this somewhere between the middle and end of the month. Some models have it [second wave] going out in early June. Based on what we are seeing now, middle to end of May would be a reasonable estimate.”\n\nThe United States will support an initiative at the World Trade Organisation (WTO) to waive Trade Related Intellectual Property Rights (TRIPS) protection for COVID-19 vaccines, the Biden administration said on Wednesday. The news will support the increased production of vaccines globally as countries, including India, continue to reel under the impact of the pandemic. The initiative was first floated by India and South Africa last October.\n\nWith India’s economic recovery threatened by the COVID-19 second wave, the Reserve Bank of India stepped in on Wednesday with measures aimed at alleviating any financing constraints for healthcare infrastructure and services, as well as small borrowers who may be facing distress due to a sudden spike in health expenditure.\n\nCumulatively, India has received (from April 27 to May 4) 1,764 oxygen concentrators, 1,760 oxygen cylinders, seven oxygen generation plants, 450 ventilators and more than 1.35 lakh Remdesivir vials and 1.20 lakh Favipiravir strips, said the Health Ministry on Wednesday.\n\nThere is no denying that the Bharatiya Janata Party (BJP) has massively increased its vote and seat share in West Bengal compared to the 2016 Assembly election, and this has largely been on the back of a strong Hindu consolidation behind it (50%), as per the Lokniti-CSDS’s post-poll survey.\n\nQuestioning the silence of Chief Minister Mamata Banerjee on the post-election attacks directed at the BJP workers, party national president J.P. Nadda on Wednesday said 14 workers of the party had been killed in the violence so far and about one lakh people had been affected.\n\nChina on Wednesday expressed “concern and regret” at India’s move to not include Chinese telecommunication firms among the companies permitted this week to conduct trials for the use of 5G technology.\n\nA third wave of COVID-19 is inevitable, given the amount of virus circulation, K. VijayRaghavan, principal scientific adviser to the Government of India, has warned. There was need to update the COVID-19 vaccines to deal with the new strains and mutations. “There is, however, no clear time-line on when this third phase will occur. We should be prepared for new waves and COVID appropriate behaviour and vaccine upgrades is the way forward,” he said at a press conference on Wednesday.\n\nThe Ministry of Home Affairs on Wednesday shot off another letter to the West Bengal government, saying no steps had been taken yet to abate the post-poll violence in the State.\n\nGermany is sending a massive oxygen plant on loan to Delhi on Thursday, capable of generating 4,00,000 litres of oxygen. The plant will service the DRDO-run Sardar Patel Covid Hospital, and will also help with refilling oxygen supplies for others. Speaking to The Hindu, German Ambassador Walter J. Lindner says calls for transparency in where all the foreign aid is going may be premature.\n\nThe COVID-19 pandemic has substantially increased informality in employment, leading to a decline in earnings for the majority of workers, and consequent increase in poverty in the country, according to ‘State of Working India 2021: One Year of Covid-19’, a report brought out annually by Azim Premji University’s Centre for Sustainable Employment, Bengaluru.\n\nOver half of the newly-elected MLAs of Assam, Kerala, Tamil Nadu, Puducherry and West Bengal had declared criminal cases against themselves in their election affidavits, the Association for Democratic Reforms said in a report on Wednesday.\n\nTamil Nadu Governor Banwarilal Purohit on Wednesday appointed DMK president M.K. Stalin as the Chief Minister and invited him to form the government in the State on May 7.\n\nWe recorded this episode to coincide with a series of articles that we will carry in The Hindu over the course of this week explaining the verdicts in the four States — West Bengal, Tamil Nadu, Kerala, Assam — and the Union Territory of Puducherry that went to the polls in March-April 2021.",
    "Title": "Morning digest: Virologist Gagandeep Kang says coronavirus surge may go down by May end, U.S. to support IP waiver for COVID-19 vaccines, and more"
  },
  {
    "Date": "Thu, 06 May 2021 07:57:47 +0530",
    "Description": "Election after election, women voters have continued to ally themselves with Mamata Banerjee’s party",
    "Image": "https://th.thgim.com/elections/west-bengal-assembly/bhmalv/article34466345.ece/ALTERNATES/FREE_960/TMC-workers-celebrate-in-South-Dinajpur",
    "Link": "https://www.thehindu.com/elections/west-bengal-assembly/women-rally-behind-trinamool-finds-csds-lokniti-survey/article34494083.ece",
    "Text": "Election after election, women voters have continued to ally themselves with Mamata Banerjee’s party\n\nOf the various factors that contributed to the Trinamool Congress’s victory in the Assembly election, the support of women voters for Mamata Banerjee is significant. And this is not new for this election — even in polls held during the last decade, women have always come out in support of Mamata Banerjee. Not only have women voters managed to bridge the turnout deficit vis-à-vis men, but their voting preferences have also been different. For the fourth straight election in the State (counting both Assembly and Lok Sabha elections), women voted for the Trinamool in higher proportions than men.\n\nAccording to the Lokniti-CSDS post-poll survey, the gender gap this time was to the tune of four percentage points, slightly lower than in the past, but still significantly large. While 46% of men voted for the Trinamool Congress, two points lower than the party’s average vote share, among women voters, support for the Trinamool Congress touched 50%. This higher-than-average voting for the Trinamool among women also meant that the ruling party got a far bigger advantage over its principal opponent, the Bharatiya Janata Party (BJP), among women than men. For men, the Trinamool Congress was ahead of the BJP by six percentage points, and among women, the Trinamool’s lead over the BJP was twice as high at a massive 13 percentage points.\n\nWomen voters seem to have been instrumental in driving up the Trinamool Congress’s seat numbers. A somewhat similar trend was witnessed in the 2016 Assembly election, when the Left Front-Congress alliance had trailed behind the Trinamool Congress by just two percentage points among men voters but by 12 percentage points among women.\n\nThe question that arises is, what has attracted women voters towards Mamata Banerjee election after election? It seems that many welfare schemes specifically targeted at women, like Kanyashree, Rupashree or bicycles for girl students, that the Mamata Banerjee-government launched during its tenure, may well have enhanced her popularity among women voters. Further, the fact that Ms. Banerjee has given greater representation to women in her party and government could also be making her more popular amongst women. This election saw the Trinamool Congress giving tickets to as many as 50 women, five more than the 2016 election.\n\nA number of schemes\n\nAnother possible explanation for the Trinamool doing exceedingly well among women voters this time could be the party’s election manifesto promise that it would provide a minimum monthly income to the woman head of every family — ₹500 for those from the general category and ₹1,000 for those from Scheduled Caste, Scheduled Tribe and OBC families. The Trinamool’s vote share among Dalit women was five percentage points more than it was among Dalit men, seven points more among upper-caste women, and 13 points more among Adivasi women.\n\nAnother category of women that particularly stood out in its support for the Trinamool this time was that of elderly women aged 45 years and above. Over half of them voted for the Trinamool and only some, about a third, opted for the BJP. Women from the poorest backgrounds also emerged as Trinamool’s strong supporters. Interestingly, the only category of women that ended up siding more with the BJP than the Trinamool in this election was that of upper-class women.\n\nThe author is co-director of the Lokniti programme at CSDS",
    "Title": "West Bengal Assembly Elections | Women rally behind Trinamool"
  },
  {
    "Date": "Thu, 06 May 2021 04:12:53 +0530",
    "Description": "‘We expect severe shortage within the next 10 to 15 days’",
    "Image": "https://th.thgim.com/news/national/mz048n/article34451607.ece/ALTERNATES/FREE_960/apollokb",
    "Link": "https://www.thehindu.com/news/national/tamil-nadu/major-private-hospitals-in-chennai-keep-an-eye-on-the-oxygen-supply/article34494108.ece",
    "Text": "‘We expect severe shortage within the next 10 to 15 days’\n\nMajor private hospitals in Chennai are keeping a close watch on their oxygen supply. Faced with last-minute supplies, some are feeling the heat and are apprehensive about an oxygen shortage in the coming weeks.\n\nThe steady rise in daily COVID-19 cases has led to an increase in infrastructural requirements in hospitals, with beds and oxygen supply being the most crucial.\n\nNavin Gnanasekaran, associate director of medical services, MGM Healthcare, said, “So far, oxygen supply is holding. Day to day, we are getting information from our biomedical department that vendors are supplying at the last minute. We are expecting severe oxygen shortage in Chennai within the next 10 to 15 days. Unless we can bring down the active cases by way of a lockdown, it is going to be a supply versus demand problem.”\n\n‘Situation may worsen’\n\nThough there was no oxygen shortage right now, hospitals are receiving supply at the last minute, he said, adding, “The situation is all set to worsen. We are anticipating a shortage of oxygen in the future. We are trying to rationalise our use of oxygen and procure oxygen concentrators for ward patients. The best concentrators can give eight to 10 litres of oxygen. Anybody with a higher requirement cannot be managed with concentrators.”\n\nAn official at a hospital, on the condition of anonymity, said, “It is a nail-biting wait for the truck.”\n\nOn average, the hospital has 150 to 170 patients on oxygen support. “Trucks to refill the liquid oxygen tanks do not come on time, putting pressure on us. Delay will send patients into desaturation. So, we are not taking too many patients requiring oxygen. We can take more if we have more supply,” he said.\n\n“The government should ensure that oxygen supply is increased and Remdesivir is available for private hospitals. Non-availability of Remdesivir is a setback. We have to send the patients’ attenders with a prescription to government medical college hospitals to get Remdesivir,” the official said.\n\nSanty Sajan, chief operating officer, Apollo Hospitals, Chennai, in a written reply to The Hindu, said, “We are grateful to the State authorities and local associates for ensuring regular and timely supplies of oxygen for the smooth running of operations at all our hospitals. We are closely monitoring the requirement of oxygen and other essential supplies as we enhance our critical bed capacity for extending care to our patients.”\n\nP. Ramakrishnan, State president of the Indian Medical Association - Tamil Nadu, said that with the increase in the number of COVID-19 cases, more admissions were expected. “There is a need for uninterrupted and prompt supply of oxygen for private hospitals. If the supply is increased, we will be trouble-free,” he said.\n\nAvailability of beds, Remdesivir and vaccines were among the other issues facing hospitals. At one hospital, all COVID-19 beds — wards, intensive care and holding area in the emergency room — were full. “We have another 50 to 60 patients requiring intensive care and ventilator-supported beds waiting, and another 50 to 60 patients in the waiting list for ward beds,” a hospital authority said.\n\n“We are unable to accommodate many patients. Our doctors, nurses and other staff and equipment are stretched out to take care of these many beds. Anything beyond will stretch our resources. Most of the doctors are heading for a burnout,” he added.\n\nDr. Gnanasekaran said Chennai would require at least 1,000 more ward beds and at least 200 more intensive care beds with all necessary equipment and manpower to handle the crisis for the next two months. “Our only hope is a lockdown for Chennai for at least 20 days, like in Maharashtra, to bring down the transmission,” he said.\n\nVaccination had come to a standstill in some private hospitals. The government should ensure that vaccination is carried out in full swing, a senior doctor said.\n\nMs. Sajan pointed out that they have ensured that currently over 50% of beds were dedicated for COVID care and they were geared up to further step up if required.",
    "Title": "Major private hospitals in Chennai keep a watch on oxygen supply"
  },
  {
    "Date": "Thu, 06 May 2021 11:29:57 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/india/madras-hcs-observations-against-election-commission-harsh-and-inappropriate-supreme-court/articleshow/82425851.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82425851.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>The Madras high court had observed that EC officials concerned should probably be tried on murder charges for their failure to ensure adherence to Covid-19 protocols during the election process in four states and a Union Territory.",
    "Image": "https://static.toiimg.com/thumb/msid-82425831,width-1070,height-580,imgsize-280968,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/india/madras-hcs-observations-against-election-commission-harsh-and-inappropriate-supreme-court/articleshow/82425851.cms",
    "Text": "NEW DELHI: The Supreme Court on Thursday said that the Madras high court 's observations against the Election Commission were harsh and inappropriate.\"There is need for judges of superior courts to exercise restraint and not make off the cuff remarks in court proceedings,\" the SC said.The Madras high court had observed that EC officials concerned should probably be tried on murder charges for their failure to ensure adherence to Covid-19 protocols during the election process in four states and a Union Territory.\"High court observations do not form part of judicial records and hence there is no necessity to dwell further on the caustic observations made by Madras HC,\" the SC said.The SC bench also said that media discharges an important function in adding vitality to democracy and it cannot be restricted from covering court proceedings in any manner.The Madras high court had, on April 26, castigated the EC for the surge in Covid-19 cases during the second wave of the pandemic, holding it \"singularly\" responsible for the spread of the viral disease, called it the \"the most irresponsible institution\" and even said its officials may be booked under murder charges.The poll panel allowing political parties to take out rallies and organise meetings had led to the surge in Covid cases, the HC had observed.(With inputs from agencies)",
    "Title": "Madras HC’s observations against Election Commission harsh and inappropriate: Supreme Court"
  },
  {
    "Date": "Thu, 06 May 2021 09:22:05 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/india/covid-19-us-approves-departure-of-non-emergency-govt-workers-from-india/articleshow/82424069.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82424069.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>The state department has advised Americans not to travel to India and said those wishing to depart should take advantage of available commercial transportation.",
    "Image": "https://static.toiimg.com/thumb/msid-82424067,width-1070,height-580,imgsize-213833,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/india/covid-19-us-approves-departure-of-non-emergency-govt-workers-from-india/articleshow/82424069.cms",
    "Text": "WASHINGTON: The US state department said on Wednesday it had approved the voluntary departure of non-emergency US government employees from India because of a surge in Covid-19 cases.Last week, the department said family members of US government employees could voluntarily leave India.A deadly second wave of coronavirus infections has swept through India in recent weeks, creating a shortage of hospital beds and oxygen for patients.The state department has advised Americans not to travel to India and said those wishing to depart should take advantage of available commercial transportation.",
    "Title": "Covid-19: US approves departure of non-emergency govt workers from India"
  },
  {
    "Date": "Thu, 06 May 2021 11:38:56 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/india/rld-chief-ajit-singh-succumbs-to-covid/articleshow/82425914.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82425914.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>",
    "Image": "https://static.toiimg.com/thumb/msid-82425982,width-1070,height-580,imgsize-194580,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/india/rld-chief-ajit-singh-succumbs-to-covid/articleshow/82425914.cms",
    "Text": "“Chaudhary sahab nahi rahe”\n\nLUCKNOW: The lethal Corona wave claimed the life of an important political figure on Thursday when Rashtriya Lok Dal ( RLD ) chief and former union minister Ajit Singh succumbed to the deadly virus. He was 82.Singh, son of stalwart farmer leader and former Prime Minister Chaudhary Charan Singh, breathed his last around 8.20 am at a private hospital in Gurgaon where he was admitted after testing positive for Covid on April 20. His son and RLD vice-president Jayant Chaudhary announced the passing away of his father, tweeting:(Chaudhary sahab is no more).The Chaudhary family, in a statement, said that it appreciated the efforts put in by his medical team and the support expressed by his many supporters and well-wishers. “Chaudhary Ajit Singh’s last rites were carried out maintaining Covid protocols. At this sensitive time, it is our express request not to come to Delhi to visit family or express grief. At this hour, giving full regard to Covid protocols and lending a helping hand if possible to relief efforts will be the appropriate way of paying tribute to Chaudhary Sahab,” the family said in a statement.Tributes poured in cutting across political lines as the news of the demise of Ajit Singh - a seven-time MP from Baghpat in west UP -- spread. Prime Minister Narendra Modi tweeted that Singh always stood for the cause of farmers. He termed Singh as an able leader who held responsibilities of various ministries in the past. “My condolences to his family and supporters,” the PM said.UP governor Anandi Ben Patel, chief minister Yogi Adityanath and UP BJP chief Swatantra Dev Singh too expressed their grief on the death of the RLD supremo. Congress leader Rahul Gandhi , his sister and party general secretary, Priyanka Gandhi Vadra too condoled the passing away of Singh saying that his death was a grave loss to Indian politics and society. SP chief Akhilesh Yadav termed Ajit Singh a `messiah of farmers and labourers’. BSP chief Mayawati paid tributes to Singh terming him as a highly popular leader amongst his supporters.",
    "Title": "RLD chief Ajit Singh succumbs to Covid"
  },
  {
    "Date": "Thu, 06 May 2021 10:17:03 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/india/in-biggest-daily-spike-india-records-4-12-lakh-new-cases-3980-deaths/articleshow/82424831.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82424831.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>India on Thursday recorded maximum fresh cases and fatalities in a day with 4,12,262 new infections and 3,980 deaths in the last 24 hours, the health ministry informed. This was the second time that the tally breached the 4-lakh mark, after 4,02,351 infections were recorded on April 30.",
    "Image": "https://static.toiimg.com/thumb/msid-82424809,width-1070,height-580,imgsize-573135,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/india/in-biggest-daily-spike-india-records-4-12-lakh-new-cases-3980-deaths/articleshow/82424831.cms",
    "Text": "NEW DELHI: India on Thursday recorded maximum fresh cases and fatalities in a day with 4,12,262 new infections and 3,980 deaths in the last 24 hours, the health ministry said.This was the second time that the tally breached the 4-lakh mark, after 4,02,351 infections were recorded on April 30.The total death toll is now 23,01,68 while the infection tally increased to 2,10,77,410, the data updated at 8 am showed.According to the data updated by the Union health ministry, India now has 35,66,398 active cases.A total of 3,29,113 people have been discharged in the last 24 hours after getting cured, the health ministry data added.The health ministry said that a total of 16,25,13,339 people have been vaccinated so far in the country, including 19,55,733, who were administered vaccines in the last 24 hours.According to the Indian Council of Medical Research (ICMR), 29,67,75,209 samples have been tested up to Wednesday (May 5) for Covid-19, of these 19,23,131 samples were tested on Wednesday.Amid a massive surge in infections, Karnataka reported 50,112 fresh cases on Wednesday, becoming the second state after Maharashtra to breach the 50,000 milestone in daily cases. Cases rose in Maharashtra as well, with the state recording 57,640 new infections, up from 51,880 on the previous day.Karnataka was among at least 12 states and UTs that recorded their biggest surge in daily cases. The others were Kerala (41,953 fresh cases), Tamil Nadu (23,310), Bengal (18,102), Punjab (8,015), Uttarakhand (7,783), Assam (4,826), J&K (4,716), Himachal (3,842), Goa (3,496), Puducherry (1,819) and Mizoram (238).",
    "Title": "In biggest daily spike, India records 4.12 lakh new cases, 3,980 deaths"
  },
  {
    "Date": "Thu, 06 May 2021 10:58:08 IST",
    "Description": "",
    "Image": "https://static.toiimg.com/thumb/msid-47529300,width-1070,height-580,imgsize-110164,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/india/eus-2-2-million-covid-aid-to-india-being-distributed-across-country/articleshow/82425064.cms",
    "Text": "NEW DELHI: As EU announced a 2.2 million euro assistance package for India on Wednesday, government sources said the aid arriving in India were being distributed to hospitals around the country.On Wednesday the new charge’d’affaires at the US Embassy , Dan Smith tweeted, “The US-India partnership involves all aspects of the relationship: government, business and people. This week vaccine components arrived in India from the US that will enable the manufacturing of 20 million doses of Covishield vaccine.”Twenty oxygen concentrators from Russia have been given to Lady Hardinge Medical College in Delhi. One large oxygen generating plant given by Italy has been sent to the ITBP hospital in Noida.France sent eight oxygen generating plants which were given to Narayana Super Speciality Hospital, Dharmshila Super specialty hospital and Sanjay Gandhi Medical Hospital; Indraprastha Apollo, Ambedkar Hospital have all received the French oxygen plants. Two others have been given to a hospital in Haryana and the Telangana Institute of Medical Sciences in Hyderabad.Government sources said, the overseas assistance is intended to bridge the gap until India can ramp up its own capacities.Refuting media reports, sources said US had second thoughts about sending an oxygen plant they had identified, because it would not be compatible with Indian systems. They had initially spoken about sending a team from CDC , but now they would do their work virtually, given the state of the pandemic here.But the first tranche of assistance from the US has gone largely to Safdarjang Hospital in Delhi — they include medicines, pulse oximeters, 700,0000 rapid detection kits, etc.Oxygen concentrators from Thailand have gone to Safdarjung Hospital and CGHS.Gilead Sciences has sent 4.5 lakh vials of remdesivir, which would be going to different states. India is in talks with Egypt to source remdesivir doses from there.Oxygen concentrators from Germany have gone to Safdarjung Hospital. Those gifted by Ireland have been sent to AIIMS Bhopal, AIIMS Jodhpur, AIIMS Jhajjhar, AIIMS Rishikesh, AIIMS Bhatinda, AIIMS Raipur, PGIMER, PGI ChandigarhOxygen concentrators from UK have been sent to AIIMS Jhajjhar, Lady Hardinge Medical College etc.The focus has been on Delhi hospitals because its the epicentre of the current surge and is fielding many more patients than in any other part of the country.",
    "Title": "EU's 2.2 million Covid aid to India being distributed across country"
  },
  {
    "Date": "Thu, 06 May 2021 08:57:00 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/india/tragic-covid-19-situation-in-india-should-raise-alarm-bells-for-all-of-us-unicef/articleshow/82423822.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82423822.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>United Nations Children's Fund (Unicef) has sent additional critical lifesaving supplies to India, including 2 million face shields and 200,000 surgical masks. \"The tragic situation in India should raise alarm bells for all of us,\" UNICEF Executive Director Henrietta Fore said on Tuesday. \"Unless the world steps up and helps India now, there will be reverberations across the region and the world in terms of virus-related deaths, virus mutations and supply delays.\"",
    "Image": "https://static.toiimg.com/thumb/msid-82424042,width-1070,height-580,imgsize-446041,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/india/tragic-covid-19-situation-in-india-should-raise-alarm-bells-for-all-of-us-unicef/articleshow/82423822.cms",
    "Text": "UNITED NATIONS: The \"tragic\" Covid-19 situation in India should raise the alarm bells for \"all of us\" and there will be reverberations across the region and the world in terms of virus-related deaths, virus mutations and supply delays unless the world steps up and helps the country now, the head of the UN children's agency has said.United Nations Children's Fund ( Unicef ) has sent additional critical lifesaving supplies to India, including 2 million face shields and 200,000 surgical masks.\"The tragic situation in India should raise alarm bells for all of us,\" Unicef Executive Director Henrietta Fore said on Tuesday.\"Unless the world steps up and helps India now, there will be reverberations across the region and the world in terms of virus-related deaths, virus mutations and supply delays.\"India is in the midst of a raging second wave of Covid-19 and is recording over 300,000 daily coronavirus infections and over 3,000 deaths. According to the World Health Organization (WHO), India has a total of 20.6 million confirmed Covid-19 cases and over 226,000 deaths.Countries across the South Asia region are witnessing rises in infections, with India accounting for over 90 per cent of both cases and deaths in the region, according to the World Health Organisation India also accounted for 46 per cent of global cases and 25 per cent of global deaths reported in the past week, WHO added.UNICEF Regional Director for South Asia George Laryea-Adjei said in a statement that urgent action and steadfast leadership are indispensable to stop the catastrophe.\"Governments must do everything within their power to stop the devastation, and partners that can send assistance must do so immediately. The international community must step up without delay,\" Laryea-Adjei said.\"This is not just a moral imperative. The deadly new surge in South Asia threatens us all. It has the potential to reverse hard-earned global gains against the pandemic if not halted as soon as possible,\" Laryea-Adjei added.Unicef said the \"scenes we are witnessing in South Asia\" are unlike anything the region has seen before.\"Family members of patients are pleading for help as the region reels under an acute shortage of medical-grade oxygen. Exhausted health workers are being pushed to the brink of collapse. We are faced with a real possibility that our health systems will be strained to a breaking point - leading to even more loss of life.\"Laryea-Adjei said the very low levels of vaccination in South Asia magnify the likelihood of the virus spiralling even further out of control. In almost all countries in the region, except for the Maldives and Bhutan, fewer than 1 in 10 people have been vaccinated.\"Now more than ever, we must ensure vaccines equitably reach all populations. Manufacturing must be ramped up, technology transferred, and doses equitably shared. None of us is safe until all of us are safe,\" Laryea-Adjei said.Laryea-Adjei said the first wave of the pandemic caused drastic cuts in the availability and use of essential public health services in South Asia, costing the lives of an estimated 228,000 children and 11,000 mothers.\"We simply cannot let this happen again. We must do everything within our power to keep essential health, immunization and nutrition services running - and make sure women and children everywhere feel safe to use them. Viruses know no borders. We must come together now as a global community to stop the devastation and protect our children.\"The UN agency said it has provided oxygen concentrators and other critically needed emergency equipment to support the immediate response in the country, while also supporting resilience-building against recurrent shocks and stresses to the health system that leave children and their families at risk.Unicef has supplied 85 Covid-19 testing machines, which form a crucial part of the Government of India's response to the pandemic.Additionally, Unicef is supporting the procurement and installation of 25 oxygen plants for hospitals in the Northeast and Maharashtra , and the installation of more than 70 thermal scanners at various ports of entry countrywide.Since the start of the pandemic, Unicef has also been working with the government and partners in India to help stop the spread of Covid-19, sharing information with more than 660 million people on how to stay safe from the coronavirus.It has consistently worked to counter misinformation and promote Covid-19 protective practices, including wearing masks, physical distancing, and handwashing.Unicef said it needs $21 million for the urgent delivery of additional testing equipment, supplies and oxygen products in India, and more than $50 million for lifesaving Covid-19 interventions across sectors.Unicef said end-to-end logistics support from DP World helped the equipment was dispatched from Unicef's warehouse in Dubai to New Delhi to help India battle the deadly wave of Covid-19.DP World Group Chairman and CEO Sultan Ahmed bin Sulayem said the company partnered with Unicef because dealing with the Covid-19 pandemic is \"humanity's biggest logistics challenge in living memory.\"\"This emergency shipment of medical supplies is just one of many operations DP World will be supporting worldwide. The UAE and India have strong ties, and we stand by India through this devastating pandemic,\" he said.",
    "Title": "Tragic Covid-19 situation in India should raise alarm bells for all of us: Unicef"
  },
  {
    "Date": "Thu, 06 May 2021 09:20:55 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/india/jaishankar-others-in-isolation-after-2-members-of-meas-g7-team-test-covid-positive-in-uk/articleshow/82424065.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82424065.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>",
    "Image": "https://static.toiimg.com/thumb/msid-82424081,width-1070,height-580,imgsize-752182,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/india/jaishankar-others-in-isolation-after-2-members-of-meas-g7-team-test-covid-positive-in-uk/articleshow/82424065.cms",
    "Text": "DELHI/ LONDON: The pandemic situation in India made another round of global headlines Wednesday after 2 members of foreign minister S Jaishankar-led delegation at G7 were reported to have tested positive in London. Official government sources here said though that this wasn’t a \" straightforward case of coming in with infected people\" and that all members of the delegation were reported negative by Covid tests carried out 48 hours before they embarked on the May 3-6 visit to the UK.The 4-member delegation, including Jaishankar and, went into \"self-isolation\" after the minister was informed by UK authorities of \"possible\" exposure to the virus. All members were tested after they landed in London. As he himself announced in a tweet, Jaishankar participated virtually in what was the first physical meeting of the G7 foreign ministers in 2 years. India was at the meeting as a special invitee. Jaishankar himself was not among the 2 said to have tested positive.\"Was made aware yesterday evening of exposure to possible Covid positive cases. As a measure of abundant caution and also out of consideration for others, I decided to conduct my engagements in the virtual mode. That will be the case with the G7 Meeting today as well,\" tweeted the minister. Among the dignitaries with whom Jaishankar had a meeting in person in the past few days were US secretary of state Antony Blinken and UK home secretary Priti Patel British officials were quoted as saying that the isolation of the Indian officials was in keeping with the strictly laid out protocol for the G7 meeting that required daily testing of the attendees. However, while UK authorities insisted that 2 officials had tested positive, official sources here hinted there might be a mismatch between the Covid-19 protocols followed by the 2 countries.There are now question marks also over the return of the delegation from the UK. Local Covil protocol requires a person to self-isolate for 10 days if he or she has tested positive or if the person has come in contact with anybody who has Covid. While sources in London said the return would depend on Indian authorities, the fact that the delegation flew commercial could complicate things.Sources in the UK pointed to Jaishankar’s tweet when asked if his meeting with his counterpart Dominic Raab at Chevening on Thursday will also be held in virtual mode.\"One thing for sure is that no infected person would have been allowed to travel with the minister. The delegation members were tested not 72 hours, but 48 hours before the departure,\" claimed a source, adding that the government was in touch with UK authorities on the issue. Public Health England had waived the need to self-isolate for those participating in G7 meetings as these were being held with strong social distancing measures.",
    "Title": "Jaishankar, others in isolation after 2 members of MEA’s G7 team ‘test Covid positive’ in UK"
  },
  {
    "Date": "Thu, 06 May 2021 09:50:53 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/india/rld-chief-ajit-singh-dies-of-covid-19/articleshow/82424398.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82424398.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>Former Union minister and RLD chief Ajit Singh died due to Covid-19 at a hospital on Thursday. 82-year-old Singh was a prominent leader in Western Uttar Pradesh. He contracted Covid on April 20 and was getting treated at a hospital in Gurugram.",
    "Image": "https://static.toiimg.com/thumb/msid-82424978,width-1070,height-580,imgsize-319579,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/india/rld-chief-ajit-singh-dies-of-covid-19/articleshow/82424398.cms",
    "Text": "चौधरी साहब नहीं रहे!🙏🏽 https://t.co/7cnLkf0c6K — Jayant Chaudhary (@jayantrld) 1620272415000\n\nhttps://t.co/xIxgNh839Q — Jayant Chaudhary (@jayantrld) 1620272463000\n\nपूर्व केंद्रीय मंत्री चौधरी अजित सिंह जी के निधन से अत्यंत दुख हुआ है। वे हमेशा किसानों के हित में समर्पित रहे। उ… https://t.co/XcGc6vPDTE — Narendra Modi (@narendramodi) 1620273315000\n\nराष्ट्रीय लोक दल प्रमुख अजित सिंह जी के असमय निधन का समाचार दुखद है।उनके परिवार व प्रियजनों को मेरी संवेदनाएँ। https://t.co/m4iZ9SAC93 — Rahul Gandhi (@RahulGandhi) 1620272681000\n\nचौधरी अजीत सिंह के निधन का समाचार बेहद पीड़ादायक हैं। अपने लम्बे सार्वजनिक जीवन में वे हमेशा जनता और ज़मीन से जुड़े… https://t.co/kSP8EWpPQp — Rajnath Singh (@rajnathsingh) 1620273036000\n\nRLD chief Ajit Singh dies of Covid-19\n\nMEERUT: Chaudhary Ajit singh, 82, Rashtriya Lok Dal chief and former Union minister passed away at a private hospital in Gurugram on Thursday morning, his son Jayat Chaudhary confirmed. Ajit Singh had contracted Covid-19 and was tested positive last month.\"Chaudhary Ajit Singh ji was diagnosed as Covid positive on the 20th April. He battled his condition till the very end and breathed his last today morning, the 6th of May, 2021,\" Jayant tweeted.Senior party members claimed the cremation, due to the raging pandemic, was a low-key affair with only close family members in attendance.\"As the nation confronts the horrific pandemic, it is our humble request to all those who wish to pay their respects, to please stay at home as far as possible. We must observe all safety protocols to keep ourselves and everyone around us healthy and safe. This would be the best way to honour Chaudhary Sahib as well as those Covid warriors who are working night and day to protect us,\" Jayant said in a tweet.Born in Meerut, Ajit Singh, son of former Prime Minister and formidable farmer leader Chaudhary Charan Singh, began his political career as a Rajya Sabha MP in 1986.Ajit Singh was inducted as Union ministry of industry in the VP Singh government in 1989 and also served as food minister in the P V Narasimha Rao government.An IIT aluminum and seven-time member of the Lok Sabha, Ajit Singh formed Rashtriya Lok Dal and joined the Atal Bihari Vajpayee government as agriculture minister in 2001.Senior leaders across party lines condoled the demise. \"Extremely sad on the demise of former Union Minister Chaudhary Ajit Singh ji . He was always devoted to the interests of the farmers. He efficiently discharged the responsibilities of several departments at the center. My condolences to his family and supporters in this hour of mourning. Om Shanti!\" Prime Minister Narendra Modi said in a tweet.\"The news of the untimely demise of Rashtriya Lok Dal chief Ajit Singh is sad. My condolences to his family and loved ones,\" Rahul Gandhi said.Defence minister Rajnath Singh said,\" The news of Chaudhary Ajit Singh's demise is very painful. In his long public life, he was always connected with the public and the land. At the same time, he also struggled for the interests of farmers, laborers and other weaker sections. My condolences to his family and supporters.\"",
    "Title": "Former Union minister and RLD chief Ajit Singh dies of Covid-19"
  },
  {
    "Date": "Thu, 06 May 2021 06:25:17 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/india/11-covid-patients-die-in-hospital-near-chennai-as-o2-pressure-drops/articleshow/82422941.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82422941.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>Eleven Covid-19 patients died gasping for breath after midnight on Wednesday at Chengalpet Government Medical College Hospital as pressure in the oxygen lines dropped suddenly, possibly because of a faulty valve.",
    "Image": "https://static.toiimg.com/thumb/msid-82422790,width-1070,height-580,imgsize-87455,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/india/11-covid-patients-die-in-hospital-near-chennai-as-o2-pressure-drops/articleshow/82422941.cms",
    "Text": "CHENNAI: Eleven Covid-19 patients died gasping for breath after midnight on Wednesday at Chengalpet Government Medical College Hospital as pressure in the oxygen lines dropped suddenly, possibly because of a faulty valve.Earlier, on Tuesday afternoon, pressure had dropped in a similar fashion, leaving two patients dead. Pressure had been restored immediately and normal supply resumed. But around midnight, the pressure dropped again drastically and within two hours, 11 people had died.A patient in the ICU said he watched helplessly as a woman two beds away struggled for breath and passed away. \"The fear that you could be next is the worst thing that can happen to anyone,\" he said.Hospital authorities said they had replaced a coil near the main valve of the oxygen pipelines last week and consumption had nearly doubled ever since, even when there was no increase in the number of patients.Witnesses said doctors and nurses rushed around trying to save children and adults using handheld devices and portable oxygen cylinders. They also had to face frantic relatives of patients, who insisted their people be attended to first. Amid the chaos, pressure was restored by 2am. The hospital had 447 patients on Tuesday and almost 70% required oxygen support.Chengalpet district collector A John Louis said oxygen consumption almost doubled on Tuesday compared to the usual levels and continuous efforts were taken to ensure that supply was not interrupted. He has ordered an investigation. “Oxygen supply was not interrupted at the hospital. I was there on the field last night and personally monitored the situation,” he said.Meanwhile, duty doctors at the hospital staged a protest within the premises on Wednesday morning. “Relatives of people who choked to death were furious with us and no one came to our aid between midnight and 2am,” said one of them. Protesting doctors said they were shortstaffed and overburdened.The hospital has Covid patients on eight different floors in three buildings. Each floor is managed by one doctor and a maximum of two nurses. “So it becomes difficult to handle the situation even when two patients need immediate medical attention,” a duty doctor told TOI, requesting anonymity.",
    "Title": "Eleven die as oxygen pressure dips in Chengalpet govt hospital"
  },
  {
    "Date": "Thu, 06 May 2021 09:22:27 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/india/covid-19-delhi-gets-high-per-capita-allocation-of-oxygen/articleshow/82423807.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82423807.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>The Union government on Wednesday informed the Supreme Court that Delhi has got higher per capita oxygen allocation as compared to similarly placed other states and asserted that a uniform pan-India approach has to be adopted in disbursement of oxygen depending on the caseload.",
    "Image": "https://static.toiimg.com/thumb/msid-82424080,width-1070,height-580,imgsize-74156,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/india/covid-19-delhi-gets-high-per-capita-allocation-of-oxygen/articleshow/82423807.cms",
    "Text": "NEW DELHI: The Union government on Wednesday informed the Supreme Court that Delhi has got higher per capita oxygen allocation as compared to similarly placed other states and asserted that a uniform pan-India approach has to be adopted in disbursement of oxygen depending on the caseload.Solicitor general Tushar Mehta informed a bench of Justices D Y Chandrachud and M R Shah that per capita allocation of liquid medical oxygen (LMO) to Delhi, that is allocation against number of active cases, is higher compared to any other similarly placed States.\"As against the active cases of 96,747 as on May 1, allocation to GNCT is 590 MT LMO, which translates to 60.98 litres per patient. The per capita allocation of States having high active caseload - Kerala (6.42), Tamil Nadu (18.74), Chhattisgarh (18.74), Haryana (25.07), Maharashtra (27.09), Andhra Pradesh (36.71), Telangana (53.29), is therefore, far less.\"The Centre in its affidavit before the SC on Wednesday said active cases in Delhi have begun to show a declining trend from 1,03,424 on April 28 to 92,290 on May 3. The dip in cases should also be factored while demands are made by the Delhi government.The Centre presented the forecast for the requirement of LMO for various states, which mostly showed a higher trend. Maharashtra's requirement on May 5 was 1,804 MT against 2,000 MT on April 30; UP 894 (800); Karnataka 865 (111); Gujarat 975 (1200); Delhi 590 (490); Punjab 257 (82); Kerala 208 (104); Tamil Nadu 404 (465); Madhya Pradesh 649 (700); Rajasthan 380 (124); Chhattisgarh 227 (382); Haryana 257 (180). It also projected demands for other states as on May 5 - Telangana 480 MT; West Bengal 308; Bihar 214 and Uttarakhand 123.The Centre said, \"allocation is a zero-sum game: any change in increasing the supply of one state would have a cascading impact on others wherein, like Delhi, the need of oxygen is rising sharply. Therefore, the need for oxygen is to be balanced, optimised and judiciously distributed at a national level, with a national outlook.\"It said no other state has complained about allocated quantity falling short of the requirement, except Delhi where the problem appears to be systemic problem in the last mile delivery. The Centre said, \"It is critical to note that 17 Additional tankers/ISO containers have also been allotted for use in Delhi with a total capacity of 331 MTs LMO. Over and above the same, the Air Force also provided 31 sorties between April 26 to May 4 for Delhi, where 20 oxygen tankers were lifted with a total capacity of 457 MTs LMO.\"",
    "Title": "Covid-19: Delhi gets high per capita allocation of oxygen"
  },
  {
    "Date": "Thu, 06 May 2021 07:52:05 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/india/india-appreciates-biden-admins-decision-to-back-trips-waiver-for-covid-19-vaccines/articleshow/82423243.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82423243.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>For the past several weeks, India's ambassador to US Taranjit Singh Sandhu had been meeting US lawmakers and officials regarding the proposal. \"We appreciate the US administration's announcement today of its support for waiver of IPR for Covid-19 vaccines,” Sandhu said.",
    "Image": "https://static.toiimg.com/thumb/msid-82423242,width-1070,height-580,imgsize-1008649,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/india/india-appreciates-biden-admins-decision-to-back-trips-waiver-for-covid-19-vaccines/articleshow/82423243.cms",
    "Text": "WASHINGTON: India has appreciated the Biden administration's decision to support a proposal moved by it and South Africa to temporarily waive some Trade-Related Aspects of Intellectual Property Rights TRIPS ) rules amid the coronavirus pandemic.For the past several weeks, India's ambassador to the US Taranjit Singh Sandhu , along with the diplomats from South Africa, had been meeting US lawmakers and officials regarding the proposal.\"We appreciate the US administration's announcement today of its support for waiver of IPR for Covid-19 vaccines,” Sandhu told PTI on Wednesday.Making the announcement, US trade representative Katherine Tai said this is a global health crisis, and the extraordinary circumstances of the Covid-19 pandemic call for extraordinary measures.\"The (Biden) administration believes strongly in intellectual property protections, but in service of ending this pandemic, supports the waiver of those protections for Covid-19 vaccines,” Tai said in a major policy announcement.A majority of Democratic Congressmen had written to President Joe Biden urging him to back the proposal so that vaccines can be made accessible and affordable.\"We also thank the large number of US Senators and Congresspersons who expressed their support. We will continue to work with all stakeholders in the US to collectively fight the global pandemic including through equitable distribution of affordable vaccines for global public health at this critical juncture,” Sandhu said in response to a question.In the past few months, the Indian Embassy had made a focused outreach on the need for equitable access to Covid-19 vaccines in the developing world.The embassy methodically reached out to the members of the House and Senate . This was reflected in the series of letters that the US lawmakers wrote to President Biden in support.In recent months, Sandhu has spoken on this issue to Senators Ed Markey and Raphael Warnock; Congresswoman Katherine Clark, Assistant Speaker; Congressman Gregory Meeks, Chair of House Foreign Affairs Committee; Congresswoman Pramila Jayapal, Chair of the Progressive Caucus; Congresswoman Jan Schakowsky and Congressman Ro Khanna.A joint outreach was also undertaken with the South African Embassy in Washington DC and together, the two envoys had underscored the importance of the issue with Congresswoman Karen Bass, Chair House Foreign Affairs Subcommittee on Africa and Global Health.",
    "Title": "India appreciates Biden admin's decision to back TRIPS waiver for Covid-19 vaccines"
  },
  {
    "Date": "Thu, 06 May 2021 01:04:38 +0530",
    "Description": "‘Favourable wind pattern keeping the day temperature normal’",
    "Image": "https://th.thgim.com/news/national/tamil-nadu/yme5ei/article34493981.ece/ALTERNATES/FREE_960/06THHEAT2615452021131255101SUMMERKVSJPG",
    "Link": "https://www.thehindu.com/news/national/tamil-nadu/imd-predicts-hot-weather-from-may-10/article34493982.ece",
    "Text": "‘Favourable wind pattern keeping the day temperature normal’\n\nMost parts of the State are being spared of soaring mercury levels even as peak summer days, the season locally referred to as Kathiri, has started.\n\nFavourable wind pattern and weather system over the Bay of Bengal has kept the day temperatures close to normal so far.\n\nOn Wednesday, the weather stations in Nungambakkam and Meenambakkam recorded 35 degree Celsius, which are close to average day temperature for the day. However, people in coastal regions would experience sultry weather due to the high humidity levels as in 70% at Nungambakkam.\n\nIn its bulletin, the Meteorological Department has said the humidity level hovered between 50% and 90% over the coastal and adjoining districts. People may experience a “real feel” temperature that is likely to be more than the normal by four or five degree Celsius.\n\nOfficials of the Meteorological Department said that a trough or wind discontinuity, a line across which there would be an abrupt change in wind direction, would spark up thunderstorms with light to moderate rains in few places over Western Ghats, interior and southern parts of Tamil Nadu till May 8. Thundershowers may be restricted to Western Ghats till the weekend.\n\nIn 24 hours ending 8.30 a.m. Wednesday, Suralacode in Kanniyakumari district and Sankarankoil in Tenkasi district received 7 cm of rains each.\n\nN. Puviarasan, Director, Area Cyclone Warning Centre, Regional Meteorological Centre, Chennai, said a cyclonic circulation over the Comorin area and the neighbourhood would influence pre-monsoon showers over parts of the State.\n\nRecalling the heat wave period during early April, he said wind direction was a major determining factor for rise or fall in day temperature.\n\nAnticyclone system\n\nAn anticyclone, a weather phenomenon that has winds in clockwise direction slowly blowing around it, is prevailing over the Bay of Bengal. This had been pushing cool, moist east-southeasterly winds into the Tamil Nadu region and keeping maximum temperature close to average.\n\nHowever, there may be a rise in mercury level after May 10 as this system may disappear and the anticyclone over Arabian sea bringing in westerly winds would persist. As the hot westerlies are expected to blow across the inland, temperature was set to rise, officials said.\n\nThe Meteorological Department forecasts that the maximum and minimum temperature will be around 36 degree Celsius and 28 degree Celsius respectively in Chennai till Friday.",
    "Title": "IMD predicts hot days from May 10"
  },
  {
    "Date": "Thu, 06 May 2021 00:53:02 +0530",
    "Description": "Work to add 2,900 oxygen points in Chennai nearing completion, says DME",
    "Image": "https://th.thgim.com/news/national/tamil-nadu/bnrw75/article34493828.ece/ALTERNATES/FREE_960/TH06OXYGEN-tank",
    "Link": "https://www.thehindu.com/news/national/tamil-nadu/health-dept-ramps-up-oxygen-beds/article34493829.ece",
    "Text": "Work to add 2,900 oxygen points in Chennai nearing completion, says DME\n\nWith the rise in the number of patients requiring oxygen, the Health Department is adding over 6,000 oxygen beds in government medical college hospitals across the State.\n\nIn Chennai alone, 2,900 oxygen points are being added in the government COVID-19 hospitals.\n\nR. Narayana Babu, Director of Medical Education, said the oxygen consumption was being reviewed on a daily basis.\n\n“The number of patients requiring oxygen has increased. Earlier, 10% of patients required oxygen. This has increased to 30% now,” he said.\n\nWork to add 2,900 oxygen points in Chennai was nearing completion. “Of this, Madras Medical College will have 550, Stanley Medical College Hospital will have 500, Government Corona Hospital in Guindy will have 250 and Kilpauk Medical College Hospital will have 100 points,” he said.\n\nAnother 3,400 oxygen supported beds will be readied across the State, he said. “Already, we have 4,000 oxygen supported beds. In total, government medical college hospitals in the State have a total of 53,000 beds for COVID-19 patients. We will increase the number of beds based on the need. We will use some oxygen beds in non-COVID wards for treating COVID-19 patients,” he added.\n\nIncreasing manpower\n\nThe Health Department was taking measures to increase manpower to manage patients with COVID-19.\n\n“We are getting 1,200 doctors from mini clinics and 2,500 nurses who were on contract with the Directorate of Medical and Rural Health Services. Private colleges are deputing nurses for our institutions in Chennai, Chengalpattu and Coimbatore. Already, 500 nurses have been posted, while another 500 would be deputed to Chennai,” he said.\n\nHe added the pre-final nursing students were also being asked to join duty.",
    "Title": "Health Dept. ramps up oxygen beds"
  },
  {
    "Date": "Thu, 06 May 2021 00:06:32 GMT",
    "Description": "Getting trapped in a boy band reality TV contest was just the start of Lelush's unlikely journey.",
    "Image": "https://ichef.bbci.co.uk/news/1024/branded_news/6181/production/_118316942_lelush10.png",
    "Link": "https://www.bbc.co.uk/news/world-asia-china-56967923",
    "Text": "\"Much of China has been lifted out of poverty, but youths' desires to fulfil their dreams, that have become increasingly difficult... So it's a huge barrier, but at the same time there are still these expectations [to do well],\" says Dr K Cohen Tan, associate professor of digital media and cultural studies at University of Nottingham Ningbo China.",
    "Title": "Lelush: How a sulky Russian model became China's slacker icon"
  },
  {
    "Date": "Thu, 06 May 2021 01:02:27 +0530",
    "Description": "Swearing-in at 9 a.m. tomorrow",
    "Image": "https://th.thgim.com/news/national/tamil-nadu/hb64hd/article34493962.ece/ALTERNATES/FREE_960/06THSTALINGOVERNOR",
    "Link": "https://www.thehindu.com/news/national/tamil-nadu/governor-appoints-stalin-as-cm/article34493963.ece",
    "Text": "Swearing-in at 9 a.m. tomorrow\n\nGovernor Banwarilal Purohit on Wednesday appointed DMK president M.K. Stalin as the Chief Minister and invited him to form the government in the State on May 7.\n\nEarlier, Mr. Stalin called on Mr. Purohit at the Raj Bhavan and staked claim to form the government. Mr. Stalin handed over the letter of his election as leader of the DMK Legislature Party.\n\n“The Governor appointed him [Mr. Stalin] as the Chief Minister and invited him to form the Ministry and to have swearing-in ceremony on May 7 at 9 a.m. at Raj Bhavan,” said an official communication on Wednesday.\n\nEarlier, Governor’s Secretary Anandrao Vishnu Patil called on Mr. Stalin and handed over the official communication to him, party sources said. Official sources said the swearing-in ceremony woul be kept simple.\n\nDMK general secretary Duraimurugan, treasurer T.R. Baalu, principal secretary K.N. Nehru and Rajya Sabha member R.S. Bharathi accompanied Mr. Stalin to the Raj Bhavan.\n\nSpeaking to reporters after meeting the Governor, Mr. Bharathi said that Mr. Stalin handed over to the Governor the resolution unanimously adopted at the DMK MLAs meeting on Tuesday electing Mr. Stalin as the Legislature Party leader. Asked if all members of the new Council of Ministers would be sworn-in on Friday, Mr. Bharathi said the party would take a decision on the issue.",
    "Title": "Governor appoints Stalin as CM"
  },
  {
    "Date": "Thu, 06 May 2021 00:56:32 +0530",
    "Description": "Thrissur Government Medical College Hospital implements project with public participation",
    "Image": "https://th.thgim.com/news/national/kerala/5iqdqs/article34493902.ece/ALTERNATES/FREE_960/06tvtrpranajpg",
    "Link": "https://www.thehindu.com/news/national/kerala/prana-to-ensure-oxygen-to-in-patients-in-thrissur-mch/article34493903.ece",
    "Text": "Thrissur Government Medical College Hospital implements project with public participation\n\nAt a time when the entire country is gasping for oxygen, Prana Air for Care, a project introduced at Government Medical College Hospital (MCH), Thrissur, to reach oxygen supply directly to in-patient beds, is drawing attention.\n\nIntroduced sometimes ago with public participation, the project aims at providing oxygen for all in-patients.\n\nThe project has high relevance, especially in the time of the surge in COVID-19 cases.\n\nDesigned by the doctors at the hospital, the project has been implemented in 500 beds in six wards in the first stage.\n\nEach unit costs around ₹12,000. Doctors, voluntary organisations, patients and old-students have contributed to the project. The plan is to extend oxygen supply to all the 1,450 beds in the hospital.\n\nPeople who are ready to be part of the project can donate their share.\n\nNew oxygen plant\n\nMeanwhile, work on an oxygen plant has been finished at hospital and is ready for inauguration.\n\nThe plant would start functioning soon, the District Collector said.\n\n“Oxygen availability has been ensured in the district. All cylinders on industrial use will be procured for medical purpose. Directive has already been issued in this regard,” the Collector said.",
    "Title": "Prana to ensure oxygen to in-patients in Thrissur MCH"
  },
  {
    "Date": "Thu, 06 May 2021 00:54:55 +0530",
    "Description": "OP block opened at MCH, 500 ICU beds at General Hospiatl",
    "Image": "https://th.thgim.com/news/national/kerala/6ixlsh/article34493858.ece/ALTERNATES/FREE_960/06tvtrmchjpg",
    "Link": "https://www.thehindu.com/news/national/kerala/3731-cases-in-thrissur/article34493859.ece",
    "Text": "OP block opened at MCH, 500 ICU beds at General Hospiatl\n\nCOVID-19 cases continue to rise in the district. The district recorded 3,731 cases on Wednesday and 1,532 people recovered from the disease. Test positivity rate in the district is 26.13%. Most parts of the district have been declared containment zones.\n\nActive cases in the district are 41,708 and 110 people from the district are undergoing treatment in various other districts. So far 1,65,924 COVID-19 cases have been reported from the district and 1,23,856 people have recovered.\n\nAccording to official statistics, 3,705 people, including nine health-care workers, contracted the disease through local contact on Wednesday. Of them, 573 are above the age of 60 and 205 are children below 10. In all, 3,581 people are under home care.\n\nAs many as 14,276 samples were collected for tests on Wednesday.\n\nA total of 5,81,236 people have been administered the first dose of COVID-19 vaccine so far while 1,23,906 have been administered the second dose.\n\nOP block\n\nMeanwhile, a COVID-19 out-patient (OP) block was opened at the Government Medical College Hospital here as number of cases continues unabated. The block was earlier closed after cases declined during the first wave.\n\nAs part of COVID-19 management, 500 ICU beds will be arranged at the Thrissur General Hospital (GH). The Thrissur Corporation would bear the expense for this, Mayor M.K. Varghese said. The Corporation would also install a permanent oxygen plant in the hospital, the Mayor said.\n\nCentralised oxygen lines will be set up at the General Hospital. A 5,000-sq-ft waiting centre will be arranged at the hospital for the COVID-19 out-patients. Urgent steps will be taken to ensure sufficient numbers of employees at the hospital.",
    "Title": "3,731 cases in Thrissur"
  },
  {
    "Date": "Thu, 06 May 2021 00:17:00 +0530",
    "Description": "Give information of vaccine stock early to people, says MLA",
    "Image": "https://th.thgim.com/news/national/karnataka/8pe0tc/article34493653.ece/ALTERNATES/FREE_460/05mnvedavyaskamath",
    "Link": "https://www.thehindu.com/news/national/karnataka/do-not-keep-people-waiting-for-long-outside-vaccination-centres/article34493654.ece",
    "Text": "Give information of vaccine stock early to people, says MLA\n\nWhile asking the authorities concerned to give preference to those who come to vaccination centres for their second dose of COVID-19 vaccine, Mangaluru City South MLA D. Vedavyas Kamath on Wednesday said that information about availability of vaccine should be given to people early and they should not be made to wait for long outside vaccination centres.\n\nExpressing anguish over people waiting outside the AYUSH Block of the Government Wenlock Hospital since 8 a.m., Mr. Kamath said,\n\n“Do not make them wait till 1 p.m. and then say vaccine is not available. There should be a better system of managing people visiting the centre when vaccine supply is limited,” he said.\n\nMr. Kamath said that apart from those aged 45 and above who have registered online for their second dose, preference should also be given to those in that age category who come directly to the health centres. If vaccine is available then it can be administered to those who have come to receive their first dose, he said.\n\nLater, in a meeting with doctors at the Wenlock Hospital, Mr. Kamath expressed the need for proper use of COVID-19 testing facility at the hospital to ensure reports are available within 24 hours.\n\nHe also said that a help desk should be set up at the hospital to provide information to family members of COVID-19 patients admitted there.\n\nThere should not be any shortage of staff in dedicated COVID-19 hospital. Bodies of patients who die should be immediately disposed of.\n\nIf family members do not come forward to perform the last rites, arrangements should be made to perform them using the services of social activists, he said.\n\nMr. Kamath was accompanied by Mayor Premanand Shetty and Chairman of Karnataka Fisheries Development Corporation Nitin Kumar.",
    "Title": "‘Do not keep people waiting for long outside vaccination centres’"
  },
  {
    "Date": "Thu, 06 May 2021 02:40:31 +0530",
    "Description": "After the Assembly election results were declared on May 2, several instances of poll-related violence, which left several dead, were reported in the State.",
    "Image": "https://th.thgim.com/news/national/jq0zwa/article34493881.ece/ALTERNATES/FREE_960/CPI-ML-Liberation-Agitation-in-Kolkata",
    "Link": "https://www.thehindu.com/news/national/centre-seeks-report-from-west-bengal-on-post-poll-violence/article34493882.ece",
    "Text": "After the Assembly election results were declared on May 2, several instances of poll-related violence, which left several dead, were reported in the State.\n\nThe Ministry of Home Affairs on Wednesday shot off another letter to the West Bengal government, saying no steps had been taken yet to abate the post-poll violence in the State.\n\nIt asked the State government to take steps to stop the violence and send a report immediately. It added that if the report was not received the “matter will be viewed seriously”.\n\nThe Ministry had on May 3 written a similar letter to the State government and sought a report. It reminded the State on Wednesday that it was yet to receive the report.\n\nAlso Read BJP protests in Chennai against Mamata over post-results violence in WB\n\nAfter the Assembly election results were declared on May 2, several instances of poll-related violence, which left several dead, were reported in the State.\n\nThe Bharatiya Janata Party has claimed that six of its members were killed in various incidents. The Communist Party of India (Marxist) and the Congress party have also alleged attacks on their cadres.\n\nThe ruling Trinamool Congress has also claimed that some of its party workers had been killed.",
    "Title": "Centre seeks report from West Bengal on post-poll violence"
  },
  {
    "Date": "Thu, 06 May 2021 00:21:51 +0530",
    "Description": "‘No doctor to issue prescription for purchase from anywhere’",
    "Image": "https://th.thgim.com/news/national/other-states/pkkivf/article34493603.ece/ALTERNATES/FREE_960/haryana",
    "Link": "https://www.thehindu.com/news/national/other-states/haryana-govt-issues-guidelines-on-tocilizumab-distribution/article34493604.ece",
    "Text": "‘No doctor to issue prescription for purchase from anywhere’\n\nThe Haryana government has issued guidelines surrounding the distribution of Tocilizumab doses to individual COVID patients in public or private health institutions.\n\nThe government guidelines state that no doctor or hospital shall issue prescription for Tocilizumab for purchase of the same from anywhere, as distribution of the drug is controlled by government. The government statement added that it shall be the personal responsibility of the hospital administrator of the institute requisitioning Tocilizumab to ensure appropriate use of prescription medicine, coordination with health authorities and keeping records for audit.\n\n“If Tocilizumab is issued and the patient dies before use, then the hospital shall reimburse the cost to the kin and keep the drug in stock for use in future,” it said.\n\nCurbs on black market\n\nThe Haryana Police has since April 23 registered as many as 21 FIRs in connection with black-marketeering of oxygen, oxygen cylinders and anti-viral drug Remdesivir across the State.\n\nA total of 45 persons have been arrested in these cases, while 77 oxygen cylinders and 101 vials of Remdesivir have been recovered.\n\nDirector General of Police (DGP) Manoj Yadava on Wednesday said that the demand for oxygen and Remdesivir had gone up after a massive outbreak of COVID-19. “Taking advantage of the situation, many unscrupulous persons and some employees of private hospitals indulged in the black-marketeering of oxygen and Remdesivir.”\n\nMr. Yadava said since April 23, 2021, a total of 8 FIRs had been registered in six districts of Haryana and 12 persons arrested.\n\n“Similarly, 33 accused have been arrested by lodging 13 FIRs against them in eight districts after the recovery of 101 vials of Remdesivir from their possession,” he said.\n\n“In addition, a total of 1,249 cylinders have been collected by the police as a voluntary contribution from factory owners, welding shop owners, gas balloons sellers and ordinary citizens which have been made available to district administrations,” he added.",
    "Title": "Haryana government issues guidelines on Tocilizumab distribution"
  },
  {
    "Date": "Thu, 06 May 2021 06:46:55 +0530",
    "Description": "Cites removal of Health Minister for political reasons during pandemic",
    "Image": "https://th.thgim.com/news/national/telangana/b1prsc/article34495351.ece/ALTERNATES/FREE_960/05hyrrr02-KCR-iGAD8I9AKR3jpgjpg",
    "Link": "https://www.thehindu.com/news/cities/Hyderabad/cm-more-interested-in-politics-than-peoples-health-says-bhatti/article34493019.ece",
    "Text": "Cites removal of Health Minister for political reasons during pandemic\n\nCongress Legislature Party(CLP) leader Bhatti Vikramarka said Chief Minister K. Chandrasekhar Rao’s insensitivity in the pandemic reflected again when he removed the Health Minister for political reasons when people were going through the toughest time of their lives.\n\nSpeaking to reporters here along with Sangareddy MLA T. Jayaprakash Reddy and MLC T. Jeevan Reddy, he said the CM had taken over the Health portfolio and did not even review it when there was a medical emergency in the State with rising cases and depleting support from the government. “It’s unfortunate that people were dying without oxygen supply and the CM is least bothered about it,” he alleged.\n\nHe said the CM went back on his promise made in the Assembly of including corona in Aarogyasri. Poor people were hit by lack of medical and financial resources to deal with the virus but the CM is still unmoved.\n\nHe wanted to know what happened to the Task Force on Corona and reminded that it would present its report even to the opposition leaders. “Has the committee ever met,” he asked and demanded that the government reveal the outcome of the report and the measures taken by the government on the recommendations.\n\nMr. Bhatti also took a dig at Chief Secretary Somesh Kumar, saying he was misleading people with false information on the availability of medicines and treatment at the hospitals.\n\n“Let us all go and visit the hospitals to get a first hand report,” he said, adding that responsible officials should speak truths only.\n\nThe Congress leader also demanded that the CM realise how the private hospitals were fleecing people. He said the opposition was ready to cooperate with the government and the CM should call for a meeting of opposition parties and their views so that a constructive plan could be implemented in dealing with the pandemic.\n\nWill meet CM: Jagga\n\nMr. Jagga Reddy said that they will seek an appointment with the Chief Minister and if he doesn’t respond it will only expose his failure. He said every citizen of the State should go back safely to their homes fully recovered like the CM recoverd and it was CM’s responsibility to ensure that.\n\nMr. Reddy said Chief Minister was more interested in land issues than the health issues of people.",
    "Title": "CM more interested in politics than people’s health, says Bhatti"
  },
  {
    "Date": "Thu, 06 May 2021 00:03:30 +0530",
    "Description": "Pandemic moving towards eastern States, say officials",
    "Image": "https://th.thgim.com/news/national/2nl6qs/article34493425.ece/ALTERNATES/FREE_960/shipmentkb",
    "Link": "https://www.thehindu.com/news/national/covid-19-global-aid-allocated-to-states-says-centre/article34493426.ece",
    "Text": "Pandemic moving towards eastern States, say officials\n\nCumulatively, India has received (from April 27 to May 4) 1,764 oxygen concentrators, 1,760 oxygen cylinders, seven oxygen generation plants, 450 ventilators and more than 1.35 lakh Remdesivir vials and 1.20 lakh Favipiravir strips, said the Health Ministry on Wednesday.\n\n“All items received up to May 4 have been allocated to the States/institutions and substantial part of it stands delivered. This is an ongoing exercise,” it said.\n\nIndia has been receiving donations since April 27 from countries including the U.K., Ireland, Romania, Russia, the UAE, the U.S., Taiwan, Kuwait, France, Thailand, Germany, Uzbekistan, Belgium, Italy, etc.\n\nHealth Secretary Rajesh Bhushan along with Member (Health), NITI Aayog Vinod K. Paul chaired a meeting on Wednesday with Assam, West Bengal, Odisha, Bihar and Jharkhand.\n\n“Evidence suggests that the pandemic is moving eastward and a rise has been observed in the number of daily cases in these States along with rising mortality,” the Ministry said in a release.",
    "Title": "Coronavirus | All foreign aid allocated to States: Centre"
  },
  {
    "Date": "Thu, 06 May 2021 00:49:05 +0530",
    "Description": "Stop Vedanta’s unit from reopening, scrap highway projects and nuclear plants are their demands",
    "Image": "https://th.thgim.com/news/national/tamil-nadu/bj0nbv/article34493753.ece/ALTERNATES/FREE_960/06THSALEMIMGTH09EXPRESSWAY21CK81V37Sjpg",
    "Link": "https://www.thehindu.com/news/national/tamil-nadu/environmental-activists-write-to-stalin/article34493755.ece",
    "Text": "Stop Vedanta’s unit from reopening, scrap highway projects and nuclear plants are their demands\n\nVarious organisations and prominent personalities, including director Vetrimaran, actor Vijay Sethupathi, former Madras High Court judge (retd) D. Hariparanthaman, have written to Tamil Nadu Chief Minister-designate M.K. Stalin to not allow the Vedanta copper smelter unit to be reopened, scrap the Chennai-Salem 8-lane highway project and the additional four proposed Kudankulam nuclear plants, among other environment-related issues.\n\nThey also requested the CM-designate to prosecute the directors of the Vedanta copper smelter unit, scrap the Adani port expansion at Kattupalli, the Kanniyakumari International Container Terminal, the Chittoor-Thachur 6-lane expressway, and withdraw the AIADMK government’s request for denotification of the Vedanthangal sanctuary and f or reduction of the protective buffer of Pulicat sanctuary.\n\nAt a time when development needs a reorientation and the country requires strong environmental laws, the Union government is busy diluting the meagre protection offered by the laws, such as EIA notification and Coastal Regulation Zone notification, they charged.\n\nEnvironmental degradation hurts women, the poor, historically marginalised communities, farmers and fishworkers disproportionately. To remain true to its values of social justice and equity, Tamil Nadu has to evolve stricter laws and better environmental due diligence to make up for the lack of it in the Central laws, they said.\n\nThe signees further requested Mr. Stalin to ensure that Hindustan Unilever’s mercury-contaminated Kodaikanal factory site is cleaned up to global standards, prohibit use of genetically engineered seeds in Tamil Nadu, bring in a comprehensive groundwater legislation with stringent norms to limit commercial extraction and use.\n\nEnacting State-level laws to strengthen and realise objectives of the CRZ and EIA notifications, safeguarding the ecological integrity of the Western and Eastern Ghats were among other issues raised in the letter.\n\nThe letter was signed by V. Vasanthi Devi, former Vice Chancellor; Nityanand Jayaraman, social activist; Sultan Ahmed Ismail, scientist and educator; T.M. Krishna, musician; Ananthoo of Safe Food Alliance; Fatima Babu, Anti-Sterlite People’s Movement; M.G. Devasahayam, former IAS officer; G. Sundararajan, Poovulagin Nanbargal, a few advocates, various environmental groups, child rights activists and agricultural groups.",
    "Title": "Environmental activists, write to Stalin"
  },
  {
    "Date": "Thu, 06 May 2021 00:32:06 +0530",
    "Description": "‘States can only make suggestions to the President or the statutory commissions’",
    "Image": "https://th.thgim.com/news/national/hcrj3w/article34472787.ece/ALTERNATES/FREE_960/SupremeCourtofIndia",
    "Link": "https://www.thehindu.com/news/national/centre-alone-can-identify-sebc-supreme-court/article34493318.ece",
    "Text": "‘States can only make suggestions to the President or the statutory commissions’\n\nThe Centre alone is empowered to identify socially and educationally backward classes (SEBC) and include them in the Central List for claiming reservation benefits.\n\n“The President (that is the Central government) alone, to the exclusion of all other authorities, is empowered to identify SEBCs and include them in a list to be published under Article 342A (1), which shall be deemed to include SEBCs in relation to each State and Union Territory for the purposes of the Constitution,” Justice S. Ravindra Bhat, whose opinion was concurred by Justices L. Nageswara Rao and Hemant Gupta on the five-judge Bench, held.\n\nAlso Read Supreme Court declares Maratha quota law unconstitutional\n\nJustice Bhat said the States could only make suggestions to the President or the statutory commissions concerned for inclusion, exclusion or modification of castes and communities to be included in the List.\n\nThe Central List is to be the “only list” for the SEBC.\n\n“Once published, under Article 342A (1), the list can only be amended through a law enacted by Parliament, by virtue of Article 342A (2),” Justice Bhat said. “In the task of identification of SEBCs, the President shall be guided by the Commission (National Commission for Backward Classes) set up under Article 338B; its advice shall also be sought by the State in regard to policies that might be framed by it,” the court said.\n\nAlso Read Maratha reservation: A timeline of events\n\n“If the commission prepares a report concerning matters of identification, such a report has to be shared with the State government, which is bound to deal with it, in accordance with provisions of Article 338B. However, the final determination culminates in the exercise undertaken by the President (i.e. the Central Government, under Article 342A (1),” the court clarified.\n\nHowever, “the President’s prerogative as far as the identification and inclusion of SEBCs in the List would not affect the States’ power to make reservations in favour of particular communities or castes, the quantum of reservations, the nature of benefits and the kind of reservations, and all other matters falling within the ambit of Articles 15 and 16”.\n\nThe court asked the National Commission for Backward Classes to “conclude its task expeditiously, and make its recommendations after considering which, the President shall expeditiously publish the notification containing the list of SEBCs in relation to States and Union Territories”.",
    "Title": "Maratha quota | Centre alone can identify socially and educationally backward classes: Supreme Court"
  },
  {
    "Date": "Thu, 06 May 2021 06:59:32 +0530",
    "Description": "Sources indicate restrictions could be continued in the light of spiralling numbers",
    "Image": "https://th.thgim.com/news/national/karnataka/upausw/article34488184.ece/ALTERNATES/FREE_960/Yediyurappa",
    "Link": "https://www.thehindu.com/news/national/karnataka/extension-of-lockdown-will-depend-on-pms-direction-cm/article34493450.ece",
    "Text": "Sources indicate restrictions could be continued in the light of spiralling numbers\n\nKarnataka, currently under partial lockdown, is awaiting further instructions from the Centre on strictures to be imposed to curb the spread of COVID-19 in the State.\n\nChief Minister B.S. Yediyurappa, on Wednesday, said that though curfew has been imposed, the State was awaiting further guidelines and instructions from Prime Minister Narendra Modi. “It is quite natural for the Centre to issue directions during this time. We will follow it,” he said.\n\nHis response came after presspersons asked him if the State was looking at a stricter curfew in the coming days as numbers were not declining enough. Incidentally, Wednesday saw the total number of cases crossing the 50,000 mark.\n\n“Since the current curfew restrictions are in force till May 12, we are yet to decide on it. We will wait for the Centre’s directives,” speaking after the 119th birth anniversary celebration of former Chief Minister K.C. Reddy here on Wednesday.\n\nMeanwhile, sources aware of the developments, strongly indicated that the curfew could be extended beyond May 12, and that it would be for at least one week.\n\n“The numbers over the next three days would be a barometer before the government decides. We are not very sure if the government would be willing to ease restrictions if the numbers do not fall below 20,000. This is also unlikely to happen in the next three days,” sources said.\n\nThe sources also said that the government was weighing options before a decision to extend curfew is taken since the livelihood of a large population is also at stake. While the last lockdown received considerable help from the Centre to deal with livelihood issues, no such support is assured to States this time, sources said. “There is a lot of pressure on the State government to save livelihoods,” an officer said.\n\n“In the last two to three days, there has not been much discussion over the extension as oxygen shortage and Chamarajanagar incidents took precedence. The Technical Advisory Committee is also watching the numbers. The government decision will be based on what the TAC will also suggest,” sources said.",
    "Title": "Extension of lockdown will depend on PM’s direction: CM"
  },
  {
    "Date": "Thu, 06 May 2021 10:37:00 +0530",
    "Description": "1,63,321 samples tested, case pool rises to 3,75,658",
    "Image": "https://th.thgim.com/news/national/kerala/xv6v15/article34495873.ece/ALTERNATES/FREE_960/image-48jfif",
    "Link": "https://www.thehindu.com/news/national/kerala/state-tally-shoots-up-to-41953/article34493323.ece",
    "Text": "1,63,321 samples tested, case pool rises to 3,75,658\n\nDaily new cases of COVID-19 crossed the 40,000 mark on Wednesday to record 41,953 cases when 1,63,321 samples were tested in the past 24 hours. This is also the highest number of tests done by the State till date.\n\nThe increase in test numbers brought the average test positivity rate slightly down to 25.69%. The peak of the second wave is still at least two weeks away and the disease transmission is likely to remain high.\n\nThe active case pool of the State has grown to include 3,75,658 patients.\n\nA record number of 58 deaths were added to the official COVID toll, taking the cumulative toll to 5,565.\n\nThis included 18 deaths reported from Thiruvananthapuram (between May 2-3), 14 from Thrissur, 11 from Kollam, six from from Kozhikode, four from Kannur, three from Malappuram, while one death each was reported from Wayanad and Ernakulam.\n\nThe number of COVID patients being treated in hospitals has risen to 28,740, with 3,868 patients getting newly admitted on Wednesday.\n\nThe number of critically ill persons being treated in ICUs stands at 2,033. Of these, 818 are on ventilator support.\n\nAt present, a total of 7,55,453 persons have been put on home or institutional isolation in the State.\n\nOn Wednesday, 23,106 patients were declared to have recovered from COVID and let off from hospitals/institutions. The total recoveries till date is 13,62,363.\n\nThe cumulative case burden of the State ever since the pandemic began, now stands at 17,43,932 cases.\n\nErnakulam continues to have the highest number of active cases with 58,378 patients, followed by Kozhikode (50,865), Malappuram (43,045), Thrissur (42,187), and Thiruvananthapuram (31,179).\n\nThiruvananthapuram has the highest number of hospitalised patients at 4,177, while Ernakulam, even with a much higher active case pool, has less hospitalisations at 3,988. Except for Kollam, all other districts have over 10,000 active cases.\n\nAmong districts, Ernakulam went to another new high as far as new cases are concerned, reporting 6,558 cases, Kozhikode 5,180, Malappuram 4,166, Thrissur 3,731, Thiruvananthapuram 3,727, Kottayam 3,432, Alappuzha 2,951, Kollam 2,946, Palakkad 2,551, Kannur 2,087, Idukki 1,396, Pathanamthitta 1,282, Kasaragod 1,056, and Wayanad 890 cases.",
    "Title": "Coronavirus | Kerala tally shoots up to 41,953"
  },
  {
    "Date": "Thu, 06 May 2021 11:41:32 +0530",
    "Description": "Despite a fierce Hindutva push, the BJP failed to retain the level of Hindu support it garnered in 2019",
    "Image": "https://th.thgim.com/elections/west-bengal-assembly/r3upa0/article34310600.ece/ALTERNATES/FREE_960/AmitShah",
    "Link": "https://www.thehindu.com/elections/west-bengal-assembly/the-limits-to-polarisation-in-bengal-finds-csds-lokniti-survey/article34494009.ece",
    "Text": "Despite a fierce Hindutva push, the BJP failed to retain the level of Hindu support it garnered in 2019\n\nThere is no denying that the Bharatiya Janata Party (BJP) has massively increased its vote and seat share in West Bengal compared to the 2016 Assembly election, and this has largely been on the back of a strong Hindu consolidation behind it (50%), as per the Lokniti-CSDS’s post-poll survey. But the party failed to retain the level of Hindu support (57%, or nearly three-fifths) it had secured in the 2019 Lok Sabha election, thus ending up faring way below its own expectations and its performance in the last general election.\n\nimage/svg+xml Note: Figures are percentages, the rest of the voters voted for other parties and candidates 1. Compared to 2019, Hindus moved away from the BJP and Muslims’ consolidation behind Trinamool strengthened further Voted for Trinamool Voted for BJP 2016 2019 2021 2016 2019 2021 Hindu 43 32 39 12 57 50 Muslim 51 70 75 6 4 7\n\nThe Trinamool Congress was a direct beneficiary of this erosion of votes, with the party registering an increase in Hindu support from 32% in 2019 to 39% this time. This seven-percentage-point shift from the BJP to the Trinamool happened despite the former running a high-pitched Hindutva campaign that was aimed at exciting Hindus through Jai Shri Ram slogans, talk of illegal migration, allegations of ‘Muslim appeasement’ against the ruling party, and anti-Muslim dog whistles, such as raising the spectre of West Bengal becoming a ‘mini-Pakistan’ and calling Chief Minister Mamata Banerjee ‘begum’ and ‘khala’.\n\nThe post-poll survey conducted by Lokniti-CSDS and data from our study after the 2019 Lok Sabha election together point to the story of limited Hindu consolidation. This has also to do with the way the Hindu mind in West Bengal seems to be working at the moment.\n\nAlso Read West Bengal Assembly Elections | Women rally behind Trinamool\n\nIn our 2019 survey, we asked respondents in West Bengal (and the rest of the country) a set of questions to gauge their views on secularism, the temple-mosque dispute and minority rights. Surprisingly, despite political polarisation, full-fledged communalisation had not occurred in the State, as it was found that many Hindus, including those who voted for the BJP, gave highly secular and pluralistic answers to most of these questions, and far more so than their counterparts in other regions of the country.\n\nFor instance, on a question on the 1992 Babri Masjid demolition, only one in every five Hindus in Bengal had said that demolition was justified, as opposed to two-fifths in the rest of the country. Similarly, a huge majority of Hindus in Bengal (81%) held that India is a country of all religions, and not just Hindus. The same figure among Hindus in the rest of the country was 74%.\n\nimage/svg+xml “1992 Babri Masjid demolition was..” Hindus (West Bengal) Hindus (All India) Justifed 21 39 Not Justifed 42 32 No response 37 29 “India belongs to..” Only Hindus 8 17 To all religions equally, not only Hindus 81 74 No response 11 9 “Minorities should get..” Special Treatment 32 50 Equal and not special treatment 29 29 No response 39 21 Note: Figures are percentages and may not add up to 100 due to rounding 2. Did the BJP misjudge the Bengali Hindu mind? Evidence from 2019\n\nOn the issue of protecting minority rights, 38% of Hindus in West Bengal agreed with the proposition that even if it is not liked by the majority community, the government must protect the interests of minorities. This sentiment, in fact, strengthened further to 58% this time, when we repeated this question in our survey.\n\nAlso read: Subaltern Hindutva on the wane in West Bengal?\n\nWhat these responses indicate is that even as average Bengali Hindus may have supported the BJP in large numbers in 2019, the reasons for doing so were different and not necessarily an endorsement of the BJP’s Hindutva agenda. This perhaps explains why the BJP’s support among Hindu voters declined this time instead of increasing. Heavily polarising rhetoric by the BJP in the recent election may well have alienated the liberal tolerant section of the Bengali Hindus from the BJP, particularly the traditional Left voters, who had shown interest in the party in 2019. It also seems to have had the effect of scaring Muslims who consolidated in even larger proportions (75%) behind the Trinamool Congress than they had in 2019. The Trinamool, thus, ended up benefiting both ways.\n\nimage/svg+xml Should the State government get another chance? “The Mamata Banerjee government gives undue favour to Muslims” % HOW THEY VOTED Trinamool BJP Hindus who fully agreed with the statement 36 18 72 Hindus who somewhat agreed 32 45 41 Hindus who somewhat disagreed 4 68 25 Hindus who fully disagreed 11 70 19 No response 17 45 42 Note: Figures are percentages, the rest of the voters voted for other parties and candidates. 3. Even as most Hindus agreed that the Mamata Banerjee government had favored Muslims unduly, many of them still voted for the Trinamool Congress, particularly those who agreed only partially\n\nThe story, of course, has another side. There is some traction to the idea that the government accorded undue favours to minorities. While a majority of the Hindus in the rest of the country had no problem with it, in West Bengal, the support for the idea was lukewarm, with many being ambivalent on the issue. In fact, in the 2021 survey, most Hindus, even the ones who ended up voting for the Trinamool Congress, agreed with the proposition that the party had given undue favours to Muslims during its tenure, an issue that the BJP had raised. It is nonetheless interesting that many of them continued to vote for the Trinamool despite holding this view.\n\nNone of this is to say that there was no polarisation on religious lines in this election. But the divide was mostly restricted to seats where the Muslim population was higher in proportion. It is also important to note that the Hindu share in the Trinamool’s votes was 57% this time and the Muslim share was 42%; in 2019, it had been 50% for each.\n\nimage/svg+xml Voted for Trinamool Voted for BJP Hindu vote choice in seats with... Muslims <10% population 43 42 Muslim 10-19% 42 46 Muslims 20-29% 26 68 Muslims 30-39% 40 53 Muslim 40%+ 24 65 Muslims <10% population 74 20 Muslim 10-19% 87 3 Muslims 20-29% 70 13 Muslims 30-39% 84 5 Muslim 40%+ 72 6 Note: Figures are percentages, the rest of the voters voted for other parties. 4. Hindus tended to vote more for the BJP in seats with higher proportion of Muslims, but the battle for the Hindu vote was neck and neck elsewhere Muslim vote choice in seats with...\n\nIn sum, the BJP, which prides itself on knowing the Hindu mind, may have failed spectacularly in deciphering the Bengali Hindu psyche. It has been unable to transform the majority community into a minority-hating monolith.\n\nMoreover, the majority community was also divided on the basis of caste, class, gender and other social identities, and the Hindutva campaign clearly fell short in catering to everyday concerns around development and livelihood. In the cultural rubric of Bengal’s politics, there was limited room for uni-dimensional religious polarisation, a fact that the BJP took very lightly.\n\nSuprio Basu is with the Department of Sociology, University of Kalyani; Jyotiprasad Chatterjee is Associate Professor of Sociology at Barrackpore Rastraguru Surendranath College; Shreyas Sardesai is a Research Associate at Lokniti-CSDS, Delhi; Suhas Palshikar is the Co-Director of the Lokniti programme",
    "Title": "West Bengal Assembly Elections | The limits to polarisation in Bengal"
  },
  {
    "Date": "Thu, 06 May 2021 06:10:11 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/04/Mamata-Banerjee-sitalkuchi-2.jpg",
    "Link": "https://indianexpress.com/article/india/mha-four-member-team-probe-post-poll-violence-bengal-7304065/",
    "Text": "West Bengal CM Mamata Banerjee meets the families of those killed in Sitalkuchi, Cooch Behar violence. (ANI)\n\nThe Union Home Ministry has formed a four-member fact finding team to look into reasons for the post poll violence in West Bengal and also assess the ground situation in the state, officials said on Thursday.\n\nThe team, led by an additional secretary of the ministry, has left for the state.\n\nOn Wednesday, the ministry had sent a terse reminder to the West Bengal government to submit a detailed report on the post-poll violence and to take necessary measures to stop such incidents “without any loss of time”.\n\nAlso Read | Centre turns up heat on violence, Mamata shunts top officials\n\nAt least six people were killed in post-poll violence in different parts of the state till Tuesday.",
    "Title": "MHA forms four-member team to probe post poll violence in West Bengal"
  },
  {
    "Date": "Thu, 06 May 2021 03:17:06 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/05/Biden-Sandhu.jpg",
    "Link": "https://indianexpress.com/article/india/india-appreciates-biden-admins-decision-to-back-trips-waiver-for-covid-19-vaccines-7303836/",
    "Text": "US President Joe Biden (L) and India's Ambassador to the US Taranjit Singh Sandhu. (File)\n\nIndia has appreciated the Biden administration’s decision to support a proposal moved by it and South Africa to temporarily waive some Trade-Related Aspects of Intellectual Property Rights (TRIPS) rules amid the coronavirus pandemic.\n\nFor the past several weeks, India’s Ambassador to the US Taranjit Singh Sandhu, along with the diplomats from South Africa, had been meeting US lawmakers and officials regarding the proposal.\n\n“We appreciate the US administration’s announcement today of its support for waiver of IPR for COVID-19 vaccines,? Sandhu told PTI on Wednesday.\n\nMaking the announcement, US Trade Representative Katherine Tai said this is a global health crisis, and the extraordinary circumstances of the COVID-19 pandemic call for extraordinary measures.\n\n“The (Biden) administration believes strongly in intellectual property protections, but in service of ending this pandemic, supports the waiver of those protections for COVID-19 vaccines,? Tai said in a major policy announcement.\n\nA majority of Democratic Congressmen had written to President Joe Biden urging him to back the proposal so that vaccines can be made accessible and affordable.\n\n“We also thank the large number of US Senators and Congresspersons who expressed their support. We will continue to work with all stakeholders in the US to collectively fight the global pandemic including through equitable distribution of affordable vaccines for global public health at this critical juncture,? Sandhu said in response to a question.\n\nIn the past few months, the Indian Embassy had made a focused outreach on the need for equitable access to COVID-19 vaccines in the developing world.\n\nThe embassy methodically reached out to the members of the House and Senate. This was reflected in the series of letters that the US lawmakers wrote to President Biden in support.\n\nIn recent months, Sandhu has spoken on this issue to Senators Ed Markey and Raphael Warnock; Congresswoman Katherine Clark, Assistant Speaker; Congressman Gregory Meeks, Chair of House Foreign Affairs Committee; Congresswoman Pramila Jayapal, Chair of the Progressive Caucus; Congresswoman Jan Schakowsky and Congressman Ro Khanna.\n\nA joint outreach was also undertaken with the South African Embassy in Washington DC and together, the two envoys had underscored the importance of the issue with Congresswoman Karen Bass, Chair House Foreign Affairs Subcommittee on Africa and Global Health.",
    "Title": "India appreciates Biden admin’s decision to back TRIPS waiver for COVID-19 vaccines"
  },
  {
    "Date": "Thu, 06 May 2021 05:08:53 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2020/11/AP20305634492722.jpg",
    "Link": "https://indianexpress.com/article/india/us-reissues-travel-advisory-urges-americans-not-to-travel-to-india-7304001/",
    "Text": "In this file photo, passengers stand on line at John F. Kennedy International Airport in the Queens borough of New York. (AP Photo/John Minchillo, File)\n\nThe US has reissued its travel advisory on India, urging its citizens not to travel to the country due to an unprecedented surge in the COVID-19 cases there.\n\nIndia is struggling with a second wave of the pandemic with more than 3,00,000 daily new coronavirus cases being reported in the past few days, and hospitals are reeling under a shortage of medical oxygen and beds.\n\n“Do not travel to India due to COVID-19. Exercise increased caution due to crime and terrorism,” the State Department said on Wednesday in its latest travel advisory that looked identical to the one issued on April 28.\n\nBoth the travel advisory has been marked ‘Level 4’ which is the highest warning level.\n\nOn April 28, the Department approved the voluntary departure of family members of US government employees.\n\nOn May 5, the Department approved the voluntary departure of non-emergency US government employees.\n\n“US citizens who wish to depart India should take advantage of available commercial transportation options,” it said.\n\nLast week, the Centers for Disease Control and Prevention (CDC) issued a Level 4 Travel Health Notice for India due to COVID-19, indicating a very high level of COVID-19 in the country.\n\nA record 3,780 fresh COVID-19 fatalities were registered in a single day in India taking the death toll to 2,26,188, while 3,82,315 new coronavirus infections were recorded, according to the Union Health Ministry data updated on Wednesday.\n\nWith the fresh cases, the total tally of COVID-19 cases in the country climbed to 2,06,65,148.",
    "Title": "US reissues travel advisory urges Americans not to travel to India"
  },
  {
    "Date": "Thu, 06 May 2021 05:48:33 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/05/kochi-new.jpg",
    "Link": "https://indianexpress.com/article/india/kerala/kerala-covid-lockdown-7304057/",
    "Text": "The Kerala government on Thursday announced a full lockdown in the state from May 8 to 16 in view of the rising cases in the second wave of Covid-19. The decision was announced a day after the state reported a record 41,953 infections. The lockdown will come into force at 6 am on Saturday.\n\nThe state had earlier brought in strict restrictions that prevented unnecessary travel and reduced attendance in offices.\n\nHowever, health experts and police departments advised the government to impose a complete lockdown as the current measures were failing to bring down the state’s Covid-19 graph.\n\nKerala’s active caseload is 3.75 lakh, the third highest in India. Its test positivity rate on Wednesday was 25.69 per cent. With the number of patients admitted to hospitals increasing, the state’s health infrastructure has come under immense pressure.\n\nThe state government recently urged the Centre to allot it 1,000 MT of imported liquid medical oxygen, apart from demanding tankers, PSA plants, oxygen concentrators and ventilators.\n\nChief Minister Pinarayi Vijayan urged Prime Minister Narendra Modi, in a letter, to advise the External Affairs Ministry to allot the required quantity of imported liquid medical oxygen partially from the current tranche of imports and the balance from future imports, in view of the depletion of storage due to the heavy daily demand.\n\nWith admission of patients to hospitals on the rise, the CM said 61 per cent of oxygen beds in medical colleges and 51.28 per cent of oxygen beds in other government hospitals were already occupied.\n\nIn private hospitals, only 33 per cent of oxygen beds are vacant for use for both Covid-19 and non-Covid patients.\n\nBesides, 61.3 per cent of ICU beds in government hospitals are already used by Covid-19 and non-Covid patients.\n\nOnly 27.3 per cent of ventilators in the government sector and 24.7 per cent in the private sector are in use, he said.",
    "Title": "Kerala announces lockdown from May 8 to 16"
  },
  {
    "Date": "Thu, 06 May 2021 02:26:16 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/05/Untitled-design-60.png",
    "Link": "https://indianexpress.com/article/india/haryana-covid-deaths-in-24-hrs-cm-declares-aid-for-poor-7303775/",
    "Text": "Manohar Lal Khattar said, “The Covid-19 registered hospitals in Haryana who would admit maximum residents of Haryana shall be given Rs. 1,000 per bed per day to private hospital for a maximum of seven days.” (File)\n\nHaryana reported its biggest single-day spike with 181 deaths and 15,416 new cases of Covid-19 infections in the last 24 hours. CM Manohar Lal Khattar, meanwhile, announced that state would provide a lump sum amount of Rs. 5,000 as medical assistance to the BPL Covid-19 patients who are staying in home isolation.\n\nKhattar also announced incentives for private hospitals that are admitting residents of Haryana for Covid-19 treatment.\n\nHe said, “The Covid-19 registered hospitals in Haryana who would admit maximum residents of Haryana shall be given Rs. 1,000 per bed per day to private hospital for a maximum of seven days.”\n\nWhile addressing a press conference, Khattar urged people to stop irrational use of experimental drugs such as Remdesivir and Tocilizumab used to treat patients with severe Covid-19 infection.\n\nAccording to Wednesday evening Covid-19 bulletin, the Covid positivity rate in Haryana reached 7.33 per cent, while recovery rate was 78.82 per cent.\n\nTill date, over 40 lakh vaccination doses have been administered across Haryana.\n\nThe number of active Covid-19 cases in the state reached 1,13,425 that included 1,443 patients in a critical condition (1,214 on Oxygen support and 229 on ventilator support).",
    "Title": "Haryana: 181 Covid deaths in 24 hrs, CM declares aid for poor"
  },
  {
    "Date": "Thu, 06 May 2021 04:54:30 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/05/arrest1.jpeg",
    "Link": "https://indianexpress.com/article/india/spike-in-covid-cases-panel-recommends-release-of-4000-undertrial-prisoners-7303959/",
    "Text": "It has also recommended against the release of those inmates who were given the benefit last year but committed fresh crimes while on interim bail.\n\nObserving that the situation at present is more dangerous than it was a year ago, the High Powered Committee, constituted on orders of the Supreme Court to decongest the jails in wake of the COVID-19 pandemic, has recommended the release of different categories of undertrial prisoners for 90 days.\n\nApproximately 4000 undertrial prisoners are likely to be benefited because of the recommendation. However, the Committee has recommended against the release of those facing trial in riot cases and cases under the “Anti-National Activities and Unlawful Activities (Prevention) Act”.\n\n“In a matter of few weeks, this second wave has left everyone “gasping for air”. It has led everyone to struggle to breathe or with asphyxia, which is the most terrifying human experience. The right to Life under Article 21 is the most precious Fundamental Right of every citizen of India. It unconditionally embraces even an undertrial /convict walled off from the society,” the committee has said.\n\nThe type of inmates whose release has been recommended includes the inmates undergoing civil Imprisonment, undertrials or remand prisoners who are facing trial in a case that prescribes a maximum sentence of seven years or less wherein the prisoner is in custody for a period of 15 days or more; who are senior citizens more than 60 years of age and are in custody for three months or more, facing trial in a case which prescribes a maximum sentence of 10 years or less; and undertrial prisoners who are less than 60 years of age and are in custody for six months or more, facing trial in a case which prescribes a maximum sentence of 10 years or less.\n\nThe committee has also recommended the release of inmates who are suffering from various serious ailments and are facing trial in cases that prescribe a maximum sentence of 10 years or less and are not involved in multiple cases. It has also said that undertrial prisoners with such ailments can be released if they have been in custody for a period of three months or more and are facing trial in a case that prescribes punishment of 10 years up to life imprisonment and are not involved in multiple cases.\n\nThe others who have also been recommended for interim bail include the undertrial prisoners facing trial for offence under Section 304 IPC and have been in jail for more than six months with no involvement in any other case; the inmates facing trial in a case under Section 307 IPC and are in jail for more than six months – subject to the condition that they should not be involved in any other case which prescribes punishment of more than 7 years; inmates, who were spouses and are facing trial for a case under Section 304B (dowry death) and are in jail for more than one year with no involvement in any other case, and the inmates – related as father-in-law, mother-in-law, brothers-in-law, sisters-in-law of the deceased – facing trial in the dowry death cases and in jail for more than six years and with no involvement in any other case.\n\nThe committee has said the inmates who are undergoing trial for intermediary or large quantity recovery under NDPS Act, undertrial prisoners facing charges under Section 4 and 6 of POCSO Act, under trial prisoners who are facing trial for offences under section 376, 376A, 376AB, 376B, 376C, 376D, 376DA, 376DB, and 376E and Acid Attack; foreign nationals; under trial prisoners who are facing trial under Prevention of Corruption Act (PC Act) / PMLA, MCOCA and cases investigated by CBI/ED/NIA/Special Cell of Delhi Police, Crime Branch, SFIO, Terror related Cases, Riot cases and cases under Anti-National Activities and Unlawful Activities (Prevention) Act should not be released.\n\nIt has also recommended against the release of those inmates who were given the benefit last year but committed fresh crimes while on interim bail.\n\nThe Committee has however recommended remission of sentence in those cases where the convicts are about to complete their jail term. It has also recommended emergency parole to the various categories of convicts, who were released last year also, for a period of eight weeks.\n\nThe Committee is chaired by Justice Vipin Sanghi and Delhi’s Principal Secretary (Home) B. S. Bhalla, DG (Prisons) Sandeep Goyal and Kanwal Jeet Arora, Member Secretary, Delhi State Legal Services Authority are its members. When the situation had improved in February, the Committee had recommended the surrender of all the inmates released on interim bail or parole on account of the pandemic.",
    "Title": "Spike in covid cases: Panel recommends release of 4000 undertrial prisoners"
  },
  {
    "Date": "Thu, 06 May 2021 03:12:34 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/05/Untitled-design-61.png",
    "Link": "https://indianexpress.com/article/india/to-break-covid-chain-10-day-corona-curfew-in-himachal-7303841/",
    "Text": "The Cabinet has also decided to cancel the Class 10 board exams of the Himachal Pradesh Board of School Education. (Express Photo)\n\nTo break the chain of Covid-19 transmission, the Himachal Pradesh government on Wednesday decided to impose ‘corona curfew’ in the state from May 7 till the midnight of May 16.\n\nThe decision to impose corona curfew in the state was taken at a Cabinet meeting chaired by Chief Minister Jai Ram Thakur, a government spokesperson said.\n\nDuring the curfew, all the government and private offices will remain closed but essential services such as health, electricity, telecommunication, water supply, sanitation etc. would remain open, according to the decision taken by the state Cabinet.\n\nThe Cabinet has also decided that work will continue at civil work sites, horticultural/agricultural and other project sites.\n\n“Educational institutions in the state would remain closed till May 31. All government and private transport would ply at 50 percent of occupancy and inter-state transport would continue. Industrial establishments would work as per the guidelines issued by the state government,” said a government statement.\n\nThe Cabinet has also decided to cancel the Class 10 board exams of the Himachal Pradesh Board of School Education. All students will be promoted to Class 11 as per norms suggested by the CBSE for its students of the same class, the official said. The board exams of Class 12 and the annual examinations of colleges will remain suspended until further orders, he said.",
    "Title": "To break Covid chain, 10-day ‘corona curfew’ in Himachal"
  },
  {
    "Date": "Thu, 06 May 2021 02:56:17 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/05/5G.jpg",
    "Link": "https://indianexpress.com/article/india/us-hails-indias-decision-to-not-allow-chinese-companies-to-conduct-5g-trials-7303825/",
    "Text": "The Department of Telecommunications on Tuesday allowed three private telcos, Bharti Airtel, Reliance Jio Infocomm and Vi (formerly Vodafone Idea) as well as state-run Mahanagar Telephone Nigam Limited (MTNL) to start 5G trials in the country.\n\nTop US lawmakers have applauded India’s decision to not allow Chinese telecom companies to conduct 5G trials in the country.\n\nThe Department of Telecom in India on Tuesday had approved applications of telecom companies Reliance Jio, Bharti Airtel, Vodafone Idea and MTNL to conduct 5G trials but none of them would be using technologies of Chinese entities.\n\n“India’s decision to exclude Huawei and ZTE from its 5G trials is good news for the people of India and the world,” House Foreign Affairs Committee Lead Republican and China Task Force Chairman Michael McCaul said in a statement on Wednesday.\n\n“People’s Republic of China law requires any Chinese company, including Huawei and ZTE, to work for the Chinese Communist Party if asked,” McCaul said.\n\nThe previous Trump administration had designated Chinese tech companies as posing a national security risk.\n\nThe US is also asking its friends and allies not to opt for a technology that is controlled by the Communist Party of China.\n\n“It’s a risk that can’t be mitigated unless these companies are excluded from our networks, and I’m glad that India has recognized this threat. India has once again proven why it is a global leader in the fight against security threats posed by CCP-controlled technology,” McCaul said.\n\nCongressman Mike Waltz also thanked India for its decision.\n\n“Thank you to India for denying the inclusion of CCP-run Huawei in their telecommunications,” he said.\n\n“As the world’s largest democracy, India will be a critical ally in confronting China and securing our supply chains,” Waltz said.",
    "Title": "US hails India’s decision to not allow Chinese companies to conduct 5G trials"
  },
  {
    "Date": "Thu, 06 May 2021 04:11:02 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2014/03/India-cremations.jpg",
    "Link": "https://indianexpress.com/article/india/indias-struggle-to-track-new-covid-variants-could-worsen-crisis-7303927/",
    "Text": "In this April 24, 2021, file photo, exhausted workers who carried the dead for cremation sit on the rear step of an ambulance in New Delhi. (AP/ File)\n\nThe good news is that the vaccines work against a new virus strain circulating in India that’s spread to several other countries. The bad news is it won’t be only the new version of the pathogen to emerge from an outbreak of this scale, underscoring the urgency of mapping other possible variants that may be currently racing through India’s tightly-packed population of 1.4 billion people.\n\nAs infections surge by more than 300,000 cases for 14 straight days, pushing India’s tally past 20 million, the country’s limited ability to track new mutations emerging from its outbreak is a growing concern for scientists.\n\nSecond- or even third-generation versions of the variant known as B.1.617 could already be circulating in India and some may be more dangerous, said William Haseltine, a former Harvard Medical School professor who now chairs think tank Access Health International.\n\n“India has the necessary genome sequencing capabilities but it needs to have a mass surveillance program,” Haseltine said. “I’ll be on the lookout for more and newer variants, given the opportunity the virus has had with such a massive outbreak.”\n\nVariants are already outracing vaccination progress in many parts of the world, fueling bigger outbreaks that spread faster. While some rich nations that secured effective vaccines early have seen their epidemics wane, the virus is still spreading like wildfire in developing economies, prolonging the pandemic.\n\nSuper Mutant Debunked Mutations occur when the virus replicates, and India’s unprecedented surge is driving new cases to global records, even as richer economies like the U.S. and Israel re-open quickly. Fearing an influx of infections and mindful of B.1.617, Singapore, the U.K. and Tanzania are among countries that have curbed travel to and from India.\n\nAustralia has banned its citizens from returning from India and imposed penalties of roughly $50,000 and five years imprisonment for violators.\n\nThe India strain has been called a double mutant because of the presence of two changes in the virus’s genome, called E484Q and L452R. Both affect a portion of the spike protein, called the receptor binding domain, that’s key to the virus entering cells.\n\nSome researchers estimate that the B.1.617 variant is as transmissible as the B.1.1.7 variant that emerged in the U.K., thought to be as much as 70% more transmissible than earlier versions of the virus.\n\nYet initial analyses indicate that the India version, now classified a variant of interest by the World Health Organization, poses a limited threat and doesn’t appear to be more dangerous.\n\nCovaxin, the inactivated-virus vaccine being made by India’s Bharat Biotech International Ltd., and AstraZeneca Plc’s vaccine, called Covishield in India, are effective against the strain in preventing serious illness, said Rakesh Mishra, director of the Centre for Cellular and Molecular Biology in Hyderabad, one of the labs analyzing virus samples. Data is still being gathered about the response to Russia’s Sputnik V vaccine, Mishra said, but it’s likely to be effective.\n\nBioNTech SE Chief Executive Officer Ugur Sahin said he was confident the mRNA shot it’s making with partner Pfizer Inc. would work against the India mutant though testing is still ongoing. “The Indian variant has the same mutation that we’ve already investigated and against which our vaccine was also effective,” he said last week.\n\nSingapore, which tightened social distancing restrictions this week after findings cases linked to the India variant, has also seen vaccines hold up well to prevent serious illness, said Kenneth Mak, director of medical services in city-state’s health ministry. But “vaccination does not prevent you from getting infected 100%,” he said in a Tuesday briefing.\n\nRavindra Gupta’s team at the University of Cambridge recently studied the two mutations that appear on the receptor binding domain of the India variant’s spike protein. The team tested viruses made to simulate the variant against serum from nine people who had already received a single dose of the BioNTech-Pfizer vaccine.\n\n“We wanted to know whether this double mutant really is a double whammy,” said Gupta, a professor of clinical microbiology at Cambridge’s Institute for Therapeutic Immunology and Infectious Diseases. What they found was that while each of the mutations could partly evade neutralizing antibodies, the two mutations didn’t combine to create an even greater ability to evade immune protection.\n\n“They don’t combine to make a super mutant,” Gupta said. “It kind of debunks this view that this double mutant is doubly evading neutralizing antibodies.”\n\nWhile the findings ease concerns around B.1.617, researchers are turning to the next set of variants as India’s outbreak continues to rage. Genomic surveillance can provide crucial information on the new forms of this shape-shifting virus — critical in preventing subsequent waves and developing the next generation of vaccines.\n\nIn the U.S., recent studies published by the Centers for Disease Control and Prevention show that a variant that caused concern when it emerged in New York isn’t more dangerous than earlier strains, while a pair of mutants that surfaced in southern California “might more frequently cause discernible and severe illness than do nationally circulating lineages overall.”\n\nThe WHO has been monitoring variants through a global working group of laboratories, said Maria Van Kerkhove, the agency’s technical lead officer. Information about new variants is coming in “fast and furious,” she said.\n\nBut as its health system is stretched to breaking point and Prime Minister Narendra Modi resists calls for a lockdown, the country’s labs are ill-equipped to keep up with the necessary monitoring. Genomic sequencing that can identify new strains and track their progress is still relatively sparse in India, where only about 11,000 viruses have been analyzed, according to Mishra.\n\nWhile countries like the U.K. monitor about 5% to 10% of cases, in India far fewer are sequenced. To do so would require analyzing tens of thousands of samples daily, and failing to leaves a huge blind spot, according to Ashish Jha, dean of Brown University’s School of Public Health in Rhode Island.\n\n“What genomic surveillance does,” he said, “is it helps you really track where infections are going and how things are spreading in a way India was pretty blind to.”",
    "Title": "India’s struggle to track new Covid variants could worsen crisis"
  },
  {
    "Date": "Thu, 06 May 2021 02:59:44 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2020/06/encounter-in-srinagar-01-1.jpg",
    "Link": "https://indianexpress.com/article/india/jammu-and-kashmir-shopian-encounter-7303835/",
    "Text": "Three militants were killed, while one surrendered before security forces during an encounter in Shopian district of Jammu and Kashmir on Thursday, police said.\n\nThe security forces launched a cordon and search operation in Kanigam area of the South Kashmir district during the night following information about the presence of militants there, a police official said.\n\nHe said as the presence of four newly recruited local militants of Al-Badr outfit got ascertained, the security forces exercised maximum restraint and tried their best to persuade them to surrender.\n\nThe militants turned down the offer to surrender and opened firing and lobbed a grenade on the security forces, the official said.\n\nThe security forces retaliated, ensuing an encounter, the official said.\n\nHowever, during the encounter one of the militants surrendered before the security forces while three others were killed.\n\nThe surrendered militant has been identified as Tausif Ahmad, the official said.",
    "Title": "Three militants killed in encounter with security forces in J-K’s Shopian"
  },
  {
    "Date": "Thu, 06 May 2021 04:10:29 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2014/03/ajit-singh.jpg",
    "Link": "https://indianexpress.com/article/india/ajit-singh-dead-7303915/",
    "Text": "Rashtriya Lok Dal chief and former union minister Ajit Singh passed away on Thursday after losing battle to Covid-19, his son Jayant Chaudhary confirmed on Twitter. He was 82.\n\nSingh was undergoing treatment at a private hospital in Gurugram after been diagnosed with the infection. He had tested positive for Covid-19 on April 20.\n\n“Chaudhary Ajit Singh ji was diagnosed as Covid+ on the 20th of April. He battled his condition till the very end and breathed his last today morning, the 6th of May, 2021. Throughout his life journey, Chaudhary Sahib was loved and respected by many. He, in turn, cherished this bond with all of you and gave his best consideration and efforts for our welfare,” his family said in a statement.\n\nAjit Singh was a seven-time Member of Parliament from Baghpat, and served as Union Minister for Civil Aviation, Agriculture, and Food Processing Industries in different governments. He had served in the governments of VP Singh, PV Narasimha Rao, Atal Bihari Vajpayee and Manmohan Singh.\n\nAjit Singh mourning beside the body of his father, Charan Singh, in 1987. (Express Archive Photo) Ajit Singh mourning beside the body of his father, Charan Singh, in 1987. (Express Archive Photo)\n\nAjit Singh, the son of former prime minister Chaudhary Charan Singh, quit the computer industry to return to India and join politics. He became a Rajya Sabha member in 1986.\n\nExpressing grief, PM Narendra Modi tweeted, “Singh was always devoted to the interests of the farmers. He efficiently discharged the responsibilities of several departments at the center. My condolences to his family in this hour of mourning.” Many political leaders, including Congress leader Rahul Gandhi and National Conference leader Omar Abdullah, also expressed their condolences.\n\nCongress leader Rahul Gandhi too expressed his condolences in a tweet.\n\nराष्ट्रीय लोक दल प्रमुख अजित सिंह जी के असमय निधन का समाचार दुखद है। उनके परिवार व प्रियजनों को मेरी संवेदनाएँ। pic.twitter.com/m4iZ9SAC93 — Rahul Gandhi (@RahulGandhi) May 6, 2021\n\nThe RLD does not have any seats in the present Lok Sabha having lost in all the three seats it contested in the 2019 general elections.",
    "Title": "Ajit Singh, former union minister and RLD chief, dies of Covid-19"
  },
  {
    "Date": "Thu, 06 May 2021 11:16:45 +0530",
    "Description": "Kerala Chief Minister Pinarayi Vijayan on Thursday announced a statewide lockdown from May 8-16 to fight the surge in coronavirus cases.",
    "Image": "https://c.ndtvimg.com/2020-04/5o1uafc_kerala-lockdown-pics-thiruvananthapuram_625x300_20_April_20.jpg",
    "Link": "https://www.ndtv.com/india-news/kerala-to-enforce-lockdown-from-may-8-to-16-amid-rising-covid-cases-2435262",
    "Text": "Kerala Lockdown: India has crossed the grim milestone of 2 lakh Covid deaths\n\nKerala Chief Minister Pinarayi Vijayan on Thursday announced a statewide lockdown from May 8-16 to fight the surge in coronavirus cases.\n\nCurrently, night curfew is enforced from 9 pm to 5 am, with semi-lockdown-like curbs during weekends.\n\nMost states have taken to partial lockdowns or containment measures to fight the deadly sweep of the second wave of infections.\n\nYesterday, the centre's top scientific adviser warned about the \"inevitable\" third wave of coronavirus, adding that vaccines will need to be \"updated\" to deal with the new strains that have overwhelmed hospitals and left thousands dead.\n\nOn the question of nationwide lockdown, NITI Aayog member and chief of the national expert group on vaccines VK Paul said Wednesday, \"...If anything more is required those options are always being discussed. There's already a guideline to states to impose restrictions to suppress chain of transmission.\"\n\nIndia has crossed the grim milestone of 2 lakh Covid deaths.\n\nIn his address to the nation last month, Prime Minister Narendra Modi likened the second surge of coronavirus to a storm and urged state governments to use lockdowns as an absolute last resort. He stressed on micro containment measures and Covid-appropriate behaviour to beat the virus.\n\n\n\n",
    "Title": "Kerala To Enforce Lockdown From May 8 To 16 Amid Rising Covid Cases"
  },
  {
    "Date": "Thu, 06 May 2021 10:16:05+5:30 ",
    "Description": "Ajit Singh was undergoing treatment at a private hospital in Delhi after he tested positive for the coronavirus on April 20",
    "Image": "https://images.livemint.com/img/2021/05/06/600x338/Ajit_1620276120141_1620276127909.jpg",
    "Link": "https://www.livemint.com/politics/news/ajit-singh-former-union-minister-and-rld-chief-dies-of-covid-11620275839590.html",
    "Text": "Rashtriya Lok Dal (RLD) president and former Union minister Ajit Singh died due to Covid-19, confirmed his son Jayant Chaudhary. He was 82.\n\nSingh, a prominent leader in western Uttar Pradesh, was undergoing treatment at a private hospital in Delhi after he tested positive for the coronavirus on April 20.\n\n\"Chaudhary Ajit Singh ji was diagnosed as COVID positive on April 20. He battled his condition till the very end and breathed his last today morning on May 6,\" Jayant, the RLD Vice President, said in a tweet.\n\nExpressing grief at the death of Ajit Singh, Prime Minister Narendra Modi said he was always dedicated to the welfare of farmers.\n\n\"He was devoted to the interests of the farmers. He efficiently discharged the responsibilities of several departments at the Centre,\" tweeted PM Modi.\n\nपूर्व केंद्रीय मंत्री चौधरी अजित सिंह जी के निधन से अत्यंत दुख हुआ है। वे हमेशा किसानों के हित में समर्पित रहे। उन्होंने केंद्र में कई विभागों की जिम्मेदारियों का कुशलतापूर्वक निर्वहन किया। शोक की इस घड़ी में मेरी संवेदनाएं उनके परिजनों और प्रशंसकों के साथ हैं। ओम शांति! — Narendra Modi (@narendramodi) May 6, 2021\n\n\n\n\n\nJayant also shared a note on Twitter on behalf of the family members which read: \"Throughout his life journey, Chaudhary Sahib was loved and respected by many. He, in turn, cherished this bond with all of you and gave his best consideration and efforts for your welfare.\n\n\"As our nation confronts the horrific pandemic, it is our humble request to all those who wish to pay their respects, to please stay at home as far as possible.\n\n\"We must observe all safety protocols to keep ourselves and everyone around us healthy and safe. This would be the best way to honour Chaudhary Sahib as well as all those COVID warriors who are working night and day to protect us. We pray for solace for all those families that have been ravaged by this brutal disease,\" the note added.\n\n\n\n\n\nSingh, a seven-time MP from Uttar Pradesh's Baghpat, was the son of former Prime Minister Chaudhary Charan Singh. He founded the RLD in 1996. (ANI)\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter.",
    "Title": "Ajit Singh, former union minister and RLD chief, dies of Covid"
  },
  {
    "Date": "Thu, 06 May 2021 03:32:17 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/05/collage.png",
    "Link": "https://indianexpress.com/article/india/meet-the-school-students-running-a-nationwide-database-for-covid-relief-material-7303601/",
    "Text": "As coronavirus cases continue to spiral in India and hospitals are stretched beyond breaking point, a group of school students from across the country are working around the clock to help Covid-19 patients in critical condition.\n\nEarly in April, Class 12 students Tia Garg and Suhani Daruka received a frantic phone call from a peer in desperate search of an ICU bed for a Covid positive family friend, whose condition was quickly worsening. With the help of a crowdsourced database, set up by the two girls and a dedicated team of volunteers, they were able to locate a free ICU bed within hours.\n\nIt was in that moment Tia and Suhani, students of DPS Vasant Kunj in Delhi, realised that they were onto something big. “We saw that our database saved someone’s life and it was just our first or second day working on it. That was when we knew we weren’t just putting out information. We were actually affecting lives,” Tia, 17, told the indianexpress.com.\n\nIn November last year, the two teenagers, both avid debaters, launched an online youth forum called ‘Uncut’ — a platform for young people, who like them were housebound amid the coronavirus pandemic, to discuss current affairs, politics and popular culture. But when the second wave struck and thousands were turning to social media in search of oxygen cylinders, plasma and medication, the ‘Uncut’ team decided to shift their focus to Covid relief work.\n\nSince then, they have been able to assist hundreds of Covid patients in distress with the help of expansive state-wise databases, updated and verified almost “every hour” by a 55-member team of volunteers who work in shifts through the day. The team has also launched a 24-hour volunteer helpline on Instagram, where they have been connecting Covid patients and their loved ones with verified medical resources.\n\nBetween online classes, preparing for their board exams and manning their 24×7 Covid helpline, the members of team ‘Uncut’ have not slept for more than “four hours a day,” Tia said. “Since school is off at the moment, we have been scheduling shifts around our tuition classes.” While new resources are constantly added to the database, they are verified by the team only until 8 pm every day. “After that, nobody really takes our calls,” explained Shivanshi Chandna, head of PR at project Uncut.\n\nTeam Uncut has set up state-wise crowdsourced databases, which are regularly updated through the day. (Screengrab: Team Uncut has set up state-wise crowdsourced databases, which are regularly updated through the day. (Screengrab: https://www.theuncutteam.com/resources\n\n“All of our members have been divided into teams based on the state for which they are maintaining a database,” Shivanshi said. “So they are constantly tracking WhatsApp, Twitter, Facebook, finding leads for medical resources and verifying them.”\n\nWhen the group’s social media handles were flooded with requests for Covid relief earlier this month, they decided to “outsource” their Instagram helpline. They shared a form on the photo-sharing app, inviting student volunteers to pitch in and support their initiative. “At least 50-55 people from across the country got in touch. We then set up a new account specifically for Covid relief. So the volunteers are solely working on responding to DMs on that account,” Shivanshi said.\n\nView this post on Instagram A post shared by Covid Volunteers (@volunteers.covihelp)\n\nThe team found that people in distress are often unable to scour through all the databases available on the Uncut website themselves. Instead, the team’s volunteers pitch in to call the numbers listed in the database on behalf of the Covid patient, until they are able to find a viable lead.\n\n“A lot of people have gotten in touch with us and thanked us for helping them. We have reviewed messages from people saying that they got a bed only because of us. We keep posting their messages on the volunteer group to encourage them to keep working,” Shivanshi said.\n\nBut not everyone who reached out to Team Uncut had the same luck. While the volunteers continue to work hard to connect Covid patients with potentially life-saving medical resources, the sheer number of requests they receive on a daily basis makes it nearly impossible for them to help everyone who gets in touch. When this happens, the team tries not to get too discouraged and focuses on the bigger picture.\n\n“It is very disheartening, but at the same time we know that we are doing as much as we can,” Shivanshi said.",
    "Title": "Meet the school students running statewide databases and a 24×7 Instagram helpline for Covid relief material"
  },
  {
    "Date": "Thu, 06 May 2021 11:29:07 +0530",
    "Description": "Constitutional authorities can do better than to complain and ask for fetters on the media, the Supreme Court said today.",
    "Image": "https://c.ndtvimg.com/2020-08/iffcjvrg_supreme-court_625x300_25_August_20.jpg",
    "Link": "https://www.ndtv.com/india-news/supreme-court-says-constitutional-authorities-stop-complaints-on-media-reports-2435453",
    "Text": "\"It would be retrograde for the Supreme Court to gag media,\" the Supreme Court said.\n\nConstitutional authorities can do better than to complain and ask for fetters on the media, the Supreme Court said today on the Election Commission's petition complaining about media reports on the Madras High Court telling the poll body it should be booked for murder for not stopping political rallies amid Covid.\n\n\"It would be retrograde for the Supreme Court to gag media,\" the Supreme Court said.\n\n\"We find no substance in prayer of EC to restrain media from reporting court proceedings. It is essential to hold judiciary accountable.\"\n\nThe Justice DY Chandrachud-led bench did say the remarks made by the Madras High Court were \"harsh and the metaphor improper\" and judicial restraint was necessary.\n\n\"There is a need for judicial restraint for off the cuff remarks which is open for misinterpretation. Judicial language is important for constitutional ethos. Power of judicial review is so high that it forms a basic structure,\" the top court observed. The Election Commission had been conducting free and fair polls, it added.\n\nHowever, the High Court was faced with rising Covid cases and the task of protecting the lives and liberty of people, the court said.\n\n\"Open access to courts is a valuable safeguard to constitutional freedom. Freedom of the press is a facet of constitutional freedom of speech and expression,\" said the Supreme Court.\n\nThe Election Commission had complained about being \"castigated without any evidence\" when the Madras High Court reprimanded it on campaigns in the middle of a Covid surge.\n\nThe Madras High Court on April 26 said the Election Commission \"should probably be booked for murder\" for allowing crowded election campaigns and was \"singularly responsible\" for the current Covid spike. But these observations did not make it to the final order, which said \"at no cost can counting become a catalyst for a further surge\".\n\nThe Election Commission last week approached the Supreme Court against what it called \"blatantly disparaging remarks\" and said the media should be stopped from reporting observations. It also said it was the government under the Disaster Management Authority that had to manage the rallies of Prime Minister Narendra Modi and the Chief Minister (E Palaniswami) and \"they committed the breach\".\n\nThe Supreme Court said: \"Something is observed in the larger public interest. The Election Commission should treat it as a bitter pill in the right spirit.\"",
    "Title": "Constitutional Authorities, Stop Complaints On Media Reports: Supreme Court"
  },
  {
    "Date": "Thu, 06 May 2021 11:14:41 +0530",
    "Description": "Delhi residents living in home isolation due to COVID-19 needn't worry about availability of oxygen anymore. The state government has set up a new system to ensure the smooth availability of cylinders...",
    "Image": "https://c.ndtvimg.com/2021-05/vvtq2o8o_delhi-oxygen-afp-650_650x400_05_May_21.jpg",
    "Link": "https://www.ndtv.com/india-news/delhi-sets-up-system-to-ensure-oxygen-supply-for-those-in-home-isolation-2435220",
    "Text": "The government move has come after seeing patients and relatives struggling in long queues for oxygen.\n\nDelhi residents living under home isolation due to COVID-19 needn't worry about availability of oxygen anymore. The state government has set up a new system to ensure the smooth availability of cylinders and the various district authorities have been made responsible for this.\n\nThose needing oxygen themselves or looking out for their relatives must register on the portal https://delhi.gov.in, a government release said today. They must submit, along with the application, copies of their Aadhar, Covid test report, and CT-Scan report if any.\n\n\"Each district has been assigned on re-filler for accessing its lump-sum allocation and the respective district magistrates have been directed to supervise the management of distribution of cylinders...\" the release said.\n\nThe government's move has come after witnessing residents struggling in long queues at various refill centres and depots across the city.\n\nAll district magistrates have been told to set aside enough a number of officials to sort the applications and ensure that those eligible receive their e-pass on priority.\n\nThose whose applications are approved will receive the e-pass from the district magistrate stating when, where, at what time, and at which depot they would get the oxygen cylinders, the release said. This will, however, depend on the availability of stocks.\n\nThe district magistrates have also been asked to appoint only such depots and dealers where availability is hassle-free so that the patients or their relatives are put into any further trouble for the sake of oxygen.\n\nThe facility of online bookings will be made available to Delhi residents from May 6.\n\nDelhi reported almost 21,000 fresh COVID-19 cases in the past 24 hours along with 311 deaths. The city's overall case load now stands at 12.5 lakh, with over 18,000 deaths.\n\nAll this has put immense pressure on the city medical resources, with several patients reportedly dying due to a lack of oxygen in recent weeks.",
    "Title": "Delhi Sets Up System To Ensure Oxygen Supply For Those In Home Isolation"
  },
  {
    "Date": "Thu, 06 May 2021 09:24:16 +0530",
    "Description": "Up to 3,980 people died of Covid in India the past 24 hours, the highest in a day so far, pushing total fatalities to 2,30,168.The country also set a new grim record in its daily Covid numbers with...",
    "Image": "https://c.ndtvimg.com/2021-05/d4o138m8_coronavirus-india-afp-650_650x400_06_May_21.jpg",
    "Link": "https://www.ndtv.com/india-news/coronavirus-4-12-lakh-covid-19-cases-3-980-deaths-in-india-highest-so-far-in-24-hours-2433589",
    "Text": "Assam, West Bengal, Odisha, Bihar, and Jharkhand have seen a rise in both the number of daily cases and mortality, indicating the \"pandemic is moving eastwards\", the Union Health Ministry said after a review meeting on Wednesday.\n\nTwelve states, including Maharashtra, Karnataka, Kerala, and Uttar Pradesh, have more than a lakh active COVID-19 cases each, according to the government. Thirty districts are showing a continued rise in the number of cases for the past two weeks. Ten of these are in Kerala, seven in Andhra Pradesh, three in Karnataka, and one in Tamil Nadu, it said.\n\nMaharashtra, the worst-hit state since last year, on Wednesday reported a record 920 new Covid deaths and over 57,000 new cases. Capital Mumbai reported 3,879 new cases and 77 deaths while Pune logged 9,084 cases and 93 deaths. The state currently has 6.41 lakh active cases.\n\nKarnataka on Wednesday reported in its single-largest spike (more than 50,000 cases) since the start of the pandemic -- nearly half of them in capital Bengaluru.\n\nIndia accounted for 46% of global cases and 25% of global deaths reported in the past week, the World Health Organization said on Wednesday.\n\n\"Unless the world steps up and helps India now, there will be reverberations across the region and the world in terms of virus-related deaths, virus mutations and supply delays,\" UNICEF Executive Director Henrietta Fore said on Tuesday.\n\nExperts have warned India must prepare for a third wave. \"Phase 3 is inevitable given the high levels of circulating virus. But it is not clear on what timescale this phase 3 will occur. We should prepare for new waves,\" K Vijay Raghavan, the government's principal scientific advisor, told a news conference on Wednesday.\n\nOver 16.24 crore COVID-19 vaccine doses have been administered in the country so far. More than 2.3 lakh beneficiaries of age group 18-44 Vaccinated in the last 24 hours.\n\nUS President Joe Biden's administration has announced support for a global waiver plan on patent protections for COVID-19 vaccines moved by India within the World Trade Organization.",
    "Title": "4.12 Lakh Fresh Cases, 3,980 Deaths: India's Worst Covid Numbers Yet"
  },
  {
    "Date": "Thu, 06 May 2021 08:32:16 +0530",
    "Description": "Three top US senators have urged the Biden administration to ramp up its COVID-19 assistance to India, saying the country is currently registering over 3,00,000 new cases every day and its health care...",
    "Image": "https://c.ndtvimg.com/2021-04/7hh5irlg_joe-biden-afp_625x300_07_April_21.jpg",
    "Link": "https://www.ndtv.com/india-news/3-us-senators-urge-joe-biden-administration-to-accelerate-covid-19-assistance-to-india-2432948",
    "Text": "Last week, John Cornyn and Mark Warner had written to President Joe Biden on sending aid to India.\n\nThree top US senators have urged the Biden administration to ramp up its COVID-19 assistance to India, saying the country is currently registering over 3,00,000 new cases every day and its health care system is struggling to keep up with the surge.\n\nCommending for recent actions to help India address the crisis, the three senators in a letter to Secretary of State Tony Blinken also urged the administration to continue its robust contribution to the WHO's COVAX plan and prepare a detailed strategy on how the US can distribute its surplus of vaccines.\n\nSenators Mark Warner, John Cornyn, and Ron Portman warned of \"disinformation campaigns surrounding the vaccines by countries such as China and Russia\", and urged the administration to do everything it can to combat these campaigns.\n\nMark Warner and John Cornyn are Co-Chairs of the Senate India Caucus. Mark Warner is from the Democratic Party, while John Cornyn and Portman are from the opposition Republican Party.\n\n\"As you know, India''s healthcare system and infrastructure are struggling to meet the challenges posed by the current and largely unchecked surge, with the country averaging more than 300,000 new infections every day,\" the letter said.\n\n\"We urge you to work with the Department of Defense and other US government agencies, as well as with our international partners and private sector partners to transfer more life-saving equipment, vaccines, and other support to India as quickly as possible,\" the three senators wrote.\n\nThe US must work with the Indian government on their response, as well as continue to lead the international efforts to stop the spread of variants and to deliver the assistance needed to the Indian people, they said.\n\nMark Warner, John Cornyn, and Portman said the US should also continue its robust contribution to COVAX's plan for the global acquisition and distribution of vaccines to low and medium-income countries.\n\nIn the coming months, the US will have a surplus of vaccines that can be made available for distribution around the world. A detailed public strategy on how the Department of State plans to distribute these excess vaccines would clarify the ambiguity surrounding future US policy and provide needed certainty to India, they said.\n\n\"Lastly, we urge the Global Engagement Center to combat the numerous disinformation messages from Russia, China, and others regarding the coronavirus pandemic, including the US global health response.\n\nSpecifically in India, disinformation has undermined the public health response, heightened already-tense religious tensions, and muddied the waters surrounding our support as they face an unprecedented surge in coronavirus infections,\" the senators wrote.\n\n\"As entities continue to manipulate narratives at the expense of US national security, regional security, and global health security, we urge you to place a greater emphasis on combating these disinformation and misinformation campaigns integrating that effort into America's global health response to this pandemic,\" they said.\n\nLast week, John Cornyn and Mark Warner had written to President Joe Biden on sending aid to India. They also had a conference call with officials from the White House.",
    "Title": "3 US Senators Urge Biden To Accelerate COVID-19 Assistance To India"
  },
  {
    "Date": "Thu, 06 May 2021 11:16:08 +0530",
    "Description": "Ninety workers and staff members of a tea garden in upper Assam's Dibrugarh district have tested positive for coronavirus, forcing the district administration to declare it a Containment Zone.",
    "Image": "https://c.ndtvimg.com/2021-05/qqe243r_zaloni-tea-garden-declared-containment-zoneassam_625x300_06_May_21.jpg",
    "Link": "https://www.ndtv.com/india-news/assam-coronavirus-90-workers-covid-positive-in-zaloni-team-estate-now-a-containment-zone-2435249",
    "Text": "Ninety workers at Zaloni tea estate have contracted COVID-19.\n\nNinety workers and staff members of a tea garden in upper Assam's Dibrugarh district have tested positive for coronavirus, forcing the district administration to declare it a containment zone. A source involved in testing of the samples, however, said that close to 150 people there have contracted the virus.\n\nThe Dibrugarh district administration has shut down the Zaloni tea estate which falls under Tengakhat revenue circle.\n\nThe Circle Officer of Tengakhat revenue circle, Medical Inspector of Plantations and officials from the health department has been rushed to the area to take stock of the situation.\n\nThe garden hospital and the two vacant staff quarters have been turned into temporary isolation centers for the positive patients.\n\nDr. Nabajyoti Gogoi, the District Surveillance Officer of IDSP, Dibrugarh said a vaccination drive would be carried out in the garden from today apart from other measures like sanitization etc.\n\nTea garden-based organizations have been demanding vaccination in the tea garden areas since there is a possibility that the virus would spread faster in the tea gardens as the workers in the gardens reside in close proximity.\n\nThe district administration has ordered closure of all leased weekly market under Tengakhat Development block with immediate effect.\n\nThe Deputy Commissioner also instructed the concerned Circle officers/ BDOs to take steps to close all such markets in their respective areas if the situation demands.\n\nAssam on Wednesday reported 55 COVID-19 fatalities, the highest single-day deaths, pushing the total number of fatalities to 1,485, according to the government.\n\nThe state also registered 4,826 new COVID-19 cases, which took the tally to 2,72,751, it said.",
    "Title": "90 Workers Covid Positive In Assam Team Estate, Now A Containment Zone"
  },
  {
    "Date": "Thu, 06 May 2021 09:38:36 +0530",
    "Description": "The US has reissued its travel advisory on India, urging its citizens not to travel to the country due to an unprecedented surge in the COVID-19 cases there.",
    "Image": "https://i.ndtvimg.com/i/2018-03/flight-generic_650x400_51520238094.jpg",
    "Link": "https://www.ndtv.com/india-news/covid-crime-terrorism-us-reissues-travel-advisory-on-india-2433778",
    "Text": "Both travel advisory has been marked ''Level 4'' which is the highest warning level. (Representational)\n\nThe US has reissued its travel advisory on India, urging its citizens not to travel to the country due to an unprecedented surge in the COVID-19 cases there.\n\nIndia is struggling with a second wave of the pandemic with more than 3,00,000 daily new coronavirus cases being reported in the past few days, and hospitals are reeling under a shortage of medical oxygen and beds.\n\n\"Do not travel to India due to COVID-19. Exercise increased caution due to crime and terrorism,\" the State Department said on Wednesday in its latest travel advisory that looked identical to the one issued on April 28.\n\nBoth the travel advisory has been marked ''Level 4'' which is the highest warning level.\n\nOn April 28, the Department approved the voluntary departure of family members of US government employees.\n\nOn May 5, the Department approved the voluntary departure of non-emergency US government employees.\n\n\"US citizens who wish to depart India should take advantage of available commercial transportation options,\" it said.\n\nLast week, the Centers for Disease Control and Prevention (CDC) issued a Level 4 Travel Health Notice for India due to COVID-19, indicating a very high level of COVID-19 in the country.\n\nA record 3,780 fresh COVID-19 fatalities were registered in a single day in India taking the death count to 2,26,188, while 3,82,315 new coronavirus infections were recorded, according to the Union Health Ministry data updated on Wednesday.\n\nWith the fresh cases, the total tally of COVID-19 cases in the country climbed to 2,06,65,148.",
    "Title": "Covid, Crime, Terrorism: US Reissues Travel Advisory On India"
  },
  {
    "Date": "Thu, 06 May 2021 09:13:58 +0530",
    "Description": "Ajit Singh, Union Minister in several governments and one of India's senior most politicians, died on Thursday at 82. The Rashtriya Lok Dal (RLD) chief had been battling Covid, his son Jayant...",
    "Image": "https://c.ndtvimg.com/2021-05/58tf4d5_ajit-singh-650_625x300_06_May_21.jpeg",
    "Link": "https://www.ndtv.com/india-news/ajit-singh-former-union-minister-dies-of-covid-19-2433439",
    "Text": "Ajit Singh Dies of Covid-19 : He was diagnosed with Covid, his son said in tweets.\n\nAjit Singh, Union Minister in several governments and one of India's senior most politicians, died on Thursday at 82. The Rashtriya Lok Dal (RLD) chief had been battling Covid, his son Jayant Chaudhary tweeted.\n\nAjit Singh was diagnosed with Covid on April 20, his son said in tweets. “He battled his condition till the very end and breathed his last today morning,” he said.\n\nPrime Minister Narendra Modi was among those who paid tribute to the politician, known to be a prominent voice of farmers.\n\n“He was always dedicated to the cause of farmers. He ably fulfilled many responsibilities at the centre,” PM Modi wrote.\n\nAjit Singh, an alum of IIT Kharagpur and the Illinois Institute of Technology,. was a seven-time MP and Union Minister in the governments of VP Singh, PV Narasimha Rao, Atal Bihari Vajpayee and Manmohan Singh. He enjoyed an immense following in politically vital Uttar Pradesh, especially its western parts dominated by Jats.\n\nThe son of former Prime Minister Chaudhary Charan Singh, Ajit Singh quit the computer industry to return to India and join politics when his father fell ill.\n\nHe became a Rajya Sabha member in 1986. When his father died the next year, he was asked to take over as chief of the Lok Dal, but amid internal tussles, the party split. Ajit Singh then formed his own party.\n\nHe went on to win many Lok Sabha elections from Baghpat in western Uttar Pradesh, his father's constituency. He only lost twice from Baghpat, once in 1998 and then in 2014. In 2019, he shifted to Muzaffarpur in UP but lost to the BJP.\n\nThroughout his political career, he was known to stitch up sharp alliances that mostly landed him on the ruling side.\n\nHe was the President of Lok Dal (A) and Janata Party in 1987 and 1988. In 1989, he joined the Janata Dal when many parties decided to merge under the leadership of VP Singh to fight the Congress.When VP Singh was Prime Minister, Ajit Singh took over as Industries Minister.\n\nLater, he joined the Congress and became Food Minister in the Narasimha Rao government. He won the 1996 election as a Congress candidate but quit the party the same year and formed the Rashtriya Lok Dal.\n\nHe was Minister of Agriculture in the Vajpayee-led BJP government from 2001 to 2003. In 2011, his party joined the Congress-led UPA and he became Civil Aviation Minister.",
    "Title": "Ajit Singh, Former Union Minister And RLD Chief, Dies Of COVID-19"
  },
  {
    "Date": "Thu, 06 May 2021 10:10:19 +0530",
    "Description": "A top American lawmaker has proposed sending a mercy ship to India to help the country which is struggling to deal with a deadly second wave of the COVID-19 pandemic.",
    "Image": "https://c.ndtvimg.com/2021-05/4fe6gle_us-lawmaker-propose-travel-of-a-mercy-ship-to-india-to-help-address-covid19-challenge-650_625x300_06_May_21.jpeg",
    "Link": "https://www.ndtv.com/india-news/coronavirus-us-must-organise-and-collaborate-to-provide-aid-india-needs-congresswoman-sheila-jackson-lee-2434235",
    "Text": "US must collaborate to provide the aid India needs, Congresswoman said.\n\nA top American lawmaker has proposed sending a mercy ship to India to help the country which is struggling to deal with a deadly second wave of the COVID-19 pandemic.\n\nThe situation in India is so dire that the US must organise and collaborate to provide the aid India needs, Congresswoman Sheila Jackson Lee said after the United Memorial Medical Center in Houston announced sending COVID-19 assistance to India.\n\n\"Today, we announced humanitarian help to India and proposed travel of a mercy ship to India to help with the devastation of COVID-19,\" Jackson Lee said on Wednesday, as several lawmakers came forward appealing for more assistance to India.\n\nToday, we announced humanitarian help to India and proposed travel of a mercy ship to India to help with the devastation of Covid-19. The situation in India is dire so we must organize and collaborate to provide the aide India needs. Thank you @cgihou, @HoustonUmmc, and leaders! pic.twitter.com/cZUVyc6q8G — Sheila Jackson Lee (@JacksonLeeTX18) May 5, 2021\n\nCongresswoman Katherine Clark said that the United States must continue to do everything it can to end the crisis in India and other countries and protect people from infection and the deadly impact of COVID-19.\n\n\"Our work as a nation is not over until the pandemic has been stopped in all corners of the world,\" she said.\n\nIndian-American Congressman Raja Krishnamoorthi had a virtual meeting with India's Ambassador to the US, Taranjit Singh Sandhu, during which he extended full support to India in its fight against COVID-19.\n\n\"I thanked Congressman for his strong support for India during these challenging times,\" Taranjit Singh Sandhu said in a tweet.\n\nCongresswoman Lisa Blunt Rochester praised the Department of Defence for flying COVID-19 assistance to India.\n\n\"Wonderful to see this support making its way to #India. Sending my prayers to the entire country as they face down this wave of COVID19,\" she said.\n\nWonderful to see this support making its way to #India. Sending my prayers to the entire country as they face down this wave of #COVID19https://t.co/BX8waRLYZT — Rep. Lisa Blunt Rochester (@RepLBR) May 5, 2021\n\nIndia is struggling with a second wave of the pandemic with more than 3,00,000 daily new coronavirus cases being reported in the past few days, and hospitals are reeling under a shortage of medical oxygen and beds.\n\nA record 3,780 fresh COVID-19 fatalities were registered in a single day in India taking the death count to 2,26,188, while 3,82,315 new coronavirus infections were recorded, according to the Union Health Ministry data updated on Wednesday.\n\nWith the fresh cases, the total tally of COVID-19 cases in the country climbed to 2,06,65,148.\n\nOver 40 countries have committed to provide India urgently required medical supplies like oxygen-related equipment and critical medicines to help it deal with an unprecedented second wave of the coronavirus pandemic, foreign secretary Harsh Vardhan Shringla said in New Delhi last week.",
    "Title": "US Must Organise And Collaborate To Provide Aid To India: Congresswoman"
  },
  {
    "Date": "Thu, 06 May 2021 06:53:11 +0530",
    "Description": "Top US lawmakers have applauded India's decision to not allow Chinese telecom companies to conduct 5G trials in the country.",
    "Image": "https://c.ndtvimg.com/2018-09/q35u6gic_india-us-flags-reuters_625x300_18_September_18.jpg",
    "Link": "https://www.ndtv.com/india-news/us-lawmakers-applaud-indias-decision-to-not-allow-chinese-firms-to-conduct-5g-trials-2431977",
    "Text": "US lawmakers thanked India for not allowing Chinese companies conduct 5G trials (Representational)\n\nTop US lawmakers have applauded India's decision to not allow Chinese telecom companies to conduct 5G trials in the country.\n\nThe Department of Telecom in India on Tuesday had approved applications of telecom companies Reliance Jio, Bharti Airtel, Vodafone Idea and MTNL to conduct 5G trials but none of them would be using technologies of Chinese entities.\n\n\"India's decision to exclude Huawei and ZTE from its 5G trials is good news for the people of India and the world,\" House Foreign Affairs Committee Lead Republican and China Task Force Chairman Michael McCaul said in a statement on Wednesday.\n\n\"People's Republic of China law requires any Chinese company - including Huawei and ZTE - to work for the Chinese Communist Party if asked,\" Mr McCaul said.\n\nThe previous Trump administration had designated Chinese tech companies as posing a national security risk.\n\nThe US is also asking its friends and allies not to opt for a technology that is controlled by the Communist Party of China.\n\n\"It's a risk that can't be mitigated unless these companies are excluded from our networks, and I'm glad that India has recognized this threat. India has once again proven why it is a global leader in the fight against security threats posed by CCP-controlled technology,\" Mr McCaul said.\n\nCongressman Mike Waltz also thanked India for its decision.\n\n\"Thank you to India for denying the inclusion of CCP-run Huawei in their telecommunications,\" he said.\n\n\"As the world's largest democracy, India will be a critical ally in confronting China and securing our supply chains,\" Mr Waltz said.\n\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
    "Title": "US Hails India's Decision To Not Allow Chinese Firms To Conduct 5G Trials"
  },
  {
    "Date": "Thu, 06 May 2021 10:15:59 +0530",
    "Description": "The good news is that the vaccines work against a new virus strain circulating in India that's spread to several other countries.",
    "Image": "https://c.ndtvimg.com/2021-05/4gvjm9bs_covid-india_625x300_06_May_21.jpg",
    "Link": "https://www.ndtv.com/india-news/the-good-news-is-that-vaccines-work-against-india-strain-the-bad-news-2434326",
    "Text": "Indian strain is called a double mutant because of the presence of two changes in the virus's genome.\n\nThe good news is that the vaccines work against a new virus strain circulating in India that's spread to several other countries.\n\nThe bad news is it won't be only the new version of the pathogen to emerge from an outbreak of this scale, underscoring the urgency of mapping other possible variants that may be currently racing through India's tightly-packed population of 1.4 billion people.\n\nAs infections surge by more than 300,000 cases for 14 straight days, pushing India's tally past 20 million, the country's limited ability to track new mutations emerging from its outbreak is a growing concern for scientists.\n\nSecond- or even third-generation versions of the variant known as B.1.617 could already be circulating in India and some may be more dangerous, said William Haseltine, a former Harvard Medical School professor who now chairs think tank Access Health International.\n\n\"India has the necessary genome sequencing capabilities but it needs to have a mass surveillance program,\" Haseltine said. \"I'll be on the lookout for more and newer variants, given the opportunity the virus has had with such a massive outbreak.\"\n\nVariants are already outracing vaccination progress in many parts of the world, fueling bigger outbreaks that spread faster. While some rich nations that secured effective vaccines early have seen their epidemics wane, the virus is still spreading like wildfire in developing economies, prolonging the pandemic.\n\nSuper Mutant Debunked\n\nMutations occur when the virus replicates, and India's unprecedented surge is driving new cases to global records, even as richer economies like the U.S. and Israel re-open quickly. Fearing an influx of infections and mindful of B.1.617, Singapore, the U.K. and Tanzania are among countries that have curbed travel to and from India.\n\nAustralia has banned its citizens from returning from India and imposed penalties of roughly $50,000 and five years imprisonment for violators.\n\nThe India strain has been called a double mutant because of the presence of two changes in the virus's genome, called E484Q and L452R. Both affect a portion of the spike protein, called the receptor binding domain, that's key to the virus entering cells.\n\nSome researchers estimate that the B.1.617 variant is as transmissible as the B.1.1.7 variant that emerged in the U.K., thought to be as much as 70% more transmissible than earlier versions of the virus.\n\nYet initial analyses indicate that the India version, now classified a variant of interest by the World Health Organization, poses a limited threat and doesn't appear to be more dangerous.\n\nCovaxin, the inactivated-virus vaccine being made by India's Bharat Biotech International Ltd., and AstraZeneca Plc's vaccine, called Covishield in India, are effective against the strain in preventing serious illness, said Rakesh Mishra, director of the Centre for Cellular and Molecular Biology in Hyderabad, one of the labs analyzing virus samples. Data is still being gathered about the response to Russia's Sputnik V vaccine, Mishra said, but it's likely to be effective.\n\nBioNTech SE Chief Executive Officer Ugur Sahin said he was confident the mRNA shot it's making with partner Pfizer Inc. would work against the India mutant though testing is still ongoing. \"The Indian variant has the same mutation that we've already investigated and against which our vaccine was also effective,\" he said last week.\n\nSingapore, which tightened social distancing restrictions this week after findings cases linked to the India variant, has also seen vaccines hold up well to prevent serious illness, said Kenneth Mak, director of medical services in city-state's health ministry. But \"vaccination does not prevent you from getting infected 100%,\" he said in a Tuesday briefing.\n\nRavindra Gupta's team at the University of Cambridge recently studied the two mutations that appear on the receptor binding domain of the India variant's spike protein. The team tested viruses made to simulate the variant against serum from nine people who had already received a single dose of the BioNTech-Pfizer vaccine.\n\n\"We wanted to know whether this double mutant really is a double whammy,\" said Gupta, a professor of clinical microbiology at Cambridge's Institute for Therapeutic Immunology and Infectious Diseases. What they found was that while each of the mutations could partly evade neutralizing antibodies, the two mutations didn't combine to create an even greater ability to evade immune protection.\n\n\"They don't combine to make a super mutant,\" Gupta said. \"It kind of debunks this view that this double mutant is doubly evading neutralizing antibodies.\"\n\nHere is the REALLY IMPORTANT part. The combination of the two mutations gives a value of 4, in other words the two mutations DO NOT confer substantial antibody evasion and we can stop using the term 'Double Mutant'. — Gupta Lab, Cambridge (@GuptaR_lab) May 1, 2021\n\nWhile the findings ease concerns around B.1.617, researchers are turning to the next set of variants as India's outbreak continues to rage. Genomic surveillance can provide crucial information on the new forms of this shape-shifting virus -- critical in preventing subsequent waves and developing the next generation of vaccines.\n\nIn the U.S., recent studies published by the Centers for Disease Control and Prevention show that a variant that caused concern when it emerged in New York isn't more dangerous than earlier strains, while a pair of mutants that surfaced in southern California \"might more frequently cause discernible and severe illness than do nationally circulating lineages overall.\"\n\nThe WHO has been monitoring variants through a global working group of laboratories, said Maria Van Kerkhove, the agency's technical lead officer. Information about new variants is coming in \"fast and furious,\" she said.\n\nBut as its health system is stretched to breaking point and Prime Minister Narendra Modi resists calls for a lockdown, the country's labs are ill-equipped to keep up with the necessary monitoring. Genomic sequencing that can identify new strains and track their progress is still relatively sparse in India, where only about 11,000 viruses have been analyzed, according to Mishra.\n\nWhile countries like the U.K. monitor about 5% to 10% of cases, in India far fewer are sequenced. To do so would require analyzing tens of thousands of samples daily, and failing to leaves a huge blind spot, according to Ashish Jha, dean of Brown University's School of Public Health in Rhode Island.\n\n\"What genomic surveillance does,\" he said, \"is it helps you really track where infections are going and how things are spreading in a way India was pretty blind to.\"\n\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
    "Title": "The Good News Is That Vaccines Work Against India Strain. The Bad News..."
  },
  {
    "Date": "Thu, 06 May 2021 11:08:20 +0530",
    "Description": "Two days after Bihar Chief Minister Nitish Kumar declared a 10-day lockdown over Covid, but a leader of his ally BJP has put out an \"I-Told-You-So\" post on Facebook.",
    "Image": "https://c.ndtvimg.com/2020-11/28803s3_nitish-kumar-pti-pic_650x400_13_November_20.jpg",
    "Link": "https://www.ndtv.com/india-news/bihar-bjp-chief-sanjay-jaiswal-needles-nitish-kumar-with-new-facebook-post-2434741",
    "Text": "This is Sanjay Jaiswal's second post within a week and Nitish Kumar's party is seething.\n\nTwo days after Bihar Chief Minister Nitish Kumar declared a 10-day lockdown over Covid, but a leader of his ally BJP has put out an \"I-Told-You-So\" post on Facebook.\n\nIn the post that has enraged Nitish Kumar's Janata Dal United, Bihar BJP Chief Sanjay Jaiswal implies that the Bihar government ignored his advice to impose a lockdown when Covid cases in the state were less than 40,000. With over one lakh active cases now, he writes, there is no other option.\n\n\"Bihar government has imposed 11 days lockdown from today. Please follow this and save your and your family's life,\" says Mr Jaiswal's Facebook post.\n\n\"Governments have to take some difficult decisions for the interest of the citizens. Even today, there is lockdown in different states of half the countries of the world. In the meeting of Governor, when I talked about the 62-hour lockdown from Friday evening to Monday morning, the cases in Bihar were less than 40,000 but today due to more than one lakh active cases, Bihar government there is no other option for public welfare. All the representatives of the Bharatiya Janata Party are requested to stay in their area and worry about hospitals. Wake the public up to mask and 2 yards distance. I hope even the leaders who make political rhetoric by taking my name understand the ground reality,\" the Lok Sabha MP writes in the long post.\n\nThis is his second post within a week and Nitish Kumar's party is seething. Janata Dal United leaders point out that the BJP has the health portfolio in the coalition government and allege Mr Jaiswal's posts are meant to divert attention from the failure of the party's minister.\n\n\"Mr Jaiswal should come clean on how many ventilators he organised or whether he intervened to ensure oxygen allotments and other health needs for Bihar on the preferential basis from the central government,\" a JDU leader said.\n\nNitish Kumar announced on Tuesday that Bihar would go into lockdown till May 15. The announcement hours after the Patna High Court ordered the government to declare a lockdown, warning that otherwise, the court may step in.\n\nYesterday, the Chief Minister urged people to postpone weddings and other social functions, with the state reporting over 10,000 daily cases for several days.\n\nIn a previous Facebook post on May 1, Mr Jaiswal, who is a doctor, had made an alarming reference to a \"close friend in Patna who is a doctor and not picking up calls\" because he was helpless in a growing health crisis.\n\n\"The situation reached at the stage that even my close friend in Patna who is a doctor is not picking up my calls as he is unable to help. I have lost many known persons in the second wave,\" the BJP leader said in the Facebook post in Hindi.\n\nHis repeated posts have not helped ease the strained ties between Nitish Kumar and the BJP in their second straight term in power. The dynamics shifted this time round with Mr Kumar's party ending up with fewer seats and becoming the junior partner in the coalition.\n\nIndia today reported another global record of 4.12 lakh cases and 3,980 deaths in a day.",
    "Title": "Bihar BJP Chief's Sarcastic Post On Lockdown Upsets Nitish Kumar's Party"
  },
  {
    "Date": "Thu, 06 May 2021 08:44:42 +0530",
    "Description": "The US India Chamber of Commerce (USICOC) Foundation has shipped another 32 portable ventilators to help India battle the deadly second wave of the COVID-19 pandemic.",
    "Image": "https://c.ndtvimg.com/2021-05/0ednib6o_usicoc-foundation-ships-32-more-ventilators-to-india-650_625x300_06_May_21.jpeg",
    "Link": "https://www.ndtv.com/india-news/coronavirus-us-india-chamber-of-commerce-foundation-sends-32-portable-ventilators-to-help-india-fight-second-covid-wave-2433078",
    "Text": "The foundation is likely to send a third shipment of 25 ventilators in the next few days.\n\nThe US India Chamber of Commerce (USICOC) Foundation has shipped another 32 portable ventilators to help India battle the deadly second wave of the COVID-19 pandemic.\n\nThe foundation is likely to send a third shipment of 25 ventilators in addition to several oxygen concentrators in the next few days.\n\nThe US India Chamber of Commerce of Dallas-Fort Worth and Indo-American Chamber of Greater Houston (IACCGH) have joined hands to unite the entire Texas Indian-American diaspora in this effort.\n\nJagdip Ahluwalia, executive /founding director of the IACCGH, credited many community organisations and individual business owners for these efforts.\n\nJagdip Ahluwalia also acknowledged the contributions made by the logistics and cargo teams at Perimeter Global Logistics, Southwest Airlines, and United Airlines.\n\nIACCGH president Tarush Anand said, \"While what is happening in India is heartbreaking, it is encouraging to see the Indian-American community rally together to support the people of India in their time of need. Dozens of private donors and various organisations have supported these efforts wholeheartedly.\"\n\nHouston-based entrepreneur Abeezer Tyebji, who also represents the Dawoodi Bohra community, donated over USD 100,000.\n\n\"Islam teaches us to aid all humanity, and as such to help India in this time of need is both a matter of faith as it is one of kinship for the Dawoodi Bohras\", he said.\n\nNeel Gonuguntla, the USICOC president, said, \"This collective community effort is the result of hundreds of helping hearts.\"\n\nPresident of the IT Serve Alliance Raghu Chittimala partnered with the USICOC Foundation and donated over USD 100,000.\n\n\"We want India to know that the ITSERVE Alliance community has your back to provide the help in any way we can,\" he said.",
    "Title": "US Foundation Ships Portable Ventilators To Aid India During Pandemic"
  },
  {
    "Date": "Thu, 06 May 2021 10:58:24 +0530",
    "Description": "Two-time Olympic medallist Sushil Kumar's role is under scanner after his name emerged in connection with a brawl that led to the death of a wrestler inside the Chhatrasal Stadium complex in north...",
    "Image": "https://c.ndtvimg.com/2021-04/tsib9se_sushil-kumar-afp_625x300_22_April_21.jpg",
    "Link": "https://www.ndtv.com/india-news/olympian-wrestler-sushil-kumar-named-in-fir-over-murder-at-delhi-stadium-2434973",
    "Text": "Sushil Kumar did not answer his phone when contacted to comment on the issue.\n\nTwo-time Olympic medallist Sushil Kumar's role is under scanner after his name emerged in connection with a brawl that led to the death of a wrestler inside the Chhatrasal Stadium complex in north Delhi, police said on Wednesday.\n\nSushil Kumar, the county's only athlete to have won two individual Olympic medals, was named in the FIR, they said.\n\nAccording to police, a 23-year-old wrestler died and his two friends got injured after they were allegedly brutally assaulted by other wrestlers inside Chhatrasal Stadium in northern part of city.\n\nPolice said that on the intervening night of Tuesday and Wednesday, an information regarding firing inside the Chhatrasal Stadium was received at Model Town police station.\n\nPolice reached the spot and found five cars parked in the parking area of the stadium.\n\nDuring enquiry, it was found that a quarrel had taken place allegedly between Sushil Kumar, Ajay, Prince, Sonu, Sagar, Amit, and others in the parking area. Thereafter, police registered a case under relevant sections of the Indian Penal Code (IPC) and Arms Act at Model Town police station in this regard, they said in a statement.\n\nThe injured were shifted to BJRM Hospital for treatment. They were identified as Sagar, a resident of Model Town, Amit Kumar, 27, a resident of Rohtak in Haryana, and Sonu, 35, a resident of Sonipat in Haryana, they said.\n\n\"The crime scene as well as all the five vehicles were inspected. During inspection, one double barrel loaded gun with five live cartridges were found in one Scorpio and two wooden sticks were also recovered from the spot.\n\n\"All the five vehicles and weapons of offence were seized. The crime scene was further inspected by forensic experts of FSL, Rohini,\" Additional Deputy Commissioner of Police (northwest) Guriqbal Singh Sidhu said.\n\nDuring the investigation, information regarding the death of Sagar and injury to Sonu was received from Trauma Centre, Civil Lines, following which sections 302, 365, 120B of the IPC were registered, he said.\n\nSeveral teams have been formed to trace the alleged persons. Technical evidences relating to this incident have been obtained. The details of the recovered vehicles are also being obtained from the concerned authority, police said.\n\nOne Prince Dalal, 24, a resident of Jhajjar in Haryana, has been apprehended in this case, along with one double-barrel gun, they said. Police said they have recovered two double-barrel guns, seven live cartridges, two wooden sticks, and five cars.\n\nOfficial sources claimed that the incident took place due to a property dispute in the Model Town area.\n\n\"It was not a case of trespassing. The accused took the victims inside the stadium where they assaulted them in the parking area. Sushil Kumar was present at the spot when the incident happened, however, police are investigating his role in the assault,\" an official source said.\n\nHowever, Sushil Kumar did not answer his phone when contacted to comment on the issue.",
    "Title": "Olympian Wrestler Sushil Kumar Named In FIR Over Murder At Delhi Stadium"
  },
  {
    "Date": "Thu, 06 May 2021 05:09:58 +0530",
    "Description": "An encounter has begun between terrorists and security forces at the Kanigam area of Shopian district in South Kashmir, Jammu and Kashmir Police said on Thursday.",
    "Image": "https://c.ndtvimg.com/2019-10/h0qapm6o_jammu-and-kashmir-police-generic-pti_625x300_11_October_19.jpg",
    "Link": "https://www.ndtv.com/india-news/encounter-begins-in-j-ks-shopian-4-al-badr-terrorists-trapped-2431265",
    "Text": "The trapped terrorists fired and threw grenade on joint search party, the police said (Representational)\n\nThree terrorists were killed, while one surrendered before security forces during an encounter in Shopian district of Jammu and Kashmir on Thursday, police said.\n\nThe security forces launched a cordon and search operation in Kanigam area of the South Kashmir district during the night following information about the presence of terrorists there, a police official said.\n\nHe said as the presence of four newly recruited terrorists of Al-Badr outfit got ascertained, the security forces exercised maximum restraint and tried their best to persuade them to surrender.\n\nThe terrorists turned down the offer to surrender and opened firing and threw a grenade on the security forces, the official said.\n\nThe security forces retaliated, ensuing an encounter, the official said.\n\nHowever, during the encounter one of the terrorists surrendered before the security forces while three others were killed.\n\nThe surrendered terrorist has been identified as Tausif Ahmad, the official said.",
    "Title": "3 Terrorists Killed, 1 Surrenders Before Security Forces In J&K's Shopian"
  },
  {
    "Date": "Thu, 06 May 2021 04:51:16 +0530",
    "Description": "Foreign donors providing medical supplies to India in support of its COVID-19 response are being apprised of the allocation of the aid to various states and Union Territories, people familiar with the...",
    "Image": "https://c.ndtvimg.com/2021-05/g999lma8_foreign-aid-to-india-_625x300_04_May_21.jpg",
    "Link": "https://www.ndtv.com/india-news/allocation-details-of-foreign-covid-aid-to-states-shared-with-donors-report-2431147",
    "Text": "India has received large amounts of medical supplies from a significant number of countries (File)\n\nForeign donors providing medical supplies to India in support of its COVID-19 response are being apprised of the allocation of the aid to various states and Union Territories, people familiar with the development said on Wednesday.\n\nAs India reels under a calamitous second wave of the coronavirus infection, it has received large amounts of medical supplies from a significant number of countries, including the US, Russia, France, Germany, the UK, Ireland, Belgium, Romania, Singapore, Sweden and Kuwait.\n\nHowever, questions have been raised by some on the allocation of the foreign medical supplies.\n\nCongress leader Rahul Gandhi has raised questions of \"transparency\" in the foreign aid received by India and demanded answers from the government.\n\n\"Questions about Covid foreign aid: What all supplies has India received? Where are they? Who is benefitting from them? How are they allocated to states? Why no transparency? Any answers, GOI?\" he wrote on Twitter on Wednesday.\n\nThe sources said the foreign medical supplies received from the global community have been allocated to the states and Union Territories and that the donors know about the allocation.\n\nThey said the arrival of supplies, facilitation of cargo clearance, delivery of the aid are being done under the framework of a multi-agency coordination.\n\nThey said the Centers for Disease Control and Prevention in the United States is also willing to help India and experts from the premier institution are expected to hold virtual discussions with Indian experts over the COVID-19 situation in the country.\n\nOn foreign missions in India reporting COVID-19 cases, the sources said many embassies have such cases among their diplomats and local employees and that the Chief of Protocol in the Ministry of External Affairs is trying to assist them.\n\n\"We are trying to do our best to help them,\" said one of the sources.\n\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
    "Title": "Allocation Details Of Foreign Covid Aid Shared With Donors: Report"
  },
  {
    "Date": "Thu, 06 May 2021 08:27:54 +0530",
    "Description": "The BJP has not yet announced the new Chief Minister for Assam, a state it won decisively in the recently-held Assembly election, because of the post-poll violence reported in West Bengal.",
    "Image": "https://c.ndtvimg.com/2021-03/16bogkkg_jp-nadda-650_625x300_22_March_21.jpeg",
    "Link": "https://www.ndtv.com/india-news/bengal-post-poll-violence-delaying-new-assam-chief-minister-announcement-2432901",
    "Text": "The BJP has said it will take a call on the Assam Chief Minister and Bengal Leader of Opposition soon.\n\nThe BJP has not yet announced the new Chief Minister for Assam, a state it won decisively in the recently-held Assembly election, because of the post-poll violence reported in West Bengal. The party's top leadership has been busy in the neighbouring state since May 4, handling the alleged attack on its cadres by Trinamool Congress backers.\n\nBJP National President JP Nadda has, however, indicated that a decision will be taken soon on both the next Assam Chief Minister and Bengal's leader of the opposition.\n\nPolitical observers believe the BJP central leadership will have a tough call in Assam between the clean image of incumbent Chief Minister Sarbananda Sonowal and its most powerful leader in the northeast, the astute Himanta Biswa Sarma.\n\nThe BJP won the Assam Assembly polls whose results were declared on May 2, gathering 75 out of the 126 seats, giving the party a consecutive term in the state.\n\nMeanwhile, hundreds claiming to be BJP supporters have fled West Bengal fearing persecution by leaders of the Trinamool Congress which won the neighbouring state with 213 of the 294 seats.\n\n\"Our only mistake was to support the BJP by going beyond our religious beliefs. That's why they have come to our houses, beat us, molested our women, and threatened to make our lives miserable if we stay there or continue supporting the BJP. So we fled,\" said a man in his late 60s, wearing a mask over his white flowing beard and skull cap on Wednesday.\n\n\"They said first, they will beat us as we have supported BJP despite being a minority and then the Hindus,\" said another person in his late 20s or early 30s, also wearing a skull cap.\n\nThey have gathered at Kherabari, Japsabari, Pokrabari area under Agomoni, Golakganj police station in Dhubri district of western Assam where, according to the state government, they were provided food and shelter.\n\nAssam minister Himanta Biswa Sarma on Tuesday claimed that around 300-400 BJP workers and their family had crossed over to Dhubri in Assam following the violence in West Bengal.",
    "Title": "Bengal Post-Poll Violence Delaying New Assam Chief Minister Announcement"
  },
  {
    "Date": "Thu, 06 May 2021 08:50:20 +0530",
    "Description": "After the fourth US military aircraft carrying much-needed life-saving supplies landed in India amid the COVID-19 pandemic, Defense Secretary Lloyd Austin on Wednesday described it as a heroic effort...",
    "Image": "https://c.ndtvimg.com/2021-05/ndgr72ns_us-covid-aid_625x300_06_May_21.jpg",
    "Link": "https://www.ndtv.com/india-news/heroic-effort-us-defense-secretary-lloyd-austin-on-covid-assistance-to-india-2433144",
    "Text": "\"It's been a heroic effort from all involved,\" said the defense secretary.\n\nAfter the fourth US military aircraft carrying much-needed life-saving supplies landed in India amid the COVID-19 pandemic, Defense Secretary Lloyd Austin on Wednesday described it as a heroic effort from all those involved.\n\n\"So far, we've sent 4 gray tails to India, containing 1 million Rapid Diagnostic Tests, 545 Oxygen Concentrators, 1,600,300 N95 masks, 457 Oxygen cylinders, 440 regulators, 220 pulse oximeters and 1 Deployable Oxygen Concentration System,\" Mr Austin tweeted with three pictures of the US military aircraft in India.\n\n\"It's been a heroic effort from all involved,\" said the defense secretary.\n\nSo far, we've sent 4 gray tails to India, containing 1m Rapid Diagnostic Tests, 545 Oxygen Concentrators, 1,600,300 N95 masks, 457 Oxygen cylinders, 440 regulators, 220 pulse oximeters and 1 Deployable Ox. Concentration System. It's been a heroic effort from all involved. pic.twitter.com/RJuxJ0KOOf — Secretary of Defense Lloyd J. Austin III (@SecDef) May 5, 2021\n\nPentagon Press Secretary John Kirby told reporters that this is just part of the whole-of-government response to \"our friends\" in India.\n\n\"We remain in communication with them to see if there are other ways we can help them defeat COVID as we all move forward,\" he said.\n\nMost of these supplies are being procured by the Defense Logistics Agency (DLA) at the request of USAID and the US Embassy in India, which are coordinating with the Indian government on the requirement related to life-saving medical supplies.\n\nAccording to the Pentagon, the agency has been tasked to provide 15 million N95 masks, one million test kits and 704 oxygen concentrators in support of the US Agency for International Development-led effort.\n\n\"We remain closely integrated with the White House, National Security Council, the Joint Chiefs of Staff and USAID to help clarify ways DLA can assist,\" Dave Kless, the agency's executive director of operations, said.\n\nThe DLA is also standing by to provide other supplies to India if directed. It has 14 field hospitals pending shipment to US Southern Command that could be redirected to India if requested, the Pentagon said.",
    "Title": "\"Heroic Effort\": US Defense Secretary On Covid Assistance To India"
  },
  {
    "Date": "Thu, 06 May 2021 07:32:40 +0530",
    "Description": "Patients lying on the roadside and IV fluid bottles hanging from trees -- that's how Covid treatment is happening in a rural area of Agar-Malwa district in Madhya Pradesh.",
    "Image": "https://c.ndtvimg.com/2021-05/148sqc88_madhya-pradesh-field-hospital_625x300_06_May_21.jpg",
    "Link": "https://www.ndtv.com/india-news/in-rural-madhya-pradesh-a-field-hospital-for-covid-run-by-quacks-2432362",
    "Text": "People from 10 nearby villages have been coming here for treatment.\n\nPatients lying on the roadside and IV fluid bottles hanging from trees -- that's how treatment is happening in a rural area of Agar-Malwa district in Madhya Pradesh. With the locals afraid to go to government hospitals, unlicensed practitioners are treating patients in the most rudimentary fashion with no arrangement for drugs or even electricity.\n\nIn an orange farm, located 200 meters from the highway, the patients are seen lying on sheets and cardboard pallets. Bags of IV fluid are seen hanging from trees. There is no social distancing. No one is seen using a mask.\n\nThe horrifying video is from near village Dhaniyakhedi -- around 200 km from state capital Bhopal -- on the road leading from Susner to Pidawa Rajasthan. People from 10 nearby villages have been coming here for treatment.\n\nAlthough no one was ready to speak in front of a camera, they told local reporters that they are afraid to go for treatment in government hospitals.\n\nThe patients, they said, will be admitted in the Covid ward, where many are dying.\n\n\"The government has time and again taken action against such quacks,\" said the Block Medical Officer, Manish Kuril. \"We request everyone -- if you have a cold or cough, please go to a proper doctor and get tested for Covid, otherwise it can be too late,\" he added.\n\nChief medical and health officer (CMHO) Dr. Samandar Singh Malviya sent a team to the spot and said an FIR will be registered against the unlicensed practitioners.\n\nHowever, when the team reached the spot, they did not find any patients or the unlicensed practitioners. The team found empty bottles of medicines.\n\n\"We got to know that the farm where this was happening belonged to the quack. Four FIRs have been lodged against the unlicensed practitioners duping patients earlier as well,\" the team said.\n\n82 patients were infected with coronavirus in the last 24 hours in Agar Malwa where the number of active cases are 492.\n\nOn Wednesday, Madhya Pradesh logged 12,319 fresh cases of Covid, which took the tally of infections in the state to 6,24,985. There were 71 fatalities in the same period, taking the total number of deaths to 6,074, show figures from the state health department.",
    "Title": "In Rural Madhya Pradesh, A 'Field Hospital' For Covid Run By Quacks"
  },
  {
    "Date": "Thu, 06 May 2021 05:36:29 +0530",
    "Description": "Up to 3,980 people died of Covid in India the past 24 hours, the highest in a day so far, pushing total fatalities to 2,30,168.",
    "Image": "https://c.ndtvimg.com/2021-05/m3o9r4co_cremation-covid-patients-delhi-afp_625x300_05_May_21.jpg",
    "Link": "https://www.ndtv.com/india-news/india-coronavirus-live-updates-india-logged-highest-single-day-covid-deaths-wednesday-2431441",
    "Text": "COVID-19 Cases in India:India is second only to the US in the total number of cases reported. (File)\n\nUp to 3,980 people died of Covid in India the past 24 hours, the highest in a day so far, pushing total fatalities to 2,30,168. The country also set a new grim record in its daily Covid numbers with 4.12 lakh infections.\n\nIndia is second only to the United States in the total number of cases reported since the beginning of the pandemic.\n\nTwelve states, including Maharashtra, Karnataka, have more than 1 lakh active COVID-19 cases, according to the government.\n\nMeanwhile, a third wave of the coronavirus is \"inevitable\", the government's top scientific adviser said on Wednesday, warning that vaccines will need to be \"updated\" to deal with the new strains that have overwhelmed hospitals and left thousands dead.\n\nVaccines will need to be updated to tackle the new strains that are spreading the contagion fast, he said, adding that the current surge in infections seems to be because of the Indian \"double mutant\" coronavirus and the spread of the UK variant has slowed.\n\nHere are the Live updates on coronavirus (COVID-19) cases:\n\nMay 06, 2021 11:38 (IST) Constitutional Authorities, Stop Complaints On Media Reports: Supreme Court\n\n\n\nConstitutional authorities can do better than to complain and ask for fetters on the media, the Supreme Court said today on the Election Commission's petition complaining about media reports on the Madras High Court telling the poll body it should be booked for murder for not stopping political rallies amid Covid.\n\nThe Supreme Court said the remarks made by the Madras High Court were \"harsh and the metaphor improper\" and judicial restraint was necessary.\n\n\n\nHowever, the High Court was faced with rising Covid cases and the task of protecting the lives and liberty of people, the court said.\n\nThe Supreme Court said the remarks made by the Madras High Court were \"harsh and the metaphor improper\" and judicial restraint was necessary.However, the High Court was faced with rising Covid cases and the task of protecting the lives and liberty of people, the court said.\n\nMay 06, 2021 11:35 (IST) Delhi Hospitals Have Significant Stock Of Oxygen: Centre To Supreme Court\n\n\n\nThe Supreme Court began hearing the matter regarding the supply of oxygen by the Centre to various hospitals in Delhi today.\n\nCentre told the top court that a survey conducted revealed that Delhi hospitals have significant stock of oxygen.\n\n\n\n\"280 MT oxygen coming today by oxygen express train,\" the Centre said, adding that the supply of more oxygen to Delhi will states other states of their share.\n\n\"700 MT requirement by Delhi is not correct,\" the Centre said.\n\nCentre told the top court that a survey conducted revealed that Delhi hospitals have significant stock of oxygen.\n\nMay 06, 2021 10:18 (IST) With 10,521 New Cases, Odisha Sees Rise In COVID-19 Infections\n\n\n\nOdisha registered 10,521 new COVID-19 cases in the last 24 hours, the state health department said on Thursday morning.\n\nThe state also recorded 16 COVID-related deaths while 6,176 COVID-infected patients recovered from the infection over the last 24 hours.\n\n\n\nAccording to the official health bulletin, the state has 81,585 active COVID-19 cases.\n\n\n\nThe state conducted 1,03,674,18 tests so far and 41,640,3 people have recovered from the disease so far.\n\n\n\nOf the fresh cases, 5,945 were detected among people in quarantine, and 4576 were local contacts, the bulletin further said. The state also recorded 16 COVID-related deaths while 6,176 COVID-infected patients recovered from the infection over the last 24 hours.According to the official health bulletin, the state has 81,585 active COVID-19 cases.The state conducted 1,03,674,18 tests so far and 41,640,3 people have recovered from the disease so far.Of the fresh cases, 5,945 were detected among people in quarantine, and 4576 were local contacts, the bulletin further said.\n\nMay 06, 2021 09:29 (IST) Congress Interim President Sonia Gandhi will hold a meeting via video conference with the party's Lok Sabha MPs tomorrow, to discuss the current COVID19 situation in the country pic.twitter.com/6VRCNmWmYm - ANI (@ANI) May 6, 2021\n\nMay 06, 2021 09:03 (IST) Ladakh Reports 251 New COVID-19 Cases\n\n\n\nWith 251 new COVID-19 cases reported in Ladakh, the total caseload in the union territory has reached 14,811, the Department of Information and Public Relations informed on Thursday.\n\nOf the 14,811 COVID-19 cases in the union territory, 12,252 are from Leh and 2,559 from Kargil.\n\n\n\nOut of the total fresh cases, 182 cases were reported from Leh and 69 from Kargil.\n\n\n\nThe total number of active cases has reached 1,494, including 1,264 in Leh district and 230 in Kargil district, the officials said. Of the 14,811 COVID-19 cases in the union territory, 12,252 are from Leh and 2,559 from Kargil.Out of the total fresh cases, 182 cases were reported from Leh and 69 from Kargil.The total number of active cases has reached 1,494, including 1,264 in Leh district and 230 in Kargil district, the officials said.\n\nMay 06, 2021 08:51 (IST) Uttarakhand Allots Rs 100 Crore For Covid Vaccination Of Beneficiaries Aged 18-44\n\n\n\nRs 100 crore have been allotted from the Uttarakhand's Chief Minister's relief fund for COVID-19 vaccination for citizens between18-44 years in the state, Additional Secretary to the state government Arunendra Singh Chauhan informed.\n\nMr Chauhan wrote a letter to the new Director-General of Medical Health and Family Welfare and informed about the allotted fund for the vaccination.\n\n\n\nMeanwhile, Additional Chief Secretary Manisha Panwar and Health Secretary Amit Negi held a press conference on Wednesday and informed about the efforts being made by the government to contain the spread of COVID-19 infection in Uttarakhand. Mr Chauhan wrote a letter to the new Director-General of Medical Health and Family Welfare and informed about the allotted fund for the vaccination.Meanwhile, Additional Chief Secretary Manisha Panwar and Health Secretary Amit Negi held a press conference on Wednesday and informed about the efforts being made by the government to contain the spread of COVID-19 infection in Uttarakhand.\n\nMay 06, 2021 08:19 (IST) Around 280 jail inmates to be released on bail or parole, in view of COVID. Regular sanitisation conducted in jail premises. The jail inmates are served immunity boosting 'kadha'. Inmates above 45&60 years of age have been vaccinated: Senior Jail Superintendent, Dist Jail, Meerut pic.twitter.com/2JyA6O0cI5 - ANI UP (@ANINewsUP) May 6, 2021\n\nMay 06, 2021 07:49 (IST) Mizoram Reports 172 New Covid Cases In 24 Hours\n\n\n\nMizoram reported 172 new COVID-19 cases in the last 24 hours. The number of active cases is now 1,642.\n\nMay 06, 2021 07:08 (IST) Noida Authority to set up 50-bed makeshift #COVID19 hospital\n\n\n\nSetting up a makeshift hospital that will have 50 beds with oxygen support for patients and the facility is likely to go functional by May 8: Noida Authority pic.twitter.com/lJbZFUL8uy - ANI (@ANI) May 6, 2021\n\nMay 06, 2021 06:09 (IST) DRDO Starts Construction Of 500-Bed Covid Hospital In J&K's Budgam\n\nAmid an acute shortage of ICU beds due to the rise in coronavirus infections in the Kashmir valley, the Defence Research and Development Organisation (DRDO) has started the construction of a 500-bed COVID-19 hospital in the Budgam district to ramp up medical infrastructure, reported news agency ANI.\n\n\n\nFor this joint initiative, the Union Territory administration handed over the land, which was already identified for a hospital, to the DRDO for construction of a temporary COVID-19 hospital.\n\n\n\nThis hospital will have 500 oxygen beds and is likely to be completed in about 35 days, Ravinder Kumar, Additional Chief Engineer, DRDO said.\n\n\n\n\"There will be 125 fully-equipped ICU beds for Covid patients, including a 50-double room accommodation facility for doctors and paramedics staff,\" he added.\n\n\n\nThe hospital will cover both Budgam and Srinagar and will become a lifeline for many COVID-19 patients in need of ICU facilities.\n\n\n\n\n\nMay 06, 2021 06:06 (IST) Train Coaches Converted To Covid Isolation Wards Stationed In Ahmedabad\n\nAs coronavirus cases continue to rise and put an increasing amount of pressure on healthcare infrastructures, the Indian Railways and Ahmedabad Municipal Corporation (AMC) have converted 19 coaches into isolation wards, an official said on Wednesday, reported news agency ANI.\n\n\n\nThe wards have been set up at Sabarmati and Chandlodiya railway stations and are equipped with oxygen cylinders.\n\n\n\nMay 06, 2021 06:05 (IST) Manipur To Vaccinate Journalists On Priority As Frontline Workers\n\nManipur Chief Minister N Biren Singh on Wednesday declared all accredited working journalist as frontline workers and said the state government will now vaccinate them against COVID-19 on priority, reported news agency ANI.\n\n\n\n\"We recognise the effort of our journalists to disseminate news and risk they are exposed to, is no less than other frontline workers. In recognition of all accredited working journalist as frontline warriors, state govt will now vaccinate all the journalists on priority,\" the chief minister tweeted.",
    "Title": "Delhi Hospitals Have Significant Stock Of Oxygen: Centre To Supreme Court"
  }
]