[
  {
    "Date": "Mon, 10 May 2021 09:28:01 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/india/convene-all-party-meeting-use-budget-allocation-for-free-mass-vaccination-lop-kharge-tells-pm-modi/articleshow/82514187.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82514187.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>",
    "Image": "https://static.toiimg.com/thumb/msid-82514241,width-1070,height-580,imgsize-31084,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/india/convene-all-party-meeting-use-budget-allocation-for-free-mass-vaccination-lop-kharge-tells-pm-modi/articleshow/82514187.cms",
    "Text": "NEW DELHI: Leader of Opposition in Rajya Sabha, Mallikarjun Kharge, on Sunday, wrote to Prime Minister Narendra Modi seeking an all-party meeting for a “collective and consensual” approach to tackling the coronavirus pandemic.\n\nWriting to the PM with six suggestions on ways to overcome the Covidcrisis, the leader of opposition echoed the views of party president Sonia Gandhi , former PM Manmohan Singh and MP Rahul Gandhi who have each written similar letters to the government in the last weeks and months, Kharge emphasised the need for an all-party meeting.\n\nHe also said that while most nations had planned in advance, prioritised their people and put in place contingencies for the anticipated second and third waves of the pandemic, such plans appeared to be missing in the Indian context.\n\n“Experts have warned us that although the situation is dire, it can become far worse if leadership is not immediately exercised. So, for the well-being of our people and in the national interest, I urge you to consider the suggestions outlined in this letter sensitively and urgently,” Kharge said.\n\nAmong key suggestions, Kharge said the government must use the Rs 35,000 crore amount allocated in the Union Budget for free mass vaccination, adding that allowing private companies to set exorbitant and differential prices for vaccines will adversely impact millions of Indians.\n\n“Sir, corporate profit cannot triumph saving lives. I, therefore, urge you to not relinquish the State's moral duty in immunising citizens. This is completely doable because India has a history of successful, large-scale immunisation programmes,” he said.\n\nKharge also reiterated the Congress ’ demand to leverage compulsory licensing to increase the production of vaccines, waiver of GST on vaccines PPE kits, ambulances, ventilators, oxygen equipment and sanitisers.\n\nThe Congress MP said the government should also expedite distribution of relief material received from foreign countries with transparency on where it is shipped to, and to mitigate employment issued in rural areas where migrant workers have returned in large numbers, expand the man days under MGNREGS to ensure 200 days from the existing 100 days.\n\n\n\nFacebook Twitter Linkedin EMail",
    "Title": "Convene all-party meeting, use budget allocation for free mass vaccination, LoP Kharge tells PM Modi"
  },
  {
    "Date": "Mon, 10 May 2021 09:23:00 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/india/opposition-dials-vp-naidu-seeks-virtual-meetings-of-parliamentary-standing-committees/articleshow/82514092.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82514092.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>",
    "Image": "https://static.toiimg.com/thumb/msid-82514175,width-1070,height-580,imgsize-170466,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/india/opposition-dials-vp-naidu-seeks-virtual-meetings-of-parliamentary-standing-committees/articleshow/82514092.cms",
    "Text": "NEW DELHI: Congress and TMC on Sunday wrote separate letters to Rajya Sabha chairman M Venkaiah Naidu and Lok Sabha speaker Om Birla seeking their permission to hold virtual meetings of parliamentary standing committees and arguing that the Indian Parliament cannot be a mute spectator to the raging coronavirus pandemic in India.\n\nIn a letter to Naidu, leader of opposition in Rajya Sabha, Mallikarjun Kharge , said parliamentary panels can contribute to the ongoing endeavours in containing the pandemic and providing relief to people.\n\n“At this hour of collective crisis, the Parliament of India cannot be and must not be a mute spectator. It must give a message of solidarity with the people, of serious business to alleviate their agony and of unity of purpose,” he said, urging Naidu to take cognisance of the report of the Department Related Standing Committee on Health and Family Welfare that had made vital recommendations on coping with the coronavirus pandemic.\n\n“The meetings of the Standing Committees at this juncture will provide the nation much required collective initiative across the party lines. They are an effective instrument to ensure accountability, to provide an institutional platform to all stakeholders and to collectively explore solutions….It is in this spirit that I urge you to allow the virtual meetings of the Standing Committees,” he said in his letter.\n\nTrinamool Congress MP Derek O'Brien also wrote to Naidu and Lok Sabha Speaker Om Birla demanding virtual meetings of house panels.\n\n“India has reported more than three lakh new Covid-19 cases per day for the past two weeks…In light of the prevailing circumstances, I urge your good offices to reconsider our request for conducting virtual meetings of parliamentary committees, including departmentally related standing committees, consultative committees and select committees,” he said.\n\nTMC also said it had sent three letters to the Lok Sabha Speaker in this regard, first in July 2020 and then again in August 2020.\n\nThe demand for virtual sittings of the two houses of Parliament, as was being done by several countries, and of standing committees, had been turned down by both Naidu and Birla earlier on grounds that virtual meetings would flout the confidentiality clause of such meetings and that any changes to the norms could only be ratified by Parliament.\n\n\n\nFacebook Twitter Linkedin EMail",
    "Title": "Opposition dials VP Naidu, seeks virtual meetings of Parliamentary standing committees"
  },
  {
    "Date": "Mon, 10 May 2021 10:13:03 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/india/as-news-breaks-cotton-univ-celebrates-its-very-own-cm/articleshow/82514676.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82514676.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>",
    "Image": "https://static.toiimg.com/thumb/msid-82514778,width-1070,height-580,imgsize-201675,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/india/as-news-breaks-cotton-univ-celebrates-its-very-own-cm/articleshow/82514676.cms",
    "Text": "GUWAHATI: The Cotton University — erstwhile Cotton College — fraternity was elated after receiving the news of their most popular student union leader from the late 1980s becoming the 15th chief minister of Assam .\n\nOne of the breeding grounds of future politicians, Cotton College produced six former chief ministers of Assam- Gopinath Bordoloi, Mahendra Mohan Choudhury, Sarat Chandra Singha, Jogendra Nath Hazarika, Hiteswar Saikia and Bhumidhar Barman- in the post-independence era. Despite the Cotton alumni playing an influential role across the political spectrum of the state all along, a Cottonian could not adorn the chief minister's chair in Assam since 1996. As Himanta Biswa Sarma is set to be sworn in as the new chief minister on Monday, both the alumni and students of the leading higher education institution have pinned high hopes from him, which is far broader than transforming the education scenario of the state.\n\n“He (Himanta) had a great zeal to work for students and society. At his initiative, Cotton College was announced as a Centre of Excellence. It was because of his efforts that Cotton College got transformed into a university. With sheer hard work, he came a long way to become a political stalwart of the northeast and the new CM is our very own CM,” said Jagadish Dutta, general secretary of Cotton Alumni Association. He was hopeful that under Himanta’s leadership, Assam will become one of the top-3 states of the country.\n\nHimanta drew severe criticism from the Cottonians, who took the lead in intensifying the protests against the Citizenship (Amendment) Act (CAA) when the legislation was passed in December 2019. However, many said they trusted Himanta’s faith in Cotton University, despite differences on a range of political issues. Besides being a frontline leader of the All Assam Students’ Union (Aasu), Himanta was a three-time general secretary of Cotton College Union Society (CCUS) in 1988-89, 1989-90 and 1991-1992.\n\nIncumbent general secretary of Cotton University Students’ Union, Rahul Bordoloi, said on personal grounds, they never attacked Himanta. He, however, said on socio-political issues such as CAA, Cottonians will continue to remain firm on the stance. “We feel proud at Himanta Biswa Sarma’s elevation to the chief minister’s post. He is fond of his alma mater and we consider him as our guardian,” said Bordoloi, a border of the Sitanath Brahma Choudhury Hostel of the university, where Himanta spent a significant period of his student life.\n\nThe general students, who could not come out to the streets to celebrate the occasion, were equally jubilant after the end of the week-long dilemma on the new CM of Assam. \"Dr Himanta Biswa Sarma, a three-time general secretary of CCUS paved his way from being a popular student leader to 15th chief minister of Assam. How does he address the issue of CAA and also implementation of Clause 6 of the Assam Accord is what we are looking for. As of now, we expect an eligible cabinet under his leadership that plans and works to tackle the pandemic that has affected our state,\" said Rahul Gupta, a postgraduate fourth-semester student of the state university .\n\n\n\nFacebook Twitter Linkedin EMail",
    "Title": "As news breaks, Cotton Univ celebrates its ‘very own CM’"
  },
  {
    "Date": "Mon, 10 May 2021 08:34:39 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/india/all-citizens-to-get-vaccine-free-centre/articleshow/82513372.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82513372.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>",
    "Image": "https://static.toiimg.com/thumb/msid-82513549,width-1070,height-580,imgsize-190437,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/india/all-citizens-to-get-vaccine-free-centre/articleshow/82513372.cms",
    "Text": "NEW DELHI: In a late-night affidavit, the Union government on Sunday told the Supreme Court that differential pricing of vaccines by manufacturers for the Centre and the states or private hospitals would have no impact on the citizens who would be given the vaccine free of cost.\n\nThe Centre said, \"price factor (of the vaccines) will not have any impact on the ultimate beneficiary namely, the eligible person getting the vaccine since all state governments have already declared their policy decision that each state will be administering the vaccine to its residents, free of cost.\"\n\nIt said, \"Due to consultations and 'persuasion' by the Central government both the manufacturers of the vaccine, Bharat Biotech and Serum Institute of India , have declared their respective prices which are uniform for all state governments. It is pertinent to note that the Central Government by nature of its large vaccination programme, places large purchase orders for vaccines as opposed to the state governments and/or private hospitals and therefore, this reality has some reflection in the prices negotiated.\"\n\n\"Thus, while it is ensured that the two vaccine manufacturers are not unduly enriched from out of public money, the citizens are not supposed to make any payment for getting both doses of the vaccine,\" the Centre said.\n\nHowever, it also said that the economics of the vaccine manufacturers must be borne in mind. \"Till date, there are only vaccines available from two vaccine manufacturers. Both manufacturers [one an Indian company and second a licensee of a British company] have taken the financial risk in developing and manufacturing these vaccines and it is prudent to make decisions on pricing through negotiations in a transparent consultative process keeping statutory provisions as a last resort under the present circumstances,\" it said.\n\nThe Union government said, \"To ensure that there is no disparity between the States inter-se, with active consultation of the Central Government with both the manufacturers, the Central Government has successfully fixed uniform prices to be paid by all the state governments.\"\n\n\"As per the policy, which is devised keeping the priority of maximum vaccine reach to the citizens depending upon their vulnerability in mind, ensuring equitable distribution of the quantity of vaccine to all states at a uniform rate, the possibility of vaccine pricing decision in India having an inevitable impact on the country’s efforts bringing in more global vaccine manufacturers to India, the policy mandates 50% of the total manufactured quantity of vaccine from both manufacturers to be supplied to the Central Government. The logic behind this is to give priority in vaccination to the most vulnerable group of the population.\"\n\nExplaining the vaccine distribution formula, the Centre said, \"the remaining quantity to be uniformly distributed amongst all states on a pro-rata basis [viz. the total manufactured quantity from both the companies is divided and allocated to the States keeping in mind the total population of each State between the age group of 18- 44 years]. Out of the 50% quota allotted to each State, the division is made on a 50% - 50% basis. In other words, from out of the 50% allotted to the State, 50% will go to the State [calculated on a pro-rata basis based upon the population of the age group of 18-44 years] and the balance 50% will go to the private sector based upon the contracts between the private sector and vaccine manufacturers.\"\n\n\n\nFacebook Twitter Linkedin EMail",
    "Title": "All citizens to get vaccine free: Centre"
  },
  {
    "Date": "Mon, 10 May 2021 06:58:35 IST",
    "Description": "",
    "Image": "https://static.toiimg.com/thumb/msid-47529300,width-1070,height-580,imgsize-110164,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/india/mod-nod-to-hire-400-retd-military-doctors/articleshow/82512818.cms",
    "Text": "NEW DELHI: The director general of the Armed Forces Medical Services has now been formally authorised to hire 400 retired military doctors in the battle against Covid-19, the defence ministry said on Sunday.\n\n“As per the order issued, 400 ex-Army Medical Corps and Short-Service Commission medical officers, who retired or were released between 2017 and 2021, are expected to be recruited on a contract basis for a maximum period of 11 months,” said an official.\n\nThey will be paid a fixed monthly lump sum amount, which will be calculated by deducting the basic pension from the salary drawn at the time of their retirement.\n\n\n\nFacebook Twitter Linkedin EMail",
    "Title": "MoD nod to hire 400 retd military doctors"
  },
  {
    "Date": "Mon, 10 May 2021 06:55:10 IST",
    "Description": "",
    "Image": "https://static.toiimg.com/thumb/msid-47529300,width-1070,height-580,imgsize-110164,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/india/amu-seeks-genome-study-after-a-spate-of-faculty-deaths/articleshow/82512786.cms",
    "Text": "AGRA: Aligarh Muslim University vice-chancellor Tariq Mansoor has written to the director general of Indian Council of Medical Research (ICMR) seeking urgent genome analysis of Covid samples sent from their lab following deaths of several employees, including16 serving faculty members and a number of retired teachers living on the campus, due to the virus, reports Anuja Jaiswal.\n\nAccording to AMU administration, in order to analyse the severity of Covid-19, the samples collected at the ICMR-approved testing laboratory of the varsity, have been sent for viral genome sequencing to the CSIR-Institute of Genomics and Integrative Biology, New Delhi.\n\nIt is suspected that a new Covid variant could be fuelling the surge of cases in Aligarh.\n\n\n\nFacebook Twitter Linkedin EMail",
    "Title": "AMU seeks genome study after a spate of faculty deaths"
  },
  {
    "Date": "Mon, 10 May 2021 06:13:13 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/india/lack-of-leadership-in-delhi-to-take-on-modi-raut/articleshow/82512596.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82512596.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>",
    "Image": "https://static.toiimg.com/thumb/msid-82512597,width-1070,height-580,imgsize-145181,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/india/lack-of-leadership-in-delhi-to-take-on-modi-raut/articleshow/82512596.cms",
    "Text": "File photo\n\nMUMBAI: Shiv Sena MP Sanjay Raut on Sunday launched an indirect attack on Congress , claiming there is lack of strong leadership in Delhi capable of taking on PM Narendra Modi during the 2024 polls, reports Sujit Mahamulkar.\n\nRaut advocated the need for a Maha Vikas Aghadi (MVA)-like alliance, at the national level, hinting at a non-Congress leadership. He also said that he had a discussion with NCP chief Sharad Pawar on formation of a strong anti-BJP opposition alliance at the national level.\n\n“The country needs a strong opposition alliance in near future to take on BJP and Congress would be the ‘soul’ of any Opposition alliance. However, it needs to improve its performance. MVA type of alliance is needed at the national level, ” he said.\n\n",
    "Title": "Lack of leadership in Delhi to take on Modi: Raut"
  },
  {
    "Date": "Mon, 10 May 2021 06:03:00 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/india/foreign-aid-of-6738-o2-concentrators-16-plants-sent-to-states/articleshow/82512554.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82512554.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>",
    "Image": "https://static.toiimg.com/thumb/msid-82512553,width-1070,height-580,imgsize-262801,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/india/foreign-aid-of-6738-o2-concentrators-16-plants-sent-to-states/articleshow/82512554.cms",
    "Text": "Representative image\n\nNEW DELHI: The Centre has dispatched and delivered to various states and Union Territories 6,738 oxygen concentrators, 3,856 oxygen cylinders, 16 oxygen generation plants; 4,668 ventilators/Bi PAP, about 3 lakh Remdesivir vials received from foreign countries from April 27, 2021 to May 8.\n\nThe government has put in place a transparent mechanism to ensure relief material received from foreign countries are dispatched to institutions and hospitals across the country based on a set of standard operating procedures set by the health ministry . The focus is on states with high caseloads.\n\nNiti Aayog CEO Amitabh Kant said several individuals such as India-Canadian billionaire Prem Vatsa, billionaire venture capitalist Vinod Khosla and others are routing their contributions through reputed NGOs which have FCRA licences for faster delivery to institutions and states.\n\nSeveral agencies are working round-the-clock to ensure that relief material is not stored and is sent immediately to the needy states, government officials have said. Niti Aayog, which is working closely with the Indian Red Cross Society , is monitoring the movementof relief materials.\n\nThe healthy ministry is also monitoring the movement of the relief material. A dedicated coordination cell has been set up to coordinate the receipt and allocation of foreign grants, aid and donations.\n\nTo ensure transparency, it has also set up a website to enable donors to track the movement of the relief material right upto the end beneficiary.\n\nMajor items received on May 8 are from Canada, Thailand, Netherland, Austria, Czech Republic, Israel, USA, Japan, Malaysia, US (GILEAD), US (Salesforce) and Indian community in Thailand include oxygen concentrators (2,404), Remdesivir (25,000), Ventilators (218), testing kit (6,92,208).\n\n“The Government of India has designed a systematic mechanism for effective allocation, and prompt distribution and delivery of the support supplies received by India. This will help to supplement the medical infrastructure of the tertiary care institutions and recipient states/UTs...,” a health ministry statement said on Sunday.\n\n",
    "Title": "Foreign aid of 6,738 O2 concentrators, 16 plants sent to states"
  },
  {
    "Date": "Mon, 10 May 2021 05:59:48 IST",
    "Description": "",
    "Image": "https://static.toiimg.com/thumb/msid-47529300,width-1070,height-580,imgsize-110164,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/india/uttarakhand-to-give-rs-2k/month-to-caretaker-of-every-orphan/articleshow/82512549.cms",
    "Text": "DEHRADUN: In the wake of an increasing number of children being orphaned by the Covid-19 pandemic, the state department of women and child development (WCD) has made it mandatory for Covidpositive patients to fill in the details of their children and the guardians to whom they should be handed over in the event of death of both parents. The details have to be filled up at the time of hospital admission. The state will also give Rs 2,000 per child per month to their caretakers along with the other facilities, Rekha Arya , state minister for women and child development said on Sunday.\n\n“We will extend all possible financial help for the education and well-being of the children to their guardian who should ideally be a close family member,” Arya said.\n\nArya said the measure aims at preventing the children from falling into the hands of human traffickers. “We are also taking the help of over 20 NGOs to take care of all such children if the situation calls for it,” she said.\n\nThe director of the state WCD department, Yogendra Yadav , said they are working towards giving a ‘home environment’ to an orphaned child rather than send them to a shelter home straight away.\n\n\n\nFacebook Twitter Linkedin EMail",
    "Title": "Uttarakhand to give Rs 2k/month to caretaker of every orphan"
  },
  {
    "Date": "Mon, 10 May 2021 05:58:05 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/india/differential-pricing-of-jabs-wont-impact-citizens-centre/articleshow/82512545.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82512545.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>",
    "Image": "https://static.toiimg.com/thumb/msid-82512544,width-1070,height-580,imgsize-92580,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/india/differential-pricing-of-jabs-wont-impact-citizens-centre/articleshow/82512545.cms",
    "Text": "NEW DELHI: In a late night affidavit filed in the Supreme Court , the Union government said differential pricing of vaccines by manufacturers for the Union government, state governments and private hospitals would have no impact on citizens who would be given the vaccine free of cost.\n\nIn the affidavit, the Centre said, “Price factor (of the vaccines) will not have any impact on the ultimate beneficiary, namely the eligible person getting the vaccine since all state governments have already declared their policy decision that each state will be administering vaccine to its residents, free of cost.”\n\nIt added, “Due to consultations and ‘persuasion’ by the Centre, both the manufacturers of vaccine, Bharat Biotech and Serum Institute of India , have declared their respective prices which are uniform for all state governments. It is pertinent to note that the central government by nature of its large vaccination programme, places large purchase orders for vaccines as opposed to the state governments and/or private hospitals and, therefore, this reality has some reflection in the prices negotiated.”\n\n“Thus, while it is ensured that the two vaccine manufacturers are not unduly enriched from out of public money, the citizens are not supposed to make any payment for getting both doses of the vaccine.”\n\nHowever, it also said the economics of the vaccine manufacturers must be borne in mind. “Till date, there are only vaccines available from two vaccine manufacturers. Both manufacturers have taken financial risk in developing and manufacturing these jabs and it is prudent to take decisions on pricing through negotiations in a transparent consultative process keeping statutory provisions as a last resort under the present circumstances,” it said.\n\n“With a view to ensure that there is no disparity between the states inter-se, with active consultation of the Centre with both the firms, the Centre has fixed uniform prices to be paid by all states,” it added.\n\n\n\nFacebook Twitter Linkedin EMail",
    "Title": "Differential pricing of jabs won’t impact citizens: Centre"
  },
  {
    "Date": "Mon, 10 May 2021 10:50:48 +0530",
    "Description": "In a 218-page affidavit, the Centre says it wants the judiciary to keep its hands off the management of the pandemic and its ‘waves/surges’",
    "Image": "https://th.thgim.com/news/national/qapege/article34524545.ece/ALTERNATES/FREE_960/DELHI-COVID-DWARKA",
    "Link": "https://www.thehindu.com/news/national/news-analysis-supreme-court-has-only-acted-on-centres-suggestions-and-in-consultation-with-it-on-covid-19-crisis/article34524546.ece",
    "Text": "In a 218-page affidavit, the Centre says it wants the judiciary to keep its hands off the management of the pandemic and its ‘waves/surges’\n\nThe Centre wants the judiciary to keep its hands off the management of the COVID-19 crisis and its “waves/surges”.\n\nThe latest 218-page affidavit filed by the Centre in the Supreme Court on May 9 informs the judiciary in no uncertain terms that “though it [Centre] is duty-bound to fully assist this Honourable Court... the policy, strategy and steps taken by the Executive, based on expert medical and scientific advice, have to be appreciated in the context of the medical crisis”. It said decisions were taken after “detailed deliberations at the highest Executive level”. Hence, no “interference” is called for in judicial proceedings.\n\nSupreme Court forms National Task Force for transparent oxygen allocation\n\nIn other words, the Centre has asked the courts — Supreme Court and the High Courts — to “leave it open” for the government to discharge its functions in “larger interests”.\n\nHowever, an examination of the Supreme Court orders from April 30 to May 6 show the court has only acted on the suggestions of the Centre and in consultation with the Centre, right from re-visiting the government’s “rough-and ready” formula of “oxygen-for-bed” to the formation of a National Task Force.\n\n‘Won’t remain mute spectator’\n\nThe attitude of the judiciary can be clearly understood from the words of Justice D.Y. Chandrachud to the Centre. He made a point to say that courts refused to remain a “mute spectator” to a national calamity, but it is “together” with the Centre to “help the Centre” ease the pain of the people.\n\nA look at the Supreme Court orders show the Centre initially shifted the blame on the States for their lack of oxygen-lifting prowess and for making “unrealistic” demands for oxygen. All the while, the Centre had claimed that it had “no dearth of oxygen”.\n\nIn this regard, the court records in its April 30 order that “the Solicitor General has stated that there is no dearth of oxygen supply in the country as on date and steps are being taken continuously to augment the supply of oxygen.... Having said that, the Solicitor General has also admitted that there has been a shortage of supply to certain States and has attributed this shortage to various factors including the failure of State governments to lift the allocated quantity of oxygen from the supply point; transportation bottlenecks caused by inter-State movement of tankers; and technical failure of certain plants leading to reassessment of allocation on a real-time basis”.\n\nNews Analysis | A paradigm shift in Supreme Court after Justice N.V. Ramana takes over as CJI\n\nThe hearings in the Supreme Court had also seen the Centre express its annoyance at the “judicial interference”. When the Supreme Court had termed the Karnataka High Court’s direction to the Centre on May 5 to allocate 1200 MT to the State, an exasperated Centre had reacted by offering to hand over its oxygen stock to the High Courts for distribution.\n\nHowever, by May 6, the Centre had toned down to admit in court that its “oxygen-for-bed” formula needed a “re-visit” and there was an urgent requirement to form a national task force to devise an equitable way of allocation of oxygen.\n\nIn fact, the court, in its order on May 6, recounted the Centre’s submission that “the formula on the basis of which oxygen is being allocated to the States and UTs is not static but needs to be re-visited”.\n\nOn the formation of the National Task Force, the Centre had found such a move necessary “to ensure that the allocation and distribution of oxygen takes place on a rational and equitable basis”.\n\n“It is necessary to constitute a National Task Force of experts which would determine the method of allocation and distribution of oxygen across States/UTs. Smaller expert committees or sub-groups may look into issues of auditing the manner in which supplies are to be distributed and utilised in each State/UT,” the Supreme Court had recorded the Centre’s submission. The Centre had wanted an “audit” of the distribution network.\n\nThe Supreme Court had thus merely ordered what the Centre itself wanted.",
    "Title": "News Analysis | Supreme Court has only acted on Centre’s suggestions and in consultation with it on COVID-19 crisis"
  },
  {
    "Date": "Mon, 10 May 2021 10:42:49 +0530",
    "Description": "MDMK general secretary Vaiko on Monday urged Chief Minister M.K. Stalin to release the seven life convicts in the former Prime Minister Rajiv Gandhi",
    "Image": "https://th.thgim.com/news/national/k9l89p/article33159387.ece/ALTERNATES/FREE_960/PERARIVALAN",
    "Link": "https://www.thehindu.com/news/national/tamil-nadu/vaiko-demands-release-of-7-rajiv-assassination-case-convicts/article34524496.ece",
    "Text": "MDMK general secretary Vaiko on Monday urged Chief Minister M.K. Stalin to release the seven life convicts in the former Prime Minister Rajiv Gandhi assassination case.\n\nIn a statement here, he said even though Chief Justice of Supreme Court had said that the state government could release them, and the state government had sent its recommendation, the Governor had thrown the request in the dustbin.\n\nContending that there was no need to seek the opinion of the Centre in the matter, he alleged that so far, a drama was enacted on the pretext of getting the Centre’s permission.\n\n“Since the DMK is also demanding their release, Chief Minister Stalin should order their release,” he said.",
    "Title": "Vaiko demands release of 7 Rajiv assassination case convicts"
  },
  {
    "Date": "Mon, 10 May 2021 10:48:40 +0530",
    "Description": "This is the second time this year that rates in some parts have crossed the ₹100-a litre mark",
    "Image": "https://th.thgim.com/business/Economy/u9tom5/article34323937.ece/ALTERNATES/FREE_960/petrol-thmni",
    "Link": "https://www.thehindu.com/business/petrol-diesel-prices-at-record-highs-crosses-100-mark-in-maharashtra/article34524524.ece",
    "Text": "This is the second time this year that rates in some parts have crossed the ₹100-a litre mark\n\nPetrol and diesel prices on Monday hit record highs across the country after rates were increased for the fifth time in a week, following which Maharashtra joined Rajasthan and Madhya Pradesh in the league of states where petrol rates breached the ₹100-a-litre mark.\n\nPetrol price was hiked by 26 paise a litre and diesel by 33 paise per litre, according to a price notification by state-owned fuel retailers.\n\nThis was the fifth increase in prices since May 4, when the state-owned oil firms ended an 18-hiatus in rate revision during assembly elections in states like West Bengal.\n\nThe increase took petrol and diesel prices to their highest-ever level. In Delhi, petrol now comes for ₹91.53 per litre and diesel is priced at ₹82.06 per litre.\n\nWhile petrol prices had crossed the ₹100-mark in some places in Rajasthan and Madhya Pradesh a few days back, Maharashtra's Parbhani joined the league on Monday. Petrol in Parbhani was priced at ₹100.20 a litre, while in Bhopal it came for₹ 99.55 a litre.\n\nThe fuel is sold at ₹102.42 a litre in Sri Ganganagar district of Rajasthan and at ₹ 102.12 in Anuppur of Madhya Pradesh.\n\nThis is the second time this year that rates in some parts have crossed the ₹100-a litre mark. Rates had breached the physiological mark for the first time in mid-February.\n\nFuel prices differ from state to state depending on the incidence of local taxes such as VAT and freight charges. Rajasthan levies the highest value-added tax (VAT) on petrol in the country, followed by Madhya Pradesh.\n\nIn five increases in the last one week, petrol price has risen by ₹1.14 per litre and diesel by ₹1.33 — more than neutralising all of the reduction that came between March 24 and April 15.\n\nAfter raising petrol price by a record ₹21.58 per litre and diesel by ₹19.18 since the government raised excise duty to an all-time high in March last year, state-owned fuel retailers, IOC, BPCL and HPCL had reduced petrol price by 67 paise a litre and diesel by 74 paise per litre effected between March 24 and April 15.\n\nOil companies, who have in recent months resorted to unexplained freeze in rate revision, had hit a pause button after cutting prices marginally on April 15. This coincided with electioneering hitting peak to elect new governments in five states including West Bengal.\n\nNo sooner had voting ended, oil companies indicated an impending increase in retail prices in view of firming trends in international oil markets.\n\nThey said prices have been on a continuous uptrend since April 27, crude oil price is hovering near USD 70-per-barrel mark.\n\nCentral and state taxes make up for 60 per cent of the retail selling price of petrol and over 54 per cent of diesel. The union government levies ₹32.90 per litre of excise duty on petrol and ₹31.80 on diesel.\n\nIn Mumbai, the petrol price was hiked to ₹97.86 a litre on Monday from ₹97.61, while diesel rates were increased to Rs 89.17 from R₹88.82, the price notification showed.",
    "Title": "Petrol, diesel prices at record highs; crosses ₹100-mark in Maharashtra"
  },
  {
    "Date": "Mon, 10 May 2021 10:23:29 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/india/had-govt-done-its-job-it-would-not-have-come-to-this-rahul-gandhi-on-foreign-aid/articleshow/82514944.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82514944.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>",
    "Image": "https://static.toiimg.com/thumb/msid-82514928,width-1070,height-580,imgsize-69676,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/india/had-govt-done-its-job-it-would-not-have-come-to-this-rahul-gandhi-on-foreign-aid/articleshow/82514944.cms",
    "Text": "विदेशी सहारा पाने पर केंद्र सरकार का बार-बार छाती ठोकना निराशाजनक है।अगर मोदी सरकार ने अपना काम किया होता, तो ये नौबत ना आती। — Rahul Gandhi (@RahulGandhi) 1620621420000\n\nNEW DELHI: Hitting out at the Centre, Congress leader Rahul Gandhi on Monday said the government's \"repeated chest-thumping\" at receiving foreign aid to tackle the Covid-19 crisis in the country is pathetic and had it done its job, it would not have come to this.The Congress had last week demanded transparency and urged Prime Minister Narendra Modi to make public the details of all the relief material received by India from different countries.\"GOI's repeated chest-thumping at receiving foreign aid is pathetic. Had GOI done its job, it wouldn't have come to this,\" Gandhi said in a tweet.As India reels under a calamitous second wave of the coronavirus infection, it has received large amounts of medical supplies from a significant number of countries, including the US, Russia, France, Germany, the UK, Ireland, Belgium, Romania, Singapore, Sweden and Kuwait.",
    "Title": "Had govt done its job, it would not have come to this: Rahul Gandhi on foreign aid"
  },
  {
    "Date": "Mon, 10 May 2021 10:31:55 +0530",
    "Description": "The Congress had last week demanded transparency and urged Prime Minister Narendra Modi to make public the details of all the relief material received by India from different countries",
    "Image": "https://th.thgim.com/news/national/uuy38/article34524449.ece/ALTERNATES/FREE_960/image-9",
    "Link": "https://www.thehindu.com/news/national/coronavirus-had-govt-done-its-job-it-would-not-have-come-to-this-rahul-gandhi-on-foreign-aid/article34524450.ece",
    "Text": "The Congress had last week demanded transparency and urged Prime Minister Narendra Modi to make public the details of all the relief material received by India from different countries\n\nHitting out at the Centre, Congress leader Rahul Gandhi on Monday said the government's \"repeated chest-thumping\" at receiving foreign aid to tackle the COVID-19 crisis in the country is pathetic and had it done its job, it would not have come to this.\n\nThe Congress had last week demanded transparency and urged Prime Minister Narendra Modi to make public the details of all the relief material received by India from different countries.\n\n\"GOI's repeated chest-thumping at receiving foreign aid is pathetic. Had GOI done its job, it wouldn't have come to this,\" Mr. Gandhi said in a tweet.\n\nAs India reels under a calamitous second wave of the coronavirus infection, it has received large amounts of medical supplies from a significant number of countries, including the US, Russia, France, Germany, the UK, Ireland, Belgium, Romania, Singapore, Sweden and Kuwait.",
    "Title": "Coronavirus | Had govt. done its job, it would not have come to this: Rahul Gandhi on foreign aid"
  },
  {
    "Date": "Mon, 10 May 2021 10:07:58 +0530",
    "Description": "The train is expected to reach Whitefield in Bengaluru on May 11.",
    "Image": "https://th.thgim.com/news/national/karnataka/df648c/article34524336.ece/ALTERNATES/FREE_960/oxygenexpress",
    "Link": "https://www.thehindu.com/news/national/karnataka/first-oxygen-express-train-to-karnataka-leaves-jamshedpur/article34524337.ece",
    "Text": "The train is expected to reach Whitefield in Bengaluru on May 11.\n\nThe first oxygen express train to Karnataka has left from Jamshedpur in Jharkhand. The train, carrying 120 tonnes of liquid oxygen, will reach the Container Corporation India in Whitefield, Bengaluru on Tuesday.\n\nChief PRO of South Western Railway (SWR) Aneesh Hegde told The Hindu that the first express train is carrying six cryogenic containers, each loaded with 20 tonnes of liquid oxygen. The train left at 3.30 a.m. on May 10 from Jamshedpur.\n\n“Based the request from the State government, the Railways is running the oxygen express train. The distance between originating station and the city is approximately around 1860 kms. A green corridor has already been created for the train. The train will reach Whitefield on Tuesday,” the official said.\n\nTo facilitate movement of tankers, the SWR had built a ramp in Whitefield. If required, the officials will also use facilities at Doddaballapur for transportation of oxygen tankers in future.\n\nIn the first week of May, Chief Secretary of the State P. Ravi Kumar had written a letter to the Railway Board requesting operations of oxygen express to mitigate shortage of liquid oxygen in the State.",
    "Title": "First oxygen express train to Karnataka leaves Jamshedpur"
  },
  {
    "Date": "Mon, 10 May 2021 10:12:07 +0530",
    "Description": "Delhi, Kolkata, Mumbai, Ahmedabad, Bengaluru, Hyderabad, Chennai, Kochi and Thiruvananthapuram are the designated cities for the initiative taken by Emirates’ to support India in its fight to control the second wave of the pandemic.",
    "Image": "https://th.thgim.com/news/national/gsxhdd/article34524348.ece/ALTERNATES/FREE_960/Airbridgejpg",
    "Link": "https://www.thehindu.com/news/national/covid-19-surge-air-bridge-between-dubai-nine-indian-cities-to-transport-urgent-relief-items-ready/article34524343.ece",
    "Text": "Delhi, Kolkata, Mumbai, Ahmedabad, Bengaluru, Hyderabad, Chennai, Kochi and Thiruvananthapuram are the designated cities for the initiative taken by Emirates’ to support India in its fight to control the second wave of the pandemic.\n\nIndia humanitarian air bridge is in place between Dubai and nine major cities in the country to transport urgent COVID-19 medical and relief items.\n\nAlso read: Explained | What is being done to bridge medical oxygen demand and supply?\n\nDelhi, Kolkata, Mumbai, Ahmedabad, Bengaluru, Hyderabad, Chennai, Kochi and Thiruvananthapuram are the designated cities for the initiative taken by Emirates’ to support India in its fight to control the second wave of the pandemic.\n\nThe first shipment under the initiative, a consignment of over 12 tonnes of multi-purpose tents from the World Health Organisation (WHO), has reached Delhi.\n\nEmirates has offered cargo capacity free of charge to NGOs to ship relief items on all its flights from Dubai to nine cities where it is operating flights. Emirates SkyCargo has been transporting medicines and medical equipment on scheduled and charter cargo flights.\n\nSheikh Ahmed bin Saeed Al Maktoum, Emirates’ Chairman and Chief Executive, has said regular and reliable wide-body capacity aircraft in the fleet would be used for rushing relief materials. International Humanitarian City in Dubai, the largest crisis relief hub in the world, will facilitate movement of urgent medical supplies.\n\nThe freight division of Emirates has a close partnership with IHC, developed over several years of delivering relief materials to communities across the world impacted by natural disasters and other crises.\n\nFor Kerala, the airbridge will come in handy as the State government has already made arrangements for the import of relief products related to COVID-19 following the tax exemption granted by the Centre.\n\nKerala Medical Services Corporation Limited has been designated by the government to receive COVID-19 relief products from the foreign donors on behalf of the State government. NoRKA Roots, the field agency of the Department of Non-Resident Keralites, will procure the relief products.",
    "Title": "COVID-19 surge: Air bridge between Dubai, nine Indian cities to transport urgent relief items ready"
  },
  {
    "Date": "Mon, 10 May 2021 10:16:31 +0530",
    "Description": "Mr. Prasad, who recently walked out of a jail in Ranchi",
    "Image": "https://th.thgim.com/news/national/other-states/ja8zdh/article34524400.ece/ALTERNATES/FREE_460/image-7",
    "Link": "https://www.thehindu.com/news/national/other-states/out-of-jail-lalu-prasad-holds-first-virtual-interaction-with-party-workers/article34524401.ece",
    "Text": "Mr. Prasad, who recently walked out of a jail in Ranchi\n\nRashtriya Janata Dal founding president Lalu Prasad, who is out on bail after spending more than three years behind bars, on Sunday held a much-awaited \"virtual interaction\" with workers of his party back home in Bihar.\n\nMr. Prasad, who recently walked out of a jail in Ranchi after the Jharkhand High Court granted him bails in all the fodder scam cases wherein he has been awarded punishments, spoke from New Delhi.\n\nThe septuagenarian, who suffers from multiple ailments including diabetes, cardiac and renal problems, has been convalescing at his residence in the national capital upon release.\n\nHis younger son and heir apparent Tejashwi Yadav, who is at their Delhi home to look after the ailing father, also spoke on the occasion. Mr. Yadav, who delivered the introductory speech, said that his father was \"unwell, his oxygen levels hovering around 85, a reason why Lalu ji will not speak much\".\n\nIt was not clear whether Mr. Prasad's oxygen levels were down because of some other problem or he had been infected by COVID-19.\n\nNonetheless, a wave of dejection swept over the party rank and file who were eagerly looking forward to hearing from their leader, famous for his flamboyant wisecracks and earthy sense of humour.\n\nMr. Prasad told the listeners party MLAs and those who had contested the assembly elections on RJD tickets but lost to rise to the occasion when the pandemic \"has reached our farthest villages\".\n\nThe listeners, who had been instructed to attend the \"virtual interaction\" from their respective constituencies via video conferencing, were asked to set up \"RJD COVID care centres\" in their areas of influence.\n\nThey were also urged to \"expose and thwart\" any instances of black marketing of oxygen cylinders and other important medicines, and help needy patients with food and other logistics like ambulances.\n\nMr. Prasad's maverick elder son Tej Pratap Yadav, who dotes on his father but has been overshadowed by his suave and shrewd younger sibling, also spoke on the occasion.\n\nHe proposed that in all the 243 assembly segments of the state, the party should run \"Lalu Rasoi\" (Lalu community kitchens) where food would be prepared and distributed free of cost.\n\nThe proposal, predictably met with applause, though it was not yet clear whether it was going to lead to fruition.\n\nMr. Prasad, who was the Chief Minister of undivided Bihar for seven straight years, first got convicted in a fodder scam case in 2013, which led to his disqualification from contesting elections.\n\nHe was, however, soon out on jail and took part in the 2014 Lok Sabha polls in which his party came out with an unimpressive performance in the face of the \"Modi wave\".\n\nA year later, though, he emerged as the star attraction in the assembly polls which his party fought in alliance with arch rival and Chief Minister Nitish Kumar's JD(U).\n\nThough out of race himself, Mr. Prasad ensured through his electrifying campaign a spectacular comeback for the RJD that had been drubbed by the NDA in the 2010 Assembly polls, and both his sons made successful debuts, with Tejashwi becoming the deputy CM and Tej Pratap getting a cabinet berth.\n\nAlthough out of power now, the RJD once again emerged as the single largest party in the assembly elections held last year, which also saw the 32-year-old Tejashwi steering the party to an impressive performance despite the absence of his charismatic father.",
    "Title": "Out of jail, Lalu Prasad holds first 'virtual' interaction with party workers"
  },
  {
    "Date": "Mon, 10 May 2021 10:54:33 +0530",
    "Description": "The Tamil Nadu government had announced a complete lockdown in the State between 4 a.m. on May 10 and 4 a.m on May 24 to combat the spread of COVID-19.",
    "Image": "https://th.thgim.com/elections/tamil-nadu-assembly/qtw2ac/article34524174.ece/ALTERNATES/FREE_960/TN-police2jpg",
    "Link": "https://www.thehindu.com/news/national/coronavirus-live-updates-may-10-2021/article34524165.ece",
    "Text": "Experts have warned that recurring waves of coronavirus infections are inevitable if existing practices such as expanding India's vaccination drive and following COVID protocol are not adhered to.\n\nUnlike in January and February when the limited vaccine rollout was yet to accelerate, there is currently a shortage in vaccine supply, with less than 2 million doses being administered a day, and supplies of both Covishield and Covaxin unlikely to significantly pick up before July.\n\nYou can track coronavirus cases, deaths and testing rates at the national and State levels here. A list of State Helpline numbers is available as well.\n\nHere are the latest updates:\n\nNew Delhi\n\nMore than a crore vaccines still available with States: Health Ministry\n\nMore than one crore COVID vaccine doses (1,04,30,063) are still available with the States/UTs to be administered, said the Union Health Ministry in a release issued on Monday.\n\nIt added that States with negative balance are showing more consumption (including wastage) than vaccine supplied as they have not reconciled the vaccine they have supplied to Armed Forces.\n\nThe Ministry said that more than 9 lakh (9,24,910) vaccine doses will be received in addition by the States/UTs within the next 3 days.\n\nCentral government has said that it has so far provided nearly 18 crore vaccine doses (17,93,57,860) to States/UTs free of cost. “Of this, the total consumption including wastages is 16,89,27,797doses (as per data available at 8 am today),” noted the Ministry. - Bindu Shajan Perappadan\n\nUttarakhand\n\nStricter COVID curfew in Uttarakhand from May 11-18\n\nIn a bid to check the coronavirus spread, the Uttarakhand government imposed a stricter curfew from May 11 to 18, reducing opening hours for shops dealing in essential services and restricting the number of people at social gatherings to 20.\n\nShops selling essential items like milk, vegetables, fruits and meat will be allowed to open from 7 am to 10 am daily. Till now, these shops opened from 7 am to 12 am daily.\n\nGrocery shops will be permitted to open on May 13 only. Mediapersons will have the permission to move around during the curfew if they have their IDs with them.\n\nPeople coming from outside the state will have to bring a negative RT-PCR report, not older than 72 hours.\n\nDepartments providing essential services will open with attendance of only 50 per cent of their staff during the period.\n\nPeople have been advised to defer marriages if they can. Not more than 20 persons will be allowed to gather for marriages or funerals during the period.\n\nIndia records 3,66,161 fresh cases, 3,754 more fatalities\n\nAfter recording over four lakh fresh cases for four consecutive days, India witnessed a single-day rise of 3,66,161 COVID-19 cases on Monday, which pushed its tally to 2,26,62,575, according to the health ministry.\n\nThe death toll due to the viral disease climbed to 2,46,116 with 3,754 more people succumbing to it, the ministry's data updated at 8 am showed.\n\nThe number of active cases of the coronavirus infection in the country has gone up to 37,45,237, accounting for 16.53 per cent of its total caseload, while the national COVID-19 recovery rate was recorded at 82.39 per cent.\n\nThe number of people who have recuperated from the disease has climbed to 1,86,71,222, while the case fatality rate was recorded at 1.09 per cent, according to the data.\n\nDubai\n\nAir bridge between Dubai, nine Indian cities to transport urgent relief items ready\n\nIndia humanitarian air bridge is in place between Dubai and nine major cities in the country to transport urgent COVID-19 medical and relief items.\n\nAlso read: Explained | What is being done to bridge medical oxygen demand and supply?\n\nDelhi, Kolkata, Mumbai, Ahmedabad, Bengaluru, Hyderabad, Chennai, Kochi and Thiruvananthapuram are the designated cities for the initiative taken by Emirates’ to support India in its fight to control the second wave of the pandemic.\n\nKarnataka\n\nFirst oxygen express train to Karnataka leaves Jamshedpur\n\nThe first oxygen express train to Karnataka has left from Jamshedpur in Jharkhand on Monday. The train carrying 120 tonnes of liquid oxygen will reach the Container Corporation India, Whitefield in the city, on Tuesday, May 11, 2021.\n\nChief PRO of South Western Railway (SWR) Mr Aneesh Hegde told The Hindu that the first express train is carrying six cryogenic containers (each loaded with 20 tonnes of liquid oxygen) left at 3.30 a.m from Jamshedpur. — Suchith Kidiyoor\n\nTamil Nadu\n\n35 flyovers closed in Chennai\n\nWith the total lockdown coming into force on Monday, May 10, 2021, the Chennai City traffic police have closed more than 35 flyovers in the city prohibiting the vehicle traffic movement. More than 10,000 police personnel will be deployed in the city and over 200 check points set up to enforce the complete lockdown in the city. People travelling for weddings of close relatives, funerals, job interviews and hospitals would be allowed on production of relevant documents.\n\nNational\n\nArmy to recruit 400 retired medical officers\n\nThe Defence Ministry has issued an order to the Directorate General Armed Forces Medical Services (DGAFMS) for the recruitment of 400 retired medical officers of the Army Medical Corps (AMC) and the Short Service Commission (SSC), amid the second wave of the COVID-19 pandemic.\n\nMedical officer released between 2017 and 2021 are expected to be recruited on a contract basis for a maximum period of 11 months, a Ministry statement said.\n\nKerala\n\nPolice crack down on inessential travel\n\nThe Kerala police actively dissuaded inessential travel on the second day of the COVID-19 lockdown on Sunday.\n\nOfficers flagged down vehicles and challenged passengers to state their reason for travel. The clampdown will continue till May 16. The police allowed people with appointments at hospitals and COVID-19 vaccination centres.\n\nKarnataka\n\nBJP MP Tejasvi Surya launches ‘Oxy Bank’\n\nTejasvi Surya, MP for Bengaluru South, has launched a bank of oxygen concentrators to aid in the treatment of COVID-19 patients in the city. Presently, the bank, MP Oxy Bank, has 250 oxygen concentrator units and will be soon expanded to 650 units, Mr. Surya said.\n\nMaharashstra\n\nAge no bar in Latur couple’s triumph over COVID-19\n\nThe third week of March proved to be Suresh Chavan’s summer of disquiet: five members of his family including his wife and two children had tested positive for COVID-19. But he was especially disconcerted when his centenarian father Dhenu Chavan and his nonagenarian mother, Motabai contracted the virus and were suffering from high fever.\n\nAs the lethal second wave of the pandemic began engulfing rural Maharashtra, many in the village of Katgaon Krishna Tanda (around 18 km from Latur city) feared the end was near for their beloved and venerated residents — 105-year-old Dhenu and 95-year-old Motabai.\n\n(With inputs from our Correspondents and agencies)",
    "Title": "Coronavirus live updates | 'Defer marriage if you can': Uttarakhand tightens curfew amid rising cases"
  },
  {
    "Date": "Mon, 10 May 2021 00:28:26 +0530",
    "Description": "The recovery of 105-year-old Dhenu Chavan and his 95-year-old wife Motabai has become a ray of hope in ravaged Marathwada.",
    "Image": "https://th.thgim.com/news/cities/mumbai/v1rv81/article34523078.ece/ALTERNATES/FREE_960/IMG-20210509-WA0063",
    "Link": "https://www.thehindu.com/news/cities/mumbai/age-no-bar-in-a-latur-couples-triumph-over-covid-19/article34523079.ece",
    "Text": "The recovery of 105-year-old Dhenu Chavan and his 95-year-old wife Motabai has become a ray of hope in ravaged Marathwada.\n\nThe third week of March proved to be Suresh Chavan’s summer of disquiet: five members of his family including his wife and two children had tested positive for COVID-19. But he was especially disconcerted when his centenarian father Dhenu Chavan and his nonagenarian mother, Motabai contracted the virus and were suffering from high fever.\n\nAs the lethal second wave of the pandemic began engulfing rural Maharashtra, many in the village of Katgaon Krishna Tanda (around 18 km from Latur city) feared the end was near for their beloved and venerated residents — 105-year-old Dhenu and 95-year-old Motabai.\n\n“Several villagers advised me against taking them to a hospital. They kept saying no one returned once they went inside one… My 75-year-old elder brother was especially anxious. He was disturbed about not being able to perform our parents’ last rites in the event of their passing away in the hospital… ‘What if the authorities did not give the bodies back?’ he kept saying,” recalls Mr. Chavan,51, the youngest of eight siblings.\n\nSuresh Chavan, however, decided to take his parents to the civil hospital and accordingly admitted them to Latur’s Vilasrao Deshmukh Government Institute of Medical Science.\n\nWhat happened over the next eight days has become the stuff of legend not only in Latur, but across much of Marathwada and neighbouring States as well.\n\n“Being ardent warkaris (devotees making the annual pilgrimage to the shrine of Lord Vithoba in Pandharpur), my parents naturally had great faith in God… While I tried to maintain a calm exterior, in my heart of hearts, I feared for their lives. But it was the fruit of their good deeds and their ardent faith which saw them defeat the malignant force of this virus,” believes Mr. Chavan.\n\nWhether a strong immune system, good genes, or an unfashionable, yet unshakeable faith in divine providence, Dhenu Chavan and Motabai’s triumph over Covid-19 is a rare shining light amid much heartbreak and loss in Maharashtra, which is still witnessing an average of 300 deaths daily.\n\n“When they checked-in on March 24, both were in a critical condition…but their eventual triumph is truly inspirational and astounding,” says Dr. Sudhir Deshmukh, Dean of the Institute.\n\nDr. Gajanan Halkanche, who treated them, says early detection and diagnosis was key to the speedy recovery of the couple. Even then, he professes astonishment at their remarkably rapid recovery.\n\n“Given their respective ages, they had an alarming CT (computed tomography) score of 15/25. Both were administered the full course of Remdesivir for five days and were given high-flow oxygen (HFO). They began responding well to treatment after just two days. Ultimately, their immune systems were very strong and could cope with this kind of treatment. A lifelong regimen of hard-work and good habits held them in good stead,” said Dr. Halkanche, speaking to The Hindu.\n\nDhenu Chavan has been working the fields for more than 65 years. According to Suresh Chavan, his father, a large-hearted man fundamentally generous by disposition, is affectionately known as ‘Naik’ in villages and taluks beyond Katgaon Tanda and Latur district.\n\nTo say Dhenu Chavan’s long, rich life has been eventful would be an understatement.\n\n“Both my parents have witnessed cataclysmic natural events besides having been in the thick of historical and political upheavals. So, when they contracted COVID-19, their first reaction was that of insouciance…they said they had seen off so many epidemics, earthquakes and pandemics, one more would scarcely make any difference,” recalled Mr. Chavan.\n\nA child of two when the Spanish Flu exploded in India (known as Bombay Fever in Maharashtra), Dhenu Chavan has since witnessed the turmoil of Independence, the 1993 Latur earthquake, the subsequent plague of 1994, and the 2009 Swine Flu pandemic among other upheavals.\n\n“All their lives, my parents have believed in doing good for others. They urge the younger generation not to behave deceitfully towards anybody, but to help, be honest and develop a strong character. My father gave away portions of his big landholdings to tenants, donated land for public works. They ascribe their feat of beating the dreaded virus to the blessings and affection of the many people they have helped in the course of their lives. So much so, since the news broke, I have getting calls from people from districts all over Maharashtra and even from villages in Karnataka and Andhra Pradesh,” said Mr. Chavan.\n\nHe feels proud that his parents’ triumph has sparked hope across Marathwada as well as the rural hinterland of Maharashtra, where people are now approaching the fight against the pandemic in a more positive frame of mind.",
    "Title": "COVID-19 survivors’s tales | Age no bar in Latur couple’s triumph over COVID-19"
  },
  {
    "Date": "Mon, 10 May 2021 10:13:24 +0530",
    "Description": "Andhra Pradesh’s former Director General of Police Bayyarapu Prasada Rao died following a massive cardiac arrest in the United States of America in th",
    "Image": "https://th.thgim.com/news/national/telangana/idts0g/article34524340.ece/ALTERNATES/FREE_460/b-Prasada-raijpg",
    "Link": "https://www.thehindu.com/news/national/telangana/former-andhra-pradesh-dgp-bayyarapu-prasada-rao-passes-away/article34524334.ece",
    "Text": "Andhra Pradesh’s former Director General of Police Bayyarapu Prasada Rao died following a massive cardiac arrest in the United States of America in the wee hours of Monday.\n\nAn IPS officer of 1979 batch, Rao, complained of chest pain and wanted to be taken to a hospital, but by the time the ambulance reached a medical facility, he breathed his last around 1 a.m. (IST).\n\nIn November 2013, Rao took charge as the DGP (Head of the Police Force) after the retirement of V. Dinesh Reddy. On attaining superannuation he retired in May 2014.\n\nPrior to his appointment as DGP (HoPF), he served as the Director General of the Anti-Corruption Bureau and after the bifurcation of the State, he was deputed as Secretary (Internal Security) in the Ministry of Home Affairs.\n\nSon of a retired police officer, Rao hailed from Guntur district. He served in several key postings, including Superintendent of Police, Nizamabad, Karimnagar and Nalgonda districts, and Commissioner of Police Hyderabad, Cyberabad, Visakhapatnam.\n\nHe was also the Vice-Chairman and Managing Director of AP State Road Transport Corporation. While on central government deputation he was commandant of the Central Industrial Security Force at Visakhapatnam and Bhopal.\n\nRao also served as DIG of Eluru and Kurnool ranges, Additional DG (Law and Order) and Additional DG (Provisioning and Logistics).\n\nHe was awarded the Indian Police Medal for meritorious service in 1997 and the President's Police Medal for distinguished service in 2006.\n\nPost retirement he was working as the professor in Physics and Director (Training, Placements and Industry Interface) at Bharat Institutions, Hyderabad. A postgraduate (M.Sc.(Physics)) from Indian Institute of Technology - Madras, he authored a book ‘Word power to mind power', a unique method of learning and memorising English vocabulary applying visualisation and contextualisation. He was awarded PhD for his research on ‘Studies on the Wave-Particle Duality of Light’ by Sri Krishnadevaraya University in 2014.\n\nHe is survived by his wife Sowmini, son Vikas, daughter-in-law Soumya and a toddler grandson.",
    "Title": "Former Andhra Pradesh DGP Bayyarapu Prasada Rao passes away"
  },
  {
    "Date": "Mon, 10 May 2021 10:20:45 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/india/covid-19-india-records-3-66-lakh-new-cases-3700-deaths-in-24-hours/articleshow/82514671.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82514671.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>India's daily rise in coronavirus cases retreated from the 400,000 mark on Monday, while its daily rise in deaths also fell after two straight days of more than 4,000 fatalities. The health ministry reported 366,161 new Covid-19 infections and 3,754 more deaths. India's total caseload now stands at 22.66 million, with 246,116 deaths.",
    "Image": "https://static.toiimg.com/thumb/msid-82514773,width-1070,height-580,imgsize-1393858,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/india/covid-19-india-records-3-66-lakh-new-cases-3700-deaths-in-24-hours/articleshow/82514671.cms",
    "Text": "NEW DELHI: India's daily rise in coronavirus cases retreated from the 400,000 mark on Monday, while its daily rise in deaths also fell after two straight days of more than 4,000 fatalities.The health ministry reported 366,161 new Covid-19 infections and 3,754 more deaths. India's total caseload now stands at 22.66 million, with 246,116 deaths.Over the last week (May 3 to May 9) India reported more than 27,000 deaths and over 27.4 lakh new cases, its highest weekly Covid numbers to date.However, the growth of cases in this period, at 5 per cent, was also the lowest during the second wave, indicating that perhaps the second wave had reached, or was nearing its peak.Deaths grew at a faster pace of nearly 15 per cent, with the daily case fatality rate crossing 1 per cent for the first time in the second wave in the last three days.The weekly toll had crossed 25,000 for the first time as the country recorded 27,243 deaths during May 3-9, up from 23,781 reported in the previous week.",
    "Title": "Covid-19: India records 3.66 lakh new cases, 3,700 deaths in 24 hours"
  },
  {
    "Date": "Mon, 10 May 2021 08:05:35 +0530",
    "Description": "A select list of stories to read before you start your day.",
    "Image": "https://th.thgim.com/news/national/i9wv66/article34521331.ece/ALTERNATES/FREE_960/Gangwar",
    "Link": "https://www.thehindu.com/news/national/morning-digest-10-may-2021/article34523881.ece",
    "Text": "A select list of stories to read before you start your day.\n\nMinister of State with independent charge in the Ministry of Labour and Employment Santosh Kumar Gangwar flagged concerns over the COVID-19 response in Uttar Pradesh in a letter to Chief Minister Yogi Adityanath on May 8. Mr. Gangwar complained about officers not answering phone calls and patients being forced to visit multiple facilities before being admitted to a hospital.\n\nThe Environment Appraisal Committee (EAC) - Infrastructure I of the Ministry of Environment, Forest and Climate Change (MoEFCC) has flagged serious concerns about NITI Aayog’s ambitious project for Great Nicobar Island (‘NITI Aayog vision for Great Nicobar ignores tribal, ecological concerns’, The Hindu, March 21, 2021). The committee has, however, removed the first hurdle faced by the project. It has “recommended” it “for grant of terms of reference (TOR)” for Environmental Impact Assessment (EIA) studies, which in the first instance will include baseline studies over three months.\n\nSome hospitals in Uttar Pradesh are consuming oxygen several times higher than the average, the State government said on Sunday based on the preliminary report of an oxygen audit conducted by it.\n\nFinance Minister Nirmala Sitharaman on May 9 said GST exemption to domestic supplies and commercial import of COVID-19 drugs, vaccines and oxygen concentrators would make these items costlier for consumers as manufacturers would not be able to offset the taxes paid on inputs.\n\nRecurring waves of coronavirus infections are inevitable if existing practices such as expanding India's vaccination drive and following COVID protocol are not adhered to, say experts. Earlier last week, Principal Scientific Advisor K. VijayRaghavan had said, “A phase three is inevitable, given the higher levels of circulating virus.”\n\nLeader of the Opposition in the Rajya Sabha Mallikarjun Kharge on Sunday wrote to Prime Minister Narendra Modi, asking him to immediately convene an all-party meeting to “collectively forge a holistic blueprint to tackle the COVID pandemic”.\n\nA first batch of oxygen concentrators and ventilators donated by the Red Cross Society of China arrived on Sunday on a cargo flight from China. The consignment marks among the biggest donations of medical supplies so far from China, from where India has been purchasing a huge amount of supplies, including oxygen concentrators.\n\nWest Bengal Governor Jagdeep Dhankhar on Sunday said he has accorded sanction to a Central investigating agency for “prosecuting Firhad Hakim, Subrata Mukherjee, Madan Mitra & Sovan Chatterjee as they were Ministers and he was their appointing authority.\n\nWest Bengal on Sunday registered a record 19,436 new cases of COVID-19 infections, while the number of samples tested for COVID-19 infections in the past 24 hours was 63,095. There has been a rise in the number of cases and deaths since the second wave of COVID-19 hit West Bengal, which has recently witnessed a high-pitched election.\n\nBCCI president says India has a hectic schedule and there are lots of organisational hazards like 14-day quarantine which is tough to handle.\n\nAlexander Zverev continued his impressive form going into the French Open by winning his second Madrid Open title on Sunday. After beating top-seeded Rafael Nadal in the quarterfinals and fourth-ranked Dominic Thiem in the semifinals, Zverev rallied to defeat Matteo Berrettini 6-7 (8), 6-4, 6-3 for his second title this season.",
    "Title": "Morning Digest | Union Labour Minister complains to U.P. CM on COVID-19 response, Green panel allows Great Nicobar plan to advance, and more"
  },
  {
    "Date": "Mon, 10 May 2021 07:41:15 +0530",
    "Description": "The American public health expert also stressed on the importance of a lockdown to break the chain of transmission.",
    "Image": "https://th.thgim.com/news/national/2m6fbr/article34522377.ece/ALTERNATES/FREE_960/09THAPFauci",
    "Link": "https://www.thehindu.com/news/national/vaccination-is-the-only-long-term-solution-to-covid-19-crisis-in-india-says-fauci/article34522378.ece",
    "Text": "The American public health expert also stressed on the importance of a lockdown to break the chain of transmission.\n\nGetting people vaccinated is the only long-term solution to the current COVID-19 crisis in India, America's top public health expert Dr. Anthony Fauci said on Sunday as he called for scaling up manufacturing of coronavirus vaccines both domestically and globally to fight the deadly pandemic.\n\n“The endgame of this all...is going to be to get people vaccinated...India is the largest vaccine-producing country in the world. They've got to get their resources, not only from within, but also from without,” Mr. Fauci, who is the Chief Medical Adviser to U.S. President Joe Biden, told ABC News in an interview.\n\n“That's the reason why other countries need to chip in to be able to get either supplies to the Indians to make their own vaccines or to get vaccines donated. One of the ways to do that is to have the big companies that have the capability of making vaccines to really scale up in a great way to get literally hundreds of millions of doses to be able to get to them,” he said.\n\nResponding to a question, Dr. Fauci said that India needs to immediately build makeshift field hospitals like what China did a year ago.\n\n“You've got to get that. You can't have people out in the street not having a hospital bed. The oxygen situation is something that was really critical. I mean, to have people not have oxygen is really tragic, what's going on over there,” he said.\n\nThe 80-year-old physician and immunologist, who serves as the director of the U.S. National Institute of Allergy and Infectious Diseases said there is an immediate problem of hospital beds, oxygen, PPE and other supplies.\n\nShut down to break the chain of transmission\n\n“Then there's the problem of looking forward to how are you going to shut this down, how are you going to turn it around, how are you going to break the chain of transmission?” he said, underlining the need for a countrywide lockdown to arrest the spread of the virus.\n\n“Vaccines is one of them but there are other ways too, like shutting down the government. I have advised them in the past that you really need to do that. You've got to shut down. I believe several of the Indian States have already done that, but you need to break the chain of transmission. And one of the ways to do that is to shut down,” the top American doctor said.\n\nMr. Fauci, in an exclusive interview to PTI last week, had termed the situation in India “very desperate” and suggested that the government marshal all its resources, including the armed forces, to immediately build makeshift field hospitals, and urged other countries to help with not only materials but also personnel.\n\nHe called for a nationwide lockdown, not necessarily for six months but “for a few weeks” to break the “continuity and transmission of infection.” He also recommended mass vaccination to arrest the current spread of the deadly disease across India.\n\nIndia is struggling with an unprecedented second wave of the COVID-19 pandemic with more than 4,00,000 daily new coronavirus cases being reported in the past few days.\n\nChina reported the first COVID-19 case in the central Chinese city of Wuhan in late 2019 and since then the deadly disease has become a pandemic, affecting more than 157,789,300 people and over 3,285,200 deaths worldwide.",
    "Title": "Vaccination is the only long-term solution to COVID-19 crisis in India, says Fauci"
  },
  {
    "Date": "Mon, 10 May 2021 07:23:37 +0530",
    "Description": "As the State prepared to go into a more stringent lockdown to arrest the soaring number of COVID-19 cases, it continued to report huge numbers in the",
    "Image": "https://th.thgim.com/news/cities/bangalore/gar7mt/article34405769.ece/ALTERNATES/FREE_960/Bengaluru-vaccinejpeg",
    "Link": "https://www.thehindu.com/news/national/karnataka/47930-new-cases-490-deaths-in-state/article34523272.ece",
    "Text": "As the State prepared to go into a more stringent lockdown to arrest the soaring number of COVID-19 cases, it continued to report huge numbers in the concluding days of the partial lockdown too.\n\nOn Sunday, as many as 47,930 new cases were reported (for Saturday, May 8), as the total number of cases in the State inched towards the 20 lakh mark, standing at 19.34 lakh. The overall number of active cases is now 5.64 lakh.\n\nFatalities too remained worrying – 490 new deaths were reported, taking the toll to 18,776. The case fatality rate for the day was 1.02%.\n\nBengaluru Urban, which reported 20,897 new cases, also saw 281 new deaths, taking the total number of fatalities in the city to 8,057.\n\nThe positivity rate too maintained its upward trend at 32.71%. The number of tests was 1.46 lakh. Among those who have tested positive so far, 86 have been for the U.K. strain, six for the South Africa strain, and 62 for the double mutant variant.\n\nAs many as 31,796 people were discharged, taking the total number of discharges to 13.51 lakh.",
    "Title": "Coronavirus | 47,930 new cases, 490 deaths in Karnataka"
  },
  {
    "Date": "Mon, 10 May 2021 00:31:58 +0530",
    "Description": "East Godavari registers highest single-day tally of 2,844 infections",
    "Image": "https://th.thgim.com/news/national/andhra-pradesh/9qqese/article34523105.ece/ALTERNATES/FREE_960/10vjpg1-convoy",
    "Link": "https://www.thehindu.com/news/national/andhra-pradesh/92-deaths-and-22164-new-cases-in-state/article34523106.ece",
    "Text": "East Godavari registers highest single-day tally of 2,844 infections\n\nThe State reported 92 COVID-19 deaths and 22,164 new infections in the 24 hours ending Sunday morning, taking the cumulative tally to 12,87,603 and the toll to 8,707.\n\nIn the last one week, the State reported 571 deaths and 1.23 lakh infections.\n\nThe number of recoveries reached 10,88,264 with 18,832 patients recovering in the last one day. The recovery rate remained at 84.52%.\n\nThe daily positivity rate again crossed 20% as 21.01% of the 1,05,494 samples tested turned positive. The overall positivity rate of the 1.73 crore samples tested so far was 7.41%.\n\nThree districts reported deaths in two digits – Guntur (12), Vizianagaram (11) and Visakhapatnam (10). They were followed by East Godavari (9), Anantapur (8), West Godavari (8), Nellore (7), Prakasam (6), Kurnool (6), Chittoor (5), Srikakulam (5) and Krishna (5). There were no fatalities in Kadapa.\n\nEast Godavari reported the highest single-day tally of 2,844 infections in 24 hours. It was followed by Visakhapatnam (2,206), Chittoor (2,169), Guntur (2,099), Anantapur (2,039), West Godavari (1,748), Nellore (1,574), Kurnool (1,568), Srikakulam (1,432), Kadapa (1,267), Krishna (1,240), Vizianagaram (998) and Prakasam (980).\n\nThe district-wise tallies were as follows: East Godavari (1,63,193), Chittoor (1,39,937), Guntur (1,20,522), West Godavari (1,10,388), Anantapur (98,777), Visakhapatnam (97,819), Nellore (92,897), Kurnool (92,698), Srikakulam (85,356), Prakasam (82,968), Kadapa (71,914), Krishna (69,958) and Vizianagaram (58,281).",
    "Title": "92 deaths and 22,164 new cases in State"
  },
  {
    "Date": "Mon, 10 May 2021 04:23:12 +0530",
    "Description": "Posts linking my son to the death malicious: BJP MP",
    "Image": "https://th.thgim.com/news/national/other-states/fqjrgf/article33703525.ece/ALTERNATES/FREE_960/up-police",
    "Link": "https://www.thehindu.com/news/national/other-states/up-police-begin-probe-into-death-of-thai-woman/article34523203.ece",
    "Text": "Posts linking my son to the death malicious: BJP MP\n\nThe Uttar Pradesh police on Sunday initiated a probe into the death of a Thai woman due to COVID-19 after several social media users, including the Opposition Samajwadi Party, linked a BJP Rajya Sabha MP’s son to her, claiming that she was a sex worker allegedly brought by him to Lucknow from Thailand for a huge sum of money.\n\nMP Sanjay Seth demanded a police investigation after the allegations and posts linking his son to the woman’s death surfaced. He termed the reports fake.\n\nLittle is, however, independently known about the woman.\n\nMr. Seth wrote to Lucknow Police Commissioner D.K Thakur seeking an investigation into the matter, the credentials, other details of the ‘deceased’ woman’s stay in Lucknow, her call details and admission to a hospital.\n\n“The contents of social media posts are concocted, fake and malicious, tarnishing social reputation of myself and my family,” Mr. Seth said on Sunday.\n\nFollowing Mr. Seth’s letter, the Lucknow police said they initiated a probe under a team led by the Deputy Commissioner of Police, East Lucknow. The concerned persons are being questioned, police said, adding that action would be taken on the basis of the probe.\n\nSP spokesperson I.P Singh had in a tweet alleged that Mr. Seth’s son had called a sex worker from Thailand and that she died in Lucknow due to COVID-19. He had asked the police to probe the case.\n\nAfter Mr. Seth’s clarification distancing his family from the alleged case, Mr. Singh issued a rebuttal and demanded a CBI probe. Issuing a statement, Mr. Singh demanded that the police reveal if the autopsy of the woman was conducted and what was the cause of her death. On whose behest was the woman brought to Lucknow, he asked.",
    "Title": "U.P. police begin probe into death of Thai woman"
  },
  {
    "Date": "Mon, 10 May 2021 08:16:58 +0530",
    "Description": "High-level probe committee asked to submit report in five days",
    "Image": "https://th.thgim.com/news/national/andhra-pradesh/xi0l5k/article34523054.ece/ALTERNATES/FREE_960/10vjpg4-bomb",
    "Link": "https://www.thehindu.com/news/national/andhra-pradesh/ex-gratia-announced-for-victims-of-quarry-explosion/article34523055.ece",
    "Text": "High-level probe committee asked to submit report in five days\n\nThe State government on Sunday ordered a high-level inquiry into the explosion at a limestone quarry at Mamillapalle village in Kadapa district on Saturday, in which 10 workers were killed.\n\nThe government also announced an ex gratia of ₹10 lakh each to the next of kin of the deceased and ₹5 lakh to each of the injured.\n\nIn a statement, Mines Minister Peddireddi Ramachandra Reddy said that the committee, comprising officials of five departments, was asked to submit its report in five days.\n\nOfficials under the supervision of the Director of Mines and Geology inspected the blast site, he said, and added that negligence of the quarry organisers led to the explosion.\n\n“They did not follow the procedures while unloading the explosives. Action will be taken against the leaseholder as per the provision of the MMD&R Act of 1957 and the A.P. Small Minerals Guidelines of 1966,” the Minister said.\n\nAmid the suspicion over the likely presence of the remnants of the explosives, or gelatin sticks and detonators, a bomb squad reached the spot to sterilised the entire area around the blast site.",
    "Title": "Ex gratia announced for victims of quarry explosion"
  },
  {
    "Date": "Mon, 10 May 2021 00:29:30 +0530",
    "Description": "Performances by artistes arranged at COIVD Care Centres win hearts",
    "Image": "https://th.thgim.com/news/national/andhra-pradesh/5q9mkj/article34523081.ece/ALTERNATES/FREE_960/10VJ4KURNOOLKALAJATHA",
    "Link": "https://www.thehindu.com/news/national/andhra-pradesh/kala-jathas-catering-to-emotional-well-being-of-patients/article34523082.ece",
    "Text": "Performances by artistes arranged at COIVD Care Centres win hearts\n\nMany psychoneuroimmunology experts believe that positive emotions can override the biological effects of adversity and improve the immunity to fight any kind of disease, and the experiment at the Kurnool APTIDCO COVID Care Centre (CCC) has given excellent results.\n\nDistrict Collector G. Veerapandian has come up with the idea of organising ‘kala jathas’ by engaging a group of PPE kit-clad artistes to cheer up the COVID-19 patients at the COVID Care Centres in the evenings.\n\nAnd the results are encouraging with one patient, after his discharge, writing a feedback in the social media about the positive impact of the initiative of the district administration.\n\n‘Kala jathas’ are organised at the CCCs at Adoni, Yemmiganur, and Nandyal as well.\n\nAs soon as the artistes arrive, all the patients gather to enjoy their performance. The artistes lace the songs with the mandatory awareness messages on COVID-19, the ways of protecting oneself, and what should be the diet after being discharged so that the nutrition requirements are taken care of.\n\nThe patient, identified as Sunny, has likened the COVID Care Centre to nothing less than a five-star hotel. He has even posted photographs of the games played, the hygienic conditions, and the performance of the ‘kala jatha’ artistes.\n\n“A regular visit by the doctors and their immediate response in case of necessity is being liked by many. The quality food being served three times a day has won the hearts of the patients,” he points out.\n\nThe District Collector has thanked the officers for taking care of the patients with dedication. The positive feedback on the social media platforms vouches for it, he opines.\n\nThe administration has kept aside ₹4.5 lakh for organising the ‘kala jathas’, and the artistes have been given advance.\n\nThe District Tourism Officer has been made in-charge of promoting these activities, which help the patients engage themselves in singing, playing games, an doing yoga or exercises.",
    "Title": "‘Kala jathas’ catering to emotional well-being of patients"
  },
  {
    "Date": "Mon, 10 May 2021 08:16:28 +0530",
    "Description": "Schools and playgrounds will be used as the venues for inoculation: Collector",
    "Image": "https://th.thgim.com/news/national/andhra-pradesh/lzx2m1/article34523027.ece/ALTERNATES/FREE_960/10VJ3COLLECTORVIZIANAGARAM",
    "Link": "https://www.thehindu.com/news/national/andhra-pradesh/vizianagaram-people-seeking-first-dose-of-vaccine-have-to-wait-till-june/article34523028.ece",
    "Text": "Schools and playgrounds will be used as the venues for inoculation: Collector\n\nCollector M. Hari Jawaharlal on Sunday made it clear that the people who want the first dose of vaccine for coronavirus would have to wait till June first week as the existing stock would be used for the people who had booked slots for the second dose.\n\nIn a release, he said that people who had booked slots for the first dose of vaccination would be cancelled automatically. “Facilities are being created at vaccination centres. The district administration will inform the people through phone calls or text messages for the second dose of vaccination that will be administered from 7 a.m. to 6 p.m. at the designated places,” said Mr. Hari Jawaharlal. In an attempt to ensure social distancing, the district administration has decided to use schools and playgounds as the venue for vaccination drive, the Collector said, adding that strict compliance with COVID-19 appropriate behaviour is must to check the spread of infection.\n\nMeanwhile, the number of active cases in the district has gone up to 8,195. The district reported 11 more deaths on Sunday, taking the total count to 337. The government is collecting data of the people those died while undergoing treatment in various COVID-19 facilities.\n\nControl room helpline\n\nThe officials have appealed to people to dial either 108 or 14410 to get quick healthcare services for COVID patients. A control room with the phone number 08922236947 has also been set up to answer the queries of patients and their relatives.",
    "Title": "‘Vizianagaram people seeking first dose of vaccine have to wait till June’"
  },
  {
    "Date": "Mon, 10 May 2021 01:59:48 +0530",
    "Description": "A few private hospitals have already started vaccinating people in the 18-44 age group",
    "Image": "https://th.thgim.com/news/national/karnataka/30mlrk/article34523258.ece/ALTERNATES/FREE_960/10bgvaccination2",
    "Link": "https://www.thehindu.com/news/national/karnataka/complaints-of-overcharging-by-some-hospitals-emerge/article34523259.ece",
    "Text": "A few private hospitals have already started vaccinating people in the 18-44 age group\n\nKarnataka was among the first States to announce free vaccination for citizens in the age group of 18 to 44 at government centres. But with its start getting delayed, some private hospitals went ahead and started inoculating those in this age group. However, a few days down the line, allegations are emerging of some of them charging above the price fixed by the government.\n\nSources in the office of Health and Medical Education Minister K. Sudhakar confirmed that the price fixed for private hospitals was ₹600 plus service charge of ₹100 for Covishield, and ₹1,200 plus service charge of ₹100 for Covaxin.\n\nHowever, when contacted, the administration of one of the hospitals said they were charging ₹1,350 for Covaxin. The official did not comment further. Those who got the jab or are planning to were irked by the prices being quoted. Giridhur Sriraman, 26, who got vaccinated a few days ago, said, “I paid ₹1,350 for Covaxin. I think it is steep. I was lucky to be able to afford it,” he said.\n\nAditya Ram, 29, is still searching for slots. “I was shocked to see the prices at private hospitals. A few hospitals are charging ₹850 for Covishield, others ₹1,350 and ₹1,500 for Covaxin. For two doses, people are going to end up paying too much. Initially, I paid ₹250 each for my parents to get vaccinated at a private hospital. For the second dose, I booked a slot at ESI hospital as the cost of the vaccines were ₹850,” he said, adding that he would prefer going to a government hospital now, though finding appointments may be difficult.\n\nThose who were trying to register after the State government’s announcement of vaccination for the age group at select government hospitals beginning on Monday, were left disappointed. “I live in Nagarabhavi and there are no government hospitals close by. No slots were showing in K.C. General, which is the next best option. When I checked private hospitals that are providing vaccination for my age group, there were no uniform rates even among the same hospital chain. For instance, one hospital was charging ₹1,350 for Covaxin. In another branch of the same chain, it was ₹1,000,” said Ganesh, 38.\n\nSmall hospitals\n\nSmaller hospitals also expressed difficulty in being able to afford procurement of the doses. A doctor, on condition of anonymity, said, “We are not even getting enough doses for the second dose of the 45 plus age group. One of the companies manufacturing the vaccine told us we need to buy minimum 5,000 doses at ₹1,200 per dose. How many small hospitals can afford this? Only the big hospitals will be able to.”",
    "Title": "Complaints of overcharging by some hospitals emerge"
  },
  {
    "Date": "Mon, 10 May 2021 08:49:04 IST",
    "Description": "",
    "Image": "https://static.toiimg.com/thumb/msid-47529300,width-1070,height-580,imgsize-110164,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/india/judge-suffers-covid-bite-for-not-practicing-what-he-preached/articleshow/82513671.cms",
    "Text": "NEW DELHI: Not practising what he preached to citizens through judicial orders extracted a heavy price from a high court Judge, who himself and family members got infected by a coronavirus.The turn of events concerns an Orissa high court Judge, who as part of a bench had last year passed several orders directing the authorities how to enforce lockdown to minimise movement of people and prevent the rapid spread of Covid disease in the state.In one of the orders, the bench had said, \"We expect and hope that the government in its appropriate department shall bring out composite planning on availability of such essential items locally thereby requiring no use of two-wheelers (by the public to go out for the purchase of essential items) at the earliest.\"A year down the line, he forgot what he had said in his judicial orders about maintenance of social distancing and embarked on a pilgrimage with his 90-year-old mother, wife, brother and his wife in April when the exponential surge in Covid cases had begun, HC sources told TOI.The first destination was Allahabad, where they submerged at Sangam the ashes of his father, who had died last year. From there they proceeded to Haridwar , to take a holy dip in the Ganga river during the Kumbh, where a sea of humanity participated and many blamed it as an event that fuelled the rapid spread of the Covid disease.From Haridwar, the Judge and his family members proceeded to Gaya for certain religious rituals and then reached Puri on April 15. On returning to Cuttack, all family members tested positive for Covid. They recovered but the Judge's old mother succumbed to the virus.Similarly, the Supreme Court decided to step in after faulting the Centre's oxygen allocation methodology during the second surge of Covid, when each affected state has been demanding a higher allocation. The Centre asserted that a daily oxygen supply of 500-600 MT to Delhi would be enough to meet the demand from hospitals and cited the management of a similar Covid caseload by Mumbai on April 10 with an oxygen supply of around 280MT. But, the SC asserted that Delhi should get 700 MT of O2.The SC also thought it fit to permit the judiciary, through high courts, to manage the pan-India oxygen allocation. It gave a free hand to the HCs to determine the quantity of O2 required by the state and direct the Centre to provide the same. The case in point is the Karnataka HC order asking the Centre to supply 1200 MT of oxygen as against an allocation of 900MT.In contrast, the SC has not been able to manage a small issue of providing seamless video-conferencing facilities for the advocates to argue before benches even though more than a year has passed since the SC started conducting its judicial business through video-conference.The glitch-ridden system played so truantly that once Justice Sanjay Kishan Kaul in a virtual hearing openly criticised the system and said if the Delhi HC could manage a better system why not the SC. But, the system remains unchanged. The advocates keep complaining about getting delinked abruptly. So much so that even the SC's E-Committee chairman Justice D Y Chandrachud got delinked once making an advocate to innocently comment - \"Justice Chandrachud has fallen off\". It created a mild panic but soon many realised that he had only \"fallen off\" the video link.",
    "Title": "Judge suffers Covid bite for not practicing what he preached"
  },
  {
    "Date": "Mon, 10 May 2021 08:17:07 +0530",
    "Description": "Collectors told to organise inoculation drives as per due date",
    "Image": "https://th.thgim.com/news/national/andhra-pradesh/h3pzw5/article34522996.ece/ALTERNATES/FREE_960/10VJ4vaccine",
    "Link": "https://www.thehindu.com/news/national/andhra-pradesh/priority-to-people-due-for-second-dose-of-vaccine-says-health-secy/article34522997.ece",
    "Text": "Collectors told to organise inoculation drives as per due date\n\nHealth, Medical and Family Welfare Principal Secretary Anil Kumar Singhal has said that the government will reach out to all those who are due for the second dose of COVID-19 vaccine.\n\n“The District Collectors have been instructed to schedule vaccination drives at particular centres as per the due date and reach out to the beneficiaries through a door-to-door visit by the ward and village volunteers, SMSes and public announcement,” he told the media on Sunday.\n\nMr. Singhal said that the authorities concerned had been told to make it clear that only those who were informed should visit the vaccine centre on the scheduled date to avoid the rush. “The Centre has permitted the State to utilise the doses purchased by it to vaccinate the people aged above 45 years and modifications to the CoWin app to facilitate the same will be done in two days. The State has purchased 3.5 lakh doses of Covishield and 1.42 lakh doses of Covaxin and those will be used to inoculate the 45+ group, once the CoWin app is modified,” said Mr. Singhal.\n\nWeightage for contract staff\n\nThe contract staff who work at the COVID facilities will be given an advantage of 5% marks in government exams for every six months of service and the government has issued orders in this regard, he said. The State has 6,870 ICU beds and 23,259 beds with oxygen facility in 637 COVID hospitals and a majority of them have been occupied. More beds will be added as the process of registering the notified COVID hospitals under Aarogyasri has begun, said Mr. Singhal. As per the revised allocation of medical oxygen by the Centre, the State got 561 tonnes in the past day, he added.",
    "Title": "Priority to people due for second dose of vaccine, says Health Secy."
  },
  {
    "Date": "Mon, 10 May 2021 05:04:35 +0000",
    "Description": "The parched bottom of Sun Moon Lake, once a popular tourist spot, has become popular on Instagram as residents pray for rain.",
    "Image": "https://static01.nyt.com/images/2021/05/10/world/10taiwan-lake/10taiwan-lake-facebookJumbo.jpg",
    "Link": "https://www.nytimes.com/2021/05/10/world/asia/taiwan-sun-moon-lake-drought.html",
    "Text": "TAIPEI, Taiwan — Sun Moon Lake was once a popular tourist spot in Taiwan. But now the bottom of the lake is Instagram-famous for a grim reason: one of the worst droughts to hit the island in decades.\n\nThe parched lake bed — cracks snaking across the ground as far as the eye can see — has drawn the attention of influencers, who have trekked to the site to take visually arresting photos of the terrain and post them online.\n\nBut the situation is dire. Residents have prayed to the god Matsu for rain after a monthslong drought dried up the island’s reservoirs. Some parts of the lake have begun to grow grass, and jetties that normally float are sitting on dry mud. Tour boats sit idle.\n\n“Our business is 90 percent less than last year,” said Wang Ying-shen, chairman of a group for businesspeople who rent boats to visitors.",
    "Title": "Cracked Lake Bed Is a Stark Symbol of Taiwan’s Drought. Influencers Take Notice."
  },
  {
    "Date": "Mon, 10 May 2021 05:56:10 IST",
    "Description": "",
    "Image": "https://static.toiimg.com/thumb/msid-47529300,width-1070,height-580,imgsize-110164,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/india/queries-on-adopting-covid-orphans-flood-helplines/articleshow/82512541.cms",
    "Text": "NEW DELHI: A counsellor trained to respond to children in distress answers a call for help. On the line is a woman from Gurugram asking about the process involved in adoption of a child who has lost both parents to Covid-19. Soon after a 27- year - old man calls from Delhi with queries related to adoption.Another caller from Madhya Pradesh says his family wants to adopt a child who has lost his parents to the pandemic and they have been making inquiries with hospitals. These are some of the calls received over the last fortnight by counsellors at the tele-counselling toll free number (SAMVEDNA - 1800-121-2830) steered by the National Commission for Protection of Child Rights In the last week alone, around 17 callers reached out to SAMVEDNA with queries for adoption of children orphaned in the second wave of the pandemic. According to NCPCR , in keeping with protocol, each caller is informed that adoption can be done only through a laid out legal procedure under the Juvenile Justice Act, 2015 and through the Central Adoption Resource Authority (CARA).They further share the legal procedure and information about how a call should be placed to Childline 1098 immediately for intervention, the role of police and also information on contacting the child welfare committee and CARA. NCPCR also plans to followup and track these cases through the call recordings in the coming days.In the backdrop of reports regarding children orphaned due to loss of parents to Covid-19 pandemic and posts circulating on social media, both the ministry of women and child development and NCPCR have written to states on measures related to rehabilitation of such children to ensure safety and prevent trafficking. Also WCD ministry has asked the ministry of health and family welfare and sought that a column may be added to hospital admission forms seeking details of a trustworthy person to whom children be handed over.",
    "Title": "Queries on adopting Covid orphans flood helplines"
  },
  {
    "Date": "Mon, 10 May 2021 06:33:54 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/india/variant-spreading-in-india-could-be-dodging-some-vaccine-protections/articleshow/82512681.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82512681.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>",
    "Image": "https://static.toiimg.com/thumb/msid-82512677,width-1070,height-580,imgsize-92580,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/india/variant-spreading-in-india-could-be-dodging-some-vaccine-protections/articleshow/82512681.cms",
    "Text": "GENEVA: A Covid-19 variant spreading in India is more contagious and it is feared it could be dodging some vaccine protections, contributing to the country’s explosive outbreak, the WHO’s chief scientist said on Saturday. In an interview with AFP, Soumya Swaminathan warned that “the epidemiological features that we see in India today do indicate that it’s an extremely rapidly spreading variant”.Swaminathan, an Indian paediatrician and clinical scientist, said the B.1.617 variant of Covid-19 was clearly a contributing factor to the catastrophe unfolding in India. “There have been many accelerators that are fed into this,” the 62-year-old said, stressing that “a more rapidly spreading virus is one of them”.The WHO recently listed B.1.617 as a “variant of interest”. Several national health authorities, including in the US and Britain , have said they consider B.1.617 a variant of concern, and Swaminathan said she expected the WHO to soon follow suit. “B.1.617 is likely to be a variant of concern because it has some mutations which increase transmission, and which also potentially could make (it) resistant to antibodies that are generated by vaccination or by natural infection,” she said.But she insisted that the variant alone could not be blamed for the dramatic surge in cases and deaths seen in India, pointing to “huge social mixing and large gatherings” in recent months.",
    "Title": "‘Variant spreading in India could be dodging some vaccine protections’"
  },
  {
    "Date": "Mon, 10 May 2021 06:08:55 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/india/kharge-sends-modi-6-covid-suggestions-seeks-all-party-meeting/articleshow/82512587.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82512587.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>",
    "Image": "https://static.toiimg.com/thumb/msid-82512582,width-1070,height-580,imgsize-92817,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/india/kharge-sends-modi-6-covid-suggestions-seeks-all-party-meeting/articleshow/82512587.cms",
    "Text": "NEW DELHI: Leader of opposition in Rajya Sabha Mallikarjun Kharge on Sunday wrote to PM Narendra Modi seeking an all-party meeting for a “collective and consensual” approach to tackle the coronavirus pandemic.Writing to the PM with six suggestions on ways to overcome the crisis, Kharge echoed the views of party president Sonia Gandhi , former PM Manmohan Singh and MP Rahul Gandhi , who have all written to the government emphasising on the need for an all-party meeting.He said that while most nations had planned in advance, prioritised their people and put in place contingencies for the anticipated second and third waves of the pandemic, such plans appeared to be missing in the Indian context. “Experts have warned us that although the situation is dire, it can become far worse if leadership is not immediately exercised. So, for the well-being of our people and in the national interest, I urge you to consider the suggestions outlined in this letter,” Kharge said.Among key suggestions, he said the government must use the Rs 35,000 crore allocated in the Union budget for free mass vaccination, adding that allowing private firms to set differential prices for vaccines would adversely impact Indians. “I, therefore, urge you to not relinquish the state’s moral duty in immunising citizens. This is completely doable because India has a history of successful, large-scale immunisation programmes,” he added. Kharge reiterated Congress ’s demand to leverage compulsory licensing to increase vaccine production, besides waiver of GST on vaccines, PPE kits, ventilators and oxygen equipment.He said the government should expedite distribution of relief material from foreign countries.",
    "Title": "Kharge sends Modi 6 Covid suggestions, seeks all-party meeting"
  },
  {
    "Date": "Mon, 10 May 2021 03:50:42 +0530",
    "Description": "Tamil Nadu reports 236 deaths; 1,44,547 patients are under treatment.",
    "Image": "https://th.thgim.com/news/national/m57frc/article32142294.ece/ALTERNATES/FREE_960/DOCTOR-CORONA-MPERIASAMY",
    "Link": "https://www.thehindu.com/news/national/tamil-nadu/28897-more-persons-test-positive/article34522726.ece",
    "Text": "Tamil Nadu reports 236 deaths; 1,44,547 patients are under treatment.\n\nCOVID-19 infections spiked in Tamil Nadu on Sunday, with 28,897 people testing positive, taking the tally of cases to 13,80,259. Among those who tested positive were 14 passengers from Andhra Pradesh; nine from West Bengal; three from Bihar; and one each from Jharkhand and Karnataka.\n\nIn the last 24 hours, the State recorded the death of 236 persons — 47 who had no pre-existing conditions and 189 persons with co-morbidities — pushing the toll to 15,648. As many as 23,515 persons were discharged after treatment. With this, 12,20,064 persons have been discharged. The State has 1,44,547 persons under treatment either at hospitals or at home.\n\nIn its daily bulletin, the Directorate of Public Health reported 7,130 fresh cases and the discharge of 6,884 persons in Chennai. The district also recorded 56 deaths. It has 32,863 active cases. So far, 3,90,589 persons have been infected and 3,52,517 have been discharged. The district has so far recorded 5,209 deaths.\n\nWhile 85 persons admitted to private hospitals had been declared to have died of the infection, the government hospitals reported 151 deaths.\n\nAn 18-year-old youth from Thoothukudi, who was admitted to the Thoothukudi Medical College Hospital on April 29, tested positive on May 5. He died on May 7 owing to acute respiratory distress syndrome and COVID-19 pneumonia.\n\nA 93-year-old diabetic man with coronary artery disease from Chengalpattu tested positive on May 2. He was admitted the same day to a private hospital in Chennai with complaints of fever, cough and breathing difficulty for 10 days. He died of COVID-19 pneumonia on May 6.\n\nOf the 6,669 beds earmarked for COVID-19 patients, 3,551 have been occupied and 3,118 are vacant, the bulletin said.\n\nVaccination update\n\nA total of 25,448 persons were vaccinated during the 2,361 sessions held on Sunday. While 1,232 healthcare workers were inoculated, as many as 2,356 frontline workers, 12,190 persons in the 45-59 age group with co-morbidities and 9,670 senior citizens were among those vaccinated.",
    "Title": "Coronavirus | 28,897 more persons test positive"
  },
  {
    "Date": "Mon, 10 May 2021 09:18:36 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/india/outpouring-of-support-from-us-for-india-covid-19-help-touches-usd-half-a-billion/articleshow/82514112.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82514112.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>Less than a fortnight after President Joe Biden in his conversation with Prime Minister Narendra Modi pledged his country's steadfast support for the people of India, America has responded with an unprecedented financial assistance worth nearly USD half a billion.",
    "Image": "https://static.toiimg.com/thumb/msid-82514112,width-1070,height-580,imgsize-160498,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/india/outpouring-of-support-from-us-for-india-covid-19-help-touches-usd-half-a-billion/articleshow/82514112.cms",
    "Text": "WASHINGTON: Less than a fortnight after President Joe Biden in his conversation with Prime Minister Narendra Modi pledged his country's steadfast support for the people of India, America has responded with an unprecedented financial assistance worth nearly USD half a billion.Biden spoke at length with Modi last month and conveyed solidarity with India in its fight against the viral disease. He assured the prime minister that the US and India will work closely together in the fight against Covid-19.\"Just as India sent assistance to the United States as our hospitals were strained early in the pandemic, we are determined to help India in its time of need,\" Biden had said in a tweet.Reflecting an overwhelming support for a \"natural ally\", the entire country not only the administration, but also the corporate sector which created a global task force, as well as Americans and Indian-Americans have opened their coffers for India.This half a billion dollars includes USD 100 million pledged by the Biden administration, USD 70 million by pharma major Pfizer and 450,000 Remdesivir doses, the governmental purchase price of each of which in the US is USD 390.Thousands of oxygen concentrators and plane loads of life saving drugs and health care equipment are flying off the United States for India almost every day.Several companies like Boeing and Mastercard have announced financial assistance worth USD 10 million each, Google has pledged USD 18 million, which the Global Task Force that comprises CEOs of top American companies have already pledged USD 30 million worth of life saving equipment.Describing it as a “Berlin Life Moment”, Mukesh Aghi of US India Strategic and Partnership Forum (USISPF), told PTI he expects the assistance to touch almost USD 1 billion by the end of the month. “It is emotional for the diaspora, almost everyone has someone who has been touched by Covid-19,” he said.Nisha Desai Biswal, president of US India Business Council (USIBC) said, “The outpouring of support from the United States over the past two weeks was a spontaneous mass mobilisation of support for the Indian people from across the America government, business community and diaspora community and the American people.”“It is unprecedented, and it reflects both the deep bonds between our two countries and the gratitude that Americans feel for the role India played in supporting the United States when we were experiencing our Covid surge last year,” she said.However, given the “speed and severity” that have overwhelmed the capacity of hospitals and local authorities, more assistance will be needed and for a sustained period of timescale of the pandemic, Biswal said.People of the country and the Diaspora too have come out in large numbers. Indian-American Vinod Khosla has committed USD 10 million, top corporate leader John T Chambers has promised USD 1 million.For the first time in its history, Sewa International has raised USD 15 million; American Association of Physicians of Indian Origin (AAPI) (USD 3.6 million), Indiaspora (USD 2.5) million and Jai Shetty has raised USD 4 million.“There has been overwhelming support and offers of assistance from the US Government, private sector, diaspora and the American public at large. In fact, in my interactions in recent days, the US interlocutors across the board ask me, ‘tell us what more we can do for India'”, India's ambassador to the US Taranjit Singh Sandhu told PTI.“They recall with fondness the help India gave. These are reflective of strong partnership and close people to people ties between our both nations. We deeply appreciate these gestures. We will continue to engage with the US in our collective fight against the pandemic,” he said.Among other major financial contributions announced include Procter and Gamble (USD 6.7 million); Merck (USD 5 million), Walmart (USD 2 million), Salesforce (USD 2.4 million), and Caterpillar (USD 3.4 million). Companies like Deloittee have announced to 12,000 oxygen concentrators to India.While Microsoft is partnering with the US government in providing aid and oxygen, FedEx and UPS have taken up the mantle of taking care of the transportation of life saving health care equipment like oxygen cylinders, ventilators and oxygen concentrators to India.On Sunday, Indian-Americans from Tamil Nadu including eminent philanthropist M R Rangaswami, held a “Help Tamil Nadu Breathe” to raise USD 1.5 million in few hours.“This is an incredible outpouring of generosity, which people have come to expect from America. When the world has a crisis, beyond politics, beyond dispute America steps up,” Rangaswami said.“It is comforting to see US cargo jets with much needed medical supplies landing at the Delhi airport regularly,” said Karun Rishi, president of the USA-India Chambers of Commerce.Noting that the stakes are very high for the entire world, he said India's success or failure to come out of this once in a century crisis will have a direct impact throughout the world.Echoing Biswal, Rishi said that more needs to be done.“The scale of assistance to India needs to increase and speeded up. To make some reasonable impact to tide over this crisis, India may need between USD 25-USD 50 billion in assistance in the form of vaccines, technology transfer, increasing vaccines and therapeutics manufacturing capacity, medical equipment and public health measures,” he said.",
    "Title": "Outpouring of support from US for India, Covid-19 help touches USD half a billion"
  },
  {
    "Date": "Mon, 10 May 2021 10:56:43 +0530",
    "Description": "Govt. to set up 250-bed super specialty hospitals in Warangal and Adilabad",
    "Image": "https://th.thgim.com/news/national/telangana/84x4xd/article34522413.ece/ALTERNATES/FREE_960/hy09CM",
    "Link": "https://www.thehindu.com/news/national/telangana/cm-orders-appointment-of-50k-doctors-for-pandemic-duty/article34522368.ece",
    "Text": "Govt. to set up 250-bed super specialty hospitals in Warangal and Adilabad\n\nChief Minister K. Chandrasekhar Rao has sanctioned appointment of about 50,000 MBBS degree holders for COVID duties on ad hoc basis to bring down pressure on health staff in the midst of a raging second wave of the pandemic.\n\nDoctors with MBBS degree, nurses, lab technicians, pharmacists and other para medical staff must be appointed immediately for two to three months, he told an official meeting that was held to review the pandemic situation on Sunday.\n\nA release said Mr. Rao ordered respectable pay to all those who are to be appointed as they would be rendering valuable service to the State. They should be given weightage during appointment in regular government jobs in future.\n\nThose interested in joining the service could apply online by logging in to ‘https://odls.telangana.gov.in/medical recruitment/Home.aspx’.\n\nMr. Rao also urged qualified nurses, pharmacists, lab technicians and para medics to come forth to render service.\n\nThe release added that Mr. Rao decided to start super specialty hospitals in Warangal and Adilabad immediately, and appoint medical and health staff there.\n\nA 250-bed super speciality hospital of MGM Hospital at Warangal could start from the nearby Kakatiya Medical College campus and another such hospital of similar bed strength could commence at RIMS, Adilabad, immediately.\n\n‘Release funds’\n\nHe instructed Principal Secretary of Finance, K. Ramakrishna Rao, to immediately release ₹36 crore for the facility in Warangal and ₹20 crore for the one in Adilabad. He asked officials to take steps to appoint 363 staff at the hospital in Warangal and another 366 personnel in Adilabad.\n\nImmediate action should be initiated for the recruitment of those 729 staff.\n\nDuring the review, Mr. Rao enquired about the availability of oxygen, beds, Remdesivir injections and other facilities at hospitals. He was told by officials that there was no shortage of oxygen supply. There were 7,393 beds available in government hospitals, along with another 2,470 beds fitted with oxygen lines and 600 beds with ventilators.\n\nMr. Rao spoke to Union Health Minister Harsh Vardhan to brief him about the steps taken by the State government to contain COVID-19. He suggested that the rapid spreaders of virus should be identified and administered vaccine first. He wanted guidelines to be relaxed to include in a special category for vaccination cab drivers, auto drivers, bus conductors, cooking gas cylinder suppliers and workers who have to cover many places throughout the day for their daily work. The Union Minister promised to discuss the suggestion with Prime Minister Narendra Modi.",
    "Title": "Coronavirus | Telangana CM orders appointment of 50k doctors for pandemic duty"
  },
  {
    "Date": "Mon, 10 May 2021 09:57:24 +0530",
    "Description": "CCB did not find any evidence of their involvement in alleged bed-blocking scam",
    "Image": "https://th.thgim.com/todays-paper/tp-national/tp-karnataka/6v4ig4/article34503371.ece/ALTERNATES/FREE_960/06bgbgabdpoliGBS8ICISK3jpgjpg",
    "Link": "https://www.thehindu.com/news/cities/bangalore/muslim-youths-targeted-by-bjp-legislators-to-be-reinstated/article34523044.ece",
    "Text": "CCB did not find any evidence of their involvement in alleged bed-blocking scam\n\nThe 17 Muslim youths who were asked to stay away from work after they had been targeted by BJP MP Tejasvi Surya in the alleged bed-blocking scam will be reposted for duty in the coming week, multiple sources said.\n\nTulasi Madineni, Special Commissioner, BBMP, South Zone, said they would get their jobs back, but it was left to the agency they work for to decide where they would be reposted for duty. However, when contacted, the agency, Crystal Infosystems and Services, which is contracted by the BBMP to provide personnel, refused to comment on the issue.\n\nAyesha, one of the staffers in the South Zone war room, said while they had been assured of getting their jobs back, there was no clarity on where they would be posted. “Preferably, we want to be posted back to the South Zone war room, as that is where we were unfairly targeted for no fault of ours and removed from work,” she said.\n\nMr. Surya and three BJP MLAs had stormed the war room last week and live-streamed an “expose” of an alleged bed-blocking scam. Mr. Surya read out the names of 16 Muslim youths and questioned their role in the scam. The personnel, along with another staff member who was from the same minority community but had not been named publicly, were asked not to report to work.\n\nAlso Read Bed allotment scam: IAS officers demand FIR for manhandling official\n\nThe Central Crime Branch (CCB) police who are investigating the case let them go as they did not find any evidence of their involvement. However, the firm insisted that they would be reinstated only after the police gave them a clean chit.\n\nThis decision was criticised as the same treatment was not meted out to the remaining staffers in the war room, many of whom had been questioned by the police. “We were falsely accused solely based on our religion. In a way, we were asked to prove ourselves innocent,” said one of the 17 personnel who had been targeted.",
    "Title": "BBMP to reinstate Muslim youths targeted by Tejasvi Surya, BJP MLAs"
  },
  {
    "Date": "Mon, 10 May 2021 08:16:43 +0530",
    "Description": "Health status of staff and family members being monitored through WhatsApp groups",
    "Image": "https://th.thgim.com/news/national/andhra-pradesh/pbl761/article34523012.ece/ALTERNATES/FREE_960/10VIJ2ONgolePolice",
    "Link": "https://www.thehindu.com/news/national/andhra-pradesh/self-health-groups-formed-to-help-police-personnel-protect-themselves-from-virus/article34523013.ece",
    "Text": "Health status of staff and family members being monitored through WhatsApp groups\n\nIn an attempt to prevent the police personnel who are coming in close contact with the public from contracting coronavirus infection, the Prakasam Police have launched several measures including a dedicated WhatsApp group to monitor the health status of the department staff and their family members.\n\nA sizeable number of the police personnel are contracting the infection in the line of duty disease including enforcing the curfew in force to check the spread of the virus. Prakasam SP Siddharth Kaushal said elaborate guidelines for police stations, staff and their family members had been issued. Among the preventive measures is ‘Police Family Self Health Groups’ (PFSHGs) with the concept of ‘all for one, all for all’.\n\nAs part of the initiative, WhatsApp groups have been created with the personnel and family members through which their health status is being monitored by roping in medical officers and promoting COVID-safe behaviour.\n\nRandom call\n\n“The COVID Family Welfare Desk randomly calls 50 personnel daily and monitor their health status. The latest updates related to the infection and various posts relating to information, education, communication activities are being shared among the WhatsApp group members,” said Mr. Kaushal.\n\nApart from dos and don’ts, videos, infographics, vaccination sites, COVID designated hospitals and details of available hospital beds are also being shared. The group members are being sensitised on healthy diet, nutritional supplements, life saving drugs and etc. The success stories are also being shared among the SHFG members to help them cope with the pandemic crisis.\n\nCOVID-safe behaviour\n\nThe SP also call the personnel and speak to their family members. Playing the role of level-1 mentor, the SP underscored the need for following the ‘Dasha Sutras’ and 'Pancha Sutras', a series of guidelines pertaining to COVID-safe behaviour that need to be followed by the personnel at their both at work and home.\n\nMore than 150 family members of police personnel have been infected by the virus and nine of them are in a critical condition, sources said.\n\nDaily status report\n\nTaking a cue from the SP, 16 level-1 mentors including Additional SPs interact with the police personnel and their family members within 66 police station limits across the district. Fourteen Deputy SPs have been appointed as nodal officers to monitor the health status of 3,600 police personnel in the district on a daily basis and prepare daily status report.\n\nDuring his whirlwind visit of the busy junctions in Ongole on Sunday, Mr. Kaushal said the curfew was yielding a good result in the form of reduced number of new infections.",
    "Title": "‘Self health groups’ formed to help police personnel protect themselves from virus"
  },
  {
    "Date": "Mon, 10 May 2021 04:50:48 GMT",
    "Description": "The motive behind the attack is unclear but there is no indication it was a domestic terror event.",
    "Image": "https://ichef.bbci.co.uk/news/1024/branded_news/112B4/production/_118442307_gettyimages-1214793506.jpg",
    "Link": "https://www.bbc.co.uk/news/world-asia-57053265",
    "Text": "Police are responding to an incident in central Dunedin.\n\n\n\nIt occurred on Cumberland St at about 2.30pm.\n\n\n\nInitial information suggests several people have been injured.\n\n\n\nOne person has been taken into custody.\n\n\n\nFurther information will be released when available.",
    "Title": "New Zealand: At least four injured in supermarket stabbing"
  },
  {
    "Date": "Mon, 10 May 2021 02:15:10 +0530",
    "Description": "Maharahstra, Karnataka top list.",
    "Image": "https://th.thgim.com/news/8fjf4k/article34515335.ece/ALTERNATES/FREE_960/COVID-19testingfacility",
    "Link": "https://www.thehindu.com/news/national/coronavirus-india-records-more-than-366000-new-cases-over-3700-deaths-on-may-10-2021/article34522261.ece",
    "Text": "Maharahstra, Karnataka top list.\n\nIndia recorded 3,66,317 new COVID-19 cases until 11.37 p.m. on May 10. As many as 3,747 new deaths were also registered. The country has so far reported a total of 2,26,62,410 cases and 2,46,146 deaths.\n\nMaharashtra reported 48,401 infections, followed by Karnataka (47,930) and Kerala (35,801). Maharashtra also recorded 572 casualties, followed by Karnataka (490) and Uttar Pradesh (296).\n\nThe figures do not include cases and deaths from Ladakh. The data are sourced from the respective States’ health bulletins.\n\nAround 18.65 lakh tests were conducted on may 9 (the results for which were made available on May 10). Daily tests have remained around the 18 lakh-mark between May 6 and 8. As many as 30.22 crore samples have been tested in the country since the beginning of the pandemic.\n\nAlso read: COVID-appropriate behaviour, vaccination main shields against all mutants, future waves: experts\n\nOn both May 7 and 8, India recorded more than 4,000 COVID-19-related deaths. Prior to May 7, the daily recorded deaths in the country never crossed the 4,000 mark. With 2,42,399 cumulative deaths recorded until May 8, India’s death toll is the third highest in the world after that of the U.S. and Brazil. However, among the five countries with the highest recorded death toll, daily fatalities are rising only in India.\n\nOnly 20.23 lakh daily vaccine doses were administered in the country in the 24 hours ending 7 a.m. on May 10, which is about 3.49 lakh doses lesser than what was recorded in the previous 24 hours. However, it is around 1.97 lakh doses more than what was recorded in the same period, one week ago. A total of 16.94 crore doses have been administered in the country as on 7 a.m. on May 10.",
    "Title": "Coronavirus | India records more than 3.66 lakh new cases, over 3,700 deaths on May 10, 2021"
  },
  {
    "Date": "Mon, 10 May 2021 08:41:27 +0530",
    "Description": "Volunteers have stepped up to help patients, kin",
    "Image": "https://th.thgim.com/news/national/xdk054/article34522985.ece/ALTERNATES/FREE_960/TapeshNagaria",
    "Link": "https://www.thehindu.com/news/national/coronavirus-grief-groceries-all-shared-in-this-fight/article34522986.ece",
    "Text": "Volunteers have stepped up to help patients, kin\n\nOn Thursday, Pritam Singh helped cremate a 24-year-old man. But that wasn’t his worst experience over the past year. He remembers having to carry the body of a man past his young son, saying they were just taking him into a hospital emergency. “The family had told us not to reveal that his father had died,” he says.\n\nMr. Singh and his team of seven, has, over the past year, supported free of cost, about 400 families struggling to perform the last rites of kin who have died of COVID-19. “Usually, when we go to a house, there are only two or three people. At the most, neighbours will come out of their homes when we are putting the body into the ambulance, but otherwise, there is no one to help,” says the 48-year-old, who heads United Sikhs. The lack of support from those they thought they could lean on and the breakdown in government machinery is what both angers and grieves people, he says.\n\nMr. Singh and his team have helped with Hindu and Sikh cremations and Muslim and Christian burials, but feel bad that they have to turn down many people simply because they have neither the volunteers nor the vehicles. Last year, the daily calls were four or five; this year, it is 18-20.\n\nFor a group of men who work at their businesses or in IT, their ages ranging from 20s-40s, dealing with death every day has not been easy. “Hum roz rote hain (we cry every day),” Mr. Singh says.\n\nIn Gurugram, Honey Tandon, who started Helping Hands to provide meals, says people are donating in kind — flour, pulses and fruit.\n\nEven as Mr Singh starts his day at 6:30 a.m. in West Delhi’s Tilak Nagar, in Gurugram dietician Honey Tandon packs breakfast for a few guards and people who live outside her condo gates. She quickly gives her father and son the same food and rushes out.\n\nMs. Tandon began Helping Hands free of cost for those in her building who got COVID and a few workers who had planned to go back their villages. “Soon people in other parts of Gurgaon started asking for home cooked meals, so I began charging ₹100 per meal, from those who can afford it,” she says. For those who can’t, it’s free.\n\nIn the three weeks that Helping Hands has been operational, it has provided about 30 meals each for lunch and dinner, with fewer for breakfast. People have started reaching out with donations in kind – flour, pulses and fruit.\n\n“My husband buys the groceries, and my father begins cutting the vegetables in the morning,” Ms Tandon says, adding that she spends a lot of time in the kitchen. She confesses she hasn’t really cooked on a regular basis till the recent crisis. “My husband joked that people wouldn’t be able to eat the rotis, but they’re getting better,” she says, laughing.\n\nThe Tandon couple deliver every meal in their car or on an electric scooter that EVeez has lent them. Now Ms. Tandon has started a fund raiser so she can feed more people.\n\nWhile she has been able to sustain the service for some time, a number of people like Ruby, 23, find it difficult. Now posted as a vaccine volunteer with the Civil Defence in the Maulana Azad Medical College centre, Ms. Ruby’s reasons for offering her services are a mix of being pragmatic and wanting to help. She is honest: “I love to wear the uniform,” she says.\n\nShe lost her job as a receptionist, and a friend suggested she join the Civil Defence. In the central district, she is one of 5,922 volunteers. She gets a daily allowance of ₹763, and has a 9 to 5 shift, but says as a first responder in various crisis situations, a lot of the work is “nishkam seva” (service without the expectation of receiving anything in return).\n\n“I will continue to do this if I can, if my family is ok with it,” she says, understanding that she also needs to contribute to her family of mother, three sisters and two brothers.\n\nDoctor on call\n\nServing Delhi from fae away Durg, in Chhattisgarh is Dr. Tapesh Nagaria, who works with the Human Solidarity Foundation helpline (9971736222). Having taken a gap year to study for his post graduate entrance exams, he thought it a good opportunity to both help people and gain some experience. “I was really nervous, because medical school doesn’t prepare you for the real world,” he says.\n\nThe real world here was a host of different things — of a new disease that doctors themselves were grappling with, of the fact that even when he knew the patient needed to be in a hospital there were none to be had, and of people sharing medication lists with each other and self-medicating.\n\n“What do you do when a drug is not available? Or when an HRCT is needed but I will be putting another life in danger because the patient will not go alone to a hospital? Or when I need to prescribe blood thinners, but these are ideally given only when a doctor can monitor the patient?” He prefers to err on the side of least medication, and also makes sure his prescription is watermarked with the name of the patient, so it can’t be forwarded. “It’s been a very steep learning curve.”\n\nAbout 70% of callers to the network of about 30 doctors are from Delhi, though the helpline is open to people across India, free of cost.\n\nYouth brigade\n\nThe phone is everyone’s lifeline, even as lockdowns put a pause on movement. An NGO, Caregiver Saathi, is using phones to verify information related to COVID-19, so caregivers have lists of ambulances, blood banks, and other resources that work. They put out a call for volunteers and 44 children — all under 18 — registered. Many had had their own experiences with COVID and wanted to help.\n\nIn Bengaluru, Nimisha Maria Nishant, 15, who heads the teams for Haryana, says the first time someone died and she couldn’t source information in time, she broke down. “It was emotionally exhausting, but my team mates helped me.”\n\nFellow volunteer, Gurgaon-based Mahira Vohra, 16, says, “When leadership fails to provide us with even basic healthcare, it’s upto us to make the community better; to step up and do something.”",
    "Title": "Coronavirus | Grief, groceries, all shared in this fight"
  },
  {
    "Date": "Mon, 10 May 2021 00:19:01 +0530",
    "Description": "I was their appointing authority, says Jagdeep Dhankha; Only Speaker is competent, says ruling party.",
    "Image": "https://th.thgim.com/news/national/other-states/wa14wa/article34522048.ece/ALTERNATES/FREE_960/JagdeepDhankar",
    "Link": "https://www.thehindu.com/news/national/other-states/trinamool-bengal-governor-spar-over-prosecution-of-former-ministers/article34522049.ece",
    "Text": "I was their appointing authority, says Jagdeep Dhankha; Only Speaker is competent, says ruling party.\n\nWest Bengal Governor Jagdeep Dhankhar on Sunday said he has accorded sanction to a Central investigating agency for “prosecuting Firhad Hakim, Subrata Mukherjee, Madan Mitra & Sovan Chatterjee as they were Ministers and he was their appointing authority.\n\n“Governor accorded sanction for prosecution of Firhad Hakim, Subrata Mukherjee, Madan Mitra & Sovan Chatterjee, being appointing authority of Ministers @MamataOfficial under Article 164 & thus competent authority. Media reports that sanction was for being MLA is incorrect,” Mr. Dhankhar said in a tweet, sharing a detailed press statement issued by the Raj Bhavan.\n\nThe matter pertains to the Narada sting videos which is being probed by the CBI. The tapes had come to the fore in 2016 where several Ministers and leaders of the Trinamool Congress were purportedly seen accepting cash on camera. The Governor said the sanction was because they were Ministers and were appointed by the Governor.\n\nTrinamool Congress leader Sukhendu Sekhar Roy differed saying they were MLAs, the sanction should have come from the Speaker.\n\n“We believe that the sanction to a Central investigation agency should come from the Speaker as the leaders were MLAs. However, this is a matter of law and the Courts can deal with it,” the party spokesperson and Rajya Sabha MP told The Hindu.\n\nMr. Roy, however, questioned the timing of the tweet by the Governor and said it comes to the public domain just a day before the Ministers of the TMC government are likely to be sworn in. “We have put it on record in a letter to the President that the conduct of the Governor is partisan and is to further the interests of the BJP. We stick to our stand,” he said.\n\nThe press statement by the Raj Bhavan pointed out that the “sanction came to be accorded by the Hon’ble Governor after CBI had made request and made available entire documentation relevant to the case to the Hon’ble Governor and he invoked his powers under Articles 163 and 164 of the Constitution to accord such sanction”.\n\nFour of those mentioned in the communication are key TMC leaders and were elected to the Assembly. Mr. Chatterjee has since defected to the BJP. Several prominent leaders of the TMC were seen in the purported Narada tapes including Suvendu Adhikari who is now a key BJP leader.",
    "Title": "Trinamool, Bengal Governor spar over ‘prosecution of former Ministers’"
  },
  {
    "Date": "Mon, 10 May 2021 01:30:00 +0530",
    "Description": "It was battle for survival for this gutsy official.",
    "Image": "https://th.thgim.com/news/national/telangana/tcd3md/article34522998.ece/ALTERNATES/FREE_460/Outlook-kjxgjeydjpg",
    "Link": "https://www.thehindu.com/news/national/telangana/covid-19-survivors-tales-with-grit-gumption-and-abiding-hope-telanagana-government-official-emerges-as-a-warrior/article34521684.ece",
    "Text": "It was battle for survival for this gutsy official.\n\nIt was nothing short of a miracle for 57-year-old Krupa Swaroopa Rani, District Welfare Officer, Women Development and Child Welfare department in Telangana Government, who came back from the jaws of death after fighting COVID-19 for almost a month in a corporate hospital in Secunderabad.\n\nIt was battle for survival for this gutsy official, who triumphed at the end to emerge a warrior. A family gathering in January she had attended is said to be the source of the infection.\n\nFor Ms. Swaroopa’s 29-year-old son Joseph Rohith Wood, an analyst with an MNC in Hyderabad, it was a repeat of yet another episode of trauma having to see his mother being almost snatched away by the dreaded COVID-19. His father passed away three years ago. “It all started off with mild fever and cough but after three days, my mother’s saturation levels started dipping. She had a tough time breathing freely. Suddenly, one night, her saturation levels fell below 90 and I used a Nebuliser to bring back the saturation level to normal,” he recalled.\n\nWith little improvement, Ms. Swaroopa was rushed to a corporate hospital in Secunderabad where an HRTCT Scan revealed severe lung infection. “On doctor’s advice, we admitted her in the hospital. On the third day, her condition worsened with a sharp decline in her saturation levels. Her BP and sugar levels fell alarmingly, prompting the doctors to wheel her into the COVID-19 ICU to revive her,” Mr. Rohith said.\n\nMore trouble was in store for the son, who himself had mild COVID-19. Doctors asked to arrange for a plasma donor. “Finding a plasma donor for my mother’s blood group — Bombay Blood Group — a rare phenotype blood group found in four per million of the world population was a Herculean Task. After two days of search, we gave up the efforts ,” he said.\n\nWith Ms. Swaroopa’s condition becoming a cause of concern, she was put on a ventilator. “My heartbeat slipped for a second when the doctors told us to be prepared for any eventuality as her condition was critical,” said Mr. Rohith. “I used to hang around in the hospital praying for my mother’s miraculous recovery. My sister Rachel Pranitha Wood, who works for a global pharma company in Ohio, U.S. rushed back to Hyderabad on hearing her mom’s worsening health condition,” he pointed out.\n\nFor almost a month the brother-sister duo took turns to take care of their mother. “On February 9, my mother was discharged from the hospital after spending one month in hospital with 15 days alone in ICU. Today is May 9 and almost three months after the discharge, she is still struggling to be normal. The family ran a bill of ₹22.5 lakh for the treatment,” Ms. Rachel told The Hindu.\n\nMs. Swaroopa, post-COVID-19 recovery, needs help from an attendant to do her day-to-day work. “While I was in the hospital, I did not realise the gravity of the situation. But once I started recovering I became emotional and used to cry. My only prayer to God was to take care of my children in my absence. A lesson that I learned is never to neglect any ailment. Early diagnosis and proper healthcare with strong willpower will ensure you can come out unscathed with the near encounter with death,” Ms. Swaroopa told The Hindu on Sunday.\n\nShe credits the doctors of the corporate hospital, who worked overtime to see she overcame the health challenges. In particular, she says she is indebted to MS. D. Divya, IAS, Commissioner, Women Development and Child Welfare department, who was in constant touch with hospital authorities monitoring her condition.",
    "Title": "COVID-19 survivors’ tales | Telanagana government official comes back from the jaws of death"
  },
  {
    "Date": "Mon, 10 May 2021 03:48:19 +0530",
    "Description": "Gender- and age group-wise case distribution remains same",
    "Image": "https://th.thgim.com/news/cities/chennai/ei5ezc/article31285827.ece/ALTERNATES/FREE_960/prayer-chennai-corona",
    "Link": "https://www.thehindu.com/news/national/tamil-nadu/more-women-and-youth-among-fatalities-in-second-wave/article34522768.ece",
    "Text": "Gender- and age group-wise case distribution remains same\n\nThough Tamil Nadu is yet to see the peak of the second wave of COVID-19, a comparison of the cases and deaths reported so far with those in the first wave shows noticeable changes in the age and gender distribution of deaths. The proportion of women and people of younger age among the deceased have increased in the second wave.\n\nHowever, the comparison shows no significant differences in the age and gender distribution of cases. (Please read the note in the infographic for the number of deaths and cases taken for analysis.)\n\nWhile women accounted for 27% of all the deaths in the first wave, they have accounted for nearly 33.5% of all the deaths thus far in the second wave. But the gender distribution of cases remains the same, with women accounting for 40% and men 60%. Similarly, while those aged 21-60 accounted for 38.7% of the deaths in the first wave, they have accounted for 43.6% in the second wave. In comparison, the percentage of those aged 60 and above among the deceased has declined from 61% in the first wave to 56.3% in the second wave. However, there has been no shift in the reported cases. In fact, the percentage of the elderly among the cases has increased from 13.1% in the first wave to 14.4% in the second wave.\n\nThe number of deaths reported daily during the second wave has been on a steep increase, with more than 1,200 deaths occurring in the past one week alone. In comparison, during the 12-week period from July to September, there were a total of nearly 7,900 deaths. However, the case fatality rate appears lower, at least for now, than in the first wave. While the case fatality rate was around 1.62% at the peak of the first wave from July to September, it is around 1.03% as of now. While the decline in the case fatality rate is seen among all age groups and gender, it is more pronounced among the elderly. They, however, remain the most vulnerable with a case fatality rate of 3.91%, compared with the the overall rate of 1.03%.\n\nV. Ramasubramanian, senior consultant, infectious diseases, Apollo Hospitals, pointed to the stark difference in the restrictions during the first wave and since this year. “People are not staying indoors, and therefore there is more exposure for people of all age groups, including children, leading to more infections,” he said. Asked why more people of younger age were among the deceased, he said a possible factor was the delay in getting medical attention, with the perception that the disease would not affect them severely. However, he said, this required further study. K. Kolandaisamy, former Director of Public Health, Tamil Nadu, said a clearer picture would emerge only after the second wave played out fully. “A higher volume of cases will mean that more from the younger age group with detected and undetected vulnerabilities or co-morbidities will be among the infected, and they will account for more fatalities,” he said.\n\nPrithvi Mohandas, managing doctor, MIOT International Hospital, recently co-authored a paper published in Clinical Epidemiology and Global Health on the hospital’s experience in treating COVID-19 patients in the first wave. He said the relaxed curbs and disregard for precautions led to more exposure for all age groups. Many of the relatively younger age, who require hospitalisation, resorted to home care and went to hospitals only when the illness became severe. “If you have pneumonia on CT, coupled with raised disease activity in the blood tests, do not sit at home measuring your oxygen level,” he said.\n\nHe, however, said an encouraging thing was that the hospital had not seen any case of COVID-19 pneumonia among those vaccinated.",
    "Title": "More women and youth among fatalities in second wave"
  },
  {
    "Date": "Mon, 10 May 2021 10:25:17 +0530",
    "Description": "Grant constitutes first instalment for the current year",
    "Image": "https://th.thgim.com/todays-paper/tp-national/tp-telangana/9o6x8c/article34523855.ece/ALTERNATES/FREE_960/09hymrl01-CentrG0I8IKT7F1jpgjpg",
    "Link": "https://www.thehindu.com/news/national/telangana/central-grant-for-rlbs-released/article34522345.ece",
    "Text": "Grant constitutes first instalment for the current year\n\nThe Central government has released ₹273 crore to rural local bodies in the State for taking up various prevention and mitigation measures needed to combat coronavirus (COVID-19) pandemic.\n\nThe amount formed part of ₹8,923.8 crore released by the department of expenditure of the Union Finance Ministry for providing grants to rural local bodies. Uttar Pradesh (₹1,441.6 crore), Maharashtra (₹861.4 crore) and Bihar (₹741.8 crore) secured the lion’s share of the release while the neighbouring Andhra Pradesh got ₹387.8 crore.\n\nThe grant is meant for utilisation by all three tiers of the panchayat raj institutions at village, mandal and district levels in the State. The grant, released on the recommendation of the Panchayat Raj Ministry, constituted the first instalment of the united grants for the current financial year.\n\nThough the 1st instalment of the untied grants was supposed to be released next month, according to the 15th Finance Commission recommendations, the grant had been released in advance of the normal schedule in view of the ongoing pandemic situation. The release of the grant would augment resources of the panchayats in fighting the contagion.\n\nThe Ministry said it had also relaxed certain conditions in the release of the grant amount keeping in view the prevailing situation. These conditions included online availability of the accounts of a certain percentage of rural local bodies in public domain. Taking into consideration the prevailing circumstances, the condition had been waived for the release of the first instalment of untied grants.",
    "Title": "Coronavirus | Centre releases ₹273 crore to RLBs in Telangana to fight COVID-19"
  },
  {
    "Date": "Mon, 10 May 2021 04:02:08 +0530",
    "Description": "It transports food, medicine and smartphone to the affected.",
    "Image": "https://th.thgim.com/news/cities/Coimbatore/5274ua/article34522537.ece/ALTERNATES/FREE_960/cb10ROBOTDESIGNED3JPG",
    "Link": "https://www.thehindu.com/news/cities/Coimbatore/a-robot-to-help-covid-19-patients-in-home-isolation/article34522539.ece",
    "Text": "It transports food, medicine and smartphone to the affected.\n\nMembers of a private robotics institute from Karamadai, including three school students, have claimed to have developed a robot to assist those in COVID-19 self-isolation. It transports food, medicine and smartphone to the affected.\n\nS.D.R. Niranjan, founder of Mukkudal Robotics, who mentored the project, demonstrated the machine here on Saturday.\n\nHe said that K. Viswath, a Class 11 student, and K. Nithin and S. Athul Krishna, Class 10 students, came up with the idea in April and the machine was developed in a month.\n\nThe robot contained eight sensors, including ultraviolet, touch, gyro and colour sensors, he said.\n\nWith an ability to carry up to 10 kg, the machine could help give food, clothes, and medicine to COVID-19 patients in self-isolation without any human interference and also had a provision to place a smartphone for tele consultation with doctors, Mr. Niranjan said. It could also carry hand sanitisers to the patients and could clean a room by itself, he claimed.\n\nWhile it could be controlled using remote control, the robot could also be calibrated in advance to carry out specific tasks.\n\n“We are planning to use in two residences in Karamadai to help patients in home isolation,” Mr. Niranjan said. The machine would be upgraded in future to transport oxygen cylinders to hospitals, he added.",
    "Title": "A ‘robot’ to help COVID-19 patients in home isolation"
  },
  {
    "Date": "Mon, 10 May 2021 01:21:32 +0530",
    "Description": "As COVID quickly swamped his lungs, Nagarajan slipped into unconsciousness, before fighting back.",
    "Image": "https://th.thgim.com/news/cities/chennai/irlnv0/article34521790.ece/ALTERNATES/FREE_960/Hospitalisation-Chennai",
    "Link": "https://www.thehindu.com/news/cities/chennai/back-from-the-brink-after-58-days/article34521791.ece",
    "Text": "As COVID quickly swamped his lungs, Nagarajan slipped into unconsciousness, before fighting back.\n\nWhen Nagarajan tested positive for COVID-19 on October 31 last year, he was not worried. On his wife’s advice, the 54-year-old Chitlapakkam resident got hospitalised at a facility in OMR in Chennai.\n\nHowever, four days after admission, his oxygen levels fell below 90. A CT scan revealed lung damage. A couple of days later when the second scan revealed severe damage he was shifted to a private hospital in Nungambakkam.\n\nMr. Nagarajan said he has been mildly hypertensive and on pills to control BP for over a decade. Within four days over 75% of his lung was damaged as the infection spread. He needed oxygen support and soon he became unconscious. He was put on ventilator and transferred to the intensive care unit.\n\nAs his condition deteriorated his family was told to be prepared for any eventuality. “The most critical day was November 30. The doctors told us to inform the family. His brothers and sisters were informed,” his wife Latha said.\n\nMeanwhile the doctors had administered five injections of Remdesivir, Mr. Nagarajan learned later.\n\nHe had been in hospital for over a month. By first week of December the doctors had also put him on nasal feeding and a tracheostomy had been done.\n\n“The doctors told me to bring the children and talk to him to give him confidence,” Ms. Latha said.\n\nThe tide began turning around the first week of December after which he was shifted from critical care unit to a step-down ward. When he recovered consciousness he was put on physiotherapy.\n\n“He had to undergo physiotherapy twice a day. He had to walk along with the oxygen cylinder tank. Doctors said he was physically weak. They said he would be discharged only if he can start breathing on his own,” Ms. Latha recalled.\n\nOn January 4, 58 days after he had been hospitalised, Mr. Nagarajan was discharged. He was advised rest at home to recuperate. Around 45 days ago he returned to work.\n\n“I was optimistic and always felt he would come back. His sickness and the subsequent hospitalisation made me realise how important a life partner is to a person,” Ms Latha said.\n\n(Names have been changed on request)",
    "Title": "COVID-19 survivors’ tales | Chennai resident recalls journey from ventilator to victory"
  },
  {
    "Date": "Mon, 10 May 2021 03:43:07 +0530",
    "Description": "More than 200 check points to be set up in the city",
    "Image": "https://th.thgim.com/news/cities/chennai/fm0nbx/article34522652.ece/ALTERNATES/FREE_960/10TH9127952021170302MARKETCROWDHEALTHSHOPSCLOSED01JPG",
    "Link": "https://www.thehindu.com/news/cities/chennai/10000-police-personnel-to-enforce-lockdown/article34522653.ece",
    "Text": "More than 200 check points to be set up in the city\n\nMore than 10,000 police personnel will be deployed in the city and over 200 check points set up to enforce the complete lockdown in the city.\n\nThe State government on May 8 announced a complete lockdown in the State between 4 a.m. on May 10 and 4 a.m on May 24 to combat the spread of COVID-19.\n\nProtective gear\n\nA large posse of policemen has been deployed across the city. “We have instructed them to wear protective gear, including masks, face shields and use sanitisers,” said a senior police officer.\n\nThe police will try to restrict people from travelling between different zones in the city.\n\n“People are requested to purchase vegetables and groceries to meet their requirements from shops in their locality itself and not to venture to other localities without any need,” said the officer.\n\n‘Show documents’\n\nPeople travelling for weddings of close relatives, funerals, job interviews and hospitals would be allowed on production of relevant documents.\n\n“We will be thoroughly checking the documents. People have to realise that we have to fight this virus together and stay indoors,” the officer said.\n\nPatrol vehicles will do the rounds to keep a check on those violating the lockdown norms, he added.",
    "Title": "Coronavirus | 10,000 policemen deployed to enforce lockdown"
  },
  {
    "Date": "Mon, 10 May 2021 07:43:29 +0530",
    "Description": "‘Oxygen produced in Ballari and allotted to Maharashtra has been re-allotted to us’",
    "Image": "https://th.thgim.com/news/national/karnataka/jmsquw/article34523976.ece/ALTERNATES/FREE_960/09bgbelagavisupply-2",
    "Link": "https://www.thehindu.com/news/national/karnataka/oxygen-supply-will-be-streamlined-in-four-days-minister/article34521553.ece",
    "Text": "‘Oxygen produced in Ballari and allotted to Maharashtra has been re-allotted to us’\n\nOxygen supply system in the State will be streamlined in three-four days as the Union government has agreed to increase allotment, Industries Minister Jagadish Shettar said on Sunday. He was speaking to officers in Belagavi.\n\nAccording him, the Centre will increase oxygen allotment to the State in line with the Supreme Court judgment.\n\nApart from this, the oxygen produced in Ballari that was allotted to Maharashtra has been re-allotted to Karnataka. To a query, he said that he would talk to Ministers in Maharashtra about curbs on oxygen transportation from Kolhapur to Belagavi. This will address the scarcity to a great extent, he said.\n\nHe asked officers to allot enough ventilators to hospitals and see that they were staffed with skilled persons to operate them. However, it is the duty of government officers, doctors and others to see that only optimum oxygen is used in hospitals and it is not wasted.\n\nHe said that the State government had allowed BIMS to appoint additional staff and asked officers to complete recruitment immediately. “We can have 822 additional beds in BIMS if oxygen supply is increased,” he said.\n\nOfficers told him that the rate of infection in Belagavi district was around 28%. The district now has 6,380 active cases.\n\nDeputy Commissioner K. Harish Kumar said that district in-charge Minister Govind Karjol had informed him that Belagavi district was getting four more oxygen plants. They were expected to start functioning in a few months, he said. Mr. Karjol had also informed that Union Minister D.V. Sadananda Gowda had promised to increase Remdesivir injection allotment to Karnataka.\n\nMLA Anil Benake asked officers to clarify their stand about supply of oxygen cylinders to NGOs and those in home isolation.\n\nMember of Parliament Mangala Angadi, officers and others were present.",
    "Title": "Oxygen supply will be streamlined in four days: Minister"
  },
  {
    "Date": "Mon, 10 May 2021 08:17:59 +0530",
    "Description": "In order to overcome the severe shortage of medical oxygen and the problems in transporting it to hospitals amidst the COVID-19 crisis, the government",
    "Image": "https://th.thgim.com/news/national/andhra-pradesh/rz3jj2/article34522194.ece/ALTERNATES/FREE_960/09thltvjkvg-oxygen4JPG",
    "Link": "https://www.thehindu.com/news/national/andhra-pradesh/310-cr-for-new-oxygen-plants-tankers/article34522195.ece",
    "Text": "In order to overcome the severe shortage of medical oxygen and the problems in transporting it to hospitals amidst the COVID-19 crisis, the government on Sunday accorded an administrative sanction for about ₹310 crore for augmenting the required infrastructure.\n\nAccording to G.O. Rt. No.214 issued by the Principal Secretary (Medical and Health) Anil Kumar Singhal, the funds will be spent on procurement of 50 cryogenic oxygen tanker vehicles, setting up oxygen generation plants at 49 locations, laying 10,000 additional oxygen pipelines and on manpower and material required to undertake repairs to oxygen pipelines for six months.\n\nIt was stated in the G.O. that the MD of AP Medical Services & Infrastructure Development Corporation had submitted a report to the government on the need for oxygen plants and other facilities prompted by a steep rise in the demand for medical oxygen due to the second wave of COVID-19 which turned out to be more virulent than the first one.",
    "Title": "₹310 cr. for new oxygen plants, tankers"
  },
  {
    "Date": "Mon, 10 May 2021 08:17:32 +0530",
    "Description": "He reportedly tried to drive them away from field when he was pushed to the ground",
    "Image": "https://th.thgim.com/news/national/andhra-pradesh/2lv7qn/article34522292.ece/ALTERNATES/FREE_960/10vjchelephants",
    "Link": "https://www.thehindu.com/news/national/andhra-pradesh/panic-grips-farmers-after-elephants-kill-watchman/article34522293.ece",
    "Text": "He reportedly tried to drive them away from field when he was pushed to the ground\n\nIn yet another incident of the elephants of the Bachelors’ Group attacking humans, a 75-year-old watchman at a mango orchard was killed when he reportedly tried to drive two elephants away from the field at Nettam village in Puttur mandal on Sunday.\n\nThis is the third incident and first casualty in the eastern mandals in the last four months after a three-member Bachelors’ Group of elephants had crossed into Chittoor district from Vellore in Tamil Nadu in the first week of January. The trio has since been occasionally raiding the crops in the plain areas of Nagari, Puttur, Narayanavanam and Karveti Nagaram mandals and has taken shelter behind hillocks and sparse jungles.\n\nAt present, one of the three elephants has got separated from the group, and is currently on the prowl at Kailasanatha Kona tourist spot at the foot of Nagari hills. The other two elephants are on the move criss-crossing the Karveti Nagaram and Puttur forest ranges.\n\nDivisional Forest Officer (Chittoor wildlife East) G.G. Narentheran told The Hindu that the elderly man, identified as Tupakula Chinnabba of Kalyanapuram locality in Puttur municipality, was on the night vigil when he heard the barking of dogs. Following the sound, he reached the spot to find two elephants.\n\nWhen Chinnabba reportedly tried to scare them away, without raising an alarm to alert others in the neighbouring orchards, he was pushed to the ground by one of the elephants, leading to his death.\n\nAction plan\n\nA few weeks ago, forest officials had launched an operation with two kumkis (trained elephants) intending to drive the trio into the forests. An action plan was also chalked out with an outlay of ₹10 lakh to tackle the issue. However, as the movement of wild elephants in Palamaner and Kuppam ranges grew, the kumkis were temporarily withdrawn from the drive in the plain areas of the eastern mandals.\n\nThe forest officials are also undertaking frequent drives to prevent the elephants from entering into human habitations, fields and from crossing the national highway towards Chennai via Nagari and Nagalapuram.\n\nForest officials have urged the farmers not to venture alone at nights and avoid engaging elderly people on night duties.",
    "Title": "Panic grips farmers after elephants kill watchman"
  },
  {
    "Date": "Mon, 10 May 2021 08:38:39 +0530",
    "Description": "Coronavirus: The centre has defended its Covid vaccination policy - criticised for differential pricing, shortage of doses, and slow rollout - in an affidavit submitted to the Supreme Court late...",
    "Image": "https://c.ndtvimg.com/2021-04/kufejci_coronavirus-india-vaccine-afp_650x400_29_April_21.jpg",
    "Link": "https://www.ndtv.com/india-news/coronavirus-on-vaccine-policy-centre-tells-supreme-court-no-judicial-interference-called-for-leave-decision-to-executive-2438533",
    "Text": "India began the vaccine drive in January, with focus on healthcare and frontline workers (File)\n\nThe centre has defended its Covid vaccination policy - criticised for differential pricing, shortage of doses, and slow rollout - in an affidavit submitted to the Supreme Court late Sunday night.\n\nThe court began hearing the matter this morning.\n\nThe affidavit urged against \"judicial interference\" and warned that \"overzealous, though well-meaning, intervention may lead to unforeseen and unintended consequences\".\n\n\"In the context of a global pandemic, where response and strategy of the nation is completely driven by expert medical and scientific opinion, there is little room for judicial interference. Any overzealous, though well-meaning, judicial intervention may lead to unforeseen and unintended consequences... in absence of any expert advice or administrative experience, leaving doctors, scientists, experts and executive very little room to find innovative solutions on the go,\" the centre said.\n\n\"Pricing of vaccines is not only reasonable but uniform across the country (after) government persuasion with two vaccine companies,\" the centre added, noting that several states had announced plans to vaccinate the 18-45 age group for free.\n\nThe Supreme Court last week directed the centre to reconsider prices - \"to ensure it withstands scrutiny of Articles 14 (equality before law) and Article 21 (protection of life and personal liberty)\".\n\nThat was after manufacturers Serum Institute and Bharat Biotech announced vastly different prices for the centre, states and private hospitals.\n\nWhile the centre continues to spend only Rs 150 per dose for either Serum Institute's Covishield or Bharat Biotech's Covaxin, states must pay Rs 400 per dose for Covaxin and private hospitals Rs 1,200. Covishield costs Rs 300 per dose for states and Rs 600 for private hospitals.\n\nShortage of vaccine doses has forced vaccination centres in several states to shut down (File)\n\nPrices for states and private hospitals were originally higher and were reduced only after outrage.\n\nThe vast difference in prices also triggered a political storm, with the Congress accusing the centre of \"vaccine profiteering\" and sarcastically reminding it of the \"one nation, one price\" war cry.\n\nThe centre pointed out it would get 50 per cent of vaccine supply and that this would be supplied to states for free. However, it made no comment on the higher prices of the remaining 50 per cent.\n\nLast week the Supreme Court said compelling states to negotiate with manufacturers, on grounds of promoting competition and making it attractive for new manufacturers, would adversely affect those in the 18-44 age group, whose vaccination has only just begun.\n\nIndia began vaccination in January and has administered over 17 crore doses so far but the pace has been questioned, with states running out of stock and shutting down centres.\n\nSeveral, including national capital Delhi, Madhya Pradesh, Karnataka and Rajasthan, deferred the start of the third phase over a lack of doses.\n\nSo far two vaccine options are available, with a third - Russia's Sputnik V - having been cleared for emergency use and expected to be rolled out soon. In its affidavit the centre also said it is in consultation with manufacturers like Pfizer, Moderna and Johnson & Johnson to bring in their products.\n\nThe vaccination policy has been criticised by international medical journal The Lancet, which called it \"botched\" and said the government had vaccinated less than two per cent of the population so far.\n\nThe Supreme Court is hearing issues surrounding vaccination and the availability of medical resources - hospital beds and oxygen - as the country battles a huge wave of daily Covid cases.",
    "Title": "\"No Judicial Interference\": Centre To Supreme Court On Vaccine Policy"
  },
  {
    "Date": "Mon, 10 May 2021 09:44:04 +0530",
    "Description": "Amid a sharp rise in the number of COVID-19 cases in the state, the Karnataka government on Sunday issued new guidelines for hospital admission, discharge, and transfer of COVID-19 patients.",
    "Image": "https://c.ndtvimg.com/2021-04/8b7sl9ao_delhi-covid-centre_625x300_13_April_21.jpg",
    "Link": "https://www.ndtv.com/india-news/coronavirus-karnataka-issues-fresh-guidelines-for-hospitalisation-transfer-discharge-of-covid-patients-2438553",
    "Text": "Karnataka government on Sunday issued new guidelines for hospital admission. (Representational)\n\nAmid a sharp rise in the number of COVID-19 cases in the state, the Karnataka government on Sunday issued new guidelines for hospital admission, discharge, and transfer of COVID-19 patients.\n\nA circular issued by Karnataka's Department of Health and Family Welfare read, \"In view of the surge in COVID-19 cases in the State, for the management of the COVID-19 pandemic, hospital beds are a valuable resource and hence, shall be used judiciously for those patients who are clinically in need of these beds. In this context, the guidelines are reiterated for hospital admission, discharge, and transfer of COVID-19 patients.\"\n\nAs per the order, in government COVID-19 hospitals, the patient shall be admitted as per the existing state protocol. However, following their recovery and clinically stable condition, based on the assessment and advise of the treating physician such patients shall be transferred to a stepdown facility attached to the hospital or to a CCC as deemed fit, it said.\n\nThe order further said that whenever a patient is discharged, the discharge protocol of the state shall be followed.\n\nAs far as private COVID-19 hospitals are concerned, for those admitted under SAST (Suvarna Arogya Suraksha Trust-Government referred patients), the patient shall be admitted as per the existing state protocol, mentioned in the circular.\n\nHowever, following their recovery and clinically stable condition, based on the assessment and advise of treating physician such patients shall be transferred to a stepdown facility attached to the private hospital at their own cost or to a Govt CCC as deemed fit, said the order.\n\nAs per the order, the discharge protocol of the state shall be followed for the discharge of patients from private hospitals too.\n\n\"Those admitted in private beds at their own expense (private patients) - The patient shall be admitted as per the existing state protocol. However, following their recovery and clinically stable condition, based on the assessment and advise of treating physician such patients shall be transferred to stepdown facility attached to the hospital at their own,\" read the order.",
    "Title": "Karnataka Issues Fresh Guidelines For Hospitalisation Of Covid Patients"
  },
  {
    "Date": "Mon, 10 May 2021 04:47:40 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/05/PHOTO-2021-05-10-09-02-50.jpg",
    "Link": "https://indianexpress.com/article/india/indian-air-force-steps-up-efforts-to-airlift-oxygen-containers-7309056/",
    "Text": "Amid the prevailing coronavirus crisis in the country, the India Air Force (IAF) on Sunday airlifted four containers of cryogenic oxygen from Pune to be refilled at Jamnagar. It also airlifted seven containers from Gwalior and Bhopal to Ranchi, and two from Hindan to Ranchi.\n\nThe IAF has stepped up its efforts to assist the civil administration by transporting oxygen containers and medical supplies required in the fight against the pandemic.\n\nAn IAF C-17 airlifted Zeolite, a raw material required for the production of respiratory oxygen raw material, from Frankfurt to Mumbai. Two other C-17s were in the process of bringing two Oxygen Generators from Bordeaux in France to Hindan Airbase and Oxygen Concentrators and Respirators from Israel to Hindan Airbase. Two Indian Air Force IL-76s airlifted four cryogenic oxygen containers from Jakarta, Indonesia, and landed at Vizag, officials said.\n\nOther C-17s were in the process of bringing four cryogenic oxygen containers from Vijayawada to Bhubaneswar, six from Chandigarh to Ranchi, two from Agra to Jamnagar, two from Hindan to Bhubaneswar, six from Hyderabad to Bhubaneswar and two from Jodhpur to Jamnagar.\n\nAs per the data shared by the IAF on Sunday afternoon, its transport assets have conducted a total of 54 and 435 international and domestic sorties for transport of close to a total of 400 cryogenic oxygen tankers. Further, 16 international and 116 domestic more sorties have been conducted for flying medical equipment personnel.",
    "Title": "Indian Air Force steps up efforts to airlift oxygen containers"
  },
  {
    "Date": "Mon, 10 May 2021 03:45:53 +0530",
    "Description": "The Uttar Pradesh Police has started a probe into the visit of a Thai woman to Lucknow, seven days after she died at a hospital in Lucknow due to COVID-19, an official said on Sunday.",
    "Image": "https://c.ndtvimg.com/2020-03/utejv4l_police-generic_625x300_07_March_20.jpg",
    "Link": "https://www.ndtv.com/india-news/up-police-launches-probe-into-visit-of-thai-woman-who-died-of-covid-19-2438480",
    "Text": "The probe team has started questioning people in the case, police said. (Representational)\n\nThe Uttar Pradesh Police has started a probe into the visit of a Thai woman to Lucknow, seven days after she died at a hospital in Lucknow due to COVID-19, an official said on Sunday.\n\nThe investigation is being headed by Deputy Commissioner of Police (East) Sanjeev Suman, Lucknow Police Commissioner DK Thakur said\n\nHe said that the probe team has started questioning people in the case.\n\nThe Thai national had come to the city in April and during her stay contracted the coronavirus. She was admitted to the emergency unit of the Ram Manohar Lohia hospital, according to official information.\n\nShe died on May 3 and after completing necessary formalities with the Thai embassy, her last rites were performed.\n\nThe inquiry was launched after allegations on social media that a politician's son had links to the woman.\n\nBJP Rajya Sabha MP Sanjay Seth on Sunday wrote a letter to the Lucknow Police Commissioner demanding that a probe into her visit be initiated and action be taken against those spreading \"false\" information on social media.\n\nCommissioner Thakur said that he has received Mr Seth's letter.\n\nIn his letter, Mr Seth also mentioned that information about the woman's stay, on who booked her a hotel, who visited her and CCTV footage of her visitors be obtained.\n\nHe also demanded that details about the person who admitted the woman to the hospital be made public.\n\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
    "Title": "UP Police Launches Probe Into Visit Of Thai Woman Who Died Of COVID-19"
  },
  {
    "Date": "Mon, 10 May 2021 07:47:27 +0530",
    "Description": "The first meeting of the 12-member National Task Force set up by the Supreme Court to ensure the delivery of medical oxygen throughout the country in a streamlined manner, was held on Sunday, sources...",
    "Image": "https://c.ndtvimg.com/2021-04/ngum9v18_oxygen-cylinder-pti-_625x300_21_April_21.jpg",
    "Link": "https://www.ndtv.com/india-news/supreme-court-task-force-on-oxygen-distribution-holds-first-meeting-2438516",
    "Text": "The Supreme Court constituted National Task Force to formulate methodology for oxygen allocation (File)\n\nThe first meeting of the 12-member National Task Force set up by the Supreme Court to ensure the delivery of medical oxygen throughout the country in a streamlined manner, was held on Sunday, sources said.\n\nThe National Task Force members include Bhabatosh Biswas, former vice chancellor of West Bengal University of Health Sciences, Kolkata; Devender Singh Rana, chairperson of Board of Management, Sir Ganga Ram Hospital, Delhi; Devi Prasad Shetty, chairperson and executive director of Narayana Healthcare in Bengaluru; Gagandeep Kang, professor, Christian Medical College (CMC), Vellore in Tamil Nadu, among others.\n\nUnion Health Secretary Rajesh Bhushan and Union Secretary (MoRTH) Giridhar Aramane were also present in the meeting, sources said.\n\nAccording to the directions of the Supreme Court, few experts can be co-opted in the team.\n\nAccordingly, VK Paul, member (Health), NITI Aayog; Randeep Guleria, director AIIMS, New Delhi; Balram Bhargava, DG ICMR and Secretary (DHR); and Sunil Kumar, DGHS, Ministry of Health, were present as special invitees in the meeting.\n\nAll members of the National Task Force commended the significant amount of work done by various ministries and departments of Government of India in augmenting the oxygen production capacities as well as in ensuring its efficient distribution, sources said.\n\nThe members also provided specific suggestions for further increasing oxygen production and availability, managing the demand side of medical oxygen, and parameters on which individual health facilities could ensure economy in use of medical oxygen, they said.\n\nThe National Task Force decided to continue its deliberations to arrive at specific recommendations.\n\nThe Supreme Court had constituted the 12-member National Task Force of top medical experts to formulate a methodology for allocation of oxygen to states and Union territories for saving lives of COVID-19 patients and to facilitate a public health response to the pandemic.",
    "Title": "Supreme Court Task Force On Oxygen Distribution Holds First Meeting"
  },
  {
    "Date": "Mon, 10 May 2021 10:33:29 +0530",
    "Description": "A mathematical model prepared by advisers to Prime Minister Narendra Modi suggests India's coronavirus outbreak could peak in the coming days, but the group's projections have been changing and were...",
    "Image": "https://c.ndtvimg.com/2021-05/67hljbt8_india-coronavirusbloomberg-_625x300_10_May_21.jpg",
    "Link": "https://www.ndtv.com/india-news/india-coronavirus-tens-of-millions-plunge-into-poverty-in-covid-hit-india-2438590",
    "Text": "People sit outside Pune railway station during lockdown restrictions imposed by the state government.\n\nAfter dipping into his savings to weather India's snap pandemic lockdown last March, Manoj Kumar was just getting his head above water again earning 600 rupees ($8) a day as a construction worker in the tourist hotspot of Goa.\n\nHe'd squirreled away enough for a trip last month to his native village in Bihar some 1,490 miles away for a wedding. He's still there, stuck in one of the nation's least developed states, as a fierce second Covid-19 wave triggers the world's worst health crisis and prevents his return. On a lucky day, he'll land some odd jobs that fetch him as much as 300 rupees. But there aren't too many of those chores left. So he's taking loans to feed and clothe his wife and three kids.\n\n\"It is all in God's hands now,\" said Kumar, who's told his wife to curtail spending on items such as lentils, cooking oil and clothes. \"I don't know when I will return. My family is worried and doesn't want me to go back as the cases are also rising in Goa.\"\n\nKumar, 40, is one of the millions of migrant workers who form part of India's vast unreported informal sector, which accounts for half of its $2.9 trillion, domestic demand-driven economy. A protracted Covid wave is shrinking incomes and wiping out savings of people like Kumar, posing the risk of a double whammy for Asia's third-largest economy that's still struggling to recover from last year's pandemic-induced recession.\n\nThe government estimates India's gross domestic product shrank 8% in the year ended March, its biggest contraction since 1952. Many economists are cutting their forecasts for the current fiscal year as rising unemployment and dwindling savings dim the chances of a double-digit growth. Shaun Roache, chief economist for Asia Pacific at S&P Global Ratings, slashed his prediction to 9.8% from 11% earlier. Fitch Solutions sees the economy expanding by 9.5%, a projection that's below the Bloomberg consensus of around 11%.\n\n\"A drawn-out Covid-19 outbreak will impede India's economic recovery,\" Singapore-based Roache said. \"The country already faces a permanent loss of output versus its pre-pandemic path, suggesting a long-term production deficit equivalent to about 10% of GDP.\"\n\nWith the latest surge caused by a new coronavirus strain, total infections in India have risen to 21.89 million, a third of which were added just in the past three weeks alone. Daily death count hit a record at 4,187 on Saturday. Experts have warned the crisis has the potential to worsen in the coming weeks, with one model predicting as many as 1,018,879 deaths by the end of July, quadrupling from the current official count of 238,270.\n\nHarsh and Sudden\n\nAs new travel restrictions are put in place in some of the nation's biggest economic centers to contain the outbreak, India's poor are likely to bear the brunt again, just as they did in 2020. They have yet to recover from the lockdown ordered by Prime Minister Narendra Modi in late March last year. The harsh and sudden measure sparked an exodus of migrant workers from cities such as Mumbai and New Delhi, as they trekked hundreds of miles to reach home.\n\nPeople like Kumar typically work without contracts and often for a pittance. The so-called informal economy in India employs approximately 411 million workers, according to calculations by Jeemol Unni, a professor of economics at Ahmedabad University, who relied on surveys by the government's National Statistical Office to arrive at the number. While the low-paying farm sector employs the bulk of them, construction comes second with about 56 million.\n\nUnprotected by unions and politicians, these laborers often miss out on handouts from governments. After meeting daily expenses, they are left with little to pay for health care and medicines -- a risky situation especially when a pathogen is taking lives and sending thousands to intensive care at overcrowded hospitals running short of beds.\n\nDip in Savings\n\nEconomists warn depleting household savings and falling incomes will have an impact on domestic consumption, which accounts for almost 60% of GDP. A study by Nikhil Gupta, an economist at Mumbai-based brokerage Motilal Oswal Financial Services Ltd., found that India's household savings dropped to 22.1% of GDP in the quarter through December, from 28.1% in the three months ended June last year. Full-year numbers show India's savings growth lagged behind the likes of the U.S., the U.K. and Japan, he said.\n\n\"A slower rise in household savings, coupled with similar or slower decline in consumption, confirms weak income growth in India,\" Gupta said. \"If so, the contribution of pent-up demand in growth recovery would also be limited in India compared with other nations.\"\n\nData showed April jobless rate increased to nearly 8% from 6.5% in March, with more than seven million exiting the workforce last month, according to data from Center for Monitoring Indian Economy Pvt., a private research firm.\n\nAs a result of all the turmoil that started last year, income inequality is deepening in India. A study by Pew Research Center has shown an estimated 75 million people slipped into poverty since the pandemic began. The second wave is set to crush some more. For the study, Pew considered daily incomes of 150 rupees or less as poor, 151 to 750 rupees as low income and 3,750 rupees and above as high income.\n\nA study by the Azim Premji University in Bangalore showed even more alarming numbers. About 230 million individuals slid below the national daily minimum wage threshold of 375 rupees during the pandemic, it said.\n\nThough India could still emerge as one of the fastest growing economies in the world, it will also be one of the most unequal countries, Oxfam, a non-profit organization said.\n\nStephen Schwarzman, chairman of Blackstone Group Inc., said in an interview last month that he's \"confident\" of the long-term prospects of India. The private-equity firm, which has plowed billions of dollars into the country and owns many of the nation's big office towers, said it would be accelerating its activities in the country. \"We will be investing more in the next 10 years than we have invested in the previous period,\" he said.\n\nDuvvuri Subbarao, a former governor of India's central bank, said the strife faced by the informal-economy workers could hurt India's long-term growth prospects. \"Inequalities have intensified because the formal sector has nearly normalized while the informal sector remains distressed,\" he said.\n\nSlower growth would be bad news for workers like A.K. Singh, who was a cook for a monthly salary of about 20,000 rupees in a restaurant in Mumbai. He fled recently to his home town of Gorakhpur in northern India to start a tire business, for which he's waiting for a loan.\n\n\"I used some of my savings and money I received from my last salary,\" he said. \"But there's a lockdown here too for the past week. My shop was hardly open for two days during the week. What will we earn out of that?",
    "Title": "\"In God's Hands\": Tens Of Millions Plunge Into Poverty In Covid-Hit India"
  },
  {
    "Date": "Mon, 10 May 2021 00:13:39 +0530",
    "Description": "West Bengal Governor Jagdeep Dhankhar - known for his frequent collision with Chief Minister Mamata Banerjee - has given his nod to the CBI to prosecute four erstwhile ministers of her government in...",
    "Image": "https://c.ndtvimg.com/2020-12/febs9qug_bengal-governor-jagdeep-dhankhar-december-2020_650x400_11_December_20.jpg",
    "Link": "https://www.ndtv.com/india-news/as-bengal-ministers-prep-oath-governor-jagdeep-dhankhar-okays-prosecution-in-narada-case-2438450",
    "Text": "The Governor has said he has the authority to sanction prosecution of the four leaders. (FILE)\n\nWest Bengal Governor Jagdeep Dhankhar - known for his frequent collision with Chief Minister Mamata Banerjee - has given his nod to the CBI to prosecute four erstwhile ministers of her government in the Narada tapes scandal.\n\nTwo of the former ministers, now facing CBI prosecution, were sworn in on Monday by the Governor himself. Subrata Mukherjee and Firhad Hakim were named in a list of 43 ministers released on Sunday.\n\nThe sanction and its timing is raising eyebrows, coming as it does just after Mamata Banerjee's resounding victory in the assembly elections that had turned into a direct fight between her and Prime Minister Narendra Modi, and also because Lok Sabha Speaker Om Birla is yet to sanction the prosecution of Suvendu Adhikari, a former Trinamool Congress minister who is now a BJP MLA from Nandigram.\n\nMr Adhikari was a Trinamool MP in Lok Sabha at the time of the commission of the crime. He beat Mamata Banerjee at Nandigram by less than 2,000 votes.\n\nIn 2014, a journalist from Delhi came to Kolkata, posed as a businessman planning to invest in Bengal, gave wads of cash to seven Trinamool MPs, four ministers, one MLA and a police officer as bribe and taped the entire operation. The tapes were released just before the 2016 assembly elections in the state.\n\nThe two other former ministers whom the Governor has now cleared for prosecution are Madan Mitra, a Trinamool MLA not named minister in the new government, and Sovan Chatterjee who left Trinamool in August 2019, joined the BJP but quit in March. He did not contest the just-concluded polls.\n\n\"Governor accorded sanction for prosecution... being the appointing authority of ministers @MamataOfficial under article 164 and thus competent authority,\" the Governor tweeted on Sunday evening.\n\nGovernor accorded sanction for prosecution of Firhad Hakim, Subrata Mukherjee, Madan Mitra & Sovan Chatterjee being appointing authority of Ministers ⁦@MamataOfficial⁩ under Article 164 & thus competent authority\n\n\n\nMedia reports that sanction was for being MLA is incorrect. pic.twitter.com/vqEg7Cv6OW — Governor West Bengal Jagdeep Dhankhar (@jdhankhar1) May 9, 2021\n\nHe was responding, a press release by Raj Bhavan said, to some media reports that he had given his sanction for prosecution because all four where members of the legislative assembly at the time of commission of crime.\n\nJust as the Speaker of Lok Sabha has to sanction prosecution of any MP, the Speaker of the state assembly should sanction prosecution of MLAs. But in the Narada scam, the CBI did not ask the Bengal assembly Speaker for sanction but approached the Governor instead.\n\nThe Governor has said he has the authority to sanction prosecution not because the four leaders named were MLAs but because they were ministers sworn in by him in 2011.\n\nOf the seven Trinamool MPs named in the Narada case, six were from Lok Sabha and Mukul Roy from Rajya Sabha. Mukul Roy is now with BJP and just elected MLA. There has been no action against him. In the sting tapes, he was not actually seen taking cash.\n\nOf six Lok Sabha MPs, Sultan Ahmed has died. The CBI has sought to prosecute Suvendu Adhikari, Sougata Roy, Kakoli Ghosh Dastidar, Prasun Banerjee and Aparupa Poddar. The Lok Sabha Speaker has not granted sanction.\n\nThe four former ministers taped taking bribes were Subrata Mukherjee, Firhad Hakim, Sovan Chatterjee and Madan Mitra.\n\nThe MLA involved was Iqbal Ahmed. The police officer was SMH Mirza.",
    "Title": "Bengal Governor Okays Narada Bribe Case Prosecution Before Ministers Oath"
  },
  {
    "Date": "Mon, 10 May 2021 04:37:56 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/05/NAVEEN-P.jpg",
    "Link": "https://indianexpress.com/article/india/naveen-patnaik-sanctions-rs-60-lakh-for-feeding-stray-dogs-cattle-during-covid-lockdown-7309057/",
    "Text": "Odisha Chief Minister Naveen Patnaik on Sunday sanctioned funds for feeding stray animals in all urban pockets during the 14-day coronavirus lockdown period.\n\n“The lockdown is now underway across the state to control the pandemic. Therefore, stray dogs and cattle are deprived of food… The CM has approved sanction of Rs 60 lakh from his relief fund,” an official release said.\n\nThe funds will be available in five municipal corporations, 48 municipalities and 61 notified area councils (NACs), it said, adding, the urban local bodies will provide food to stray animals through various voluntary organisations.\n\nA report from Jajpur district said the local administration Sunday distributed food to monkeys, dogs and cows at the Mahavinayak temple in the Chandikhole area.\n\nThe district administration has also appealed to people to feed stray animals during the lockdown phase that started from May 5.",
    "Title": "Naveen Patnaik sanctions Rs 60 lakh for feeding stray dogs, cattle during Covid lockdown"
  },
  {
    "Date": "Mon, 10 May 2021 00:34:25 +0530",
    "Description": "Union Minister Santosh Gangwar has written to Chief Minister Yogi Adityanath, flagging a series of concerns including shortage of oxygen and black marketing of ventilators and other medical equipment...",
    "Image": "https://c.ndtvimg.com/2019-07/a5q12p18_yogi-adityanath-facebook_650x400_02_July_19.jpg",
    "Link": "https://www.ndtv.com/india-news/coronavirus-oxygen-shortage-in-bareilly-union-minister-santosh-gangwar-writes-to-yogi-adityanath-2438456",
    "Text": "Yogi Adityanath recently asserted there was no oxygen shortage in any UP Covid hospital(FILE)\n\nUnion Minister Santosh Gangwar has written to Uttar Pradesh Chief Minister Yogi Adityanath, flagging a series of concerns including shortage of oxygen and black marketing of ventilators and other medical equipment in his constituency Bareilly --- about 250 km from state capital Lucknow. His complaints come barely a fortnight after the Chief Minister denied any scarcity of oxygen in the state's hospitals and promised strong action, including seizure of property, against people \"spreading rumours\".\n\nThere is a scarcity of oxygen in Bareilly, which he represents in parliament, Mr Gangwar said. Ventilators and other medical equipment are being sold in the black market. People in the Health department do not pick up phones, creating difficulty for Covid patients, he added.\n\nThe Union minister also sought that oxygen plants be installed in the hospitals of Bareilly and the process of referring Covid patients to hospital be simplified.\n\nAsked about the letter, Mr Gangwar told reporters that the complaints and suggestions had come from the people, and he had only passed it on to the Chief Minister.\n\n\"I think the points they raised were valid and these can be investigated and decided on,\" he said. \"I think oxygen is just a temporary problem. It will get solved. But there should be no black marketing,\" he added.\n\nYogi Adityanath had recently asserted that there was no shortage of oxygen in any Covid hospital of the state, private or government. \"Every infected patient does not need oxygen,\" he had told reporters late last month, seeking cooperation to spread awareness about this.\n\nAt the time, he also asked officials to take action under the National Security Act and seize the properties of people who spread \"rumours\" and \"propaganda\".\n\nHe, however, admitted that black marketing and hoarding were problems, \"which will be tackled with a heavy hand\".\n\nCongress's Priyanka Gandhi Vadra had called him out over his remarks.\n\n\"Mr. Chief Minister, there is an oxygen emergency in the entire state,\" she had tweeted. \"If you want to file a case against me, seize my property, do so. But for God's sake recognise the seriousness of the situation and get down to saving people's lives immediately,\" her tweet in Hindi read.\n\nOver the last 24 hours, 736 new Covid cases have been logged in Bareilly, the number of active cases is 6,387.\n\nSave A Life. Help Fight The Coronavirus Outbreak In India",
    "Title": "Oxygen Shortage In Bareilly, Union Minister Writes To Yogi Adityanath"
  },
  {
    "Date": "Mon, 10 May 2021 05:42:30 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/05/central-vista-2.jpg",
    "Link": "https://indianexpress.com/article/india/delhi-hc-agrees-to-hear-plea-seeking-interim-stay-on-central-vista-project-7309127/",
    "Text": "The Delhi High Court on Monday agreed to hear tomorrow a petition seeking an interim stay on the construction of Central Vista during the peak phase of the pandemic.\n\nThe court had earlier listed the case for hearing on May 17. Last week, the Supreme Court had declined to entertain the plea against the High Court’s adjournment of the petition and told the petitioners to request the High Court for an urgent hearing.\n\nSenior Advocate Siddharth Luthra this morning apprised the division bench of Chief Justice D. N. Patel and Justice Jasmeet Singh about the Supreme Court order.\n\nThe petition filed by Anya Malhotra, a translator, and Sohail Hashmi, a historian and documentary filmmaker, states they are concerned by the “super spreading potential and threat” posed by the continuing construction at the project and the plight of the workers who are being exposed to the infection on a daily basis.\n\nLuthra, appearing for the petitioners, last week submitted before the division bench that they are in no manner seeking to overreach the Supreme Court’s earlier judgment on the project and the prayer is limited to seeking an interim stay on the construction during the peak phase of pandemic.\n\n“The petitioners are also questioning why or how the project constitutes an ‘essential service’ merely because some executive mandated contractual deadline has to be met,” the plea read. “In the current dismal scenario, this project has no feature of ‘essentiality’ for and/or of ‘service’ to the public at large.”",
    "Title": "Delhi HC agrees to hear plea seeking interim stay on Central Vista project"
  },
  {
    "Date": "Mon, 10 May 2021 09:52:38 +0530",
    "Description": "India saw a significant drop in daily Covid infections this morning with 3.66 lakh fresh cases and 3,754 deaths logged in the last 24 hours after the country recorded over 4 lakh cases for four...",
    "Image": "https://c.ndtvimg.com/2021-05/sqrh1aug_coronavirus-india-reuters-may_650x400_10_May_21.jpg",
    "Link": "https://www.ndtv.com/india-news/coronavirus-3-66-lakh-fresh-covid-19-cases-in-india-3-754-deaths-2-26-crore-total-cases-2-46-116-deaths-2438563",
    "Text": "India Coronavirus Cases: India has logged 3,754 deaths linked to Covid in the last 24 hours.",
    "Title": "3.6 Lakh Fresh Covid Cases In India, 3,754 Deaths; 2.26 Crore Total Cases"
  },
  {
    "Date": "Mon, 10 May 2021 10:41:48 +0530",
    "Description": "Hitting out at the Centre, Congress leader Rahul Gandhi on Monday said the government's \"repeated chest-thumping\" at receiving foreign aid to tackle the COVID-19 crisis in the country is pathetic",
    "Image": "https://c.ndtvimg.com/2021-04/f41ns0fs_rahul-gandhi-pti-photo_625x300_20_April_21.jpg",
    "Link": "https://www.ndtv.com/india-news/congress-leader-rahul-gandhi-on-foreign-aid-had-government-done-its-job-it-would-not-have-come-to-this-2438596",
    "Text": "\"GOI's repeated chest-thumping at receiving foreign aid is pathetic,\" Rahul Gandhi tweeted\n\nHitting out at the centre, Congress leader Rahul Gandhi on Monday said the government's \"repeated chest-thumping\" at receiving foreign aid to tackle the COVID-19 crisis in the country is pathetic and had it done its job, it would not have come to this.\n\nThe Congress had last week demanded transparency and urged Prime Minister Narendra Modi to make public the details of all the relief material received by India from different countries.\n\n\"GOI's repeated chest-thumping at receiving foreign aid is pathetic. Had GOI done its job, it wouldn't have come to this,\" Mr Gandhi said in a tweet.\n\nAs India reels under a calamitous second wave of the coronavirus infection, it has received large amounts of medical supplies from a significant number of countries, including the US, Russia, France, Germany, the UK, Ireland, Belgium, Romania, Singapore, Sweden and Kuwait.",
    "Title": "Rahul Gandhi Slams Centre Over Foreign Aid Amid COVID-19"
  },
  {
    "Date": "Mon, 10 May 2021 09:31:54 +0530",
    "Description": "Indian drugmaker Cipla Ltd said on Monday it has entered into a licensing agreement with U.S. company Eli Lilly and Co to make and sell Lilly's arthritis drug baricitinib for the treatment of COVID-19...",
    "Image": "https://i.ndtvimg.com/i/2016-08/cipla_650x400_41471001022.jpg",
    "Link": "https://www.ndtv.com/india-news/cipla-enters-into-licensing-agreement-with-uss-eli-lilly-for-baricitinib-drug-to-treat-covid-19-2438555",
    "Text": "Indian drugmaker Cipla Ltd said on Monday it had entered into a licensing agreement with U.S. company Eli Lilly and Co to make and sell Lilly's arthritis drug baricitinib for the treatment of COVID-19 patients.\n\nThe agreement comes at a time when India is struggling with a catastrophic second wave of the pandemic, leading to an acute shortage of coronavirus medicines such as remdesivir and tocilizumab.\n\nBaricitinib has been given restricted emergency use approval by India's drug regulator for use in combination with remdesivir for the treatment of hospitalised COVID-19 adult patients requiring supplemental oxygen, Cipla said in a filing to stock exchanges.\n\nIn November, the U.S. Food and Drug Administration initially gave Eli Lilly an emergency use approval for baricitinib in combination with remdesivir to treat COVID-19 patients.\n\nCipla's deal with Lilly expands the Indian drugmaker's portfolio of COVID-19 drugs. Aside from remdesivir and tocilizumab, the company also offers antiviral drug favipiravir, used to treat patients with moderate to mild COVID-19.\n\nLast week, Cipla said it would be the local distribution partner for a COVID-19 antibody drug cocktail developed by Roche and Regeneron, after the therapy got emergency use approval from India's drug regulator.\n\nIndia has posted more than 400,000 daily coronavirus cases for the past four days, and its total infections have reached nearly 22.30 million, the second highest number of cases in the world after the United States.\n\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
    "Title": "Cipla To Make, Sell US's Eli Lilly's Baricitinib Drug For Covid Treatment"
  },
  {
    "Date": "Mon, 10 May 2021 02:36:52 +0530",
    "Description": "Three persons died after allegedly consuming an alcohol-based homeopathy medicine as a substitute for liquor in Chhattisgarh capital Raipur, police said on Sunday.",
    "Image": "https://c.ndtvimg.com/2020-03/utejv4l_police-generic_625x300_07_March_20.jpg",
    "Link": "https://www.ndtv.com/india-news/3-dead-after-taking-medicine-as-substitute-for-liquor-chhattisgarh-police-2438472",
    "Text": "Probe revealed the trio had consumed some medicine as a replacement of alcohol. (Representational)\n\nThree persons died after allegedly consuming an alcohol-based homeopathy medicine as a substitute for liquor in Chhattisgarh capital Raipur, police said on Sunday.\n\nThe deaths occurred on May 7, but its cause came to light on Sunday after an investigation was carried out based on the autopsy report of one of the victims, said RK Mishra, station house officer (SHO) of Civil Lines police station in Raipur.\n\nThe victims were identified as Manish Verma (37), Dalvir Singh Parmar (25) and Balvindar Singh (29), all residents of Pandri area in Raipur, he said.\n\n\"On May 7, Verma died at his home, while two others died during treatment at Dr BR Ambedkar Memorial Hospital on the same day,\" he said.\n\nSuspecting that Verma died of COVID-19, his family performed his final rites, Mr Mishra said.\n\n\"However, the autopsy report of Singh indicated that he died due to unknown alcoholic poisoning, while Paramar due to a heart attack, following which police launched a probe,\" he said.\n\nThe investigation revealed that the trio had consumed some homeopathy medicine together as a replacement of alcohol, following which their condition deteriorated, the SHO said, adding that it was yet to be ascertained which medicine they had consumed.\n\nFurther probe into the matter is underway.\n\nIn a similar incident, nine persons had died in a village in Bilaspur district of the state between May 4 and 6 after allegedly consuming an alcohol-based homeopathy syrup as replacement for liquor, police had said.\n\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
    "Title": "3 Dead After Taking Medicine As Liquor Substitute: Chhattisgarh Police"
  },
  {
    "Date": "Mon, 10 May 2021 00:05:03 +0530",
    "Description": "Forty-three ministers weresworn in todayas part of Mamata Banerjee's team as she begins her third term as Chief Minister of West Bengal.",
    "Image": "https://c.ndtvimg.com/2021-05/okedo0ks_mamata-banerjee-pti_625x300_09_May_21.jpg",
    "Link": "https://www.ndtv.com/india-news/veterans-new-faces-in-swearing-in-for-mamata-banerjees-cabinet-today-2438438",
    "Text": "Mamata Banerjee's cabinet was sworn in at Raj Bhavan on Monday morning.\n\nForty-three ministers were sworn in today as part of Mamata Banerjee's team as she begins her third term as Chief Minister of West Bengal.\n\nThe team has 25 incumbent faces and 18 new ones. Out of 43, nine are ministers of state.\n\nTwo ministers were sworn in virtually. Amit Mitra, as he has not been keeping well and Bratya Bose who is recovering from COVID-19.\n\nVeterans Subrata Mukherjee, Partha Chatterjee, Firhad Hakim, Aroop Biswas, Sujit Bose, Chandrima Bhattacharya and Shashi Panja are back as ministers.\n\nManas Bhuian, who was Rajya Sabha MP and fought the Assembly poll this time, is in.\n\nSo is Akhil Giri, a loyalist from East Midnapore, turncoat Suvendu Adhikari's district, and Arup Roy from Howrah, the district of yet another rebel leader Rajib Banerjee.\n\nBirbaha Hansda, a star of Santhali cinema who contested for the first time, is a minister of state.\n\nFormer IPS officer Humayun Kabir is on the list too as minister.\n\nThe swearing-in took place at Raj Bhavan at around 10:30 am and some awkward moments.\n\nGovernor Jagdeep Dhankhar has just sanctioned the CBI prosecution of four people in the Narada sting operation case, including two of the ministers being sworn in - Subrata Mukherjee and Firhad Hakim.\n\nThe two others are Madan Mitra and Sovan Chatterjee. Mr Mitra has won the assembly election and is now an MLA. Mr Chatterjee had quit Trinamool and joined the BJP last year. He quit the BJP days before the just-concluded assembly polls.\n\nThe Governor and Mamata Banerjee have sparred ever since May 5 when she was sworn in over reports of post-poll violence in the state.\n\nThe Governor held Mamata Banerjee responsible. She said a lot of the violence was fake news and that the clashes that did take place happened when the Election Commission was in charge of law and order.",
    "Title": "Veterans, First-Timers Take Oath, Join Mamata Banerjee's New Cabinet"
  },
  {
    "Date": "Mon, 10 May 2021 04:16:37 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/05/sushil-kumar-1.jpg",
    "Link": "https://indianexpress.com/article/india/delhi-police-issues-a-look-out-circular-against-absconding-olympic-medallist-sushil-kumar-7309027/",
    "Text": "Delhi Police has issued a Look-out-Circular (LoC) against the two-time Olympic medalist Sushil Kumar who is absconding after a 23-year-old former junior national champion, Sagar Rana, was beaten to death during a brawl at the Chhatrasal Stadium parking area.\n\nAfter the incident, an FIR of murder, abduction and criminal conspiracy was registered against Kumar.\n\nAdditional DCP (North-West district) Dr Guriqbal Singh Sidhu has confirmed that they have issued LoC against Sushil Kumar. “We have recorded statements of all the victims and they all made allegations against Sushil Kumar. We are conducting raids to nab Sushil Kumar,” Sidhu said.\n\nThe victims in their statements have also alleged that Kumar and his associates abducted Sagar from his house in Model Town to teach him a lesson for bad mouthing him in front of other wrestlers, police said.\n\nOn Tuesday, Sagar Rana, who had competed in the 97-kg Greco-Roman category, was beaten to death in a clash involving two groups. Rana was a former junior national champion and is part of the senior national camp. “We have found during investigation that a quarrel had allegedly taken place between Sushil Kumar, Ajay, Prince Dalal, Sonu, Sagar, Amit and others in the parking area of the stadium,” Sidhu said.\n\nPolice recorded the statements of all the victims during which they said that Sagar and some of his friends, including injured Sonu Mahal, who is a close associate of gangster Kala Jathedi, were staying in a house linked to Sushil near the stadium. “They had been asked to vacate recently and were removed from the house forcefully. Sushil later came to know that Sagar had started bad mouthing him in the Chhatrasal Stadium in front of other wrestlers and also threatened him of dire consequences,” a senior police officer said.\n\nPolice said that during the investigation, they also found a recorded video of the incident from the mobile phone of accused Prince Dalal, in which faces of all the attackers can be seen. “Dalal was arrested from the spot and we seized his cellphone, two double barrel guns along with seven live cartridges of 12 bore from his possession. After investigation, we have found that the guns were registered in the name of one resident of Ashoda village in Haryana’s Jhajjar,” police sources said.",
    "Title": "Delhi police issues Look-out-Circular against absconding Olympic medallist Sushil Kumar"
  },
  {
    "Date": "Mon, 10 May 2021 01:01:16 +0530",
    "Description": "Union Minister of State (MoS) for Finance and Corporate Affairs Anurag Thakur on Sunday gave point wise responses elaborating measures taken by the Centre and rectifying some of the \"misconceptions\"...",
    "Image": "https://c.ndtvimg.com/2020-09/9598r4ns_anurag-thakur-pti-_625x300_19_September_20.jpg",
    "Link": "https://www.ndtv.com/india-news/anurag-thakur-rectifies-misconceptions-in-kharges-letter-to-pm-says-states-get-70-pc-of-vaccine-revenue-2438461",
    "Text": "Anurag Thakur informed 1.5 lakh doses of vaccine Sputnik V have already reached (FILE)\n\nAfter Congress leader Mallikarjun Kharge wrote to Prime Minister Narendra Modi offering suggestions to tackle COVID-19, Union Minister of State (MoS) for Finance and Corporate Affairs Anurag Thakur on Sunday gave point wise responses elaborating measures taken by the Centre and rectifying some of the \"misconceptions\" in the letter.\n\nMr Thakur posted Kharge's letter to PM Modi on his Twitter handle and said on government supplies, GST is also paid by the government. \"From GST collected on the vaccine, half is earned by the Centre and another half by the States. 41 per cent of Centre's collections also get devolved to the States. States end up receiving almost 70 per cent of the total revenue collected from vaccines,\" he explained.\n\n\"A nominal 5 per cent GST is in the interest of the domestic manufacturer of vaccine and in the interest of citizens. If full exemption from GST is given, vaccine manufacturers would not be able to offset their input taxes and would pass them on to the end consumer/citizen by increasing the price. A 5 per cent GST rate ensures that the manufacturer is able to utilise Input Tax Credit (ITC) and in case of overflow of ITC, claim a refund. Exemption to the vaccine from GST would be counterproductive without benefiting the consumer,\" the MoS said.\n\nCalling India's COVID-19 vaccination drive 'world's fastest and largest', he said 15 crore people have been vaccinated in 103 days. While 17.56 crore vaccine doses were provided to States/UTs free of cost, 72 lakh doses were still available with States/UTs to be administered. \"More than 46 lakh doses in addition will be received by States/UTs in the next 3 days. COVID vaccines are being provided free of cost by the Government of India to those who are 45 years of age and above and to all frontline workers,\" he tweeted.\n\nHe informed that 1.5 lakh doses of COVID vaccine Sputnik V have already reached India and Russian Direct Investment Fund (RDIF) has also tied up with local Indian companies for bulk production.\n\n1.5 Lk doses of Sputnik V have already reached India and RDIF has also tied up with local Indian companies for bulk production. — Anurag Thakur (@ianuragthakur) May 9, 2021\n\nSpeaking about Mahatma Gandhi Employment Guarantee Act (MNREGA), he said: \"Not only did NDA Government double the allocation during the COVID period last year from Rs 61,500 crore to a historic high of over Rs 1 lakh crore, but also increased the wages to Rs 202 thereby ensuring 300 crore person days of work in total. And it is demand driven.\"\n\nIn order to augment availability of these items, he said that the government also provided full exemption from basic customs duty and health cess to their commercial imports.\"GST rates varying 5 per cent (on vaccines), 12 per cent (COVID drugs, oxygen concentrators) is applicable to domestic supplies and commercial import of items.\n\n\"Assistance to States/UTs 6,608 Oxy Concentrators, 3,856 Oxy Cylinders, 1500 PSA plants being set up across country via PMCARES and PSUs 4,330 ventilators/ Bi PAP/ C PAP, Over 3 lakh Remdesivir vials delivered/dispatched, 400 ex-AMC/SSC medics, released between 2017-2021 expected to be recruited.\n\nMr Kharge on Sunday wrote to Prime Minister Modi and Rajya Sabha Chairman M Venkaiah Naidu and suggested convening an all-party meeting and virtual meetings of Parliament Standing Committees to discuss the COVID-19 situation in the country.\n\n\"Use Rs 35,000 crore allocated in the Union Budget to ensure free vaccine for all. Leverage compulsory licensing to increase production of vaccines,\" reads Kharge's letter.\n\nHe further suggested to expand the scope of MNREGA to 200 days.\n\nWith 4,03,738 new COVID-19 cases in the last 24 hours, India continued to report more than four lakh daily coronavirus infections for the fourth day on the trot.\n\nWith this, the cumulative national tally of the infection went up to 2,22,96,414, the union health ministry said on Sunday morning.\n\nSave A Life. Help Fight The Coronavirus Outbreak In India\n\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
    "Title": "1.5 Lakh Doses Of Sputnik V Vaccine Have Already Reached India: Minister"
  },
  {
    "Date": "Mon, 10 May 2021 09:06:28 +0530",
    "Description": "Anger over the scale of devastation in the fierce second wave of Covid and its impact on Prime Minister Narendra Modi's government has caused deep disquiet in the ranks of the ruling BJP and its...",
    "Image": "https://c.ndtvimg.com/2021-05/1at2vlig_india-covid-generic_625x300_09_May_21.jpg",
    "Link": "https://www.ndtv.com/india-news/coronavirus-worry-within-bjp-rss-over-covid-handling-electoral-impact-sources-2438545",
    "Text": "India has recorded over 2.66 crore Covid cases since the pandemic broke.\n\nAnger over the scale of devastation in the fierce second wave of Covid and its impact on Prime Minister Narendra Modi's government has caused deep disquiet in the ranks of the ruling BJP and its ideological mentor Rashtriya Swayamsevak Sangh (RSS), sources say. In seven years of PM Modi in power, public perception and election results have never spooked the powerful \"Sangh Parivar\" this much.\n\nSources say the BJP and RSS are concerned with the perception that the government dropped the ball on Covid, given that almost everyone in the ruling party's core support base is affected by the deadly pandemic. The middle class are the worst-hit -- and now the virus is spreading to the villages, especially in Uttar Pradesh and Bihar.\n\n\"If you lose someone, the grief and anger remains for a long period and it can be expressed in any form,\" a leader told NDTV, implying that there is a big worry in the ranks about the pandemic costing the BJP in elections.\n\nWhile there are still three years to the next Lok Sabha polls (2024), when PM Modi will seek a third term, states like Uttar Pradesh are due to vote next year.\n\nIf the results of the UP Panchayat polls are any indication, the BJP has reason to worry.\n\nThe discontent has floated to the surface. Union Minister Santosh Gangwar's letter to UP Chief Minister Yogi Adityanath flagging oxygen shortage, \"black-marketing\" of medical equipment and delays in admitting Covid patients in his constituency Bareilly went viral.\n\nLeaders say there is a strong belief that any damage control will require a shuffle in which some ministers must go and make way for new faces.\n\nThe Covid emergency has exposed the poor health infrastructure and unpreparedness of the government, leaders admit.\n\nHealth is a state subject but that argument does not wash, they believe, since it is the Centre that had been leading the fight against Covid since last year. \"People are disappointed with the central leadership and they blame lack of action on their part for the current situation, which has gone out of our hands,\" sources said.\n\nPM Modi's campaign in West Bengal while Covid cases were spiraling in the country has sent a \"wrong message\", senior leaders fear. Top BJP leaders were campaigning in West Bengal and attending huge rallies and roadshows without masks, prioritizing votes over public safety, and the imagery across global media could not have been worse.\n\nThese leaders also blame lack of communication within the government. \"The Principal Scientific Adviser K Vijay Raghavan warns us about the third wave but he never talked about the second wave,\" a leader lashed out.\n\nThere is an unsettling perception that the BJP's famed machinery is invisible on the ground, and so are its leaders. They are not seen extending help to people this time, unlike last year when the party organization arranged food packets and other relief during the lockdown.\n\nThe government's mismanagement is also evident in what leaders call a \"botched-up vaccination drive\" tangled in rules and regulations.\n\nVaccine production capacity should have been enhanced when there was time, the leaders point out.\n\nThose in the government have strongly defended the Centre's Covid response. They say the perceived ill-preparedness was mainly because of zero warning about the magnitude of the second wave. \"It is a fact that the government was not prepared for the second wave but now all hands are on the deck,\" a minister said.\n\n\"The oxygen supply is being strengthened. Vaccination drive will be smoother. Our vaccine basket has been increased and we will get more vaccines in the coming months,\" he said, adding that the Prime Minister was personally monitoring the efforts.\n\nPM Modi \"cut short his Bengal campaign as soon as it was brought to his notice\", leaders say, and persuaded seers to wind down the mega Kumbh Mela - a religious gathering on the banks of river Ganga that heightened super-spreader fears.\n\n\"It is understood that people are angry and in pain, but the government is trying its best to extend all possible help. BJP-rules states are in the forefront,\" they say. The Yogi Adityanath-led Uttar Pradesh government, for instance, has launched a special drive in the villages to trace, test and treat on a large scale.\n\nThe leaders accuse opposition-ruled states of \"playing politics\" at this hour of crisis and putting their failure at the door steps of the Centre - they name Delhi and Maharashtra.\n\n\"Despite public health being state subject, the Central government has been proactive in Covid management as a pandemic requires national level coordination and substantial resources,\" Union Minister Prakash Javadekar has written in a column in The Indian Express.",
    "Title": "Worry Within BJP, RSS Over Covid Mismanagement, Electoral Impact: Sources"
  },
  {
    "Date": "Mon, 10 May 2021 03:42:42 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/03/Nitin-Gadkari.jpg",
    "Link": "https://indianexpress.com/article/india/no-politics-in-social-service-help-allgadkari-to-bjp-workers-7308969/",
    "Text": "Union minister and BJP MP Nitin Gadkari on Sunday appealed to BJP workers to not play politics while doing social service and asked them to reach out to people with all possible help in the time of the pandemic.\n\nAddressing the party workers virtually at the conclusion of the BJP Nagpur executive meeting, the senior BJP leader said no one knows the post-COVID future, and one should “think for the best and prepare for the worst”.\n\nHe also asked the party workers to diligently follow the pandemic protocols, saying the BJP has lost many workers this time. “Don’t do politics in social service as only the good work done by you will credit the workers as well as the BJP.\n\nSocial work should be done in the interest of the people. Politics does not only mean to be in power, but it is social work and nationalism. “We should stand with society and the poor without thinking about caste, religion or party and help all, which will surely bear fruits for the BJP in the future through this good work,” he said.\n\nGadkari said no one should step out of his or her house without any valid reason and always wear a face mask, maintain social distance and follow all protocols of the pandemic. “You should first start following these protocols before asking the people to do so through the word of mouth,” he said. Gadkari further said many public representatives and corporators have expressed their desire to open hospitals and COVID centres.\n\n“However, this is a very risky work because someone might get infected again… mistakes may happen while administering injection or oxygen and a huge problem will arise if someone loses life in this process,” he said and advised that the number of beds be increased in the existing hospitals only.\n\n“It will be better if such COVID centres are opened by the existing hospitals only as they have the required number of doctors, nurses and staff for the purpose,” he added. During his address, Gadkari praised three local BJP workers for helping people by providing them with oxygen cylinders and concentrators.\n\nGadkari also asked the party workers to focus on arranging blood and plasma without holding any blood donation camps. He said blood and plasma can be arranged from donors from their respective wards in limited numbers in blood banks.\n\nGadkari also asked the party workers to arrange well-equiped ambulance services and vehicles for carrying dead bodiesin every district in the Vidarbha region in east Maharashtra. The Nagpur MP appealed to the party workers to arrange for food and medicines for their colleagues who are in need and focus on helping senior citizens with water and other things at vaccination camps.\n\nAppealing to the party workers to not take the pandemic lightly, Gadkari asked them to work through video conferencing and use mobile phones for communication.",
    "Title": "No politics in social service, help all:Gadkari to BJP workers"
  },
  {
    "Date": "Mon, 10 May 2021 03:41:22 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/05/Banner-image-4.jpg",
    "Link": "https://indianexpress.com/article/india/west-bengal-woman-raped-by-2-men-she-accompanied-to-tikri-skm-says-action-taken-against-guilty-7308991/",
    "Text": "The Samyukta Kisan Morcha on Sunday said it had zero tolerance towards violence against women amidst reports that a woman activist from West Bengal on her way to join the farmers protest was assaulted and subsequently died of Covid-19 related complications.\n\nIn a statement, the outfit said, the incident of sexual harassment and assault against the woman has been reported on social media sites, and the farmers group wanted to make it clear that strict action has been taken against those found guilty.\n\n“The Samyukta Kisan Morcha (SKM) makes it abundantly clear that it stands with the struggle for justice for our deceased woman colleague. SKM has already taken strict action against the accused in this case and we are committed to take this fight for justice to its logical conclusion,” it said.\n\nThe farmers group said the case concerns the 26-year-old woman who came from West Bengal along with some persons posing to be “Kisan Social Army” members.\n\nShe was assaulted by some of these persons on the way to Delhi and after reaching Tikri border. A week later, she developed high fever and was found to be Covid-19 positive. She was admitted to a private hospital in Bahadurgah. Sadly, on April 30, she passed away due to Covid-19.\n\n“When this came to the notice of the SKM, we decided to take strictest possible action. Four days ago, the Tikri committee of SKM had already removed the tents and banners of the so called ‘Kisan Social Army’. The accused were also barred from participating in the movement and public appeal was issued for their social boycott,” the statement stated.\n\nThe SKM added that the Kisan Social Army was never the authorised social media voice of the farmers group and none of its handles have anything to do with the movement.\n\nMeanwhile, the Haryana Police on Sunday formed a special investigation team after the woman’s father alleged that she was raped when she had gone to the border point with some members of an outfit supporting the protest against the Centre’s new farm laws.\n\nSix people, including the two prime accused, have been named in an FIR registered in the case following a complaint from the father on Saturday, an official said.\n\nSeveral farmers are protesting against the farm laws at border points of Delhi, including Tikri and Singhu, since November last year.",
    "Title": "West Bengal woman raped by 2 men she accompanied to Tikri; SKM says action taken against guilty"
  },
  {
    "Date": "Mon, 10 May 2021 02:00:21 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2020/10/Azam-Khan-1200.jpg",
    "Link": "https://indianexpress.com/article/india/covid-positive-azam-khan-son-shifted-to-lucknow-hospital-from-sitapur-jail-officials-7308910/",
    "Text": "Senior Samajwadi Party leader Mohammad Azam Khan and his son Abdullah Khan have been shifted from the Sitapur jail to a private hospital in Lucknow for coronavirus treatment, officials said on Sunday.\n\n“Azam Khan has tested positive for COVID-19, and has moderate symptoms,” Medanta Hospital (Lucknow) Director Dr Rakesh Kapoor told PTI.\n\nOn May 2, the jail administration tried to convince Azam Khan for treatment at Lucknow’s King George’s Medical University but the SP leader refused to move out of the jail.\n\nOn Sunday, he was convinced and officials confirmed in the evening that he along with his son were headed to Lucknow’s Medanta Hospital.\n\n“Azam Khan has fever, and has been kept on four litres of oxygen. His tests are being conducted, and accordingly, his treatment will be done. His son is stable,” Kapoor said.\n\nA team of doctors from the district hospital, including Sitapur CMO Madhu Garola, had examined Azam Khan on Sunday.\n\nOfficials from the district administration explained to Azam Khan for a long time the need to take him to Lucknow for better treatment, Deputy Jailor Onkar Pandey said.\n\nAzam Khan and Abdullah were confirmed COVID-19 positive on April 30.\n\nThirteen other inmates had also tested positive for COVID-19 after they complained of fever and cough on April 29, added the deputy jailor.\n\nAzam Khan, along with his son and wife Tazeen Fatma, was lodged in the jail in February last year in connection with various cases.\n\nThe Allahabad High Court had in December granted bail to Tazeen Fatma in all 34 cases registered against her.",
    "Title": "COVID positive Azam Khan, son shifted to Lucknow hospital from Sitapur jail: Officials"
  },
  {
    "Date": "Mon, 10 May 2021 10:42:36 +0530",
    "Description": "Less than a fortnight after President Joe Biden in his conversation with PM Narendra Modi pledged his country's steadfast support for the people of India, America has responded with an unprecedented...",
    "Image": "https://c.ndtvimg.com/2021-03/4hhkvlsg_joe-biden-afp650_625x300_26_March_21.jpg",
    "Link": "https://www.ndtv.com/india-news/outpouring-of-support-from-us-for-india-covid-19-help-touches-usd-half-a-billion-2438597",
    "Text": "\"We are determined to help India in its time of need,\" President Joe Biden had said in a tweet.\n\nLess than a fortnight after President Joe Biden in his conversation with Prime Minister Narendra Modi pledged his country's steadfast support for the people of India, America has responded with an unprecedented financial assistance worth nearly USD half a billion.\n\nBiden spoke at length with PM Modi last month and conveyed solidarity with India in its fight against the viral disease. He assured the prime minister that the US and India will work closely together in the fight against COVID-19.\n\n\"Just as India sent assistance to the United States as our hospitals were strained early in the pandemic, we are determined to help India in its time of need,\" President Biden had said in a tweet.\n\nReflecting an overwhelming support for a \"natural ally\", the entire country not only the administration, but also the corporate sector which created a global task force, as well as Americans and Indian-Americans have opened their coffers for India.\n\nJust as India sent assistance to the United States as our hospitals were strained early in the pandemic, we are determined to help India in its time of need. https://t.co/SzWRj0eP3y — President Biden (@POTUS) April 25, 2021\n\nThis half a billion dollars includes USD 100 million pledged by the Biden administration, USD 70 million by pharma major Pfizer and 450,000 Remdesivir doses, the governmental purchase price of each of which in the US is USD 390.\n\nThousands of oxygen concentrators and plane loads of life saving drugs and health care equipment are flying off the United States for India almost every day.\n\nSeveral companies like Boeing and Mastercard have announced financial assistance worth USD 10 million each, Google has pledged USD 18 million, which the Global Task Force that comprises CEOs of top American companies have already pledged USD 30 million worth of life saving equipment.\n\nDescribing it as a \"Berlin Life Moment\", Mukesh Aghi of US India Strategic and Partnership Forum (USISPF), told PTI he expects the assistance to touch almost USD 1 billion by the end of the month. \"It is emotional for the diaspora, almost everyone has someone who has been touched by COVID-19,\" he said.\n\nNisha Desai Biswal, president of US India Business Council (USIBC) said, \"The outpouring of support from the United States over the past two weeks was a spontaneous mass mobilisation of support for the Indian people from across the America government, business community and diaspora community and the American people.\"\n\n\"It is unprecedented, and it reflects both the deep bonds between our two countries and the gratitude that Americans feel for the role India played in supporting the United States when we were experiencing our COVID surge last year,\" she said.\n\nHowever, given the \"speed and severity\" that have overwhelmed the capacity of hospitals and local authorities, more assistance will be needed and for a sustained period of timescale of the pandemic, Biswal said.\n\nPeople of the country and the Diaspora too have come out in large numbers. Indian-American Vinod Khosla has committed USD 10 million, top corporate leader John T Chambers has promised USD 1 million.\n\nFor the first time in its history, Sewa International has raised USD 15 million; American Association of Physicians of Indian Origin (AAPI) (USD 3.6 million), Indiaspora (USD 2.5) million and Jai Shetty has raised USD 4 million.\n\n\"There has been overwhelming support and offers of assistance from the US Government, private sector, diaspora and the American public at large. In fact, in my interactions in recent days, the US interlocutors across the board ask me, 'tell us what more we can do for India''\", India''s ambassador to the US Taranjit Singh Sandhu told PTI.\n\n\"They recall with fondness the help India gave. These are reflective of strong partnership and close people to people ties between our both nations. We deeply appreciate these gestures. We will continue to engage with the US in our collective fight against the pandemic,\" he said.\n\nAmong other major financial contributions announced include Procter and Gamble (USD 6.7 million); Merck (USD 5 million), Walmart (USD 2 million), Salesforce (USD 2.4 million), and Caterpillar (USD 3.4 million). Companies like Deloittee have announced to 12,000 oxygen concentrators to India.\n\nWhile Microsoft is partnering with the US government in providing aid and oxygen, FedEx and UPS have taken up the mantle of taking care of the transportation of life saving health care equipment like oxygen cylinders, ventilators and oxygen concentrators to India.\n\nOn Sunday, Indian-Americans from Tamil Nadu including eminent philanthropist MR Rangaswami, held a \"Help Tamil Nadu Breathe\" to raise USD 1.5 million in few hours.\n\n\"This is an incredible outpouring of generosity, which people have come to expect from America. When the world has a crisis, beyond politics, beyond dispute America steps up,\" Mr Rangaswami said.\n\n\"It is comforting to see US cargo jets with much needed medical supplies landing at the Delhi airport regularly,\" said Karun Rishi, president of the USA-India Chambers of Commerce.\n\nNoting that the stakes are very high for the entire world, he said India's success or failure to come out of this once in a century crisis will have a direct impact throughout the world.\n\nEchoing Biswal, Rishi said that more needs to be done.\n\n\"The scale of assistance to India needs to increase and speeded up. To make some reasonable impact to tide over this crisis, India may need between USD 25-USD 50 billion in assistance in the form of vaccines, technology transfer, increasing vaccines and therapeutics manufacturing capacity, medical equipment and public health measures,\" he said.",
    "Title": "Support From US For India, Covid Help Touches USD Half A Billion"
  },
  {
    "Date": "Mon, 10 May 2021 06:03:40 +0530",
    "Description": "India recorded 3,66,161 fresh COVID-19 cases in a day, which pushed the tally to 2,26,62,575, according to the Union health ministry data updated on Monday.",
    "Image": "https://c.ndtvimg.com/2021-05/ljcmp1bo_coronavirus-india-generic-hospital-afp_625x300_07_May_21.jpg",
    "Link": "https://www.ndtv.com/india-news/india-covid-latest-news-live-updates-2438498",
    "Text": "Coronavirus Updates: The number of people who have recuperated from the disease surged to 1,83,17,404.\n\nIndia recorded 3,66,161 fresh COVID-19 cases in a day, which pushed the tally to 2,26,62,575, according to the Union health ministry data updated on Monday.\n\nThe death count climbed to 2,46,116 with 3,754 daily deaths, the data updated at 8 am showed.\n\nMeanwhile, Union Minister Santosh Gangwar has written to Uttar Pradesh Chief Minister Yogi Adityanath, flagging a series of concerns including shortage of oxygen and black marketing of ventilators and other medical equipment in his constituency Bareilly --- about 250 km from state capital Lucknow. His complaints come barely a fortnight after the Chief Minister denied any scarcity of oxygen in the state's hospitals and promised strong action, including seizure of property, against people \"spreading rumours\".\n\nThere is a scarcity of oxygen in Bareilly, which he represents in parliament, Mr Gangwar said. Ventilators and other medical equipment are being sold in the black market. People in the Health department do not pick up phones, creating difficulty for Covid patients, he added.\n\nHere are the Live Updates on India Coronavirus (Covid-19 Cases) Cases:\n\nMay 10, 2021 11:15 (IST) Supreme Court hearing on vaccine policy and pricing begins\n\nMay 10, 2021 10:48 (IST) INS Trikand reaches Mumbai with two 27 MT oxygen-filled containers from Qatar.\n\n\n\n\"The ship entered Hamad Port, Qatar on May 5 and embarked maiden shipment of oxygen containers which was facilitated by French Mission as part of oxygen solidarity bridge,\" says CO Capt Harish Bahuguna\n\n\n\nMay 10, 2021 10:35 (IST) Arunachal Pradesh reports 119 new COVID-19 cases, tally rises to 20,165\n\n= Arunachal Pradesh reported 119 new COVID-19 cases, pushing the coronavirus tally in the northeastern state to 20,165, a health department official said on Monday.\n\nThe death toll remained at 60 as no fresh fatality due to the infection was reported in the last 24 hours, State Surveillance Officer Dr Lobsang Jampa said.\n\nThe Capital Complex region recorded the maximum number of fresh cases at 68, followed by Changlang (13), eight each from Lower Dibang Valley and Papumpare and seven from Tawang, the official said.\n\nMay 10, 2021 09:58 (IST) Coronavirus News: India Records 3,66,161 New COVID-19 Cases, 3,754 Deaths\n\n\n\nIndia recorded 3,66,161 fresh COVID-19 cases in a day, which pushed the tally to 2,26,62,575, according to the Union health ministry data updated on Monday. The death count climbed to 2,46,116 with 3,754 daily deaths, the data updated at 8 am showed. India recorded 3,66,161 fresh COVID-19 cases in a day, which pushed the tally to 2,26,62,575, according to the Union health ministry data updated on Monday. The death count climbed to 2,46,116 with 3,754 daily deaths, the data updated at 8 am showed.\n\nMay 10, 2021 09:54 (IST) Police baton charge and seize vehicles of the violators in Shivamogga and Kalaburagi as a 14-day state-wide lockdown begins today. Karnataka | Police baton charge & seize vehicles of the violators in Shivamogga & Kalaburagi as a 14-day state-wide lockdown begins today. #COVID19pic.twitter.com/2E4E3HOVF0 - ANI (@ANI) May 10, 2021 Police baton charge and seize vehicles of the violators in Shivamogga and Kalaburagi as a 14-day state-wide lockdown begins today.\n\nMay 10, 2021 09:50 (IST) Coronavirus: Karnataka Issues Fresh Guidelines For Hospitalisation, Discharge Of Covid Patients\n\n\n\nAmid a sharp rise in the number of COVID-19 cases in the state, the Karnataka government on Sunday issued new guidelines for hospital admission, discharge, and transfer of COVID-19 patients. A circular issued by Karnataka's Department of Health and Family Welfare read, \"In view of the surge in COVID-19 cases in the State, for the management of the COVID-19 pandemic, hospital beds are a valuable resource and hence, shall be used judiciously for those patients who are clinically in need of these beds. In this context, the guidelines are reiterated for hospital admission, discharge, and transfer of COVID-19 patients.\"\n\n\n\nMay 10, 2021 09:23 (IST) COVID-19: Centre Issues Advisory To Manage Black Fungus Infection In Covid Patients\n\n\n\nMucormycosis, a fungal infection being found in COVID-19 patients with uncontrolled diabetes and prolonged intensive care unit (ICU) stay, may turn fatal if uncared for, the Centre said on Sunday. In an advisory, it also said the fungal infection mainly affects people who are on medication that reduces their ability to fight environmental pathogens. Mucormycosis, a fungal infection being found in COVID-19 patients with uncontrolled diabetes and prolonged intensive care unit (ICU) stay, may turn fatal if uncared for, the Centre said on Sunday. In an advisory, it also said the fungal infection mainly affects people who are on medication that reduces their ability to fight environmental pathogens.\n\nMay 10, 2021 09:07 (IST) Delhi Metro rail services to remain temporarily suspended till May 17. Delhi: Metro rail services to remain temporarily suspended till 5 am on 17th May, as the national capital enters into an extended period of lockdown with strict restrictions#COVID19pic.twitter.com/QUY6crpdZW - ANI (@ANI) May 10, 2021 Delhi Metro rail services to remain temporarily suspended till May 17.\n\nMay 10, 2021 08:54 (IST) Chinese Scientists Discussed Weaponising Coronavirus In 2015: Report\n\n\n\nA document written by Chinese scientists and health officials before the pandemic in 2015 states that SARS coronaviruses were a \"new era of genetic weapons\" that could be \"artificially manipulated into an emerging human disease virus, then weaponised and unleashed, reported Weekend Australian. A document written by Chinese scientists and health officials before the pandemic in 2015 states that SARS coronaviruses were a \"new era of genetic weapons\" that could be \"artificially manipulated into an emerging human disease virus, then weaponised and unleashed, reported Weekend Australian.\n\nMay 10, 2021 08:40 (IST) Vaccination Only Long-Term Solution To India's Covid Crisis: Dr Fauci\n\n\n\nGetting people vaccinated is the only long-term solution to the current COVID-19 crisis in India, America's top public health expert Dr Anthony Fauci said on Sunday as he called for scaling up manufacturing of coronavirus vaccines both domestically and globally to fight the deadly pandemic. Getting people vaccinated is the only long-term solution to the current COVID-19 crisis in India, America's top public health expert Dr Anthony Fauci said on Sunday as he called for scaling up manufacturing of coronavirus vaccines both domestically and globally to fight the deadly pandemic.\n\nMay 10, 2021 08:35 (IST) Medical aid including 1,300 oxygen concentrators, 400 ventilators, and other medical equipment from Israel arrived at Hindon Air Base in Ghaziabad.\n\nMedical aid including 1,300 oxygen concentrators, 400 ventilators, and other medical equipment from Israel arrived at Hindon Air Base in Ghaziabad.\n\nMay 10, 2021 08:23 (IST) 'COVID curfew to be imposed in Uttarakhand from 6am on May 11 till 6am on May 18; shops selling fruits, vegetables, dairy items to remain open from 7am-10am, shopping malls, market complexes, gyms, theatres, assembly halls, bars, liquor shops to remain closed until further orders pic.twitter.com/nRC9GdRQmo - ANI (@ANI) May 10, 2021\n\nMay 10, 2021 08:10 (IST) Coronavirus News: Assam reported 3,299 new COVID-19 cases\n\nAssam reported 3,299 new #COVID19 cases, 4,045 recoveries and 48 deaths.\n\n\n\nTotal cases: 2,92,368\n\nTotal recoveries: 2,53,340\n\nDeath toll: 1,676\n\n\n\nActive cases 36,005 pic.twitter.com/UiFze1XV1s - ANI (@ANI) May 9, 2021\n\nMay 10, 2021 07:37 (IST) Guru Tegh Bahadur COVID-19 care centre to begin operation with 300 beds today. Delhi: Guru Tegh Bahadur COVID care centre to begin operation with 300 beds today.\n\n\n\n\"I thank Amitabh Bachchan for his contribution of Rs 2 crores to the facility. He also said 'Sikhs are Legendary',\" said President, Delhi Sikh Gurdwara Management committee\n\n\n\nVisuals from yesterday pic.twitter.com/ulRWfeCiP9 - ANI (@ANI) May 10, 2021 Guru Tegh Bahadur COVID-19 care centre to begin operation with 300 beds today.\n\nMay 10, 2021 07:10 (IST) Coronavirus: Haryana Extends COVID-19 Lockdown Till May 17\n\n\n\nIn order to contain the COVID outbreak, Haryana on Sunday extended lockdown for another week starting from May 10 to May 17, said the state government, adding that the state will observe the period as ''Surkshit Haryana''. \"To contain the spread of the COVID pandemic, the restrictions are imposed for another one week that is from May 10, 2021 (05:00 am onwards) to May 17, 2021 (till 05:00 am) in the State of Haryana. The period is to be observed as Mahamari Alert-Surakshit Haryana,\" reads the order. In order to contain the COVID outbreak, Haryana on Sunday extended lockdown for another week starting from May 10 to May 17, said the state government, adding that the state will observe the period asHaryana''. \"To contain the spread of the COVID pandemic, the restrictions are imposed for another one week that is from May 10, 2021 (05:00 am onwards) to May 17, 2021 (till 05:00 am) in the State of Haryana. The period is to be observed asAlert-Haryana,\" reads the order.\n\nMay 10, 2021 07:05 (IST) Why Tax Vaccines, Nirmala Sitharaman Explains After Mamata Banerjee Note\n\nFinance Minister Nirmala Sitharaman on Sunday said that a 5 per cent tax on vaccines and 12 per cent on medicines and oxygen concentrators was necessary to keep costs low, after a new appeal by West Bengal Chief Minister Mamata Banerjee to waive these fees given India's coronavirus crisis.\n\n\"If full exemption from GST (Goods and Services Tax) were given, the domestic producers of these items would be unable to offset taxes paid on their inputs and input services and would pass these on to the end consumers by increasing their price,\" she explained in a string of 16 tweets.\n\nMay 10, 2021 06:33 (IST) COVID-19: Rajasthan Chief Minister calls for strict enforcement of lockdown from May 10-24\n\nRajasthan Chief Minister Ashok Gehlot on Sunday asserted that the state-wide lockdown from May 10 to May 24 should be strictly followed.\n\n\"There should not be any kind of laxity in enforcing the lockdown. Whoever violates the guideline, strict action should be taken against them,\" he said in a statement.\n\n\n\nThe Chief Minister said along with all efforts for investigation, treatment, vaccination and expansion of resources, the government will strictly follow the coronavirus-induced lockdown to prevent the spread of the infection. Without this, it is not possible to stop this deadly wave, he said.\n\n\n\nHe also conducted a high-level review on COVID-19 situation, lockdown and availability of resources.\n\nMay 10, 2021 06:05 (IST) COVID-19: Over 38 lakh COVID-19 vaccine doses administered in Delhi so far\n\nDelhi's cumulative COVID-19 vaccination coverage exceeded 38 lakh doses, informed the Delhi government on Sunday.\n\n\n\nAccording to the vaccination bulletin issued by the Delhi government, as many as 38,96,551 COVID-19 vaccine doses been administered across the national capital since the commencement of the vaccination drive on January 16, while 1,28,441 doses were administered on May 8.\n\n\n\n\"Vaccine doses received till date from the Government of India supply for beneficiaries above 45 years, frontline workers and healthcare workers stands at 43,20,490. Out of which, 38,53,300 doses have been utilised till date,\" the bulletin said.\n\n\n\nThe balance stock left with the Delhi government is 4,67,190 doses, it pointed out.",
    "Title": "Supreme Court Hearing On Vaccine Policy, Pricing"
  }
]