[
  {
    "Date": "Thu, 06 May 2021 10:00:00 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/life-style/health-fitness/web-stories/coronavirus-rt-pcr-test-reason-behind-a-negative-rt-pcr-test-despite-having-covid-symptoms/photostory/82406963.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82406963.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>Recent reports have suggested that many individuals, who happen to experience mild to severe COVID symptoms, are testing negative for the infection.",
    "Image": "https://static.toiimg.com/thumb/msid-82407409,width-900,height-1200,imgsize-170283,resizemode-6.cms",
    "Link": "https://timesofindia.indiatimes.com/life-style/health-fitness/web-stories/coronavirus-rt-pcr-test-reason-behind-a-negative-rt-pcr-test-despite-having-covid-symptoms/photostory/82406963.cms",
    "Text": "RT-PCR tests: The gold standard for COVID testing\n\nOne of the best ways to get an accurate COVID-19 test result is through an RT-PCR test, which is currently the gold standard of COVID testing.",
    "Title": "Reasons why you get false negatives right now"
  },
  {
    "Date": "Thu, 06 May 2021 07:00:00 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/life-style/relationships/web-stories/reasons-why-you-must-date-a-mismatched-person/photostory/82405446.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82405446.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>Reasons why you must date a 'mismatched' person",
    "Image": "https://static.toiimg.com/thumb/msid-82406131,width-900,height-1200,imgsize-1270977,resizemode-6.cms",
    "Link": "https://timesofindia.indiatimes.com/life-style/relationships/web-stories/reasons-why-you-must-date-a-mismatched-person/photostory/82405446.cms",
    "Text": "Getting out of comfort zones\n\nBeing with a polar opposite can help you get out of your comfort zone if you are afraid of doing something other than your usual routine.",
    "Title": "Reasons to date a 'mismatched' person"
  },
  {
    "Date": "Thu, 06 May 2021 00:05:47 +0000",
    "Description": "The state, which lifted all its pandemic restrictions in March, has seen a 21 percent increase in its daily new-case average in recent weeks.",
    "Image": "https://static01.nyt.com/images/2021/05/03/us/03virus-broiefing-arizona2/03virus-broiefing-arizona2-facebookJumbo.jpg",
    "Link": "https://www.nytimes.com/2021/05/04/us/covid-arizona-surge.html",
    "Text": "While most of the United States has seen a steady decline in new coronavirus cases recently, Arizona has been an outlier.\n\nThe state has not been swamped with another virus wave, but public health experts are worried about a steady increase in cases and hospitalizations. As of Tuesday, Arizona’s daily average had climbed 19 percent in the last two weeks, the second largest rise in the nation over that period after Wyoming. Only four other states reported increases of more than 10 percent in that time: Washington, Hawaii, Arkansas and Oregon.\n\nArizona’s daily new case load, at 10 per 100,000 people, is still below the national average of 14 per 100,000. Over the last 14 days, as federal health officials have suggested that the virus’s trajectory is improving, the country has seen a 26 percent decrease in new coronavirus cases, and 27 states have seen declines of 15 percent or more, according to a New York Times database.",
    "Title": "New Covid Cases in Arizona Are Up 21 Percent in Two Weeks"
  },
  {
    "Date": "Thu, 06 May 2021 00:20:35 +0000",
    "Description": "President Biden, facing a slowing rate of vaccinations and a hope for near normalcy by Independence Day, said the government would shift from mass vaccination sites to local settings.",
    "Image": "https://static01.nyt.com/images/2021/05/04/us/politics/04dc-virus-biden/04dc-virus-biden-facebookJumbo.jpg",
    "Link": "https://www.nytimes.com/2021/05/04/us/politics/biden-vaccination-strategy.html",
    "Text": "WASHINGTON — President Biden, confronting lagging vaccinations that threaten his promise of near normalcy by July 4, on Tuesday overhauled the strategy to battle the pandemic, shifting from mass vaccination sites to more local settings to target younger Americans and those hesitant to get a shot.\n\nIn a speech at the White House, Mr. Biden said he was launching a new phase in the fight against the coronavirus, with a goal of at least partly vaccinating 70 percent of adults by Independence Day and with a personal plea to all of the unvaccinated: “This is your choice. It’s life and death.”\n\nAfter three months of battling supply shortages and distribution bottlenecks, the Biden administration is confronting a problem that the president said was inevitable: Many of those who were most eager to get vaccinated have already done so. Vaccination sites at stadiums once filled with carloads of people seeking shots are closing, and states that once clamored for more vaccines are finding that they cannot use all of the doses that the federal government wants to ship to them.\n\nYet the administration’s own health experts say tens of millions more Americans must be vaccinated before the infection rate is low enough to return to what many people consider ordinary life.",
    "Title": "Biden Shifts Vaccination Strategy in Drive to Reopen by July 4"
  },
  {
    "Date": "Thu, 06 May 2021 10:50:15 +0530",
    "Description": "It’s a long road to recovery for people testing positive in this second wave of COVID-19. Trusty transistors, well-thumbed Harry Potter books, and family on constant video calls is what got them by",
    "Image": "https://th.thgim.com/life-and-style/2ay19y/article34495948.ece/ALTERNATES/FREE_960/covid-patients",
    "Link": "https://www.thehindu.com/life-and-style/coronavirus-covid-19-india-patients-dealing-isolation-anxiety-mental-health-with-hobbies-and-family-support/article34495949.ece",
    "Text": "It’s a long road to recovery for people testing positive in this second wave of COVID-19. Trusty transistors, well-thumbed Harry Potter books, and family on constant video calls is what got them by\n\nComfort in reading old favourites\n\nMallik Thatipalli, content writer\n\nThe only driving forces that kept me strong were my mother, wife and sister. Every day as I felt weak and fatigued, I’d tell myself, I have to be strong for them and fight it out. I wasn’t in a frame of mind to read a new book, so I started re-reading the Harry Potter series, followed by Ayn Rand and the Inheritance series. I also re-watched The Lord Of The Rings and The Hobbit. All this even though I knew that Sauron and Voldemort would be defeated, I just wanted to go back to those familiar scenes.\n\nThe other most important thing my family did was to be on video most of the time; it was our way of being connected. Since my wife and I both tested positive, it was my mother who kept a watch on us. She would keep the video on in the kitchen while she worked, so that was like our window to the world outside.\n\nLeading change from a hospital bed\n\nSai Ram, marketing professional\n\nAs I work with a hospital, I was busy even while I was admitted there after testing positive. I was constantly on the phone, replying to various queries on beds, vaccine and medication. When I was not able to talk, I was messaging. Being on a hospital bed and battling the virus made me understand the plight of the people seeking help and I couldn’t turn my back. This also helped me feel stronger and diverted my attention.\n\nWe’re in this together, on video call\n\nSajan Pookkodan, communication professional\n\nAfter testing positive, I assured myself that I will be fine. I reminded myself of having the privilege of a safety net in the form of supportive friends even though I was away from my family. Staying connected with my wife and daughter through video calls kept me happy. We also made a pact that as a family we would be honest with each other about our feelings and well being. My friends kept me engaged with jokes and chats, jumping in to help with whatever I needed. A strong support system is very important to keep you in the right frame of mind.\n\nNothing beats Telugu music, not even COVID-19\n\nVanaja C, journalist\n\nI spent many days in three different ICUs. Right now, I am home and recovering, but with limited limb function. While in the hospital my friends advised me to practise Vipasana, they sent me chants, verses from the Gita, and suggested meditative music. I tried them all and honestly, I found them depressing. Instead, I found my mojo in popular Telugu film songs; their upbeat music made me feel alive — I wanted to break into a dance even in my bed. I insisted on doing some basic exercise. Calming music and meditation didn’t work for me. Everybody is different, so one should be allowed to listen and watch whatever gives them joy.\n\nTransistor by my side\n\nDharma Kanta Sharma, retired teacher\n\nI am 81 years old and am not a big fan of music, but I do have a transistor by my bedside right now just to listen to the political discussions. News is depressing. But since I like reading, I finished Ashwin Sanghi’s Chanakya’s Chant. That book was gripping and made me forget my lethargy. I read Sanghi’s The Rozabal Line too. I also call my daughters and friends to check on their well-being and also use the opportunity slyly to ask them if I sound feeble.\n\nVadivelu memes will save us\n\nBakiya Sri, analyst\n\nWhen my mother, brother and I tested positive we preferred home quarantine. We stayed in our respective rooms and decided to stay away from news bulletins. We also spoke to each other from our rooms instead of communicating through phone. I sailed through my isolation days with Vadivelu memes and jokes.\n\nSeven days after we were allowed to mingle with each other, we played a lot of board games. As a household that survived COVID-19, my request to others is, be kind to those who are sick. That really lifts up their spirits. I am actively talking to my friends who have the virus now. I want to keep them motivated and do whatever cheers them up.\n\nI needed to\n\nfeel like myself again\n\nShilpa Nainani, emcee\n\nCal Newports’s book Deep Work was my companion at night when I couldn’t sleep. During the day when I was not coughing, I was on call with my parents and niece. My husband and I both tested positive, so I had company in isolation. I am also part of an NLP group that shared motivational speeches and conducted virtual community meetings. It gave me the push to get dressed, do my hair and wear my earrings, so I could feel like myself again. By the 12th day, I got onto social media to see how I could be of help to others.\n\nSame hospital, different rooms\n\nVenugopal N, journalist\n\nWhen I was hospitalised, I kept myself focussed and positive to recover for my wife. COVID-19 hit her severely and I was only focussing on her recovery. For a week, we couldn’t see each other even though we were in the same hospital. That was very frustrating. To distract myself, I read Bahula by A Appala Naidu, a 500-page socio-historical fiction based in Srikakulam, Andhra Pradesh.",
    "Title": "‘These COVID-19 patients coped with isolation and anxiety in their own uplifting ways’"
  },
  {
    "Date": "Thu, 06 May 2021 01:07:04 +0530",
    "Description": "Kawasaki Versys’ engine is its crowning jewel, to say nothing of its impressive handling and comfortable seating",
    "Image": "https://th.thgim.com/entertainment/movies/jup5gv/article34487681.ece/ALTERNATES/FREE_960/1DSC2641",
    "Link": "https://www.thehindu.com/life-and-style/motoring/versys-1000-makes-for-a-breezy-ride/article34487682.ece",
    "Text": "Kawasaki Versys’ engine is its crowning jewel, to say nothing of its impressive handling and comfortable seating\n\nEvery time I step off an adventure tourer, I am left with a sense of conviction about their aptness for our roads. They have the ability to gobble serious miles without compromising on comfort and also have a touch of sportiness sewn in. And that is where motorcycles like the Kawasaki Versys 1000 appear to make a strong case for themselves.\n\nThe Design\n\nFirstly, it is the sheer size of the Kawasaki Versys 1000 that captures your attention, leaving you a little intimidated as well. With its new ZX-6R inspired face, the Versys 1000 is a little easier on the eyes, but it is still not what you would call pretty.\n\nStep to the side and it becomes even more apparent that this motorcycle is built to chew miles all day long. The 21-litre tank, massive fairing and spacious seating are all indicative of the Versys’ touring orientation. But there is no getting away from the fact that the bodywork is so huge that the relatively small 17-inch wheels make the motorcycle appear disproportionate, despite running sport-bike tyre sizes.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe other advantage of so much real estate is what is possibly the roomiest and comfiest rider and pillion seat in the class. The ergonomics are pretty relaxed, with a slightly pared-back footrest and an easy reach to the bar. That, along with the windscreen, takes the fatigue out of spending a whole day in the saddle.\n\nEngine & Performance\n\nThe Versys’ engine is the crowning jewel of the whole package; it is the same engine that also powers the Ninja 1000SX, however, it makes less power and torque in the Versys. Nevertheless, 120hp and 102Nm are decent figures.\n\nWhen you fire up the engine, the sweet hum at idle feels like the calm before the storm. Once on the move, the loud intake howl is accompanied by a surge in acceleration that belies this motorcycle’s size and weight. You get to unmentionable speeds in no time and the engine doesn’t feel strained at any point. Slot the slick gearbox in sixth, and the Versys transforms into an effortless cruiser with enough juice in reserve to pull a quick overtake, sometimes even without down-shifting. Even in the city, the engine’s tractability and heat management is impressive, making it capable of dealing with a city commute, if necessary.\n\nThe 2019 update to the Versys 1000 also brought in IMU assisted, three-step traction control (TC) and lean-sensitive ABS. Adding another layer of safety are the two power modes — Full and Low. The ‘Low’ mode chops power down to 75% and also softens the power delivery. This makes riding this big Kawasaki quite easy, whether in the wet or dry. However, we did find the TC to be too intrusive in some situations and it cuts power rather abruptly. A smoother throttle action does help to an extent, but Kawasaki needs to refine the system further so that it doesn’t upset the chassis the way it currently does on loose and slippery surfaces.\n\nHandling\n\nIt is not just the performance but also the way this 255kg motorcycle handles that impresses. Get past the initial trepidation of riding a tall motorcycle and you will be surprised to see how well this motorcycle takes to the bends. There is oodles of grip and feedback through the chassis while the 17-inch wheels make life easy during quick direction changes.\n\nThe suspension does a pretty good job of absorbing undulations, and the ride quality over bad roads is comfortable enough despite the firm edge. Adjustability, however, is limited and one can tune the 43mm fork and monoshock for preload and rebound only.\n\nFor those wondering if they should wander off-road on this Versys, the motorcycle can only handle a mild trail. Because, the 17-inch wheels, fat tyres and 150mm of ground clearance aren’t encouraging specifications to venture off the beaten path. The 310mm discs do a good job of hauling down the motorcycle to a stop while the ABS is well-calibrated to prevent unnecessary intervention.\n\nVerdict\n\nAt ₹11.44 lakh, the Kawasaki Versys 1000 is nothing but a steal for the kind of performance it offers. Not to mention the sweet sound and character of an inline-four engine. In fact, at this price point, its biggest competition comes from its sibling the Ninja 1000SX. It may not have the ergonomics, suspension travel and all-day comfort of the Versys 1000 but it is more powerful and better equipped. That said, the Versys offers unbeatable value for someone looking for a supremely comfortable and fast road-biased touring motorcycle.",
    "Title": "Why the Versys 1000 makes for a breezy ride"
  },
  {
    "Date": "Thu, 06 May 2021 08:00:00 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/life-style/food-news/can-eating-alkaline-foods-kill-coronavirus/photostory/82408032.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82408032.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>. In the current scenario, when everyone is finding ways to get rid of novel COVID19 virus, there are people claiming that alkaline foods can help kill the virus.",
    "Image": "https://static.toiimg.com/photo/82408051.cms",
    "Link": "https://timesofindia.indiatimes.com/life-style/food-news/can-eating-alkaline-foods-kill-coronavirus/photostory/82408032.cms",
    "Text": "pH refers to a scale to specify the acidity or basicity of an aqueous solution. Acidic solutions are measured to have lower pH values than basic or alkaline solutions. In the digestion process, our stomach secretes gastric acids, which help in breaking down the food and our stomach has a pH balance that ranges from 2.0 to 3.5, which is highly acidic but is considered necessary for the process of digestion. And when you eat foods that are highly acidic in nature, they cause discomfort and the acidic levels in the body go haywire, leading to acidity, acid refluxes, and other gastric issues. In the current scenario, when everyone is finding ways to get rid of the novel COVID19 virus, there are people claiming that alkaline foods can help kill the virus. (Image: istock)",
    "Title": "Eating alkaline food kills Coronavirus?"
  },
  {
    "Date": "Thu, 06 May 2021 09:00:00 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/if-you-cannot-do-this-in-90-seconds-your-heart-might-be-in-danger/articleshow/82407575.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82407575.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>As per the World Heart Organisation, heart disease is one of the major causes of deaths worldwide.",
    "Image": "https://static.toiimg.com/thumb/msid-82407575,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-964092/82407575.jpg",
    "Link": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/if-you-cannot-do-this-in-90-seconds-your-heart-might-be-in-danger/articleshow/82407575.cms",
    "Text": "As per the World Heart Organisation, heart disease is one of the major causes of deaths worldwide. Heart disease can happen at any age, but the risk increases with age. But not many people come to know about their heart issues on time as the conventional methods to measure heart health are expensive and time-consuming.Well, there is one test that you can do at home and will take less than one minute. Read this article to know the easy method to test your heart at home.People with a healthy heart should be able to climb four fleets of stairs in 45 seconds, says new research published in December 2020.The study looked at 165 symptomatic patients who were recommended testing because of known or suspected coronary artery disease. These people were asked to do a strenuous bout of exercise and then were asked to rest for 15 to 20 minutes and then were quickly asked to climb four flights of stairs (60 stairs) without any break and also without running.The time was recorded and their exercise capacity was measured as metabolic equivalents (METs), which is defined as the amount of oxygen consumed while resting.It was found that patients who claim the stairs in less than 40-45 seconds achieved more than 9 to 10 METs, a rate that is linked with lower mortality.If it takes you more than one minute 30 seconds to climb 60 stairs, your health is sub-optimal and you must consult a doctor. People who took more than 90 seconds or longer to climb the stairs achieved less than 8 METs, which translates to a mortality rate of 2 to 4 per cent per year.The images of the patient's hearts during the exercise test to assess their cardiac function. For people who took more than 90 seconds or more, 58 per cent of these had abnormal heart function.Heart disease is not something only seniors have to worry about. The risk for men increases after the age of 45, while for women the risk increases after the age of 50.As per a 2016 study from the American Heart Association, 45 per cent of heart attacks are silent, meaning they occur without symptom. This makes taking care of heart health even important.Silent heart attacks are as bad as a heart attack that is recognised while it is happening.",
    "Title": "The simple 90 second heart test"
  },
  {
    "Date": "Thu, 06 May 2021 10:00:00 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/life-style/fashion/style-guide/chanel-brings-back-jodhpuri-pants/articleshow/82408027.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82408027.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>Virginie Viard showcased  Chanel's Cruise 2021/22 show in Provence and we could see the revival of our very own Jodhpuri pants on the runway.",
    "Image": "https://static.toiimg.com/thumb/msid-82408027,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-716926/82408027.jpg",
    "Link": "https://timesofindia.indiatimes.com/life-style/fashion/style-guide/chanel-brings-back-jodhpuri-pants/articleshow/82408027.cms",
    "Text": "There was a time when every Indian menswear designer made Jodhpuri pants, and it sold like hot cakes with male celebrities wearing these puffed-thigh trousers. They teamed them with their bandhgalas and shirts for red carpet events and weddings. A decade ago this trend was a hit, but gradually it faded away with more men opting for fitted trousers with their bandhgalas and tuxedos. But now, it seems we will soon be witnessing the resurgence of Jodhpuri pants in fashion. And this time it will have a gender-neutral style. French fashion designer and Chanel's creative director Virginie Viard showcased Chanel's Cruise 2021/22 show in Provence and we could see the revival of our very own Jodhpuri pants on the runway. Models sauntered down the runway in a new feminine interpretation of the tweed jacket, worn with fluid jodhpurs and patent glove booties.Indian designers like Raghavendra Rathore and Rohit Kamra have been making these trousers for their patrons. Couturier Rohit Bal has also been a fan of Jodhpuri trousers since most of his menswear collection had these pants with jackets and bundis. Designer duo Shantanu and Nikhil's latest collection for S&N by Shantanu And Nikhil also saw a lot of breeches and Jodhpuri pants on female models.\"Equestrian fashion is going big this season and therefore we can see its influence around. With Chanel bringing back the Jodhpuri trousers, the other designers will follow suit,\" opines menswear designer Dhruv Vaish.\"What should be kept in mind is that while we give our heads up to Jodhpuri trousers again, we should style it keeping the latest trend in mind. I would love to see a man wearing Jodhpuri pants with a crop top since they are in vogue these days,\" quips designer and stylist Anvita Sharma.What do you peeps have to say about the resurgence of Jodhpuri trousers? Tell us in the comment section below.",
    "Title": "Chanel brings back Jodhpuri pants"
  }
]