[
  {
    "Date": "Mon, 10 May 2021 02:02:43 +0000",
    "Description": "The comments from President Biden’s chief medical adviser came just two days after the C.D.C. belatedly highlighted the danger of airborne transmission.",
    "Image": "https://static01.nyt.com/images/2021/05/09/world/09virus-briefing-indoor-masks1/09virus-briefing-indoor-masks1-facebookJumbo.jpg",
    "Link": "https://www.nytimes.com/2021/05/09/world/fauci-indoor-mask-mandates.html",
    "Text": "Dr. Anthony S. Fauci said on Sunday that he was open to relaxing indoor masking rules as more Americans get vaccinated against the virus, just two days after the Centers for Disease Control and Prevention belatedly emphasized the danger of airborne transmission.\n\nDr. Fauci, President Biden’s chief medical adviser for the pandemic, said that as vaccinations climb, “we do need to start being more liberal” in terms of rules for wearing masks indoors, though he noted that the nation was still averaging about 43,000 cases of the virus daily. “We’ve got to get it much, much lower than that,” he said.\n\nOn Friday, the C.D.C. updated its guidance about how the coronavirus spreads, stating explicitly that people can inhale airborne virus even when they are more than six feet away from an infected individual. Previously, the agency had said that most infections were acquired through “close contact, not airborne transmission.”\n\nThe update brought the agency in line with evidence of the danger from airborne droplets that epidemiologists had noted as the pandemic unfolded last year, and, according to some experts, also underscored the urgency for the federal Occupational Safety and Health Administration to issue standards for employers to address potential airborne hazards in the workplace.",
    "Title": "Fauci Says Indoor Mask Guidance Should Ease With Vaccinations"
  },
  {
    "Date": "Mon, 10 May 2021 03:05:39 +0000",
    "Description": "Psilocybin and MDMA are poised to be the hottest new therapeutics since Prozac. Universities want in, and so does Wall Street. Some worry a push to loosen access could bring unintended consequences.",
    "Image": "https://static01.nyt.com/images/2021/05/08/science/08PSYCHEDELICS3b/08PSYCHEDELICS3b-facebookJumbo.jpg",
    "Link": "https://www.nytimes.com/2021/05/09/health/psychedelics-mdma-psilocybin-molly-mental-health.html",
    "Text": "Dr. Doblin’s organization, MAPS, is largely focused on winning approval for drug-assisted therapies and promoting them around the globe, but it is also pushing for the legalization of psychedelics at the federal level, though with strict licensing requirements for adult recreational use.\n\nNumerous studies have shown that classic psychedelics like LSD and psilocybin are not addictive and cause no organ damage in even high doses. And contrary to popular lore, Ecstasy does not leave holes in users’ brains, studies say, nor will a bad acid trip lead to chromosome damage.\n\nBut most scientists agree that more research is needed on other possible side effects — like how the drugs might affect those with cardiac problems. And while the steady accumulation of encouraging data has softened the skepticism of prominent scientists, some researchers warn against the headlong embrace of psychedelics without stringent oversight. Although “bad trips” are rare, a handful of anecdotal reports suggest that psychedelics can induce psychosis in those with underlying mental disorders.\n\nDr. Michael P. Bogenschutz, a professor of psychiatry who runs the four-month-old Center for Psychedelic Medicine at NYU Langone Health, said most of the clinical studies to date had been conducted with relatively small numbers of people who were carefully vetted to screen out those with schizophrenia and other serious mental problems.\n\nThat makes it hard to know whether there will be potential adverse reactions if the drugs are taken by millions of people without any guidance or supervision. “I know it sounds silly but, Kids, don’t take these at home,” Dr. Bogenschutz said. “I would just encourage everyone to not get ahead of the data.”\n\nThe Rush to Invest\n\nPsychedelics are suddenly awash in money.\n\nDr. Doblin can remember when research funding was nearly impossible to come by. But MAPS is flush now, having raised $44 million over the past two years.",
    "Title": "How MDMA and Psilocybin Became Hot Investments"
  },
  {
    "Date": "Mon, 10 May 2021 04:37:31 +0000",
    "Description": "Some people said they started bathing less during the pandemic. As long as no one complains, they say they plan to keep the new habit.",
    "Image": "https://static01.nyt.com/images/2021/05/05/multimedia/00xp-shower-shower/00xp-shower-shower-facebookJumbo.jpg",
    "Link": "https://www.nytimes.com/2021/05/06/health/shower-bathing-pandemic.html",
    "Text": "Ms. Harper, who still uses deodorant and does a daily wash of “the parts that need to be done” at the sink, said she was confident she was not offending anyone. Her 22-year-old daughter, who is fastidious about bathing and showers twice a day, has not made any comments regarding her new hygiene habit. Nor have the children at her school.\n\n“The kids will tell you if you don’t smell good,” Ms. Harper said, “3-, 4- and 5-year-old children will tell you the truth.”\n\nPlumbing and upward mobility changed everything\n\nDaily showers are a fairly new phenomenon, said Donnachadh McCarthy, an environmentalist and writer in London who grew up taking weekly baths.\n\n“We had a bath once a week and we washed under at the sink the rest of the week — under our armpits and our privates — and that was it,” Mr. McCarthy, 61, said.\n\nAs he grew older, he showered every day. But after a visit to the Amazon jungle in 1992 revealed the ravages of overdevelopment, Mr. McCarthy said he began reconsidering how his daily habits were affecting the environment and his own body.\n\n“It’s not really good to be washing with soap every day,” said Mr. McCarthy, who showers once a week.\n\nDoctors and health experts have said that daily showers are unnecessary, and even counterproductive. Washing with soap every day can strip the skin of its natural oils and leave it feeling dry, though doctors still recommend frequent hand-washing.",
    "Title": "The Pandemic Has Changed Their Shower Habits. How About Yours?"
  },
  {
    "Date": "Mon, 10 May 2021 00:44:44 GMT",
    "Description": "Coronavirus has affected many people in different ways - how would you react if someone needed support?",
    "Image": "https://ichef.bbci.co.uk/news/1024/branded_news/11418/production/_118408607_promo_mental_health_sit2_976-nc.png",
    "Link": "https://www.bbc.co.uk/news/health-57013126",
    "Text": "As we emerge from restrictions and start interacting with colleagues, friends and family more then we have done over the last few months, looking out for someone's mental health is just as important as their physical health. Around one in five adults experienced some form of depression in the first few months of this year, more than twice as many as before the coronavirus pandemic struck.",
    "Title": "Mental health: Can you tell if someone is struggling?"
  },
  {
    "Date": "Mon, 10 May 2021 09:55:55 +0530",
    "Description": "As young people express an interest in vegan and gluten-free options at the bar, cider — a fermented summer drink made from apples — attracts interest in India",
    "Image": "https://th.thgim.com/life-and-style/food/6ra8lq/article34523227.ece/ALTERNATES/FREE_460/Wildcraft-Hard-Apple-Cider",
    "Link": "https://www.thehindu.com/life-and-style/food/apple-cider-trend-2021-india-alcohol-beverages/article34523228.ece",
    "Text": "As young people express an interest in vegan and gluten-free options at the bar, cider — a fermented summer drink made from apples — attracts interest in India\n\nA bite into a crisp apple, its juices dripping down your chin, as tart and floral flavours dance upon your palate. These memories are now being translated into a heady summer drink: cider.\n\nIn the Indian market since 2017, the drink, which is made from apples and is fermented with minimal processing, has an alcoholic content ranging from 1.2% to 8.5% ABV (Alcohol by Volume — a standard measure of how much alcohol, or ethanol, is contained in a given volume of an alcoholic beverage).\n\nCiders can be still or carbonated, based on secondary fermentation and carbon dioxide injection. Sales have seen an upward trend despite craft beer and whiskey ruling the roost, as young Indians look to shift consumption towards vegan and gluten-free offerings at the bar. And apple drinks offer the added advantage of antioxidants.\n\nHomegrown cider brand, Wildcraft Beverage, headquartered in Maharashtra, uses apples from the northern hills of the country. “Kashmiri apples are sourced directly from the farmers, and the Himachal variety is sweet, but more importantly, not genetically modified which is why we chose it . We also use the skin of apples, in our Hard Apple cider which really celebrates the fruit,” elaborates Priyanka Patel, who helms the operation with her husband Mehul.\n\nIn addition to the classic Hard Cider available in bottles at ₹180 each, Wildcraft Cider offers a wide repertoire of fruity options — mulberry (from Mahabaleshwar), coffee-orange (from Karnataka and Maharashtra), mango and strawberry ciders. Ayush Arora, co-founder of Mumbai-based restobar, Hammer & Song is impressed, “It’s a great beverage for those who dislike the taste of alcohol and like something sweet and fruity. They have greatly appreciated the balance and the use of indigenous mulberry.”\n\nPatel adds, “. We have seen some of our consumers even turn our ciders into cocktails and desserts.”\n\nOmkar Shivhare, a regular patron in Mumbai adds, “When I moved back from the UK to India, I was on the look out for a good cider. The cider itself isn’t too sweet or too dry like most ciders tend to be. The 8% plus alcohol level is just the cherry on the top.”\n\nKapil Kanetkar, owner, Genuine Broasters Chicken, Mumbai, concurs, “Hard Apple Cider was a very interesting introduction to our customers. Patrons mostly come for beer bucket offers. However, once they gave it a go, they practically switch over.”\n\nDespite the rousing reception, the pandemic forced a pause and pivot. “For a brand that started in December 2019 with no idea that a pandemic was looming, it sure has taken its toll on us. With excise relaxing norms on home deliveries, we had a little relief. It also gave us ample time to focus on innovation,” explains Priyanka, as the brand plans to expand its operations to Karnataka and Goa by the end of the year.\n\nSteal the best ones\n\nThirsty Fox Cider, the newest kid on the block, brings a Massachusetts staple to the Indian market. Siddharth Sheth, founder-CEO, spent much of 2014 through 2016 chasing the perfect cider in Somerville, Massachusetts. He sent a handwritten note to the founders at Bantam Cider requesting them to be fellow travellers in his mission to bring all-natural, craft apple ciders to India.\n\nWhy Thirsty Fox? Foxes are notorious among orchard owners, with their uncanny ability to steal the best apples; so the label bears the wily thief as well as hand illustrated botanicals, inspired by 17th Century Belgian botanist, Pierre-Joseph Redouté.\n\nSheth explains, “We started with apples from Himachal Pradesh and Jammu and Kashmir. But unable to achieve the desired product profile, we finally zeroed in on the right blend of apples from Washington State and Oregon. We would be more than thrilled to find a local source that exceeds the standards of our current supplies which would lower transportation costs and import taxes and duties, which account for 70% of the basic cost of the materials.”\n\nWith two gluten-free iterations, priced at ₹300 per stubby bottle, Thirsty Fox Izzy, is a golden cider, with orange blossom honey, and Thirsty Fox Reed, a ruby-red, semi-dry cider, conditioned with tart cherries and peppercorns. While all retail sales are routed through premium shops in Mumbai and Pune for home delivery, Thirsty Fox also sells via online platforms and its own website. Sheth is confident that his ciders will soon find space at tables in Karnataka, later this year.\n\nNotes of whiskey\n\nMorgan Beverages, which has brought Paladin wines from Italy and Marchigue Panul red and whites from Chile, entered the cider market in 2018 with 200-year-old Sheppy’s Cider, and Australian favourite, Three Oaks Cider. Sheppy’s ciders are fermented using naturally occurring wild yeast from Somerset’s (UK) cider and dessert apples, giving them a distinct flavour, not mimicked by other yeasts. The amber juice from fresh apples is matured in oak vats which have been in the Sheppy family for almost 100 years. Shashank Rathore, marketing head at Morgan Beverages says, Indian drinkers, still prefer more familiar notes to full bodied-ciders.\n\nSheppy’s cider | Photo Credit: special arrangement\n\n“Sheppy’s 200 Special Edition Cider goes down smooth, since it has notes of whiskey, having been aged in oak barrels, while the classic draught version is an acquired taste. Three Oaks Cider, made with freshly crushed Red Delicious, Pink Lady and Granny Smith apples from Adelaide, is smooth with light and crisp notes.”\n\nRathore points out that Chennai has been a dream market for their ciders with a younger segment of buyers, and a lower price point compared to Mumbai. While Sheppy’s is available only at premium TASMAC outlets at ₹470, plans are afoot to offer the ciders at bars and restaurants once there is a semblance of normalcy. “The curious aspect of cider in the Chennai market is that it falls under the wine category since it uses fruit and is a fermented beverage.” With plans to expand, post-pandemic, Rathore is confident of taking his ciders to Goa and the capital as well.",
    "Title": "Cider becomes a fast favourite as a gluten-free and vegan option at the bar and at home"
  },
  {
    "Date": "Mon, 10 May 2021 01:06:02 +0530",
    "Description": "No matter the age, we all share deep bonds with our mothers and which only go from strength to strength with the passage of time. Six people settled abroad pen their thoughts in a letter to their mothers in India, to say why moms need to be celebrated",
    "Image": "https://th.thgim.com/life-and-style/mxliph/article34514884.ece/ALTERNATES/FREE_960/Dhira-Saharai-and-Priyam-Saharia",
    "Link": "https://www.thehindu.com/life-and-style/mothers-day-a-letter-to-dear-mother-to-say-thank-you/article34514894.ece",
    "Text": "No matter the age, we all share deep bonds with our mothers and which only go from strength to strength with the passage of time. Six people settled abroad pen their thoughts in a letter to their mothers in India, to say why moms need to be celebrated\n\nPriyam Saharia, founder of Rhyme N Reason, Singapore to her mother, Dhira Saharia\n\nYes, I will get you Estee Lauder’s anti-wrinkle serum when I come home next. The last time I spoke with you on video call, you looked perfectly beautiful to me. When I see you in your starched cotton saree with your golden-rimmed spectacles, hair neatly tucked into a bun, I feel relieved that despite the chaos outside, you still remain the same. You are my constant. You give stability to my world.\n\nI know you can’t go to Barua aunty’s house for your afternoon tea, you can’t wear your lovely paat silk mekhela chadars to weddings, you can’t even bargain with the vegetable vendors peacefully! But I am proud of you for going through this period of isolation with patience and resilience.\n\nYour grandson told me today, “Why can’t Amma come for my fourth birthday?” If you were here, you would have probably cooked enough to feed the whole neighbourhood.\n\nLockdown has significantly improved my cooking skills. Remember how much you harassed me during my teenage years that I should at least learn to make tea. Now, I am making biryani and caramel pudding ! I miss your cooking, Ma.\n\nEverything reminds me of you. When I cook, when I potter around my little garden, when I obsess about changing the pillowcases frequently and when I put extra sheets on my son at night. How I miss you my Mamasaurus, my Nirupa Roy, my Mother India! When I meet you next, I will find a nice new nickname for you. Until then, all I ask of you is, don’t grow old!\n\nAs told to Prabalika M Borah\n\nNina Sivan, audiologist, Ireland, to her mother, Mini Vasudevan, founder-director of Sure Events\n\nNina Sivan with her mother Mini Vasudevan | Photo Credit: Special Arrangement\n\nI have lived away from home since the age of 18, when I left for college. Ten years have passed. Now I am in a different continent. Yet home is still where you are, mom.\n\nWe are more like best friends than a mother-daughter duo. You have so many quirks that I love like your obsession for kitchen utensils, or your ability to fall asleep even before the credits of the movie starts! You always make me sit in the kitchen while you cook, but you never let me help you. All you expect is for me to be your radio. You have really funny nicknames for me, mostly you call me vava (regardless of my current age), gudiya, or ‘Neenu peanut’ in a sing-song manner. And of course, you call me this in public no matter how many times I tell you not to!\n\nI miss you, mom. But I am looking forward to coming home and spending time with you, and do all this again. Until then, we will continue our banter over phone calls. Happy Mother’s Day, and thanks for being my one true friend.\n\nAs told to Saraswathy Nagarajan\n\nShilpa Nair, advertising professional, Dubai, to her mother Girija Nair\n\nThey say distance makes the heart grow fonder. But this adage does not apply to the relationship with you. The pandemic may keep me physically away from you, but technology has helped us stay connected.\n\nIt pains me to hear your frustration at being home-bound for several months at a stretch. But the fact that you are safe makes me realise that we are among the fortunate lot. Although Zoom calls keep me updated about your health, I miss your gentle touch, warm hug, welcoming smile, your inimitable spirit, and of course your astute commentary on politics and cinema, and your trademark delicacies.\n\nThe prospect of being so far apart seems daunting, but I try and put on a brave face to cheer you up. If I were with you on Mothers’ Day, I would have spoiled you with the best sarees, treat you to Mohanlal movies, and accompany you on your temple visits.\n\nYou are a superwoman. You manage the house, office, kitchen, family, bank account, investments and much more. More power to you! They say love makes the world go round. I’d instead say mothers make life worth living.\n\nAs told to K Jeshi\n\nUdayan Bose, CEO of NetElixir, New Jersey, USA to his mother, Niyati Bose\n\nUdayan Bose with his mother Niyati Bose | Photo Credit: Special Arrangement\n\nThis is the first time in the last two decades I have not met you and Baba in person for over nine months. Every morning, I wake up thinking about your health and wish we were all together now.\n\nI yearn to hear you say, “Hobe na maane?, Nischoi aamra parbo. Aaro beshi cheshta korte hobe” (What do you mean it is not possible? Of course we can do it. We have to try harder). You have always encouraged me and my brother with these words and I realise how it helped surmount seemingly impossible challenges.\n\nThe word ‘impossible’ never existed in your dictionary and with an indomitable spirit you have fought every challenge in our lives. In our recent conversations, I sensed frustration creeping up in you. Please, don’t let this pandemic eat into your buoyant spirit.\n\nI am hoping we will soon make up for all the lost time and occasions with celebrations in Jaipur. Not necessarily a big one, but those simple, leisurely evening strolls to Statue Circle for our all-time favourite tangy pani puri and a chilled glass of ganne ka ras (sugarcane juice). Your grand kids are waiting for that lingering taste of payesh, pathishapta and puli-pithe you make during festivals.\n\nI more often turn to the pages of our old albums for some solace. I gaze at a black and white picture of yours receiving the Best Teacher’s Award and the day you became the vice-principal of your school. That pride of raising so many successful students, whom you treated as your own, makes us so proud of you.I miss the warmth of your embrace, Ma. Keep your trademark smile going for us; soon we will relive those blissful days and enjoy the sunshine together.\n\nAs told to Soma Basu\n\nRevathy Menon, Independent writer and editor, Luxembourg, to her mother, Parvathy Menon\n\nRevathy with her mother Parvathy Menon | Photo Credit: Special Arrangement\n\nI speak to you every day, hear your strong, unfaltering voice through the phone, see your face on video call — pixelated, but always honest and smiling. I know how you are.\n\nYou are missing your children, sad that we cannot meet, worried about the pandemic, hurting from the surgery, aching to hold your grandchildren, anxious to never become a burden, wishing with all your heart that things were how they used to be.\n\nWhen I left India, my heart was filled with hope and excitement. No place was too far away. Of course, I would visit you every summer, I said — this was not a promise, it was an obvious fact. I was actually brimming with excitement in January last year, because the summer was going to be perfect. The kids and I would talk excitedly about eating ammamma’s delicious food again. You and I were making plans over the phone. You were already gathering all the stuff you wanted to send back with me. Then the pandemic hit us.\n\nWe exchanged stories of how someone in the neighbourhood, someone’s friend or a faraway relative had succumbed to the virus. With each call, hopes diminished and anxiety grew. But we still laughed and joked. Your lilting laughter, like your fierce love, always feels well-earned.\n\nIn March, you fell. Again. My heart broke with the sound of shattering bones. This time I could not be there. I felt lucky and deeply grateful for my brother’s committed care, for dad’s calm optimism. Together, the three of us wept and wept because we couldn’t ease your pain. And then slowly we watched in awe as you walked again, a little more broken but always our champ.\n\nAll the while, my fragile relief was ever threatened by the virus, still lurking, growing unchecked. Then it exploded. All hell broke loose.\n\nThe pandemic’s second catastrophic wave in India has drawn a new deep chasm. My simple yearning for your loving presence has become a desperation. But we cannot meet yet ma. Not yet. This Mother’s Day, I can only repeat, what I tell you every day. I love you. Stay safe. I live now to come home and embrace you.\n\nAs told to K Jeshi\n\nNeetika Kapani, working for Australian Energy Market Operator, Perth, to her mother, Anu Kapani\n\nNeetika Kapani with her mother Anu Kapani | Photo Credit: Special Arrangement\n\nIt is two years since we last met. It feels strange considering we try and see each other at least twice a year. Since the borders are closed, and I don’t have any superpowers to be able to teleport myself to Bengaluru, here is my little love note to you.\n\nYou will never know what you mean to me because words can never do justice. It tugs at my heart that I can’t be with you to give you a hug, wish you Happy Mother’s Day, and be wrapped in your warm embrace .\n\nMy sense of resilience comes from you; you have taught me to be strong yet empathetic. I thank you for putting up with my tantrums, for calming my intense spirit when I struggle to see reason. I don’t know where you get the reservoir of energy to love me unconditionally, but I thank God every day for blessing me with a mother like you... my best friend.\n\nI wish I could buy you the lilies you like, and take you to China Bistro. I wish I could massage your feet and kiss you a million times, and indulge in our silly banter which would usually end with me saying, ‘But seriously ma, I love you for all that you do for me, for inspiring me to be the best version of myself, for not giving up on me even when I feel there is no hope, and for being my strongest rock.’\n\nAs told to Shilpa Nair Anand",
    "Title": "These Mother’s Day letters from all over the world offer strength in a time of long-distance love"
  },
  {
    "Date": "Mon, 10 May 2021 10:00:00 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/life-style/food-news/7-tips-to-keep-in-mind-while-buying-chocolates/photostory/82484609.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82484609.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>Whether you love dark chocolates or creamy gooey milk chocolates or dry fruit loaded chocolate, a single bite of it can make your day. In fact, most of us just buy our favourite chocolate even without looking into the ingredients or what goes into making them. Well, if you too are chocolate fanatic, then here are a few tips to keep in mind before buying your favourite chocolate.",
    "Image": "https://static.toiimg.com/photo/82484750.cms",
    "Link": "https://timesofindia.indiatimes.com/life-style/food-news/7-tips-to-keep-in-mind-while-buying-chocolates/photostory/82484609.cms",
    "Text": "\n\n\n\nThere’s nothing more soul statiting than a delightful bar of chocolate. Whether you love dark chocolates or creamy gooey milk chocolates or dry fruit loaded chocolate, a single bite of it can make your day. In fact, most of us just buy our favourite chocolate even without looking into the ingredients or what goes into making them. Well, if you too are chocolate fanatic, then here are a few tips to keep in mind before buying your favourite chocolate.",
    "Title": "Tips while buying chocolates"
  },
  {
    "Date": "Mon, 10 May 2021 10:00:00 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/life-style/fashion/celeb-style/times-shehnaaz-gill-slayed-in-body-hugging-dresses/articleshow/82488129.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82488129.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>The 28-year-old Punjabi superstar is fond of figure-hugging gowns and dresses and she has been seen gracing her curves in these striking numbers.",
    "Image": "https://static.toiimg.com/thumb/msid-82488129,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-867732/82488129.jpg",
    "Link": "https://timesofindia.indiatimes.com/life-style/fashion/celeb-style/times-shehnaaz-gill-slayed-in-body-hugging-dresses/articleshow/82488129.cms",
    "Text": "Shehnaaz Gill had a style transformation and after her dramatic weight loss, she had all the more reasons to put her most stylish foot forward. The 28-year-old Punjabi superstar is fond of figure-hugging gowns and dresses and she has been seen gracing her curves in these striking numbers. Here are four times she looked absolutely stunning in these designer outfits and blew our minds.She wore this black body-hugging dress from designer Rocky S. The full-sleeved dress featured baroque print and thigh-high slit. Shehnaaz looked unrecognisable in this outfit and we can't take our eyes off her.Shehnaaz posed up a storm in this nude sheath dress and teamed it with a pair of black heels. She styled her hair in a sleek middle parting.Shehnaaz wore this heavily embellished dress which graced her curves. Her hairdo grabbed all the eyeballs and she nailed it with this showstopping outfit.Shehnaaz looked drop-dead gorgeous in this black one-shouldered gown and looked picture perfect as she posed. The hair was styled in soft waves and she opted for minimal makeup to complement the outfit.What do you guys think of Shehnaaz Gill's fashion choices? Tell us in the comment section below.",
    "Title": "Shehnaaz Gill's body-hugging dresses"
  },
  {
    "Date": "Mon, 10 May 2021 07:00:00 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/life-style/health-fitness/diet/weight-loss-5-amazing-ways-coffee-speeds-up-weight-loss-according-to-science/photostory/82468667.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82468667.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>If you thought the calories were the only real benefit here, wait before you unravel some more weight-loss friendly reasons why you should be having coffee more regularly.",
    "Image": "https://static.toiimg.com/photo/82468777.cms",
    "Link": "https://timesofindia.indiatimes.com/life-style/health-fitness/diet/weight-loss-5-amazing-ways-coffee-speeds-up-weight-loss-according-to-science/photostory/82468667.cms",
    "Text": "The number one rule to promote weight loss is to burn more calories than you take in and create a deficit. One way to do so is to mindfully consume lesser carbs, or eat moderate portions and most importantly, cut down mindless junking. Drinking coffee is one way to do so. It has now been scientifically proven that caffeine consumption during the day lowers energy intake and promotes gastric emptying. Put simply, having a cup of coffee before your meals may fill you up and consume a lesser quantity.",
    "Title": "How coffee speeds up weight loss"
  },
  {
    "Date": "Mon, 10 May 2021 06:00:00 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/life-style/fashion/buzz/how-to-re-purpose-your-old-denim/articleshow/82485305.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82485305.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>If you have your denims piling up in your closet, here are some fun ways to re-purpose your old jeans. Bags, denim mat and denim pouches are some of the ways to recycle and re-use it.",
    "Image": "https://static.toiimg.com/thumb/msid-82485305,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-964116/82485305.jpg",
    "Link": "https://timesofindia.indiatimes.com/life-style/fashion/buzz/how-to-re-purpose-your-old-denim/articleshow/82485305.cms",
    "Text": "With new denim trends entering the market every other day, we often leave our vintage jeans to no use. So, if you have your denims piling up in your closet, here are some fun ways to re-purpose your old jeans. Bags, denim mat and denim pouches are some of the ways to recycle and re-use it. We got in touch with Samresh Das, Design Manager, Numero Uno- India to list out some new trends you can recreate from denims:1. Boho wall hanging: Macrame or boho wall hangings are quite in trend these days. It is a subtle piece of art that instantly catches eye and gives a very organic flair to our homes. With an old denim, one can easily make a macrame wall hanging. Evenly cut out long strings of about 20-30 and knot them on a wooden hanger. With the help of square knots, continue the process till the end, feel free to use your creativity and design it as you like. This denim macrame wall hanging will add a pop of color to your wall.2. Denim choker: Cut the hem of your jeans, hook the two ends with an elastic and your own DIY denim choker is ready to wear. You can even accessorize it by putting studs and stones or paint it with textures. A zigzag texture with a white paint will make your denim choker standout from the usual.3. Denim Scrunchies: One of the biggest fashion trends, 'scrunchies’ are a favourite among kids and grown-ups. Replacing the regular tie-ups, scrunchies add more fun and pep to the look. With so many varieties already available, you can make your own Denim Love scrunchie at home. Cut denim in rectangular shape and sew it sides. Now with the help of a safety pin, insert the elastic inside and knot the two ends. Sew the edges and your own Vintage denim scrunchie is ready to hold all your hair.4. Denim Placemats : One of the really cool ways of denims is to reuse it as dinner placemats. Cut your old jeans and open the inseam or outseam and put it flat. Cut rectangular pcs with little margin to sew the borders/ Grey's. Once the edges are sewn it's ready to be used as Placement mat for your dining table. Here your jean pocket can easily be used to hold your cutlery. You can sew the pocket at one of the sides of the cut-out for a fancier setting.5. Wall Organizer: Pockets of your jeans can never be so useful. All you need to do is cutting down the back of your jeans from top till thighs. Once you have your cut out ready you can hang it simply on your wall or can paste one more pocket beneath. It will give more space to hold stuff.6. Lamp shade (Hanging from ceiling)Cut one leg around 20\" long and dip it in resin and let dry in the sun for the whole day. Make sure while drying to give a support and keep the circular shape intact, pass a plastic jar of the same size through it. Once dried, you can see a hardened circular base ready to be used as lamp shade. Add electrical elements easily available from the market and hand it from your ceiling. That will complete your denim desire in your private corner.",
    "Title": "How to re-purpose your old denim"
  }
]