[
  {
    "Date": "Mon, 10 May 2021 08:37:11 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/sports/football/epl/top-stories/west-brom-relegated-from-premier-league-after-arsenal-defeat/articleshow/82513574.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82513574.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>West Bromwich Albion were relegated from the Premier League on Sunday after they lost 3-1 away to Arsenal.",
    "Image": "https://static.toiimg.com/thumb/msid-82513602,width-1070,height-580,imgsize-757598,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/sports/football/epl/top-stories/west-brom-relegated-from-premier-league-after-arsenal-defeat/articleshow/82513574.cms",
    "Text": "AFP Photo\n\nLONDON: West Bromwich Albion were relegated from the Premier League on Sunday after they lost 3-1 away to Arsenal .\n\nThe defeat left Sam Allardyce's side in 19th place with 26 points, 10 points behind fourth-bottom Burnley with only three games left to play.\n\nEmile Smith Rowe deftly volleyed Arsenal's opener in the 29th minute and Nicolas Pepe cut in from the right before curling home an unstoppable left-foot shot six minutes later.\n\nMatheus Pereira pulled one back for the visitors in the 67th after a surging run but Willian's free kick in the 90th minute wrapped up the points as West Brom manager Sam Allardyce suffered relegation from the Premier League for the first time.\n\nHis side will join basement club Sheffield United, who are already down, in the Championship next season.\n\n",
    "Title": "West Brom relegated from Premier League after Arsenal defeat"
  },
  {
    "Date": "Mon, 10 May 2021 08:40:53 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/sports/more-sports/shooting/indian-pistol-coaches-may-not-go-to-tokyo-olympics/articleshow/82513662.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82513662.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>Indian pistol team coaches - Jaspal Rana, Ronak Pandit and Samaresh Jung - who had already decided against attending the training camp in Zagreb, in all probability will miss the Tokyo Games too, it is learnt.",
    "Image": "https://static.toiimg.com/thumb/msid-82513656,width-1070,height-580,imgsize-47413,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/sports/more-sports/shooting/indian-pistol-coaches-may-not-go-to-tokyo-olympics/articleshow/82513662.cms",
    "Text": "Jaspal Rana. (TOI Photo)\n\nPUNE: Indian pistol team coaches - Jaspal Rana , Ronak Pandit and Samaresh Jung - who had already decided against attending the training camp in Zagreb, in all probability will miss the Tokyo Games too, it is learnt.\n\nThe National Rifle Association of India ( NRAI ) had announced an extended training camp for the Tokyo-bound Indian shooters in Zagreb from May 11. However, considering the current situation due to the pandemic, the trio had expressed their unavailability to attend the 2-month-long camp.\n\nIt was expected that coaches may join the team in Tokyo, but that won't be easy. \"The NRAI will have to send the names of the coaches for accreditation by next week. With the current stand-off, it will be difficult for the coaches to join the team directly at the Tokyo Games,\" a source told TOI.\n\nFor 15 shooters (19 starts), India will get 5 or 6 accreditations for coaches and support staff. The NRAI was earlier contemplating to rotate their coaches on the given accreditations according to the schedule but it seems the juggling won't be needed now.\n\nIt is learnt that the coaches had sent a mail to the NRAI, suggesting a separate camp for pistol shooters in Delhi. However, the NRAI simply thanked them for their services.\n\nNRAI president Ranidner Singh told TOI that he respects the coaches' decision. \"Given the pandemic, the coaches' concern is understandable. However, the camp in Croatia is very much needed for the team,\" he said. \"It is not just safer for the shooters in Croatia, but it will also give them international exposure,\" he added.\n\nOther than the training, the shooters will also participate in the European Championships and the ISSF World Cup. Singh said if the coaches change their mind and want to join the camp, \"he will do everything in his power to accommodate them.\"\n\nManu to train under Ronak\n\nIn a surprising development, it's been learnt that Manu Bhaker has opted to train under Ronak Pandit and not Rana, who has been her coach for the last three years. While Ronak was assigned to train Manu, Abhishek Verma had asked to train under Rana. Jung was supposed to train Saurabh ahead of the Games. However, the pistol shooters will now train under national coach Ved Prakash Pilania and foreign coach Pavel Smirnov.\n\n",
    "Title": "Indian pistol coaches may not go to Tokyo Olympics"
  },
  {
    "Date": "Mon, 10 May 2021 09:17:04 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/sports/more-sports/wrestling/injured-wrestler-sumit-malik-could-be-out-of-action-for-up-to-three-weeks/articleshow/82514081.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82514081.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>Olympic Games-bound wrestler Sumit Malik could be out of action for up to three weeks after his old knee injury resurfaced during the recent World Olympic qualifiers in Sofia.",
    "Image": "https://static.toiimg.com/thumb/msid-82514078,width-1070,height-580,imgsize-354735,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/sports/more-sports/wrestling/injured-wrestler-sumit-malik-could-be-out-of-action-for-up-to-three-weeks/articleshow/82514081.cms",
    "Text": "Sumit Malik (Twitter Photo)\n\nNEW DELHI: Olympic Games-bound wrestler Sumit Malik could be out of action for up to three weeks after his old knee injury resurfaced during the recent World Olympic qualifiers in Sofia.\n\nDue to this reason, the 28-year-old wrestler gave a walkover to his opponent, Russia's Sergei Kozyrev, in the final of the 125kg category in Sofia on Saturday night. He had won the Olympic quota place by entering the final.\n\nFinalists in each weight category were allotted tickets to the Olympic Games, scheduled to be held in Tokyo from July 23.\n\n\"Since Malik is injured, he will not train up to three weeks. We hope he would recover from the knee injury by the first or, maybe, second week of June. It is important for him to recover fully as Olympics are around the corner,\" coach Virender Singh said.\n\n\"Since it was the last tournament to achieve an Olympic berth, he went all out to win. But after the semi-final, the pain got a bit unbearable, so he decided to not compete in the final,\" he said.\n\nAccording to Singh, Malik, the 2018 Gold Coast Commonwealth Games champion, had hurt his right knee during a training session in the first week of April.\n\nDespite the knee pain, Malik had carried on during the Asian Olympic qualification tournament, held last month in Almaty.\n\n\"He managed to recover as there was a gap between the Asian and the World qualification tournaments. But now he will have to undergo proper rehabilitation ahead of the Olympics,\" said Singh.\n\nThe Wrestling Federation of India had picked a 12-member team, including six in men's Greco-Roman, for the four-day World Olympic qualifiers.\n\nOnly two Indian wrestlers won Olympic quota places in Sofia; Seema Bisla was the other. She won an Olympic quota place in 50kg freestyle event after entering the final. Her opponent, Lucia Yamileth Yepez Gugman of Ecuador, pulled out of the final due to injury.\n\n",
    "Title": "Injured wrestler Sumit Malik could be out of action for up to three weeks"
  },
  {
    "Date": "Mon, 10 May 2021 08:51:10 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/sports/football/top-stories/toni-kroos-strikes-late-but-real-madrid-title-hopes-hit-by-sevilla-draw/articleshow/82513762.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82513762.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>Real Madrid's 94th-minute equaliser salvaged a dramatic 2-2 draw against Sevilla on Sunday as an extraordinary penalty decision swung La Liga's title race back in Atletico Madrid's favour.",
    "Image": "https://static.toiimg.com/thumb/msid-82513763,width-1070,height-580,imgsize-649635,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/sports/football/top-stories/toni-kroos-strikes-late-but-real-madrid-title-hopes-hit-by-sevilla-draw/articleshow/82513762.cms",
    "Text": "AP Photo\n\nMADRID: Real Madrid 's 94th-minute equaliser salvaged a dramatic 2-2 draw against Sevilla on Sunday as an extraordinary penalty decision swung La Liga 's title race back in Atletico Madrid's favour.\n\nZinedine Zidane's side had levelled through Marco Asensio midway through the second half and thought they had a penalty when Karim Benzema was brought down after rounding Sevilla goalkeeper Bono.\n\nBut VAR prompted referee Juan Martinez to check an Eder Militao handball a few seconds before, with a huge decision seeing Madrid's penalty cancelled and a spot-kick awarded to Sevilla instead.\n\nIvan Rakitic converted and while Madrid still managed to hit back in injury time, Toni Kroos ' shot squirming in off Diego Carlos, the draw hands the advantage back to Atletico at the end of another dramatic weekend in the Spanish title race.\n\n",
    "Title": "Toni Kroos strikes late but Real Madrid title hopes hit by Sevilla draw"
  },
  {
    "Date": "Mon, 10 May 2021 09:04:33 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/sports/football/top-stories/serie-a-ac-milan-knock-juventus-out-of-top-four-with-thumping-win/articleshow/82513847.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82513847.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>AC Milan pushed Juventus out of the Serie A top four with a 3-0 win in Turin on Sunday which increases their hopes of Champions League football for the first time since 2014.",
    "Image": "https://static.toiimg.com/thumb/msid-82513905,width-1070,height-580,imgsize-820018,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/sports/football/top-stories/serie-a-ac-milan-knock-juventus-out-of-top-four-with-thumping-win/articleshow/82513847.cms",
    "Text": "Reuters Photo\n\nMILAN: AC Milan pushed Juventus out of the Serie A top four with a 3-0 win in Turin on Sunday which increases their hopes of Champions League football for the first time since 2014.\n\nBrahim Diaz put Milan ahead just before the break with Anton Rebic and Fikayo Tomori adding two more in the second half after Franck Kessie had missed a penalty.\n\nMilan move up to third, equal on 72 points with second-placed Atalanta, with Napoli a further two points behind in fourth and the final Champions League berth.\n\nJuventus are now fifth, one point behind the top four with three games left to play, including next weekend's clash with newly-crowned champions Inter Milan .\n\nThe breakthrough came just before half time with Diaz scoring on the rebound after Juventus goalkeeper Wojciech Szczesny cleared a Hakan Calhanoglu free-kick.\n\nMilan should have gone two up just before the hour when Giorgio Chiellini was judged to have handled the ball, but Szczensy denied Kessie's weak penalty.\n\nStar striker Zlatan Ibrahimovic came off with a knee injury after 65 minutes with Diaz also replaced five minutes later.\n\nBut Rebic doubled Milan's lead with a fantastic strike with 12 minutes to go and Tomori put the cherry on the cake when he headed home the third minutes later.\n\nEarlier Atalanta brushed aside relegated Parma 5-2 to move back into second.\n\nGian Piero Gasperini's side are closing in on a third consecutive season of Champions League football as they sit two points ahead of third-placed Napoli with three games to play.\n\n\"There's still two weeks to go and a lot can happen,\" said Gasperini.\n\nAtalanta have the top attack in Serie A ahead of newly-crowned champions Inter Milan which they added to in Parma with Ruslan Malinovskyi grabbing the first after 12 minutes.\n\nLuis Muriel and Matteo Pessina came on after the break and the Colombian set up the Italian for the second six minutes later.\n\nMuriel then struck twice within 10 minutes in the final quarter of an hour to bring his tally to 21 goals this campaign.\n\nAleksei Miranchuk grabbed a fifth in injury time after Juan Brunetta and Simon Sohm had pulled two goals back late for Parma.\n\nSassuolo kept their Europa League hopes alive with a 2-1 win over Genoa, with goals in either half from Giacomo Raspadori and Domenico Berardi.\n\nRoberto De Zerbi's side are eighth, two points behind Roma , who crushed relegated Crotone 5-0 to end their four-match winless league run, days after their Europa League exit to Manchester United .\n\nBorja Mayoral and Lorenzo Pellegrini both scored twice with Henrikh Mkhitaryan getting his first goal in over three months.\n\nCagliari won the battle with relegation rivals Benevento 3-1, to move four points clear of the drop zone, equal on points with Torino who held Hellas Verona 1-1.\n\nBenevento were awarded a late penalty which could have snatched a 2-2 draw, but it was overruled after a VAR review.\n\nJoao Pedro sealed the win for the Sardinians deep into injury time.\n\n",
    "Title": "Serie A: AC Milan knock Juventus out of top four with thumping win"
  },
  {
    "Date": "Mon, 10 May 2021 09:16:38 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/sports/football/top-stories/i-wont-resign-i-think-i-can-do-better-says-andrea-pirlo/articleshow/82513862.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82513862.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>Juventus coach Andrea Pirlo said he will not resign after seeing his side slip out of the Champions League qualification places in Serie A following a 3-0 home defeat by AC Milan on Sunday, insisting he can do better.",
    "Image": "https://static.toiimg.com/thumb/msid-82514069,width-1070,height-580,imgsize-132271,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/sports/football/top-stories/i-wont-resign-i-think-i-can-do-better-says-andrea-pirlo/articleshow/82513862.cms",
    "Text": "Andrea Pirlo (Photo by Valerio Pennicino/Getty Images)\n\nTURIN: Juventus coach Andrea Pirlo said he will not resign after seeing his side slip out of the Champions League qualification places in Serie A following a 3-0 home defeat by AC Milan on Sunday, insisting he can do better.\n\nLast weekend, two late goals from Cristiano Ronaldo earned Juve a dramatic victory at Udinese to give them confidence going into the crucial clash with Milan who, like the Turin side, have stuttered in recent matches.\n\nBut the hosts never really looked like earning victory on Sunday, with the loss leaving Pirlo's outfit fifth in the standings with three games to go, as doubts linger over the rookie's managerial capabilities.\n\n\"Step aside? No,\" Pirlo told Sky Sport Italia. \"I have undertaken this job with a lot of enthusiasm, there are difficulties but my work goes on and I am available.\n\n\"I think I can do better and be able to get out of it, together with the team. We have to look forward, I will continue to do my job as long as I am allowed.\n\n\"We had actually started fairly well in the match, but we lost our way and this was the final result. It's difficult to explain now. There were many components that didn't work.\"\n\nMilan led the way for much of the season but could not keep pace with Inter Milan, who are the newly-crowned champions.\n\nSunday's win, however, thanks to goals by Brahim Diaz , Ante Rebic and Fikayo Tomori , helped Milan climb to third spot, three points clear of Juve, and put them in a strong position to return to the Champions League next term.\n\n\"I have always thought that there are no perfect matches but tonight we came close in terms of attention, spirit and quality,\" coach Stefano Pioli said.\n\n\"It was a very important match and the victory I want to dedicate to the fans who have given us an exciting charge.\n\n\"This win could be a turning point (in the top four race) if we manage to continue this path on Wednesday against Torino.\"\n\n",
    "Title": "I won't resign, I think I can do better, says Andrea Pirlo"
  },
  {
    "Date": "Mon, 10 May 2021 00:45:50 +0000",
    "Description": "The Mets’ ace went five innings in his return after missing a start. The Yankees had their second consecutive walk-off win over Washington.",
    "Image": "https://static01.nyt.com/images/2021/05/09/sports/09mlb-roundup-web-1/09mlb-roundup-web-1-facebookJumbo.jpg",
    "Link": "https://www.nytimes.com/2021/05/09/sports/baseball/mets-sweep-arizona-diamondbacks-jacob-degrom.html",
    "Text": "Right-hander Miguel Castro relieved deGrom with the Mets ahead 2-1 over Arizona (15-19). He hit a batter and walked another before completing a scoreless inning. Jacob Barnes worked a perfect seventh before allowing Asdrúbal Cabrera’s solo homer in the eighth, and Edwin Díaz got five outs for his fifth save.\n\nMichael Conforto had two hits, an R.B.I. and a superb catch against the right-field wall.\n\nThe Mets matched their longest winning streak since August 2019. They also beat the Diamondbacks for the 10th straight time at Citi Field.\n\nArizona has lost six games in a row and totaled just eight runs during this three-game sweep in Queens. The rookie right-hander Riley Smith (1-2) allowed two runs, four hits and a walk in four innings, striking out one.\n\nDeGrom’s rocky fifth began with a free pass to David Peralta, and Stephen Vogt followed with a long double.\n\nDeGrom walked Eduardo Escobar to load the bases with no outs and fell behind Nick Ahmed before inducing a double play that cut the Mets’ lead to 2-1. He walked Daulton Varsho, then struck out pinch-hitter Christian Walker.\n\nThe Mets do-it-all ace also helped build the lead. DeGrom placed a perfect bunt single down the third-base line during a two-run third inning. DeGrom scored on Conforto’s two-out single, and Francisco Lindor also lofted an R.B.I. sacrifice fly in the inning.\n\nThe Mets got their third run on pinch-hitter Patrick Mazeika’s bases-loaded walk against J.B. Bukauskas as light rain began in the sixth. Dominic Smith added an R.B.I. single in the seventh.",
    "Title": "Mets Sweep Arizona, but deGrom Leaves Early"
  },
  {
    "Date": "Mon, 10 May 2021 04:01:14 +0000",
    "Description": "From archery to yachting, and everything in between: Here are all the sports that are part of the Tokyo Games in 2021.",
    "Image": "https://static01.nyt.com/images/2021/05/06/sports/06oly-everysport-top-art/merlin_110960237_2dfe8408-9b1c-430b-8dba-847ef02f06d1-facebookJumbo.jpg",
    "Link": "https://www.nytimes.com/article/olympic-sports-explained.html",
    "Text": "Judo, a martial art focused on grappling, provides a great medal-winning opportunity for the host country. Japan historically has more than double the golds of the next closest country, and also had the most golds at the 2016 Games. The heavyweight Teddy Riner of France will be going for a third straight gold medal and fourth straight medal over all. A coed team event has been added this year.\n\n8 Golds\n\nKarate\n\nKarate debuts at this Olympics. There will be six gold medals awarded in kumite, in which athletes spar against an opponent, and two in kata, a solo event in which judges evaluate competitors’ stances and movements. Japan won the most medals at the latest world championships.\n\n2 GOLDS\n\nModern pentathlon\n\nIt is a quirky sport that was invented for the 1912 Games in Stockholm. Athletes compete in swimming, fencing, equestrian jumping and a combined pistol shooting and running event, all in one day. Though the sport is hardly “modern,” its name comes because it is newer than the pentathlon of the ancient Greeks. The United States has won six silver medals in this sport, but never a gold.\n\n2 GOLDS\n\nRhythmic gymnastics\n\nIn this women-only event, both individual athletes and teams of five perform with balls, hoops, clubs and ribbons. One piece of equipment is omitted each Games: This time the rope will be left out.\n\n14 GOLDS\n\nRowing",
    "Title": "A Brief Guide to Every Sport at the Olympics"
  },
  {
    "Date": "Mon, 10 May 2021 10:52:31 +0530",
    "Description": "The IPL had to be postponed on May 4 after multiple COVID-19 cases came to light inside the tournament's bio-bubble which wasn't as foolproof as the last edition in the UAE",
    "Image": "https://th.thgim.com/sport/cricket/8m9h9/article34524554.ece/ALTERNATES/FREE_960/9ODY6Fe400x400",
    "Link": "https://www.thehindu.com/sport/cricket/west-indies-players-in-ipl-are-back-home-cwi-ceo-johnny-grave/article34524555.ece",
    "Text": "The IPL had to be postponed on May 4 after multiple COVID-19 cases came to light inside the tournament's bio-bubble which wasn't as foolproof as the last edition in the UAE\n\nAll the Caribbean players, who participated in the currently postponed Indian Premier League, have reached home following concerted efforts by the BCCI and their respective franchises, Cricket West Indies CEO Johnny Grave has said.\n\nThe IPL had to be postponed on May 4 after multiple COVID-19 cases came to light inside the tournament's bio-bubble which wasn't as foolproof as the last edition in the UAE.\n\nTop West Indies players like their white-ball captain Kieron Pollard, Jason Holder, Sunil Narine, Andre Russell, Dwayne Bravo, Nicholas Pooran, Shimron Hetmyer, and Fabien Allen were a part of the league. In all, nine West Indies cricketers competed in the event.\n\n\"Our IPL players, along with the West Indians who were part of the TV production, are now safely back in the Caribbean. We are grateful to the BCCI and IPL Franchises for arranging their safe travel back to the Caribbean so quickly,\" Cricket West Indies tweeted.\n\nSave for COVID-19 affected duo of CSK batting coach Michael Hussey and Kolkata Knight Riders' New Zealand batsman Tim Seifert, all the foreign players and support staff have left the Indian shores.\n\nAll the Australians, along with a few New Zealanders, are currently in Maldives waiting for their onward journey after serving out quarantine. Australia has imposed a ban on flights from India till May 15 because of the COVID case surge there.\n\nThis was the reason why players from Down Under had to fly to Maldives for their quarantine instead of heading home directly.",
    "Title": "West Indies players in IPL are back home: CWI CEO Johnny Grave"
  },
  {
    "Date": "Mon, 10 May 2021 02:12:18 +0530",
    "Description": "This is his fourth Masters 1000 title, and first in three years.",
    "Image": "https://th.thgim.com/sport/tennis/aujcbe/article34523264.ece/ALTERNATES/FREE_960/10THAFPZverev",
    "Link": "https://www.thehindu.com/sport/tennis/zverev-beats-berrettini-to-win-his-2nd-madrid-open-title/article34523265.ece",
    "Text": "This is his fourth Masters 1000 title, and first in three years.\n\nAlexander Zverev continued his impressive form going into the French Open by winning his second Madrid Open title on Sunday.\n\nAfter beating top-seeded Rafael Nadal in the quarterfinals and fourth-ranked Dominic Thiem in the semifinals, Zverev rallied to defeat Matteo Berrettini 6-7 (8), 6-4, 6-3 for his second title this season. The sixth-ranked German also won the Mexican Open in Acapulco in March.\n\nZverev won his first Madrid title in 2018 in a final against Thiem. The win on Sunday gave him his fourth Masters 1000 title, and first in three years. Zverev will be trying to improve from his fourth-round appearance from last year at the French Open.\n\nThe 10th-ranked Berrettini won the title in Belgrade last week and was trying to win his first Masters 1000 trophy. The Italian has been gradually returning to form after struggling with an abdominal injury that kept him from playing his quarterfinal match against Stefanos Tsitsipas at the Australian Open. The injury kept Berrettini out until Monte Carlo, where he lost his opening match.\n\nAfter exchanging a break each in the first set, Berrettini opened the tiebreaker with a 5-0 lead but allowed Zverev to come back. The Italian closed it out on his fourth set point after Zverev also squandered a set point in the back-and-forth tiebreaker.\n\nZverev, who finished with seven double-faults, evened the match after breaking Berrettini at 4-4 and serving out to clinch the second set at the Magic Box center court, which had its roof closed because of rain in Madrid.\n\nBerrettini, who ended with 50 unforced errors, squandered a break point early in the third set, and Zverev broke him in the following game to take the lead. He earned another break at the end, converting on his second match point to clinch the victory.\n\nThe Madrid Open was one of the first sporting events in Spain that allowed the presence of a limited number of fans. The tournament was among those canceled last year because of the coronavirus pandemic. Local health workers were honored by tournament organizers before the final on Sunday.",
    "Title": "Zverev beats Berrettini to win his 2nd Madrid Open title"
  },
  {
    "Date": "Mon, 10 May 2021 07:49:06 +0530",
    "Description": "BCCI president says India has a hectic schedule and there are lots of organisational hazards like 14-day quarantine which is tough to handle",
    "Image": "https://th.thgim.com/sport/cricket/2rb5l7/article34522371.ece/ALTERNATES/FREE_960/TH10GANGULY",
    "Link": "https://www.thehindu.com/sport/cricket/too-early-to-say-how-we-can-find-a-slot-to-complete-ipl-ganguly/article34522372.ece",
    "Text": "BCCI president says India has a hectic schedule and there are lots of organisational hazards like 14-day quarantine which is tough to handle\n\nSourav Ganguly, as the president of the Board of Control for Cricket in India, must steer the ship in the most distressing times mankind has known.\n\nThe former India skipper is mindful of the sacrifices that players make in today’s times and for that reason he backs them in their pursuit to play cricket.\n\nIn this chat with Sportstar, Ganguly shares his thoughts on the challenges faced over the past 14 months, the forthcoming series in England, which he reckons, will be tougher than the one against Australia.\n\nThe COVID-19 situation is unlikely to improve anytime soon. So, what is the BCCI’s biggest immediate challenge? What are your thoughts on the situation?\n\nThe challenge has been there for a year now. COVID has hit us badly and we have all been struggling. Barring December 2020 to March 2021, it has been a battle against the pandemic. Battle to stay relevant. Battle to keep the people together. It has been extremely tough for all of us, and the cricketers were no exceptions.\n\nHow was the experience of hosting the IPL in 2020?\n\nHosting the IPL in Dubai was a challenge no doubt. Hosting domestic cricket was going to be a humungous task. Everything went off well until this massive and dreadful second wave of Covid came. You can imagine how difficult it has been to get cricket organised. We have the World Cup in five months' time. Till this pandemic remains it is going to be some task to organise any cricket.\n\nAre you not concerned about junior cricketers? They must be disillusioned since there has been no cricket for them for a long time...\n\nHow can we expose the young boys to this Covid atmosphere? Imagine a 16-year-old away from the home and their parents and staying in hotels for long periods. This virus is so dangerous. We write to the associations. We can’t have direct access to individuals. We keep the players motivated by speaking with them through their associations. They have a World Cup in January. Hopefully by October things will settle down. Covid has ruined so much of sport and life. We will compensate all the domestic players in June-July. The junior players, umpires, scorers, they will all get their fees.\n\nHow did you manage to host the India-England series without any glitches and also the domestic tournaments?\n\nBecause the numbers were down, and we had just two teams. The bio-bubbles were there. We had 760 players in the bio-bubble (during the domestic games), but the key was that the COVID numbers were down across the country — 7000 a day. Now we have more than 4 lakh daily cases.\n\nDo you think you erred in continuing with the 2021 IPL? Could it have been called off earlier?\n\nYou can say that now in hindsight that the IPL should have been called off earlier. Mumbai and Chennai (leg) did not have cases. Only when the IPL reached Delhi and Ahmedabad did the cases rise. People will say lot of things in any case. The English Premier League had so many people affected. But they could reschedule the matches. But you can’t do that with IPL. You stop it for seven days and it is done. Players go back home and then the process of quarantine starts from scratch.\n\nThe IPL and BCCI have drawn criticism from many quarters for continuing with the tournament. What will the BCCI do to counter this negative perception? Do you think the criticism coming IPL’s way was justified?\n\nThere are different scenarios, and it is not always helpful to be wise after the event. We don’t have the advantage. As I said we would have continued if there were no cases. We would have completed the IPL. The players were in the bubble and there were no crowds at the venues. Players were not getting infected. Once the players got affected, we called it off. Look at leagues going around the world. They have had COVID cases, but they have continued.\n\nIs there a possibility to hold the remainder of the tournament in England after the WTC final and before the England series? WTC final gets over on June 22 and the first Test starts on August 4. Or, after the England series?\n\nNo. India is supposed to go to Sri Lanka for three ODIs and five T20Is. There are lots of organisational hazards like 14-day quarantine. It can’t happen in India. This quarantine is tough to handle. Too early to say how we can find a slot to complete the IPL.\n\n(To read the full interview, go to https://sportstar.thehindu.com)",
    "Title": "Too early to say how we can find a slot to complete IPL: Ganguly"
  },
  {
    "Date": "Mon, 10 May 2021 08:33:33 +0530",
    "Description": "Chelsea is chasing a quadruple this season, having previously won the League Cup.",
    "Image": "https://th.thgim.com/sport/football/neqdp7/article34524066.ece/ALTERNATES/FREE_960/WomensChampionchelsea",
    "Link": "https://www.thehindu.com/sport/football/chelsea-retains-womens-super-league-title-in-england/article34524067.ece",
    "Text": "Chelsea is chasing a quadruple this season, having previously won the League Cup.\n\nChelsea retained the Women’s Super League title and became the all-time record champion in the English game by beating Manchester City to first place on Sunday.\n\nChelsea was a 5-0 winner at home to Reading and finished two points ahead of City, which won its final game — 1-0 at West Ham — but also needed Chelsea to lose to stand a chance of jumping into first.\n\nIt is a fourth league title for Chelsea, which now has one more than Arsenal since the first WSL season in 2011.\n\nChelsea is chasing a quadruple this season, having previously won the League Cup. The team plays Barcelona in the Women’s Champions League final on May 16 and is into the last 16 of the Women’s FA Cup.\n\nAustralia striker Sam Kerr scored one of Chelsea's goals and became just the second player to pass 20 goals in a WSL season, after Arsenal’s Vivianne Miedema in the 2018-19 campaign.\n\nKerr’s 21 goals saw her finish as the top scorer in the league.\n\n“This probably means the most to me out of all my golden boots,” she said. “I feel like a lot of people said I had to come to Europe to prove myself and here it is.”",
    "Title": "Chelsea retains Women’s Super League title in England"
  },
  {
    "Date": "Mon, 10 May 2021 07:48:50 +0530",
    "Description": "Chappell recalled a few incidents that led to the disruption of the game in the past.",
    "Image": "https://th.thgim.com/sport/cricket/z35d7v/article34520409.ece/ALTERNATES/FREE_960/IPLkb",
    "Link": "https://www.thehindu.com/sport/cricket/ipl-suspension-shows-games-vulnerability-world-t20-could-be-postponed-or-shifted-ian-chappell/article34520410.ece",
    "Text": "Chappell recalled a few incidents that led to the disruption of the game in the past.\n\nAustralian great Ian Chappell feels the suspension of IPL is a reminder of cricket's vulnerability and does not rule out the COVID-19 pandemic forcing a postponement or shifting of the upcoming T20 World Cup from India.\n\nThe 2021 edition of the lucrative T20 league was suspended earlier this week after four players - Sunrisers Hyderabad batsman Wriddhiman Saha, Delhi Capitals spinner Amit Mishra and KKR's Varun Chakravarthy and Sandeep Warrier - tested positive for COVID-19 in the bio-bubble.\n\n\"The suspension of the 2021 IPL tournament because of surging Covid infections and deaths among the public, and a number of participants testing positive, was a reminder of the game's vulnerability,\" Chappell wrote in his column for 'ESPNcricinfo'.\n\nIndia, which is grappling with a devastating second wave of the pandemic with cases rising by over 4 lakh everyday, is scheduled to host the T20 World Cup in October-November.\n\n\"In the current disastrous climate, the suspension of the IPL could also produce a precedent. It may lead to the World T20 event, programmed for India later in the year, either being postponed or moved.\"\n\nChappell recalled a few incidents that led to the disruption of the game in the past.\n\n\"In the past, tours have been aborted and matches abandoned for a variety of reasons. Many of these involved back stories, some of which were tragic and others amusing.\"\n\nThe 77-year-old recollected how poor weather during the 1970-71 Boxing Day Test between hosts Australian and England led to the first ever One-Day International.\n\n\"In 1970-71 the MCG Boxing Day Test between Australia and England was abandoned without a ball being bowled after heavy rain ruined any chance of a competitive match.\n\n\"That led to the first ever ODI being played in lieu of the Test in an effort to recoup some of the lost revenue. The match was agreed between officials of both countries without the players being consulted, and this angered many in the England camp.\n\n\"It was yet another arrow in the players' quiver in the build-up to the World Series Cricket (WSC) revolution in 1977-78. WSC is portrayed as an Australian uprising but that belies the fact that more than 50 players from many different countries were among the original signees.\"\n\nThe former Australia skipper also wrote about the time when Pakistan players forfeited a Test in 2006 against England over ball-tampering allegations.\n\n\"In 2006 the fourth Test between England and Pakistan came to a premature end with much recrimination. Pakistan forfeited the match after refusing to take the field when the team was accused of ball-tampering and penalised five runs.\n\n\"Despite cricket employing more sheriffs than you'd find in the old American Wild West, the Pakistan captain, Inzamam-ul-Haq, could not be coaxed into taking his team back onto the field. After a lengthy delay the match was awarded to England on a forfeit,\" he said.\n\n\"In a disgraceful attempt at compromise, the ICC subsequently declared the match a draw in 2008.\n\n\"However, integrity finally won out in 2009 when the decision was reversed at the behest of the MCC, who quite rightly claimed that to not uphold the laws set a dangerous precedent,\" Chappell said.",
    "Title": "IPL suspension shows game's vulnerability, World T20 could be postponed or shifted: Ian Chappell"
  },
  {
    "Date": "Mon, 10 May 2021 07:37:18 +0530",
    "Description": "The result left Atletico Madrid in first place with three games to go on 77 points, two ahead of second-placed Real and third-placed Barcelona.",
    "Image": "https://th.thgim.com/sport/football/18jxs/article34523961.ece/ALTERNATES/FREE_960/SPAIN-MAD-SEV-REPORTJPG",
    "Link": "https://www.thehindu.com/sport/football/title-chasing-real-madrid-snatch-draw-with-sevilla-after-var-drama/article34523962.ece",
    "Text": "The result left Atletico Madrid in first place with three games to go on 77 points, two ahead of second-placed Real and third-placed Barcelona.\n\nReal Madrid missed the chance to top La Liga after drawing 2-2 at home to Sevilla on Sunday but they earned a point when an own goal from Diego Carlos in added time added a final twist to a remarkable game containing two huge VAR decisions.\n\nThe result left Atletico Madrid in first place with three games to go on 77 points, two ahead of second-placed Real and third-placed Barcelona. Sevilla are fourth on 71.\n\nBrazilian midfielder Fernando put Sevilla in front midway through the first half after a headed effort from Real striker Karim Benzema had been ruled out for a marginal offside.\n\nA goal from Marco Asensio pulled Zinedine Zidane's side level in the 67th but the game swung back in Sevilla's favour in an extraordinary turn of events.\n\nReal launched a quick counter and Benzema earned a penalty when he was felled by goalkeeper Bono, but a VAR review led to the referee penalising Real defender Eder Militao for an earlier handball and awarding a spot kick to Sevilla instead.\n\nFormer Barcelona midfielder Ivan Rakitic kept his nerve to deceive Thibaut Courtois from the spot and restore Sevilla's lead in the 77th minute.\n\nHowever, Real somehow stayed alive in an enthralling title race when Toni Kroos tried his luck and saw his shot diverted into the net off the boot of Diego Carlos.\n\nReal coach Zinedine Zidane came on the pitch after the fulltime whistle to speak to referee Juan Martinez Munuera and admitted being annoyed by the penalty, awarded as Militao handled after leaping in the air to defend a cross.\n\n\"I'm very angry, someone needs to explain the handball rule to me. It's very difficult to take because we played very well but it is what it is,\" Zidane told reporters.\n\n\"I don't like to speak about the referees, but today the sensations are not good.\"\n\nHuge weekend\n\nThe own goal, in the third minute of added time, was the final twist in a huge weekend for the title race after Atletico stayed top with a 0-0 draw at Barca on Saturday.\n\nThe stalemate at the Camp Nou offered title holders Real the chance to lead the standings and leave their fate in their own hands although they went into the game in low spirits after their Champions League semi-final exit to Chelsea on Wednesday.\n\nZidane shook up his starting 11 by dropping Eden Hazard after the Belgian's poor display in the 2-0 defeat at Stamford Bridge and was without captain Sergio Ramos, ruled out with injury in a season riddled with fitness setbacks.\n\nThe Frenchman's side were poor in the first half but looked to have gone ahead when Benzema leapt to turn in an excellent cross from right back Alvaro Odriozola.\n\nThe goal was chalked off though as Odriozola's foot was a couple of inches offside, although the incident was overshadowed by the second VAR review in the second half of an entertaining contest with so much at stake at the top of the standings.\n\n\"We have let two points escape today, we did everything to win the game,\" said Real midfielder Luka Modric. \"But the ball wouldn't go in and then we earn a penalty which is taken away and another is given down the other end. But we're still alive.\"",
    "Title": "Title-chasing Real Madrid snatch draw with Sevilla after VAR drama"
  },
  {
    "Date": "Mon, 10 May 2021 07:48:16 +0530",
    "Description": "Star Sports roped in 18 sponsors across multiple categories for IPL 2021, while Disney+ Hotstar, the OTT platform which was streaming the matches live, had 14 sponsors",
    "Image": "https://th.thgim.com/sport/cricket/gvbl67/article34519479.ece/ALTERNATES/FREE_960/vbk-ipl-ap",
    "Link": "https://www.thehindu.com/sport/cricket/pay-only-for-ipl-matches-played-so-far-star-sports-tells-worried-sponsors-advertisers/article34519480.ece",
    "Text": "Star Sports roped in 18 sponsors across multiple categories for IPL 2021, while Disney+ Hotstar, the OTT platform which was streaming the matches live, had 14 sponsors\n\nStar Sports has told advertisers who had bought airtime on the now-suspended 14th edition of the popular Indian Premier Leage (IPL) cricket tournament to pay only for the matches that have been played, sources said.\n\nStar Sports bagged the IPL’s television and digital rights for 2018-2022 for ₹16,348 crore, agreeing to pay about ₹54.5 crore per game in a 60-match season. Only 29 games were played before the pandemic halted this year’s IPL.\n\nIt had sold slots during the match to advertisers for the season.\n\nThe broadcast major has approached its title sponsors and advertisers, which had bought airtime, informing them to pay for the played matches and an option to continue the deals when BCCI decides to resume the tournament for this season at a later stage. “Given the unprecedented times, Star India has reached out to all their advertisers informing them and their agencies to only bill for the inventory consumed so far. The contingency plan gives brands the first preference to continue the ad deals if and when BCCI decides to resume the league at a later stage,” said a source close to the development.\n\nIf the suspended IPL T20 is resumed by the BCCI, the advertisers will also have the flexibility to opt out from their ad deals.\n\n“This will enable brands to capitalise on the second burst and the transparency will ensure a minimum adverse impact on their business objectives,” the source added.\n\nEarlier last week, the Board of Control for Cricket in India (BCCI) had indefinitely suspended the IPL T20 cricket event due to a COVID-19 outbreak in its bio-bubble.\n\nThe 2021 edition had so far completed 29 of the 60 matches to be played.\n\nStar Sports roped in 18 sponsors across multiple categories for IPL 2021, while Disney+ Hotstar, the OTT platform which was streaming the matches live, had 14 sponsors.\n\nSeveral advertisers had claimed losses due to indefinite suspension of the tournament, although industry insiders said it was the right thing to do considering the current surge in COVID-19 cases in the country.\n\nThis year, IPL had witnessed encouraging response and according to the data sourced from Broadcast Audience Research Council (BARC) India, nearly every third TV-owning household in India watched the opening match live.\n\nThe BARC data suggested that for the first 26 matches played in IPL 2021, Star India network has garnered a cumulative reach of 352 million, compared with 349 million for IPL 2020.\n\nCommenting on this, a Star Sports spokesperson had last week said, “While it’s heartening to know that more viewers tuned in to watch this IPL season than the one in 2020 [at the same stage of the tournament], we still believe that postponing the season was the right decision to ensure the safety of everyone involved and in line with the prevailing situation in the country.” The IPL 2021 was broadcast in seven languages.",
    "Title": "Pay only for IPL matches played so far, Star Sports tells worried sponsors & advertisers"
  },
  {
    "Date": "Mon, 10 May 2021 07:52:45 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/sports/cricket/ipl/top-stories/could-the-ipl-bubble-been-secured-better/articleshow/82513128.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82513128.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>The breach of the bio-bubbles in the IPL has led to a debate within the cricket board whether the cricket league could have been held inside a much more secure central bubble. Some board members feel that IPL should have taken a leaf out of the way the Indian Super League was conducted between Nov 20, 2020, and March 13, 2021 - a total of 114 days with a 195 days long bubble.",
    "Image": "https://static.toiimg.com/thumb/msid-82513112,width-1070,height-580,imgsize-112014,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/sports/cricket/ipl/top-stories/could-the-ipl-bubble-been-secured-better/articleshow/82513128.cms",
    "Text": "Indian Super League\n\nbio blueprint was given to\n\nBCCI\n\nbut board rejected it outright\n\nMUMBAI/PANAJI: The breach of the bio-bubbles in the Indian Premier League ( IPL ) has led to a debate within the cricket board whether the cricket league could have been held inside a much more secure central bubble.Some board members feel that IPL should have taken a leaf out of the way the Indian Super League (ISL) was conducted. The Football Sports Development Limited, a subsidiary of Reliance Industries that operates ISL with the All India Football Federation ( AIFF ), had offered to the Indian cricket board (BCCI) for the construction of a safe central bio-secure bubble for the 2021 edition of IPL.The eleven-franchise ISL was conducted between November 20, 2020 and March 13, 2021 - a total of 114 days. The overall bubble to conduct this league and its operations came into effect from the start of September until the end of the tournament - 195 days. Having implemented it successfully, FSDL offered the draft to the BCCI for safe conduct of the IPL. This idea was 'politely turned down' by BCCI.When this year's IPL was planned, Covid-19 was on the wane, there was a sense of relative security and of a sense that the worst was over. BCCI decided to host the 52-day IPL, involving 60 matches, across six cities. It decided to have it at six different centres, believing in the fact that the European football leagues had been successful in doing it. It did not hire a central IT and safety firm. In doing so, did it expose itself to the risk of flying between matches, not constructing a central bio-bubble?What worked for ISL was that it could provide for enough manpower, enough RT-PCR tests and the logistics to ensure that nothing went wrong. The FSDL spent an approximate Rs 17 crore on the safety measures. ISL zeroed in on three potential venues to host the league - Goa, Kerala and Kolkata - but eventually decided to do away with Kerala and Kolkata because of the impending state elections. BCCI's six venues to host the IPL included Kolkata and Chennai, where elections were being planned. \"It had to be one city,\" ISL sources said.Soon after the ISL ended, FSDL chairperson Nita Ambani said: \"In spite of the global pandemic, despite the odds against us, the fear and uncertainty, this season of ISL has brought immense joy, cheer and celebrations back into our lives.\"In fact, BCCI president Sourav Ganguly himself spoke of the league's bio-bubble highly. \"The successful completion of the ISL in these challenging times is indeed a new benchmark for the Indian sports industry.\"However, what is clear is that IPL got caught in a nightmarish second wave when the monster was air borne. Nobody envisaged that.",
    "Title": "Could the IPL have been played in a more secure central bio-bubble?"
  },
  {
    "Date": "Mon, 10 May 2021 10:57:18 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/sports/cricket/ipl/top-stories/remaining-ipl-games-cant-be-played-in-india-bcci-chief-sourav-ganguly/articleshow/82515407.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82515407.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>Sourav Ganguly, head of the BCCI, said that COVID-19 restrictions meant it was impossible to stage the remaining games in India. \"There are lots of organisational hazards like 14-day quarantine. It can't happen in India,\" Ganguly said. \"This quarantine is tough to handle. Too early to say how we can find a slot to complete the IPL.\"",
    "Image": "https://static.toiimg.com/thumb/msid-82515393,width-1070,height-580,imgsize-54478,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/sports/cricket/ipl/top-stories/remaining-ipl-games-cant-be-played-in-india-bcci-chief-sourav-ganguly/articleshow/82515407.cms",
    "Text": "NEW DELHI: The remainder of the suspended Indian Premier League ( IPL ) season will have to be played outside the country, the organising Indian cricket board said, though it is unclear whether a window can be found to play the outstanding 31 games.The popular Twenty20 league was suspended indefinitely last week after several personnel tested positive for COVID-19. India reported 366,161 new COVID-19 infections on Monday, taking the caseload to 22.66 million.Sourav Ganguly , head of the Board of Control for Cricket in India ( BCCI ), told Sportstar magazine that COVID-19 restrictions meant it was impossible to stage the remaining games in India.\"There are lots of organisational hazards like 14-day quarantine. It can't happen in India,\" Ganguly said.\"This quarantine is tough to handle. Too early to say how we can find a slot to complete the IPL.\"Warwickshire, Surrey and the Marylebone Cricket Club ( MCC ) are keen to host the remaining matches in September, but a BCCI official told Reuters on Friday they were yet to discuss the offer.The entire 2020 tournament was played in the United Arab Emirates because of the pandemic.Ganguly also said India would play three one-dayers and five Twenty20 Internationals in Sri Lanka in July though the BCCI is likely to field a second-string squad.Virat Kohli's side are due to leave for England in early June for the World Test Championship final in Southampton against New Zealand. They will then play a five-Test series against England.",
    "Title": "Remaining IPL games can't be played in India: BCCI chief Sourav Ganguly"
  },
  {
    "Date": "Mon, 10 May 2021 11:19:30 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/sports/cricket/ipl/top-stories/ipl-2021-varun-chakravarthy-sandeep-warrier-back-home-after-completing-mandatory-isolation/articleshow/82515732.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82515732.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>Tamil Nadu's Chakravarthy was officially the first player in this edition of the IPL, who contracted the infection after going for some medical scans. Subsequently, two of his teammates, Warrier and Prasidh Krishna, were also infected by the virus.",
    "Image": "https://static.toiimg.com/thumb/msid-82515690,width-1070,height-580,imgsize-48584,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/sports/cricket/ipl/top-stories/ipl-2021-varun-chakravarthy-sandeep-warrier-back-home-after-completing-mandatory-isolation/articleshow/82515732.cms",
    "Text": "NEW DELHI: Kolkata Knight Riders' leg-spinner Varun Chakravarthy and pacer Sandeep Warrier , who were the first to test positive for COVID-19 in the currently-suspended IPL 's bio-bubble, have returned to their respective home cities after completing 10 days of mandatory isolation.Tamil Nadu's Chakravarthy was officially the first player in this edition of the IPL, who contracted the infection after going for some medical scans.Subsequently, two of his teammates, Warrier and Prasidh Krishna , were also infected by the virus.The Kerala-based Warrier's interaction with Delhi Capitals veteran Amit Mishra led to the veteran being found positive as well, causing ultimately the league's suspension.\"Yes, Chakravarthy and Sandeep have gone home. They have completed 10 days of mandatory isolation. However, KKR as a franchise will keep monitoring their health,\" a BCCI official in know of things told PTI on Monday.\"They will undergo RT-PCR tests in Chennai and Kerala respectively,\" he added.Both Chakravarthy and Warrier did not show any major symptoms for the infection.However, New Zealander Tim Seifert, another COVID positive KKR recruit, is still in isolation. The IPL was suspended on May 4.",
    "Title": "Chakravarthy, Warrier back home after completing mandatory isolation"
  },
  {
    "Date": "Mon, 10 May 2021 08:15:45 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/sports/tennis/top-stories/alexander-zverev-downs-matteo-berrettini-to-clinch-second-madrid-open-crown/articleshow/82513315.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82513315.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>Alexander Zverev underlined his credentials as a French Open title contender with a battling 6-7(8), 6-4, 6-3 victory over Italian Matteo Berrettini on Sunday to claim his fourth Masters 1000 crown and second Madrid Open title.",
    "Image": "https://static.toiimg.com/thumb/msid-82513328,width-1070,height-580,imgsize-642796,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/sports/tennis/top-stories/alexander-zverev-downs-matteo-berrettini-to-clinch-second-madrid-open-crown/articleshow/82513315.cms",
    "Text": "MASTER OF MADRID 🏆@AlexZverev is the @MutuaMadridOpen champion for the second time! https://t.co/gu1gKGPvKa — ATP Tour (@atptour) 1620588385000\n\n🏆🇮🇹🏆🇨🇦🏆🇪🇸🏆🇪🇸@AlexZverev wins his fourth ATP Masters 1000 title 👏 #MMOPENhttps://t.co/6zabemSOls — ATP Tour (@atptour) 1620588604000\n\nLift it up 🙌🏆🎥: @TennisTV | @AlexZverev | #MMOPENhttps://t.co/KdgnX0Q3zl — ATP Tour (@atptour) 1620589925000\n\nCaja Mágica - you are my happy place!🤗 Thrilled about winning my 4th ATP Masters 1000 title!🏆 Thank you everyone… https://t.co/QqacGx0Bp0 — Alexander Zverev (@AlexZverev) 1620596501000\n\nAlexander Zverev underlined his credentials as a French Open title contender with a battling 6-7(8), 6-4, 6-3 victory over Italian Matteo Berrettini on Sunday to claim his fourth Masters 1000 crown and second Madrid Open title.Germany's Zverev, conqueror of claycourt specialists Rafa Nadal and Dominic Thiem en route to the final, dropped his first set of the tournament. However, he fought back under a closed roof at the Manolo Santana stadium to lift his first claycourt title since 2019.\"I feel awesome,\" Zverev said at a courtside interview. \"It's great. This is definitely a special win. I just want to enjoy it. I didn't play too many guys who can serve like him, so it was a difficult match.\"Berrettini showed no sign of nerves in his maiden ATP 1000 final and landed the first blow, taking a see-sawing opening set in a tie-break, where he initially let slip a 5-0 advantage and then saved a set point.But Zverev, who was champion in Madrid in 2018, hit back strongly in the second set, breaking the 25-year-old Italian in the ninth game to force a decider.With unforced errors creeping into Berrettini's game, the Italian squandered a break point at 2-2 and then proceeded to drop his own serve as Zverev inched closer to victory.The fifth seeded German did not let up and another break confirmed the win in two hours and 40 minutes.Zverev will shift his focus to Rome next week before continuing his pursuit of a maiden Grand Slam title at Roland Garros, where he has never been beyond the quarter-finals.\"It's difficult to switch, but Rome is also an event I like and I hope I can perform the same way,\" Zverev said.",
    "Title": "Zverev downs Berrettini to clinch second Madrid Open crown"
  },
  {
    "Date": "Mon, 10 May 2021 09:32:14 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/sports/cricket/ipl/top-stories/ipl-2021-kkr-players-sunil-narine-andre-russell-arrive-safely-in-caribbean/articleshow/82514249.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82514249.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>All the Caribbean players, who participated in the currently postponed Indian Premier League, have reached home following concerted efforts by the BCCI and their respective franchises, Cricket West Indies CEO Johnny Grave has said.",
    "Image": "https://static.toiimg.com/thumb/msid-82514255,width-1070,height-580,imgsize-452175,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/sports/cricket/ipl/top-stories/ipl-2021-kkr-players-sunil-narine-andre-russell-arrive-safely-in-caribbean/articleshow/82514249.cms",
    "Text": "\"Our IPL players, along with the West Indians who were part of the TV production, are now safely back in the Caribb… https://t.co/2guLkXQp7a — Windies Cricket (@windiescricket) 1620569372000\n\nST.JOHN'S (Antigua): Kolkata Knight Riders ( KKR ) spinner Sunil Narine and all-rounder Andre Russell have \"safely\" arrived in the Caribbean following the postponement of the Indian Premier League ( IPL ) 2021.Narine and Russell along with West Indians who were part of the TV production in the suspended IPL reached the Caribbean, informed Windies cricket on Sunday.Cricket West Indies CEO Johnny Grave thanked the Board of Control for Cricket in India ( BCCI ) and IPL teams for arranging their safe travel.\"Our IPL players, along with the West Indians who were part of the TV production, are now safely back in the Caribbean. We are grateful to the @BCCI and IPL Franchises for arranging their safe travel back to the Caribbean so quickly,\" Windies Cricket tweeted.",
    "Title": "IPL 2021: KKR's Sunil Narine, Andre Russell arrive 'safely' in Caribbean"
  },
  {
    "Date": "Mon, 10 May 2021 08:56:40 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/sports/more-sports/shooting/abhishek-verma-hopes-for-virtual-guidance-as-pistol-coaches-give-croatia-trip-a-miss/articleshow/82513828.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82513828.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>With the second wave of Covid-19 pandemic raging across the globe, resulting in uncertainty over the conduct of the Tokyo Olympics in July, World No. 1 pistol shooter Abhishek Verma isn't much bothered with the distraction.",
    "Image": "https://static.toiimg.com/thumb/msid-82513819,width-1070,height-580,imgsize-47380,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/sports/more-sports/shooting/abhishek-verma-hopes-for-virtual-guidance-as-pistol-coaches-give-croatia-trip-a-miss/articleshow/82513828.cms",
    "Text": "Role of coaches\n\nWC boost in Croatia\n\nLate bloomer to India's medal hope\n\nCHANDIGARH: With the second wave of Covid-19 pandemic raging across the globe, resulting in uncertainty over the conduct of the Tokyo Olympics in July, World No. 1 pistol shooter Abhishek Verma isn't much bothered with the distraction.The 30 year-old from Panipat , is focused on the task which comes with the pinnacle of sport.\"I am not even thinking about whether the Olympics will be held or not. I am training with the belief that it will go ahead. Whatever is the next competition, I am focusing on that,\" he said at a virtual media interaction facilitated by Sports Authority of India .\"I am very happy that there the NRAI has decided to have a camp in Croatia, as the situation in India is very tough to conduct training camps.\"\"After the last World Cup in March, I could not continue regular training due to the Covid restrictions, and now after getting vaccinated, I lost 3-4 days to exhaustion. In Croatia, the focus will be solely on training and work on a few things around,\" said the 2019 Beijing World Cup gold medallist.Responding to a question on how Tokyo 2020 would be different and how it brings about changes to the routine of athletes, Verma said his is always on training and on competitions when he enters one.\"I focus on how I can give my best on every shot in every competition. Whatever external situation arises, I will adapt to that,\" he said.\"Even in the World Cup (in New Delhi) last month, we had to make certain adjustments, like wearing masks. There were shields separating shooting lanes. It was awkward constantly having to remember to put on the mask. Whatever be the situation, we have to face it and adapt. The most important thing is performance,\" he said.As part of the Olympics-bound Indian team which will be based in Croatia before proceeding to Tokyo, Verma said this trip would help him retain his focus despite being away from family.India's top pistol shooters and the most likely Olympic medal contenders will be without their coaches from now till the start of the Games in Tokyo. They include Abhishek, Manu Bhaker and Saurabh Chaudhary as the trio will board the chartered flight to Zagreb sans their mentors Jaspal Rana, Ronak Pandit and Samaresh Jung, skipping the tour due to personal reasons.Bhaker, Chaudhary and Verma train directly under the three coaches. Acknowledging the role of a coach in providing those finishing touches before the showpiece event, Abhishek said he will carry his Go Pro camera to live telecast his training for his mentors in India.\"The coaches play a very important role, more so in the next three months. For any last minute adjustments before the Olympics, the presence of a coach is very crucial.\"\"He knows our game, our strengths and weaknesses, and in the run-up to a major tournament like the Olympics, only a coach can fix the minute details,\" he said.But the trio can surely bank on the services of the two pistol coaches Pavel Smirnov and Ved Prakash, who will be traveling to Zagreb. In addition, seven rifle coaches, four physiotherapists and two physical trainers too will make the trip.In addition to the European Championships, Osijek will also host a World Cup from June 22-July 3, the ISSF announced on Friday. The tournament, which will include individual, team and mixed team events in rifle, pistol and shotgun, will throw open another competitive opportunity for Indian shooters camping in Zagreb.\"It was a setback for us after the cancellation of the World Cup in Azerbaijan. But with the European Championships, and a World Cup in Croatia, scheduled so close to the Olympics, it will definitely help us analyse our performances,\" Abhishek said.The Osijek WC will be held in place of the one earlier scheduled in Baku, Azerbaijan (from June 21 to July 2) but got cancelled due to a surge in Covid-19 cases in that country.The Indian team will fly out by a special chartered plane on May 11, before serving a seven-day quarantine on arrival and then participate in the May 20-June 6 European Championships in the Minimum Qualification Score (MQS) category (won't be eligible for medals). After training for a few more days in Zagreb, they will head back to Osijek for the World Cup.An advocate in the Punjab and Haryana High Court, Abhishek started shooting competitively only at the age of 27 and made a meteoric rise. Once described as a hobby shooter, Verma feels age is no bar in becoming a successful shooter.\"People look at me and say that they are 23 or 24 and ask if they can start shooting. I tell them I started at 27. Once I realised I liked shooting, I worked hard on it and not just like a hobby, that is why I am in the Indian team. Age does not matter but if you were willing to work hard, you can achieve anything,\" he said.Verma has an impressive record where he rose to fame by winning a bronze medal at the 2018 Asian Games and following that up with a gold medal at the 2019 Beijing World Cup with which he won a quota place at the Tokyo Olympics. He also won the gold medal the same year at the Rio de Janeiro World Cup. He was inducted in the Target Olympic Podium Scheme in December 2018 and has so far received Rs. 16.73 lakh through out of pocket allowance and customised support.",
    "Title": "Abhishek Verma hopes for virtual guidance as pistol coaches give Croatia trip a miss"
  },
  {
    "Date": "Mon, 10 May 2021 04:27:35 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/05/psg.jpg",
    "Link": "https://indianexpress.com/article/sports/football/psg-losing-grip-on-title-after-draw-at-rennes-monaco-wins-7309039/",
    "Text": "PSG's Neymar, center, fights for the ball with Rennes' Flavian Tait, right, during a French League One Soccer match between Rennes and PSG at the Roazhon Park stadium in Rennes (Source: AP)\n\nParis Saint-Germain’s title defense hangs by a thread after a 1-1 draw at Rennes on Sunday left it three points behind leader Lille with only two games left.\n\nPSG led through Neymar’s penalty seconds before halftime. It was given after a long video review, even though it looked like Nayef Aguerd made a clean tackle in the area on left back Layvin Kurzawa.\n\nAfter PSG goalkeeper Keylor Navas saved midfielder Flavien Tait’s fine curler from 20 meters (yards) out midway through the second half, Rennes striker Serhou Guirassy superbly headed home winger Benjamin Bourigeaud’s corner in the 70th.\n\nPSG had center half Presnel Kimpembe recklessly sent off near the end, and could have lost for the ninth time in the league this season. But the alert Navas saved again from Tait’s drilled shot in the first minute of injury time.\n\nSeventh-place Rennes was rewarded for a strong performance by slightly closing the gap to one point on Lens and fifth-place Marseille in the Europa League spot.\n\nLille looks odds-on for its first title since 2011 and has a better head-to-head record after drawing at home to PSG and winning away.\n\nWith two remaining rounds, PSG is just two points ahead of third-place Monaco, which won 1-0 at Reims to stay in the Champions League spots.\n\nMarseille dropped crucial points in the race for the Europa League after a 1-0 defeat at Saint-Etienne but is fifth on goal difference.\n\nMonaco struck in the 20th minute through midfielder Eliot Matazo, who made a surging run from deep inside his own half and swapped passes with Wissam Ben Yedder on the edge of the penalty area before finishing confidently.\n\nIt was Monaco’s sixth win in the past seven games without conceding a goal, a perfect copy only blotted by last weekend’s defeat at Lyon.\n\nMidtable Saint-Etienne’s goal came in the 43rd minute when Arnaud Nordin turned in Wahbi Khazri’s cross from the left at the back post.\n\nAfter Marseille goalkeeper Steve Mandanda had prevented further goals, the visitors almost equalized when substitute Dario Benedetto’s late header was saved.\n\nMarseille defender Alvaro Gonzalez criticized the attitude of his teammates.\n\n“I’m angry because we didn’t score today,” he told broadcaster Canal Plus. “I think the team doesn’t understand how important these games are to be European next season.”\n\nElsewhere, it was: Angers 3, Dijon 0; Nice 3, Brest 2; Metz 0, Nimes 3; and Strasbourg 2, Montpellier 3.\n\nNimes is 19th and two points behind Nantes in 18th _ the relegation-playoff position _ with two rounds remaining.\n\nLille won 3-0 at Lens on Friday.",
    "Title": "PSG losing grip on title after draw at Rennes; Monaco wins"
  },
  {
    "Date": "Mon, 10 May 2021 04:16:01 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/05/manchester-united.jpg",
    "Link": "https://indianexpress.com/article/sports/football/english-premier-league/manchester-united-makes-city-wait-to-capture-premier-league-title-west-brom-relegated-7309009/",
    "Text": "The wait goes on for Manchester City. Time is up for West Bromwich Albion.\n\nManchester United underlined its determination to make City, its fierce local rival, fight to clinch the Premier League trophy by prolonging the title race for at least a couple more days.\n\nUnited beat Aston Villa 3-1 on Sunday to leave City still needing three points to reclaim the biggest prize in English football. It is the 10th time United has come from behind to win in the league this season.\n\nCity blew a chance to seal the title itself by losing 2-1 to Chelsea on Saturday.\n\nAs for West Brom, there are no more chances. A 3-1 loss at Arsenal sealed West Brom’s fate as the second team to get relegated, after Sheffield United, and ended manager Sam Allardyce’s proud record of never having been demoted from England’s top division in his 30-year managerial career.\n\nCity’s next game is away to Newcastle on Friday but Pep Guardiola’s players might be celebrating by then anyway. United plays twice before that, against Leicester on Tuesday and Liverpool on Thursday, and knows a loss in either of those matches _ against teams fighting desperately for Champions League qualification _ will hand City a third league championship in four years under Guardiola.\n\nUnited will surely not be at full strength for both games _ manager Ole Gunnar Solskjaer has already made public his displeasure at being forced to play three times in five days _ especially given that captain Harry Maguire hobbled off with an ankle injury against Villa that Solskjaer said could sideline the defender for “a few weeks.”\n\nStill, two victories for United in the coming days would put serious pressure back on City ahead of the leaders’ trip to St. James’ Park, where they have lost and drawn in their last two visits in the league.\n\nSecond-half goals by Bruno Fernandes _ from the penalty spot _ Mason Greenwood and substitute Edinson Cavani completed United’s latest comeback at Villa Park and ensured a top-four finish for the second straight season.\n\nThat hasn’t happened since long-time manager Alex Ferguson retired in 2013.\n\n“The players are learning,” Solskjaer said. “They’re getting better. The spirit, the camaraderie. They back each other.\n\n“There’s competition for places (in the top four) so I’m very happy that we’ve done that twice now.”\n\nOllie Watkins was sent off in the final minutes for Aston Villa for collecting a second yellow card after being adjudged to have dived in an attempt to win a penalty.\n\nWEST BROM DOWN\n\nA 19th defeat of the campaign left next-to-last West Brom 10 points from safety with just three games remaining. Fulham will join West Brom and Sheffield United in going down if it loses at home to Burnley on Monday.\n\nGoals by Emile Smith Rowe, Nicolas Pepe and Willian condemned West Brom to an immediate return to the second-tier Championship.\n\nAllardyce, the former England manager, joined West Brom in December with the team in 19th place and owning a reputation as a survival specialist. He hadn’t been relegated with any of the previous seven top-flight clubs he managed, but this was always going to be his biggest challenge.\n\n“I’m not saying we would have avoided relegation but at least we should have been closer, we should have been in the last three games, based on how we performed,“ the 66-year-old Allardyce said. “The creating of chances has been there but the conversion has not.”\n\nWEST HAM’S WOE\n\nWest Ham has been one of those teams providing competition for the Champions League qualification positions but its dreams of a first-ever finish in the Premier League’s top four faded after losing 1-0 at home to Everton.\n\nLeicester, which was beaten 4-2 by Newcastle on Friday, occupies the final qualification place and is five points ahead of fifth-place West Ham. Liverpool is a point and place further back with a game in hand.\n\nDominic Calvert-Lewin scored Everton’s winner in the 24th minute, for his 16th goal of a campaign, and Carlo Ancelotti’s team still has much to play for as it is three points behind West Ham also with a game in hand.\n\nBRIGHTON WAITING\n\nBrighton is still not assured of another season in the top flight after squandering the lead to lose 2-1 at Wolverhampton.\n\nLewis Dunk put Brighton ahead with a header from a corner but was sent off in the 53rd minute for a professional foul. Wolverhampton scored in the 76th through substitute Adama Traore before Morgan Gibbs-White curled in the winner in the 90th.\n\nNeal Maupay became the second Brighton player to get a red card for arguing with the referee after the final whistle.\n\nBrighton is 10 points clear of third-to-last Fulham.",
    "Title": "Manchester United makes City wait to capture Premier League title, West Brom relegated"
  },
  {
    "Date": "Mon, 10 May 2021 04:32:21 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/05/zverev.jpg",
    "Link": "https://indianexpress.com/article/sports/tennis/zverev-beats-berrettini-to-win-his-second-madrid-open-title-7309054/",
    "Text": "Alexander Zverev continued his impressive form going into the French Open by winning his second Madrid Open title on Sunday.\n\nAfter beating top-seeded Rafael Nadal in the quarterfinals and fourth-ranked Dominic Thiem in the semifinals, Zverev rallied to defeat Matteo Berrettini 6-7 (8), 6-4, 6-3 for his second title this season. The sixth-ranked German also won the Mexican Open in Acapulco in March.\n\nZverev won his first Madrid title in 2018 in a final against Thiem. The win on Sunday gave him his fourth Masters 1000 title, and first in three years. Zverev will be trying to improve from his fourth-round exit last year at the French Open.\n\n“To do well at the French Open, you need to be playing well during the clay court season,” the 24-year-old Zverev said. “That is in a way important for me, as well. At the end of the day I won a Masters. There’s really very little in terms of bigger than this one right here. I’m happy with this achievement. Obviously, yeah, I look forward to the next few weeks. I look forward to what’s ahead.”\n\nThe 10th-ranked Berrettini won the title in Belgrade last week. The Italian has been gradually returning to form after struggling with an abdominal injury that kept him from playing his quarterfinal match against Stefanos Tsitsipas at the Australian Open. The injury kept Berrettini out until Monte Carlo, where he lost his opening match.\n\n“This was my first (Masters 1000) final. Hopefully it’s not going to be my last,” Berrettini said. “But like I said before, I’m really happy on my level. Today unfortunately I think I didn’t play my best tennis.”\n\nAfter exchanging a break each in the first set, Berrettini opened the tiebreaker with a 5-0 lead but allowed Zverev to come back. The Italian closed it out on his fourth set point after Zverev also squandered a set point in the back-and-forth tiebreaker. It was the first set dropped by Zverev this week.\n\nZverev, who finished with seven double-faults, evened the match after breaking Berrettini at 4-4 and serving out to clinch the second set at the Magic Box center court, which had its roof closed because of rain in Madrid.\n\nBerrettini, who ended with 50 unforced errors, squandered a break point early in the third set, and Zverev broke him in the following game to take the lead. He earned another break at the end, converting on his second match point to clinch the victory.\n\nIn the men’s doubles final, Marcel Granollers of Spain and Horacio Zeballos of Argentina defeated Nikola Mektic and Mate Pavic of Croatia 1-6, 6-3, 10-8.\n\nThe Madrid Open was one of the first sporting events in Spain that allowed the presence of a limited number of fans. The tournament was among those canceled last year because of the coronavirus pandemic. Local health workers were honored by tournament organizers before the final on Sunday.\n\nIn the women’s edition, Aryna Sabalenka beat top-ranked Ash Barty 6-0, 3-6, 6-4 in Saturday’s final.",
    "Title": "Zverev beats Berrettini to win his second Madrid Open title"
  },
  {
    "Date": "Mon, 10 May 2021 03:46:26 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/05/zlatan-ronaldo.jpg",
    "Link": "https://indianexpress.com/article/sports/football/juventus-in-danger-of-missing-out-on-top-four-after-loss-to-ac-milan-7308992/",
    "Text": "Juventus started the season looking to win a 10th straight Serie A title but instead find themselves in danger of missing out on a Champions League spot after a 3-0 home defeat by top-four rivals AC Milan on Sunday left them fifth with three games left.\n\nGoals from Brahim Diaz, Ante Rebic and Fikayo Tomori secured the win and sent Milan up to third on 72 points from 35 matches, leaving Juve a point behind fourth-placed Napoli and needing teams to drop points as they battle for a top-four finish.\n\nBrahim curled home a stunning opener just before the break to give the visitors the halftime lead and they had a chance to extend the advantage in the 56th minute only for Franck Kessie’s penalty to be saved by Wojciech Szczesny.\n\nThat miss did not prove costly, however, as substitute Rebic arrowed a fine strike into the net 12 minutes from time before defender Tomori, on loan from Chelsea, headed a third goal to seal a crucial win for Milan four minutes later.\n\n“It was a very special night for us,” Tomori told Sky Sport Italia. “This result and my goal made the night special.”This victory gives us an advantage but nothing has been decided yet (in top four race). Now we have to continue like this and stay focused for the next match against Torino.\n\n“Used to battling it out for the Scudetto in the past, Juve and Milan looked like two teams who were unsure of a top-four finish in a nervous first half.\n\nOther than a header from Giorgio Chiellini, Juve struggled to create anything, with Cristiano Ronaldo unusually quiet.\n\nBrahim lit up a poor first half after Szczesny did not get enough on a punch, with the Real Madrid loanee finding the top corner on his first start for Milan since March.\n\nAfter the break, Juve did improve, with Ronaldo finally getting a shot away, but he could not find the target with his left foot, while Milan had to withdraw their top goalscorer this season, Zlatan Ibrahimovic, due to an injury.\n\nChiellini’s clumsy handball gifted Milan the chance to extend their lead, after a lengthy VAR review. However, Szczesny came to the rescue – the Pole’s third penalty save from the last four spot kicks he has faced in Serie A against Milan.\n\nIt was Ibrahimovic’s replacement Rebic who effectively ended Juve’s hopes of getting something from the match, before Tomori picked an opportune moment to score his first goal for Milan.\n\nThe final whistle was greeted with wild scenes of celebration from Milan staff and players, with their first away league win at Juve since March 2011 putting them in a strong position to return to the Champions League, potentially at their opponent’s expense.",
    "Title": "Juventus in danger of missing out on top four after loss to AC Milan"
  },
  {
    "Date": "Mon, 10 May 2021 02:39:54 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/05/rm-sevilla.jpg",
    "Link": "https://indianexpress.com/article/sports/football/la-liga/zidane-bewildered-by-handball-decision-as-real-madrid-title-hopes-slip-7308927/",
    "Text": "Real Madrid's Eder Militao jumps for the ball with Osasuna's David Garcia during the Spanish La Liga soccer match between Real Madrid and Osasuna at the Alfredo di Stefano stadium in Madrid (Source: AP)\n\nReal Madrid coach Zinedine Zidane was left baffled after two handball calls went against his side in Sunday’s enthralling 2-2 draw at home to Sevilla which left Los Blancos still trailing La Liga leaders Atletico Madrid in the title race.\n\nWith the game poised at 1-1, Real’s Eder Militao was penalised after a VAR review for touching the ball with his hand as he jumped to defend a cross.\n\nThe decision meant that a penalty which had been awarded to the hosts moments earlier for a foul on Karim Benzema by Sevilla goalkeeper Bono was overruled.\n\nIvan Rakitic scored from the spot to restore Sevilla’s lead but a Diego Carlos own goal in the 93rd minute snatched a point for Real to leave them two points behind Atletico.\n\nZidane’s side had appealed for a penalty in the first half when the ball struck the arm of Sevilla’s Joan Jordan although, unlike Militao, the midfielder had not extended his arm.\n\n“I don’t understand it at all. If it’s a handball against Militao it has to be a handball against Sevilla too,” Zidane told Spanish network Movistar Plus.\n\nThe French coach prides himself on rarely discussing refereeing decisions but he took to the pitch after the game to remonstrate with official Juan Martinez Munuera.\n\n“He told me that Militao’s was a handball but he didn’t convince me,” added Zidane.\n\n“I never speak about the referee but today I’m angry. In the end it is what it is and what I say won’t change anything. I’m happy with how my team played, we deserved more as we were spectacular in the second half.”\n\nReal director Emilio Butragueno joined Zidane in expressing his frustration with the decision, recalling his side were denied a penalty against Atletico in March when the ball came off the hand of defender Felipe when he jumped for a header.\n\n“We’re not having much luck with plays like this. We’ve been in a few similar situations this season and once again the decision went against us,” he said.\n\n“It was an absolutely decisive decision given the moment in the game and what it meant, a penalty for Sevilla or a penalty for Real Madrid.\n\n“We’re concerned as there have been some similar plays which in theory would have gone in our favour and the outcome has been different. We’re left feeling a little uneasy.”",
    "Title": "Zidane bewildered by handball decision as Real Madrid title hopes slip"
  },
  {
    "Date": "Mon, 10 May 2021 03:32:39 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/05/avesh-khan_d.jpg",
    "Link": "https://indianexpress.com/article/sports/cricket/avesh-khan-travels-tough-road-to-ipl-success-and-england-7308962/",
    "Text": "“Those people who had said that I couldn’t do anything are messaging me now. I have become popular overnight. I am enjoying it but my father tells me to stay grounded, and that fame doesn’t last long,” Avesh Khan has turned philosophical in a blink.\n\nGood things are happening in his life. His performances in the Indian Premier League (14 wickets) brought recognition from people in his hometown. He will now travel to England as a stand-by for the World Test Championship final and the subsequent five-Test series against England.\n\nThe journey to here hasn’t been easy. When Khan was 14, his family faced a sudden reversal in fortunes. Father Mohammad Ashique Khan had a small paan shop by the roadside in Indore, which was demolished by the local authorities to widen the road.\n\nHe remembers the day clearly. The mood at home was suddenly sombre. The road construction began, as did the family’s struggles for the next two years. “Gumti (paan shop) se papa used to earn 500 rupees but one day it was broken. Suddenly for the next two years, life was full of struggle. I told myself, ‘kuch karna hi padega, aise nahi chalega’, (I have to do something, life can’t continue like this)”. And Khan has done it. He is now a hero in his area.\n\nSign language\n\nTalk about the latest exploits – in the IPL – and he zooms in to his collaboration with Delhi Capitals captain Rishabh Pant. Both hit upon a working method during the tournament: At the top of his run-up, Khan would glance at Pant to spot a sign. They had pre-determined signs for the different balls to be bowled.\n\n“When I was about to start my bowling run-up, I used to look at Pant. At that moment the batsman is watching only me, and not anyone else. So if Pant wants me to bowl a yorker, we have a sign for it. If he wants me to bowl wide outside off, I will know by his sign,” he tells this newspaper.\n\nKhan brings up the dismissal of MS Dhoni to detail his point. He had wanted to have a long-on but Pant wanted to keep the fielder inside the circle, at mid-on. “Only a few overs were left and Pant knew that Dhoni will try to hit out. But he also knew that Dhoni is playing after a gap of four months and it won’t be easy for him. Pant told me to bowl just short of a length. I did just that, Dhoni tried to hit, but got an inside edge and was bowled.”\n\nWhat if there was no sign from Pant when he stood at the top of his run-up? “It means I now have to use my brains!” Khan quips. Which he has done well in recent times to further his career.\n\nLooking to improve\n\nHe always had pace but lacked the variations. Like a slower one. He worked on it for months to develop it as a potent tool. “I train with two friends Venkatesh Iyer and Rajat Patidar. I asked them if they can read my slower ball and kept on improving it until they couldn’t pick it easily.”\n\nKhan’s stock ball is the one that comes into right-hand batsmen. “It’s the ball on a good length that comes in. It’s almost by default, you can say, because of bowling a lot in domestic cricket. I was lacking the slower ones and told Iyer and Patidar that I am going to bowl slower ones. And told them to let me know if they can read it or not,” he says.\n\nIt came in handy in the IPL, where he says he was initially lucky to get a break in the playing XI. Delhi had pacers like Umesh Yadav, Ishant Sharma, Kagiso Rabada , Anrich Nortje and Chris Woakes but the team management showed faith in Khan.\n\n“I was lucky. Rabada and Nortje weren’t there in the first match. Umesh bhai had some niggle, so the team showed faith in me. In fact, (head coach) Ricky Ponting and Pant had told me a week before the match that I will be getting a chance; ‘so be ready,’” Khan says.\n\nHe remembers a line Ponting said in the dressing room after the game. “He said that, ‘whenever we wanted a wicket, Avesh got it for us. Whenever we wanted some pressure to be built, he did it. Avesh is our go-to man, he was just outstanding’. Those words from Ponting really pumped me up. I am in a team where the margin of error is so less. One bad game and I am out. The people who are benched are all India players. I have no choice but to grab every opportunity.”\n\nKhan is now waiting to seize any opportunity that comes his way in England.",
    "Title": "Avesh Khan travels tough road to IPL success and England"
  },
  {
    "Date": "Mon, 10 May 2021 09:50:29 +0530",
    "Description": "Serie A: AC Milan defeated Juventus 3-0 in Turin and pushed them out of the top four.",
    "Image": "https://c.ndtvimg.com/2021-05/qj0l6v6o_ac-milan-afp_625x300_10_May_21.jpg",
    "Link": "https://sports.ndtv.com/football/serie-a-ac-milan-knock-juventus-out-of-top-four-with-thumping-win-2438561",
    "Text": "AC Milan pushed Juventus out of the Serie A top four with a 3-0 win in Turin on Sunday which increases their hopes of Champions League football for the first time since 2014. Brahim Diaz put Milan ahead just before the break with Anton Rebic and Fikayo Tomori adding two more in the second half after Franck Kessie had missed a penalty. Milan move up to third, equal on 72 points with second-placed Atalanta, with Napoli a further two points behind in fourth and the final Champions League berth.\n\nJuventus are now fifth, one point behind the top four with three games left to play, including next weekend's clash with newly-crowned champions Inter Milan.\n\n\"We had a great game, a victory over a direct rival at this moment in the championship is very important,\" said Milan coach Stefano Pioli whose side lost 3-1 to Juve in the San Siro in January.\n\n\"We still have to fight. But I have a very young team, that is maturing as this evening proved.\"\n\nThe breakthrough came just before half time with Diaz scoring on the rebound after Juventus goalkeeper Wojciech Szczesny cleared a Hakan Calhanoglu free-kick.\n\nMilan should have gone two up just before the hour when Giorgio Chiellini was judged to have handled the ball, but Szczensy denied Kessie's weak penalty.\n\nMilan's star striker Zlatan Ibrahimovic came off with a left knee injury after 65 minutes with Diaz also replaced five minutes later.\n\n\"He wasn't at his best, but he didn't want to miss the match,\" said Pioli of the 39-year-old Swede.\n\n\"He has a sore knee, but I don't think it's something serious.\"\n\nRebic doubled Milan's lead with a fantastic strike with 12 minutes to go and Tomori put the cherry on the cake when he headed home the third minutes later.\n\nJuventus coach Andrea Pirlo was at a loss to explain what went wrong with star striker Cristiano Ronaldo failing to add to his Serie A-leading 27 league goals.\n\n\"We got into the game pretty well and then little by little we fell apart ... It's hard to explain,\" said Pirlo.\n\n\"When you lose 3-0 in such an important game, it means that there are a lot of things that did not work.\"\n\nPirlo ruled out resigning, insisting: \"No I won't step aside. I undertook this work with a lot of enthusiasm, with difficulties, but my work continues.\n\n\"I think I can do better. There are three games left and I will continue to do my job as long as I can.\"\n\nAtalanta second\n\nEarlier Atalanta brushed aside relegated Parma 5-2 to move back into second.\n\nGian Piero Gasperini's side are closing in on a third consecutive season of Champions League football.\n\n\"There's still two weeks to go and a lot can happen,\" said Gasperini.\n\nAtalanta have the top attack in Serie A ahead of newly-crowned champions Inter Milan which they added to in Parma with Ruslan Malinovskyi grabbing the first after 12 minutes.\n\nLuis Muriel and Matteo Pessina came on after the break and the Colombian set up the Italian for the second six minutes later.\n\nMuriel then struck twice within 10 minutes in the final quarter of an hour to bring his tally to 21 goals this campaign.\n\nAleksei Miranchuk grabbed a fifth in injury time after Juan Brunetta and Simon Sohm had pulled two goals back late for Parma.\n\nSassuolo kept their Europa League hopes alive with a 2-1 win over Genoa.\n\nRoberto De Zerbi's side are eighth, two points behind Roma, who crushed relegated Crotone 5-0 to end their four-match winless league run, days after their Europa League exit to Manchester United.\n\nPromoted\n\nBorja Mayoral and Lorenzo Pellegrini both scored twice with Henrikh Mkhitaryan getting his first goal in over three months.\n\nCagliari won the battle with relegation rivals Benevento 3-1, to move four points clear of the drop zone, equal on points with Torino who held Hellas Verona 1-1.",
    "Title": "Serie A: AC Milan Knock Juventus Out Of Top Four With Thumping Win"
  },
  {
    "Date": "Mon, 10 May 2021 09:06:30 +0530",
    "Description": "Premier League: West Brom were relegated after losing 3-1 to Arsenal at the Emirates Stadium.",
    "Image": "https://c.ndtvimg.com/2021-05/j3hpunm_west-brom-vs-arsenal-afp_625x300_10_May_21.jpg",
    "Link": "https://sports.ndtv.com/football/west-bromwich-albion-relegated-after-losing-to-arsenal-3-1-2438546",
    "Text": "West Bromwich Albion were relegated after losing to Arsenal 3-1. West Brom arrived at the Emirates Stadium needing a win to maintain their slim hopes of beating the drop. But they were 2-0 down just past the half-hour mark thanks to well-taken goals from Emile Smith Rowe and Nicolas Pepe. Matheus Pereira pulled one back in the 67th minute after running the length of the Arsenal half. But Willian's 90th-minute free-kick, his first goal for Arsenal, confirmed West Brom's fate one season after they were promoted.\n\nDefeat meant Baggies boss Sam Allardyce had suffered the first Premier League relegation of his managerial career.\n\n\"It's not sunk in yet, but I'm sure I'll wake up tomorrow and realise the situation,\" Allardyce told BT Sport.\n\n\"I'm bitterly disappointed we're not still in the fight,\" added the ex-England boss, who replaced the sacked Slaven Bilic in December with West Brom just one place off the bottom.\n\n\"Our real problem was not beating the bottom-six sides when we came up against them. The results against Chelsea, Manchester United and Manchester City should have been bonus points.\"\n\nVictory for Arsenal came just days after they failed to reach the Europa League final following a lacklustre goalless draw against a Villarreal side managed by former Gunners boss Unai Emery.\n\n\"We needed that win,\" said Arsenal manager Mikel Arteta. \"It has been a while since we won at home.\"\n\nAcross London, West Ham were rocked by Dominic Calvert-Lewin's 24th-minute goal.\n\nThe Hammers are now five points behind fourth-placed Leicester with three games to play.\n\nEighth-placed Everton remain in the hunt for Europa League qualification.\n\nBrighton blew a chance to secure their survival in a dramatic 2-1 defeat at Wolves.\n\nThe Seagulls took the lead in the 13th minute when Lewis Dunk headed in Pascal Gross' corner in a match Brighton needed to win to be sure of avoiding relegation.\n\nBut Brighton captain Dunk was sent off in the 53rd minute after he pulled back Fabio Silva.\n\nWolves equalised in the 76th minute through Adama Traore and Morgan Gibbs-White won it in the 90th minute with his first Premier League goal.\n\nPromoted\n\nBrighton's Neal Maupay was sent off for foul and abusive language after the final whistle.\n\nThe Seagulls are 10 points above the relegation zone, with third-bottom Fulham, who have four games left, playing Burnley on Monday.",
    "Title": "Premier League: West Brom Relegated After Losing To Arsenal 3-1"
  },
  {
    "Date": "Mon, 10 May 2021 08:47:18 +0530",
    "Description": "La Liga: Eden Hazard struck in the 94th minute to help Real Madrid to a 2-2 draw against Sevilla.",
    "Image": "https://c.ndtvimg.com/2021-05/42vu7l28_real-madrid-sevilla-afp_625x300_10_May_21.jpg",
    "Link": "https://sports.ndtv.com/football/la-liga-real-madrid-strike-late-but-title-hopes-hit-by-dramatic-sevilla-draw-2438535",
    "Text": "Eden Hazard's 94th-minute equaliser salvaged Real Madrid a dramatic 2-2 draw against Sevilla on Monday as an extraordinary penalty decision swung La Liga's title race back in Atletico Madrid's favour. Zinedine Zidane's side had levelled through Marco Asensio midway through the second half and thought they had a penalty when Karim Benzema was brought down after rounding Sevilla goalkeeper Yassine Bono.\n\nBut VAR prompted referee Juan Martinez Munuera to check an Eder Militao handball a few seconds before, with a huge decision seeing Madrid's penalty cancelled and a spot-kick awarded to Sevilla instead.\n\nIvan Rakitic converted and while Madrid still managed to hit back in injury time, Toni Kroos' shot deflecting in off Eden Hazard's foot, the draw hands the advantage back to Atletico at the end of another dramatic weekend in the Spanish title race.\n\n\"They have to explain the exact rules of the hands to me,\" said Zidane afterwards. \"But now we have to think about the next game. It is not up to us now, but we will fight to the end, to the death.\"\n\nAfter Barcelona and Atletico played out a goalless draw on Sunday at Camp Nou, the second instalment of La Liga's blockbuster weekend also finished honours even, meaning the situation at the top is unchanged with three games now remaining.\n\nAtletico are two points clear of both Real Madrid and Barcelona, with the title very much back in their hands.\n\nA Sevilla victory might have given them an outside chance but instead they remain six points back and are surely out of the running.\n\n\"We're disappointed but we are not going to give up,\" said Sevilla coach Julen Lopetegui. \"We are going to try to keep this dream going a little longer.\"\n\nWith a superior head-to-head record over Barcelona, Real Madrid scraping a draw could also yet prove decisive, given they only have to overtake one team now instead of two.\n\n\"It's a shame but we're alive,\" said Luka Modric. \"We have seen that everyone is dropping points so you have to have faith.\"\n\nHazard had to come off the Real bench after his controversial reaction to the Champions League defeat by Chelsea and while the equaliser was eventually credited to him, there was hardly a sense of redemption given how little the Belgian knew about it.\n\nSevilla had 75 per cent of the ball in the first 10 minutes but it felt like more, with Madrid chasing shadows and incapable of escaping their own half.\n\nThey scored with their first attack, Benzema rising above Jules Kounde to head in, only for the goal to be chalked off, with Alvaro Odriozola offside in the build-up.\n\nMadrid looked jaded, the usually reliable Modric guilty of sloppy passes while Kroos and Casemiro struggled to affect the game.\n\nSevilla took the lead in the 22nd minute and it was brilliantly worked, a short free-kick down the right improving the angle before Rakitic's cool header down gave Fernando Reges the chance. He dummied past the diving Casemiro before slotting in.\n\nAsensio's rapid response\n\nMadrid emerged early after half-time. Vinicius Junior poked onto the outside of the post after a clever short corner before Modric departed for Asensio, who scored 65 seconds after coming on.\n\nSevilla's Joan Jordan was caught in midfield and Benzema sped away. Asensio looked like he had overrun the ball but it was returned to him by Kroos and he swept first time into the net.\n\nMadrid had the momentum and they thought they had a penalty before the pendulum swung one way and then the other in a matter of seconds.\n\nSevilla's corner was cleared and Benzema was sent through one-on-one, rounding Bono and going down for what looked an obvious spot-kick.\n\nInstead, Martinez was prompted to look at the monitor, where he saw Militao had dangled an arm onto the ball before Sevilla's corner was cleared.\n\nBoth benches made their feelings clear while the voices from the stand in front of Martinez, most of them belonging to Madrid, insisted the ball had struck Militao's back.\n\nBut Martinez cancelled Madrid's penalty and awarded one to Sevilla instead, with Rakitic stepping up and slotting into the corner.\n\nPromoted\n\nHazard came on and the drama was not yet finished. Kroos ghosted forward in the 94th minute and fired off a shot that deflected off the Hazard's foot and in.\n\nMadrid still had two minutes to find a winner and they almost got it, Casemiro's effort curling agonisingly wide.",
    "Title": "Real Madrid Strike Late But Title Hopes Hit By Dramatic Sevilla Draw"
  },
  {
    "Date": "Mon, 10 May 2021 03:09:12 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2020/06/IndiaBowlers-1200.jpeg",
    "Link": "https://indianexpress.com/article/sports/cricket/ishant-bumrah-shami-reunion-raises-hopes-7308937/",
    "Text": "Before the Wellington Test last year — the last time the trio of Mohammed Shami, Ishant Sharma and Jasprit Bumrah played together in a Test match — a local photographer requested them to pose side by side, in the order of their height and their shirt unbuttoned and wearing menace on the face, like the iconic photograph of the West Indies quicks of the late 1970s. Shami, wearing a grin and the shortest of them, detested the idea and gestured towards Sharma, the tallest of the group shouting: “I need a stool!” Sharma immediately frowned and shrieked: “I will sit on the ground then.” Bumrah just kept peeling his laughter away. In the end, the frame was left un-clicked for some reason.\n\nThe Indian threesome might be a few notches below the fearsome Caribbean quartet of Andy Roberts, Colin Croft, Michael Holding and Joel Garner — few pace packs would ever match their collective destructibility — but they can credibly lay claim to be the finest ever of the country and one of the most lethal of their times. And their reunion — after that Wellington Test — fills India with hope of winning the World Test Championship as well as a series in England after 14 years. The path to the summit is tough, but in these three masterful seamers, the country has invested faith and hope.\n\nThey are fully healed of their strains, niggles and twangs. Sharma’s ankle is sturdy as ever, Shami has regained the strength in his right forearm, fractured when ducking a Pat Cummins short ball, and Bumrah seems fresh and feisty. The truncated Indian Premier League means they had adequate time to shrug the rust and polish their match-fitness, but at the same time not over-expend and reach the WTC final tired and weary, or even injured. A perfect script in imperfect times.\n\nIndia’s best bet\n\nTheir selections in the final XI may not be quite straightforward as it was in Wellington, what with the emergence of Mohammed Siraj and the all-round potency of Shardul Thakur, but it’s fair to assume that the trio presents India’s most potent, rounded bowling firm not just in the present, but in the past too. Even Siraj and Thakur would not disapprove of their claims to re-entry.\n\nIn them merges a copious amount of skill, awareness, experience and expertise. So much so that they have turned a historical weakness of India, the pace-bowling dimension, into an indubitable strength. It’s they who dictate terms once they step outside the subcontinent. The batsmen and spinners are little more than able accomplices and not star-men, except undoubtedly Virat Kohli.\n\nFor instance, since January 2018, when Bumrah took his first steps in Test cricket, Indian seamers have accounted for almost 75 per cent of the wickets outside Asia. Of the 332 wickets on India’s ledger, 252 were scalped by seamers. It’s expected that in seam-bowler friendly conditions, they share the bulk of the bowling load, but their average of 26 suggests that they have been utmost penetrative. It’s the best attack India ever had in its history. Before this three-year timeline, the best average was 32.03, achieved between 1985-90.\n\nIt doesn’t shock that the trio’s numbers have been glittering in this time. Ishant has nabbed 53 wickets at 20; Shami’s corresponding numbers are 61 at 27.55 and Bumrah’s 79 at 21.59. They out-gunned Australian seamers in Australia (2018-19), West Indies in West Indies (2019) while matching England’s and South Africa’s in their backyard (in 2018). In this span, only Shannon Gabriel has drawn more false shots than Shami (23 per cent); only Jason Holder has purchased more swing than Sharma (1.38 degrees). And no three pacers have taken as many wickets in this time as the three (193) of India have.\n\nUnique in their own ways\n\nIf the numbers are not convincing enough, the fusion of their varied skills, nuance and deception is pure art. To start with, they are all properly quick — upwards of 140kph. This really does not happen too often, least of all in Indian cricket. Then there is the fine tessellation of skills and angles.\n\nBumrah provides sling and seam; Shami skid and kick; Sharma has height and with remorseless length pins batsmen down. Apart from the generic right-hand fast bracketing, they are different, from their run-ups, release points, wrist positions, angles, methods, thought patterns, design and deception. They are as delightfully diverse as the vaunted Fab Four of Indian batting. In a sense, they have taken their mantle. Call them the terrific trio.\n\nAll three can bowl the same ball differently. For instance, the nip-backer: Sharma’s cuts back substantially, but Shami gets more bounce; Bumrah’s hustles through. He has neither the massive deviation of Sharma nor bounce of Shami, but it’s quicker and sharper. All three are versed in trading different lengths and roles. Depending on their form, all three can switch between workhorse, strike bowler or enforcer roles without much difficulty. They understand that bowling is about partnerships, that an attack competes individually but achieves as a collective. The strength of India’s pace attack is not so much in individuals as the collective. It is a chain as strong as its weakest link.\n\nHunting in a pack\n\nInwardly, they might be pushed to out-do each other, they are staunchly competitive, but there is this absence of hubris. Bumrah might be the youngest of the lot, but Sharma, the eldest says “he has nothing more to learn.” Bumrah has ample variations but wants his bouncer to be as accurate as Shami’s. Shami, on the other hand, is in awe of Sharma’s control in England. Sharma often reminds that there is no designated leader of the pack. “We are all leaders,” he would say, making light of his experience.\n\nThe last time they toured England, they were still in the incipience of their three-pronged firm. Bumrah was callow, and Shami yet to crack the code of consistency. There were times when both Shami and Bumrah wasted the new ball, were wayward, failed to judge the perfect length and got carried away, but in three years, they have smoothened the abrasive edges. The genius of Bumrah has settled down; Shami has tamed the stormy petrel in him.\n\nSometime during the long tour, someone would make them pose in the iconic pose of the West Indies quartet. And it would not look like a cheap replication or one bit artificial. And then there is the lens of history waiting to clack away.",
    "Title": "Ishant, Bumrah, Shami reunion raises hopes"
  },
  {
    "Date": "Mon, 10 May 2021 10:59:12 +0530",
    "Description": "Shafali Verma is set to join India's T20I skipper Harmanpreet Kaur, deputy Smriti Mandhana, Jemimah Rodrigues and Deepti Sharma in the inaugural edition of The Hundred.",
    "Image": "https://c.ndtvimg.com/2021-05/5h146pbo_shafali-varma-india-twitter_625x300_10_May_21.jpg",
    "Link": "https://sports.ndtv.com/cricket/the-hundred-shafali-verma-to-play-for-birmingham-phoenix-says-report-2438606",
    "Text": "Teen sensation Shafali Verma is set to join India's T20I skipper Harmanpreet Kaur, deputy Smriti Mandhana, Jemimah Rodrigues and Deepti Sharma in the inaugural edition of The Hundred. The swashbuckling opener will play for Birmingham Phoenix under Kiwi all-rounder Sophie Devine. Speaking to ANI, sources in the know of developments confirmed that Shafali is the fifth Indian player who has been handed a No-Objection Certificate (NOC) by the Board of Control for Cricket in India (BCCI). \"It is a delightful news not just for Shafali but for Indian women's cricket that there will be five Indian players in the inaugural edition of The Hundred. She will re-unite with her Sydney Sixers coach Ben Sawyer and the experience should help her grow further in what has already been a very positive road forward for the youngster,\" the source said.\n\nThe 17-year-old has shown that she loves taking on fresh challenges and speaking after her spectacular showing in the women's series against South Africa in March, Shafali had revealed how she trained with the Haryana men's team to improve her game.\n\n\"The reason behind the fast foot movement is the time I spent with the Haryana men's team ahead of the Syed Mushtaq Ali T20 tournament. I cannot thank the Haryana Cricket Association enough for allowing me to train with the team. What it did was that it helped my decision-making power at the crease as I was facing fast bowlers who were touching close to the 140kph mark.\n\nSo, I had that extra second to decide if I wanted to go back or play off the front foot when I played the T20I series,\" she told ANI.\n\n\"We had some top-quality bowlers in Mohit Sharma, Ashish Hooda, Ajeet Chahal, Sanjay Pahal and Aman Kumar among others.\"\n\nApart from playing whirlwind knocks in the T20I series, Shafali also looked to have improved her fitness. She once again thanked the HCA for helping the players.\n\nPromoted\n\n\"Yes, I did work on my fitness during the time away from the game due to lockdown. Here too, cannot thank the HCA enough. Every player was catered to individually.\n\nOur needs were looked into and even for things like dumbbells, HCA ensured every player had equipment to train. At the top level, you need to be fit to perform,\" she had said.",
    "Title": "Shafali Verma To Play In The Hundred For Birmingham Phoenix: Report"
  },
  {
    "Date": "Mon, 10 May 2021 09:26:13 +0530",
    "Description": "Madrid Open: Alexander Zverev defeated Matteo Berrettini 6-7 (8/10), 6-4, 6-3 to win the title for a second time.",
    "Image": "https://c.ndtvimg.com/2021-05/fdbo7ijo_alexander-zverev-afp_625x300_10_May_21.jpg",
    "Link": "https://sports.ndtv.com/tennis/madrid-open-alexander-zverev-clinches-second-title-for-roland-garros-boost-2438554",
    "Text": "Alexander Zverev recovered from a set down to defeat Matteo Berrettini 6-7 (8/10), 6-4, 6-3 and win the Madrid Open for a second time Sunday as he clinched a fourth Masters 1000 title. The German fifth seed recorded his third consecutive top-10 victory this week, having eliminated five-time Madrid champion Rafael Nadal and Dominic Thiem to reach the final. Zverev, last year's US Open runner-up, added to his 2018 Madrid triumph as he denied Berrettini successive titles following the Italian's win in Belgrade last month.\n\n\"It is great (to win this title), especially after losing my last three finals I played at Masters 1000 events,\" Zverev said.\n\n\"This is definitely special and I just want to enjoy this one.\"\n\nZverev was full of praise for his Italian rival.\n\n\"Matteo was an extremely difficult opponent, because I had not faced anyone who serves at 235 km/h, who dominates the ball like him.\n\n\"Against Rafa (Nadal) and Dominic (Thiem), the matches were different, although they are obviously excellent clay players, perhaps the two best at the moment.\n\n\"Against Matteo, it was extremely difficult to just put the ball back in the court.\"\n\nZverev is targeting a second Rome title at the Foro Italico next week.\n\nHe captured his first Masters there in 2017 before also winning in Montreal later that year.\n\n\"Rome is also an event I like and enjoy, so I hope I can perform in the same way as I did here and we will see how it goes there. I feel awesome,\" said Zverev.\n\nAfter Rome, the German star will target a maiden Grand Slam title at Roland Garros. However, he has yet to get beyond the quarter-finals in Paris.\n\n\"To play well at Roland Garros, you have to play well during the season on clay. In that sense, it's (Sunday's win) important to me,\" said Zverev.\n\nBerrettini, making his Madrid main draw debut this week, was attempting to become this year's third first-time Masters champion after Hubert Hurkacz (Miami) and Stefanos Tsitsipas (Monte Carlo).\n\n'Great fight'\n\n\"I think we had a great fight. It's tough, this sport is crazy. It's a really good moment of my career but at the same time it's not that great because I lost,\" said Berrettini.\n\nWorld number 10 Berrettini landed the first blow as he broke Zverev to move 4-3 ahead in the opening set at the Caja Magica, only to drop his service the very next game.\n\nThe Italian raced into a 5-0 lead in the tie-break but Zverev clawed it back to 5-4 before two set points slipped beyond the grasp of Berrettini.\n\nZverev failed to take a set point of his own at 7-6 and then saved a third, but a double fault at 8-8 handed Berrettini another opportunity that this time he did not let go to waste.\n\nIt was the first set lost by Zverev, whose last clay-court title had come in Geneva in 2019.\n\nPromoted\n\nZverev secured the only break of the second set in game nine, when Berrettini double faulted, to send the match into a decider.\n\nThe German then broke to move 3-2 ahead in the final set and closed out victory after two hours and 40 minutes with another break, earning his second title of the season after taking home the Acapulco crown in March.",
    "Title": "Alexander Zverev Clinches 2nd Madrid Open Title For Roland Garros Boost"
  },
  {
    "Date": "Mon, 10 May 2021 10:24:05 +0530",
    "Description": "Cricket West Indies CEO Jonny Grave said all West Indies players who participated in IPL 2021 have reached home safely, and thanked BCCI and IPL franchises for their efforts to help players reach...",
    "Image": "https://c.ndtvimg.com/2021-05/vflsbfe_dwayne-bravo-sunil-narine-andre-russell-bcci-ipl_625x300_10_May_21.jpg",
    "Link": "https://sports.ndtv.com/cricket/west-indies-players-in-ipl-are-back-home-says-cricket-west-indies-ceo-johnny-grave-2438582",
    "Text": "All the Caribbean players, who participated in the currently postponed Indian Premier League, have reached home following concerted efforts by the BCCI and their respective franchises, Cricket West Indies CEO Johnny Grave has said. The IPL had to be postponed on May 4 after multiple COVID-19 cases came to light inside the tournament's bio-bubble which wasn't as foolproof as the last edition in the UAE. Top West Indies players like their white-ball captain Kieron Pollard, Jason Holder, Sunil Narine, Andre Russell, Dwayne Bravo, Nicholas Pooran, Shimron Hetmyer, and Fabien Allen were a part of the league. In all, nine West Indies cricketers competed in the event.\n\n\"Our IPL players, along with the West Indians who were part of the TV production, are now safely back in the Caribbean.\n\n\n\nWe are grateful to the @BCCI and IPL Franchises for arranging their safe travel back to the Caribbean so quickly.\"\n\n\n\n- CWI CEO @JohnnyGrave\n\n\n\n@KKRiders pic.twitter.com/68ftnHRATq — Windies Cricket (@windiescricket) May 9, 2021\n\n\"Our IPL players, along with the West Indians who were part of the TV production, are now safely back in the Caribbean. We are grateful to the BCCI and IPL Franchises for arranging their safe travel back to the Caribbean so quickly,\" Cricket West Indies tweeted.\n\nSave for COVID-19 affected duo of CSK batting coach Michael Hussey and Kolkata Knight Riders' New Zealand batsman Tim Seifert, all the foreign players and support staff have left the Indian shores.\n\nPromoted\n\nAll the Australians, along with a few New Zealanders, are currently in Maldives waiting for their onward journey after serving out quarantine. Australia has imposed a ban on flights from India till May 15 because of the COVID case surge there.\n\nThis was the reason why players from Down Under had to fly to Maldives for their quarantine instead of heading home directly.",
    "Title": "West Indies Players In IPL Are Back Home: CWI CEO Johnny Grave"
  }
]