[
  {
    "Date": "Thu, 06 May 2021 11:38:48 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/sports/cricket/ipl/top-stories/on-this-day-in-2009-rohit-sharma-took-his-first-hat-trick-in-ipl/articleshow/82425934.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82425934.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>It was on this day, 12 years ago, when Rohit Sharma took his first hat-trick in the history of the Indian Premier League (IPL). During 2009, Rohit Sharma represented Deccan Chargers and he ended up taking a hat-trick against Mumbai Indians at Centurion.",
    "Image": "https://static.toiimg.com/thumb/msid-82425971,width-1070,height-580,imgsize-306889,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/sports/cricket/ipl/top-stories/on-this-day-in-2009-rohit-sharma-took-his-first-hat-trick-in-ipl/articleshow/82425934.cms",
    "Text": "Rohit Sharma (BCCI/IPL Photo)\n\nNEW DELHI: It was on this day, 12 years ago, when Rohit Sharma took his first hat-trick in the history of the Indian Premier League ( IPL ).\n\nDuring 2009, Rohit Sharma represented Deccan Chargers and he ended up taking a hat-trick against Mumbai Indians at Centurion.\n\nDeccan Chargers had opted to bat first in the match and the side registered a total of 145/6 in the allotted twenty overs. Rohit also played a knock of 38 runs with the bat.\n\nDefending the total, Deccan Chargers was in a difficult position with Mumbai at 103/4 in the 16th over. However, Rohit changed the complexion of the game as he went on to dismiss Abhishek Nayar (1) and Harbhajan Singh (0) on the final two balls of the 16th over.\n\nThen beginning the 18th over of the innings, Rohit went on to dismiss JP Duminy (52) to claim a hat-trick and ensure Deccan Chargers' win in the match.\n\nDeccan Chargers ended up winning the match by 19 runs after restricting Mumbai to 126/8. Rohit finished the match with the figures of 4-6 in his two overs.\n\nIndian opening batsman Rohit has won the IPL maximum number of times. He was won the tournament six times (once with Deccan Chargers in 2009 and five times with Mumbai Indians).\n\nMumbai Indians had won the IPL in 2020 as well under the leadership of Rohit Sharma.\n\nThe IPL 2021 season was postponed on Tuesday due to the rising number of Covid-19 cases within the bio-bubble.\n\n",
    "Title": "On this day in 2009: Rohit Sharma took his first hat-trick in IPL"
  },
  {
    "Date": "Thu, 06 May 2021 04:01:07 +0000",
    "Description": "The pandemic slowed worldwide drug testing to a crawl. The process has resumed, but the problems that led to poor testing ahead of the 2016 Games have not gone away.",
    "Image": "https://static01.nyt.com/images/2021/05/05/sports/05oly-doping/05oly-doping-facebookJumbo.jpg",
    "Link": "https://www.nytimes.com/2021/05/06/sports/olympics/olympic-drug-testing.html",
    "Text": "Because many athletes are traveling to fewer competitions, they are harder to reach for testing.\n\n“We’re not back to the full capacity we were operating at, but we are very close,” said Jeremy Luke, senior director of sport integrity for the Canadian Center for Ethics in Sport, which manages antidoping efforts in that country. Luke said that in recent months officials had focused heavily on athletes who have made the Olympic team and those who are attempting to earn a spot. “It’s not operating in the same way as in the past, but it is operating.”\n\nA robust, comprehensive testing program hardly ensures doping-free competitions, even though positive tests are rare. Lance Armstrong, the retired cyclist who admitted to doping throughout his career, won the Tour de France seven times without getting tossed for a positive test. But the tests put athletes on notice that they are being monitored and make it more complicated to use performance-enhancing drugs without getting caught.\n\nNearly every country and international sports organization keeps private the names and exact dates connected to tests. The United States is a rare exception.\n\nAmerican athletes pushed for transparency in the early 2000s, when a series of scandals threatened the credibility of the country’s sporting success. Those who support publicly revealing who gets tested, and their results, say it is the only way to ensure accountability and provide athletes with information about how often their opponents have been tested. Some people who argue against public disclosure say it could help cheaters detect testing patterns and game the system.\n\n“You get five different experts in a room and you will get six different opinions on this,” Cohen said.\n\nAlso, privacy laws vary from country to country.\n\n“We have been considering it, but it is complicated for us, as we need to seek specific data protection approval from the Monaco authorities to do so,” said Aditya Kumar, an official with the Athletics Integrity Unit, which manages the testing program for World Athletics, the global governing body for track and field.\n\nAs part of its effort to not repeat mistakes made before the Rio Games, the International Testing Agency convened a group of antidoping experts in December to study what tests needed to be done during the crucial months leading up to the Tokyo Games, which begin in late July. In 2016, that work began less than three months before the start of the Games.",
    "Title": "Ahead of Tokyo Olympics, Drug Testing Is a Struggle"
  },
  {
    "Date": "Thu, 06 May 2021 03:38:15 +0000",
    "Description": "A fifth straight win has the team on a hot streak. The Mets split a doubleheader with St. Louis.",
    "Image": "https://static01.nyt.com/images/2021/05/05/sports/05mlb-roundup-yankees/merlin_187342611_a81c1dec-9a62-4b67-af6e-7e8a2f36d0b3-facebookJumbo.jpg",
    "Link": "https://www.nytimes.com/2021/05/05/sports/baseball/yankees-mets.html",
    "Text": "Giancarlo Stanton homered again and knocked in four runs, Aaron Hicks hit a tiebreaking single in the eighth inning and the Yankees beat the Houston Astros, 6-3, on Wednesday for their fifth straight victory.\n\nWith fans in the Bronx chanting curses at Jose Altuve and several other Astros for the second consecutive night, the Yankees (16-14) got three innings of scoreless relief from their major league-best bullpen and won for the 10th time in 13 games to move two games above .500 for the first time this season.\n\nYuli Gurriel and Aledmys Diaz had back-to-back R.B.I. doubles off Jordan Montgomery in a three-run fourth that gave Houston a 3-2 lead. But the Yankees rallied with two outs and none on in the fifth, and Stanton tied it when he greeted Ryne Stanek with an R.B.I. double.\n\nThe big slugger launched a long homer off rookie starter Luis Garcia in the third, extending his hitting streak to 11 games with his second two-run shot in two nights against the rival Astros. Stanton finished 3 for 4 with a walk and has 17 hits in his last six games, raising his batting average from .205 to .314.",
    "Title": "Stanton Continues to Surge, Leading Yankees Past Astros"
  },
  {
    "Date": "Thu, 06 May 2021 02:11:25 +0000",
    "Description": "President John Davidson and General Manager Jeff Gorton lost their jobs, and then the team started settling scores with the Washington Capitals two days after Tom Wilson attacked two Rangers.",
    "Image": "https://static01.nyt.com/images/2021/05/05/sports/05NHL-RANGERS-FIGHT2/05NHL-RANGERS-FIGHT2-facebookJumbo.jpg",
    "Link": "https://www.nytimes.com/2021/05/05/sports/hockey/rangers-fire-john-davidson-jeff-gorton.html",
    "Text": "A day of upheaval for the Rangers started with the ouster of two top executives and ended with a game between two teams that had a score to settle.\n\nHours after the firing of President John Davidson and General Manager Jeff Gorton, the Rangers began their game against the Washington Capitals with a choreographed show of vengeance that led to three simultaneous fights after the opening face-off.\n\nChris Drury, 44, the associate general manager, will become the team’s new president and general manager. Drury, the N.H.L. rookie of the year in 1999, spent the last four seasons of his playing career with the Rangers and joined the team’s front office in 2015. Glen Sather, who has been a senior adviser with the team since 2019, will work with Drury during the transition period.\n\n“Chris is a very sought-after executive and a strong leader, who has proven himself to be one of the top young minds in hockey,” the team owner, James L. Dolan, said in a statement. “We are confident he will effectively guide the team to ensure the long-term success we promised Rangers fans.”",
    "Title": "Rangers in Turmoil: Brawls on the Ice Follow Front Office Firings"
  },
  {
    "Date": "Thu, 06 May 2021 08:08:14 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/sports/tokyo-olympics/weightlifter-laurel-hubbard-poised-to-become-first-transgender-olympian-report/articleshow/82423309.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82423309.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>Weightlifter Laurel Hubbard is set to become the first transgender athlete to compete at an Olympics after qualifying for the rescheduled Tokyo Games due to a rule change, Inside the Games website reported on Wednesday.",
    "Image": "https://static.toiimg.com/thumb/msid-82423365,width-1070,height-580,imgsize-106245,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/sports/tokyo-olympics/weightlifter-laurel-hubbard-poised-to-become-first-transgender-olympian-report/articleshow/82423309.cms",
    "Text": "Laurel Hubbard (Photo by Alex Pantling/Getty Images)\n\nWeightlifter Laurel Hubbard is set to become the first transgender athlete to compete at an Olympics after qualifying for the rescheduled Tokyo Games due to a rule change, Inside the Games website reported on Wednesday.\n\nHubbard was effectively guaranteed a spot in the women's super heavyweight category, the report from the Olympics-focused trade publication said, after the International Olympic Committee approved an amendment to the rules as the COVID-19 pandemic forced the cancellation of many qualifying competitions.\n\nNew Zealander Hubbard, 43, has not yet been named to the national women's weightlifting team going to the Tokyo Olympic Games.\n\nHubbard competed in men's weightlifting competitions before transitioning in 2013.\n\nShe has been eligible to compete in the Olympics since 2015, when the IOC issued new guidelines allowing any transgender athlete to compete as a woman provided their testosterone levels are below 10 nanomoles per litre for at least 12 months before their first competition.\n\nWeightlifting has been at the centre of the debate over the fairness of transgender athletes competing in women's sports, and Hubbard's presence in Tokyo is set to attract huge media attention as well as criticism from fellow lifters and coaches.\n\nHer gold medal wins at the 2019 Pacific Games in Samoa, where she topped the podium ahead of Samoa's Commonwealth Games champion Feagaiga Stowers , triggered outrage in the island nation.\n\nAustralia's weightlifting federation sought to block Hubbard from competing at the 2018 Commonwealth Games on the Gold Coast but organisers rejected the move.\n\nUSA Weightlifting said it had no issue with Hubbard competing in the Games.\n\n\"We respect the rules established by the International Weightlifting Federation and the International Olympic Committee for qualification and will be focusing on assisting our athletes to compete against all those who are qualified for the Tokyo Games,\" spokesman Kevin Farley told Reuters.\n\n",
    "Title": "Weightlifter Hubbard poised to become first transgender Olympian: Report"
  },
  {
    "Date": "Thu, 06 May 2021 04:11:28 +0000",
    "Description": "“There’s no doubt about it,” Robertson said. “I hope he gets it.” And he hopes people will stop criticizing Russell Westbrook, the Wizards guard, for not yet winning a championship.",
    "Image": "https://static01.nyt.com/images/2021/05/05/sports/05nba-oscar-AP/05nba-oscar-AP-facebookJumbo.jpg",
    "Link": "https://www.nytimes.com/2021/05/05/sports/basketball/oscar-robertson-russell-westbrook-triple-double.html",
    "Text": "Westbrook gets a lot of criticism because he hasn’t been part of a championship team in the N.B.A., and I imagine you faced something similar during your time in Cincinnati. What do you remember about the years before you won a championship with Milwaukee?\n\nI think this happens with great basketball players, like Westbrook and myself. I was with Cincinnati for many years, but we never made any notable trades to get better players. If you look back through the history of basketball — and I always tell people this — every team that’s won a championship has made key trades. Boston got Bill Russell. Red Auerbach was very astute at getting older starters from other teams to play off the bench for him. A lot of the teams I played for, they didn’t want to do that.\n\nWhen you look back, how jarring was it to be traded from Cincinnati to Milwaukee in 1970?\n\nIt was fine. I just resented the fact that the Cincinnati basketball family felt that I hadn’t done anything in 10 years, and all I had done was make All-Pro 10 straight years. But they wanted to trade Oscar Robertson. I just did not want them to try to destroy my credibility and what I had done for the city of Cincinnati. When I went to Milwaukee, I assessed my situation, and I’ll never forget, I told my wife, “I’m not going to be the scorer I was in Cincinnati.” And she said, “Why?” I told her I have to get these other players involved in the game. For us to win, we’ve got to get the other players to make a contribution offensively.\n\nIs it accurate to classify you as a Russell Westbrook fan?\n\nI totally enjoy the way Westbrook plays. He’s a dynamic individual. They’ve moved him around to different teams and I don’t know why, because I think he’s one of the star guards in basketball. I guess they thought that when he went to Washington that he would not be that effective, but, man, he’s done a tremendous job.",
    "Title": "Oscar Robertson Wants Westbrook to Break His Triple-Doubles Record"
  },
  {
    "Date": "Thu, 06 May 2021 03:04:43 +0000",
    "Description": "“Now, every time he takes the ball, he is well aware — because he’s done it — that he could pitch a no-hitter,” said Jim Palmer, the last Orioles pitcher to throw one on his own.",
    "Image": "https://static01.nyt.com/images/2021/05/05/sports/05kepner-means-1/05kepner-means-1-facebookJumbo.jpg",
    "Link": "https://www.nytimes.com/2021/05/05/sports/baseball/john-means-no-hitter.html",
    "Text": "Throwing a no-hitter, you could say, is like lassoing the moon. You can see the distant glow, beckoning and teasing all at once. Can you really get there? Probably not. But you can dream.\n\nOn Aug. 13, 1969, in Oakland, Jim Palmer made the giant leap for the Baltimore Orioles with nine no-hit innings against the Athletics. It was the same day that Neil Armstrong, Buzz Aldrin and Michael Collins glided up Broadway and down Michigan Avenue for ticker-tape parades in New York and Chicago, followed by a state dinner with President Richard M. Nixon in Los Angeles.\n\nPalmer, now 75, has never been to the moon, of course. But the no-hitter broadened his universe in a way no other Oriole had experienced until Wednesday, when John Means became the first Baltimore pitcher since Palmer to toss a complete-game no-hitter. Means subdued the Mariners, 6-0, with 12 strikeouts and no walks in Seattle.\n\nFour Orioles combined for a no-hitter in 1991, but going the distance set Means’s feat apart. It was his 44th career start and the first to stretch past the seventh inning. His work days will never be the same.",
    "Title": "With No-Hitter, John Means Opens Up a World of Possibilities"
  },
  {
    "Date": "Thu, 06 May 2021 10:33:30 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/sports/cricket/news/new-zealands-ipl-based-test-players-to-leave-for-uk-on-may-11-nzc/articleshow/82424013.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82424013.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>Four members of New Zealand's Test contingent involved in the now-suspended IPL, including captain Kane Williamson, will leave India for the United Kingdom on May 11 while the rest will make their way back home on Friday, the country's cricket board has announced.",
    "Image": "https://static.toiimg.com/thumb/msid-82424992,width-1070,height-580,imgsize-441479,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/sports/cricket/news/new-zealands-ipl-based-test-players-to-leave-for-uk-on-may-11-nzc/articleshow/82424013.cms",
    "Text": "Kane Williamson and Kyle Jamieson (AP Photo)\n\nCHRISTCHURCH: Four members of New Zealand's Test contingent involved in the now-suspended IPL , including captain Kane Williamson , will leave India for the United Kingdom on May 11 while the rest will make their way back home on Friday, the country's cricket board has announced.\n\nNew Zealand are scheduled to play hosts England in a two-match Test series, beginning on June 2, before facing India in the World Test Championships final at Southampton from June 18.\n\n\"We've worked closely with the BCCI and the IPL franchises on the various departure strategies and we're very appreciative of their support during what is, clearly, a very challenging time,\" New Zealand Cricket (NZC) chief executive David White said in a statement on Thursday.\n\nSkipper Williamson, pacer Kyle Jamieson and spinner Mitchell Santner , as well as physio Tommy Simsek, will remain in a mini-bubble in New Delhi before departing for the UK, ahead of preparations for the Test series against England, and the WTC final against India.\n\nThere were 17 New Zealanders involved in the IPL, including 10 players.\n\n\"We are also very grateful to the England and Wales Cricket Board for accommodating the early arrival of the four members of the Test squad currently in India.\"\n\nNZC said May 11 is the earliest date it could obtain for the team's arrival in the UK.\n\nHowever, pace spearhead Trent Boult will return home briefly to see his family before joining the Test squad in early June, for the second match against England and the WTC final.\n\nThe New Zealand-based Test squad members will depart for England on May 16 and 17.\n\n\"Along with the balance of the New Zealand-bound IPL players, support staff and commentators, Boult is scheduled to depart New Delhi tomorrow on one of two charter flights, arriving in Auckland on Saturday before undergoing managed isolation,\" the NZC stated.\n\n\"...Boult will leave MIQ (Managed Isolation and Quarantine) on May 22 and will spend a week at home with his family, training at Mt Maunganui before departing for the UK in early June,\" it added.\n\nNew Zealand team trainer Chris Donaldson, who has been with the Kolkata Knight Riders, will also return home briefly to see his family before reconnecting with the Test squad.\n\nWhite said Boult and Donaldson will return home for the three-week period with the \"blessing\" of the cricket board and the national team management.\n\n\"We're completely supportive of Chris and Trent taking the opportunity to see their families before heading to the UK,\" said White.\n\n\"They've always been the consummate professionals and we're more than happy to accommodate these arrangements.\"\n\nWhite said IPL players, support staff and commentators returning to New Zealand would adhere to all regulatory protocols, including pre-departure COVID-19 tests.\n\nThose returning home from India also include Stephen Fleming, Brendon McCullum, Kyle Mills, Shane Bond, Mike Hesson, Tim Seifert, Adam Milne, Scott Kuggeleijn and James Pamment.\n\nThe league was suspended after four players and two coaching staff members from three different teams tested positive for COVID-19 inside the bio-bubble.\n\n",
    "Title": "NZ's IPL-based Test players to leave for UK on May 11: NZC"
  },
  {
    "Date": "Thu, 06 May 2021 09:08:22 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/sports/football/champions-league/top-stories/chelsea-will-face-manchester-city-with-confidence-in-final-thomas-tuchel/articleshow/82423849.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82423849.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>Chelsea manager Thomas Tuchel said their Champions League final opponents Manchester City are the \"benchmark\" in Europe, but his team will head to the title clash in Istanbul equipped with the confidence that they can beat Pep Guardiola's side.",
    "Image": "https://static.toiimg.com/thumb/msid-82423895,width-1070,height-580,imgsize-168656,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/sports/football/champions-league/top-stories/chelsea-will-face-manchester-city-with-confidence-in-final-thomas-tuchel/articleshow/82423849.cms",
    "Text": "Thomas Tuchel (Centre) (Reuters Photo)\n\nChelsea manager Thomas Tuchel said their Champions League final opponents Manchester City are the \"benchmark\" in Europe, but his team will head to the title clash in Istanbul equipped with the confidence that they can beat Pep Guardiola 's side.\n\nGoals by Timo Werner and Mason Mount sent Chelsea into the title clash with City as they outclassed 13-times champions Real Madrid 2-0 in the semi-final second leg at Stamford Bridge on Wednesday for a 3-1 aggregate triumph.\n\nChelsea knocked City out of the FA Cup semi-final with a 1-0 win earlier in the season but Tuchel said that performance does not necessarily give his team the upper hand heading into the Champions League final.\n\n\"But it gives us a good feeling, the confidence that we played that semi-final on the edge, we used it... for me Bayern Munich with Manchester City are the benchmarks and we wanted to close the gap to City,\" Tuchel told reporters.\n\n\"This one match in the semi-final we did that with a very impressive performance and we need that again. It gave us belief and confidence for every game after that, because it's the highest level you can face.\"\n\nFormer Paris St Germain boss Tuchel took over from the sacked Frank Lampard in January and has guided Chelsea from ninth to fourth place in the league.\n\n\"We had huge challenges in the Premier League and we came out of it very strong and showed our mentality and quality in all of these matches,\" Tuchel said.\n\n\"So yes, we'll arrive with self-confidence... in Istanbul. With no injuries, just the positive energy to win.\"\n\nTuchel said all the sacrifices he had made since January, including being away from his family, were worth it.\n\n\"I was part of an amazing club from the first day, and I felt huge support from day one. I'm very grateful to be on the sideline with this team,\" he said.\n\n\"This was an energetic performance... The job isn't done yet. We're in two finals and the sacrifice that I, personally have made, has been worth it since day one.\"\n\n",
    "Title": "Chelsea will face City with confidence in final: Tuchel"
  },
  {
    "Date": "Thu, 06 May 2021 08:47:23 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/sports/racing/top-stories/lewis-hamilton-pursues-100th-pole-as-nip-and-tuck-title-battle-arrives-in-spain/articleshow/82423645.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82423645.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>The Formula One circus pitches up in Barcelona this weekend for the Spanish Grand Prix with Red Bull's tantalising tilt at prising the spotlight away from showstoppers Mercedes topping the bill.",
    "Image": "https://static.toiimg.com/thumb/msid-82423724,width-1070,height-580,imgsize-231316,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/sports/racing/top-stories/lewis-hamilton-pursues-100th-pole-as-nip-and-tuck-title-battle-arrives-in-spain/articleshow/82423645.cms",
    "Text": "Lewis Hamilton (Photo by Bryn Lennon/Getty Images)\n\nBARCELONA: The Formula One circus pitches up in Barcelona this weekend for the Spanish Grand Prix with Red Bull 's tantalising tilt at prising the spotlight away from showstoppers Mercedes topping the bill.\n\nThree races in and against pre-season predictions it is Lewis Hamilton who leads Max Verstappen by eight points arriving at the fourth leg of the championship.\n\nWins last Sunday in Portugal and in the opener in Bahrain leave the seven-time champion in his customary habitat at the top of the F1 drivers' tree.\n\nBarcelona is a track the teams know intimately as the usual venue for pre-season testing, and with its reputation as a circuit where overtaking opportunities are few and far between the onus will be on Saturday's qualifying to command a prime front row seat on Sunday's grid.\n\nHamilton is seeking his fifth consecutive win in Catalonia, with three of his last four victories delivered from pole.\n\nShould he top the time sheets on Saturday he will celebrate his 100th pole position, after being denied that honour by his teammate Valtteri Bottas last weekend in Portimao.\n\nVerstappen and Red Bull's emergence as serious title contenders not only has F1 fans gripping their sofas' arm rests or smart phones -- Mercedes chief Toto Wolff says he's enjoying the same sensation he felt at the first signs Mercedes could muscle in on the then Red Bull roadshow seven years ago.\n\n\"When we were behind in testing and in Bahrain, it's a buzz that I have not felt in the team since 2013 when we had that first sniff that we could be there,\" said Wolff. \"The whole place is excited and continues to be excited. I'd like to be happy after Abu Dhabi at the end of the season but for the time being, we'll take it one step at a time.\"\n\nWhile the 2021 Hamilton continues to display all the hallmarks that have turned him into a serial champion - often flawless race craft, consummate professionalism and steely focus, Verstappen this season has changed.\n\nThe Dutch driver seems to have his eye on the bigger picture, as F1's managing director Ross Brawn pointed out.\n\n\"It's clear that Max Verstappen is approaching this championship in a different way because he finally has a title-winning car,\" said Brawn.\n\n\"And it had to change because when you're a title contender, the focus has to be on consolidating when you're not the fastest and when opportunities such as a mechanical issue for a rival or a Safety Car present themselves, you must be in a position to strike.\"\n\nVerstappen's boss at Red Bull Christian Horner is like his Mercedes counterpart Wolff lapping up the first proper inter-team title battle for some time.\n\n\"The picture is starting to clarify. Red Bull and Mercedes are the two standout teams, and Lewis and Max are the two standout drivers.\n\n\"It's incredibly tight. The biggest winner for that is Formula 1 - and if it goes like this for 23 races, it's going to be nip and tuck.\"\n\nOne driver who has special reason to approach this weekend's race with a spring in his step is Fernando Alonso .\n\nThe two-time champion is finally finding his feet with Alpine, formerly Renault, after his return to F1, scoring points for the second straight race in the Algarve sunshine.\n\n\"It was good, it was fun,\" said the veteran Spaniard ahead of his home grand prix.\n\n\"We were fighting with one McLaren, one Ferrari - things that were unthinkable in Imola or Bahrain. So I think we made a big step forward in terms of the car performance.\"\n\nAlonso is in 12th in the drivers standings, nine places and 32 points behind Lando Norris , who has enjoyed a sensational start to 2021 for back-in-business McLaren with three top-five finishes.\n\nSensational is not how even Nikita Mazepin 's most loyal followers would describe the Russian rookie's three first appearances in the fast lane.\n\nA lap one crash in Bahrain, spins at Imola, and a dangerous block on Sergio Perez last Sunday suggest the young Haas driver will be just happy to reach Sunday night having crossed the line without any further mishaps.\n\n",
    "Title": "Hamilton pursues 100th pole as 'nip and tuck' title battle arrives in Spain"
  },
  {
    "Date": "Thu, 06 May 2021 07:40:13 +0530",
    "Description": "Goals from Chelsea’s Timo Werner and Mason Mount sealed a 2-0 victory that ousted Real Madrid 3-1 on aggregate.",
    "Image": "https://th.thgim.com/sport/football/p1hd5z/article34495356.ece/ALTERNATES/FREE_960/chelsea-realmadrid",
    "Link": "https://www.thehindu.com/sport/football/champions-league-chelsea-beats-madrid-to-set-up-all-english-final-vs-man-city/article34495357.ece",
    "Text": "Goals from Chelsea’s Timo Werner and Mason Mount sealed a 2-0 victory that ousted Real Madrid 3-1 on aggregate.\n\nChelsea’s decision to fire a club legend suddenly doesn’t seem so callous after all.\n\nWhile Frank Lampard’s name has hardly been forgotten by the Chelsea fans — there were chants outside Stamford Bridge before kickoff on Wednesday — new manager Thomas Tuchel is quickly creating his own legacy after leading the London club into the Champions League final against Manchester City.\n\nChelsea even made record 13-time European Cup champion Real Madrid look ordinary as goals from Timo Werner and Mason Mount sealed a 2-0 victory that ousted Madrid 3-1 on aggregate.\n\nPerhaps the stragglers leaving the bars near Stamford Bridge could hear the roar Tuchel let out on the field inside the empty stadium long after his players had departed the field. It will certainly have been heard in the Chelsea boardroom by the directors whose decision to dismiss Lampard in January and hire Tuchel now seems vindicated.\n\n“I am very grateful and thankful to have this opportunity,” said Tuchel, who’d been dismissed by Paris Saint-Germain in December despite leading the French club to last year’s Champions League final. “You can never be ahead of plan as a manager and as a player — it does not exist.”\n\nJust like when owner Roman Abramovich made mid-season managerial changes in the 2007-08 and 2011-12 seasons, Chelsea will end the campaign by contesting the biggest game in European football. And by the end of the month two Champions League trophies could be at Stamford Bridge, with Chelsea the first club to reach the men’s and women’s finals in the same season.\n\nEven though the men’s showpiece will be an all-English encounter on May 29, the Premier League rivals will have to fly four hours to play the UEFA showpiece in Istanbul, which is currently in a coronavirus lockdown. While City has never lifted the European Cup, Chelsea’s only triumph came in 2012 when the 22-year-old Mount was in the youth system.\n\n“It’s going to be a stunning game,” Mount said.\n\nUnlike last season’s final — when Tuchel’s PSG lost to Bayern Munich — fans are set to be allowed in. Chelsea supporters have yet to see Tuchel managing their team in the flesh due to England’s ongoing coronavirus restrictions. But they can’t deny the impact he has made.\n\nChelsea was five points outside the four Champions League qualification places when he was hired, but heads into the final four games of the Premier League season in fourth place with a three-point cushion. There’s a chance to pick up a trophy before the trip to Turkey, too, with an FA Cup final against Leicester on May 15 after beating City in the semifinals.\n\nMadrid coach Zinedine Zidane is left to focus on trying on wiping out Atletico Madrid’s two-point lead in Spain to win La Liga, rather than adding to the three Champions League titles he won from 2016 to 2018.\n\n“I think we tried, but the truth is today Chelsea were superior and we have to congratulate them,” Zidane said. “It was complicated throughout the match because they had many chances to score more goals and they deserved their victory.”\n\nAfter conceding a costly away goal last week, Madrid lacked the attacking nous or threat to turn this semifinal around as Chelsea kept an 18th clean sheet in 24 games under Tuchel.\n\nKarim Benzema was denied by the first in a series of fine saves by Chelsea goalkeeper Edouard Mendy before Werner’s opener but the visitors were sluggish, lacking a creative spark from Eden Hazard on an ineffective return to his former home.\n\nEven in a debut season of misfortune, not even Werner could miss in the 28th minute when presented with an unguarded net to head into from close range after Kai Havertz had lobbed former Chelsea goalkeeper Thibaut Courtois and hit the crossbar.\n\n“I had to wait a long time for the ball coming down — it felt like hours,” Werner said.\n\nThe chants of “Timo” from the substitutes’ bench reflected the delight from his teammates that the Germany forward had scored only his fourth goal in 35 games for Chelsea. For all the scrutiny faced, though, Werner has still managed 12 goals and 10 assists since last year costing Chelsea up to $68 million.\n\nFor all Chelsea’s threat, Madrid only needed to score once to force the second leg into extra time. When the second half opened with Havertz heading against the crossbar and having a low shot saved it looked like the misses could prove costly.\n\n“Keep on pushing guys,” Tuchel urged from the sideline.\n\nAnd so they did, helped by the arrival of Christian Pulisic from the bench as Werner's replacement to spark the second goal. The American headed to N’Golo Kante and received the ball back to feed Mount, who lifted a shot over Courtois in the 85th.\n\n“I have to go on and do my bit,” Pulisic sad, “be creative and try to finish the game off strong and luckily I was able to do that.”\n\nNot that Pulisic was satisfied waiting more than an hour to enter the game.\n\n“Very frustrated — I wanted to play from the beginning, as I always do,” said the forward signed in 2019 from Borussia Dortmund. “I’ve had to continue to prove myself over and over again. ... Nothing can stop me, really.”",
    "Title": "Champions League | Chelsea beats Madrid to set up all-English final vs Man City"
  },
  {
    "Date": "Thu, 06 May 2021 07:39:04 +0530",
    "Description": "Eyeing for glory, table tennis veteran Sharath Kamal next hopes to take the sport he dearly loves to the masses",
    "Image": "https://th.thgim.com/sport/dboa19/article34489500.ece/ALTERNATES/FREE_460/sharathkamal9",
    "Link": "https://www.thehindu.com/sport/other-sports/how-table-tennis-veteran-sharath-kamal-is-gearing-up-for-olympics/article34489501.ece",
    "Text": "Eyeing for glory, table tennis veteran Sharath Kamal next hopes to take the sport he dearly loves to the masses\n\nThe year 2011 was one of the worst in paddler Sharath Kamal’s career. His world rankings plummeted to 94, the lowest ever in his career. He started losing Indian national tournaments, a rarity for a veteran player like him. “It was the lowest of lows,” he recalls, “But I believe that you can appreciate the high only if you see the low.”\n\nExactly a decade later, Sharath will represent the country at the upcoming Tokyo Olympics, scheduled to kickstart on July 23. He firmly believes that this year he will realise his dream of bagging the prestigious medal. “I’m as close as can be this time,” says the Chennai resident.\n\nThis will be Sharath’s fourth trip to the Olympics, considered the holy grail for all sportspersons. “It [the Olympics] is what the whole world is talking about. The stress levels go higher here as there are a lot of expectations from you. This time, it is a lot different because interaction with other sportspersons is going to be minimal [due to COVID-19 protocols].”\n\nLockdown and later\n\nDespite the pandemic squashing his longing to go out and play, Sharath is thankful he at least has a table at home. “Sathiyan (Gnanasekaran) also has a table at home, but has no one to play against. I was lucky to have my younger brother (Rajath Kamal) and father (Srinivasa Rao) around to help me during practice sessions.” With no specific goal in sight, all Sharath could do was keep working on his game. “Mentally, it was hard....because I was practising without knowing exactly for what. All I could tell was to work in a generic manner on my skills.”\n\nThat was the time when he also got back to yoga, which he used to practise when he was in school and during his training days. “Flexibility is not my forte as I am used to playing a power game. Yoga helped me work on that,” he says. “It helped me become more aware of my body. Since the last year, I know exactly where I feel stiff and how to work on it. Also, just waking up in the morning and having that time and space for yourself was great.”\n\nAt 38, Sharath isn’t growing any younger but he is still as active as the new players. His family has been wanting him to call it quits for a while now. He recently posted a picture with his mother, captioning it: “Ever since 2007, till date, my mom has been asking me when I’ll stop playing and spend more time with family.” Draw his attention to that, and Sharath breaks into a big smile, “I’ll just win another medal for them, and then they cannot say much. The families of sportspersons sacrifice a lot to help us focus on the sport.”\n\nHis sights are set on an Olympic medal but he also has a vision for the future: taking the game he dearly loves to the masses. “It is a sport that most people would have tried at some point of time; there are tables at schools, colleges and offices. Most holiday resorts have TT tables too. But those numbers have not translated into people taking it up professionally. I think it’s about having role models and superstars in the sport. Hopefully, if we get an Olympic medal, things will change.”\n\nWatch the Olympics on Sony Sports",
    "Title": "Yoga and practise: How table tennis champ Sharath Kamal is chasing his Olympics dream"
  },
  {
    "Date": "Thu, 06 May 2021 08:48:27 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/sports/cricket/ipl/top-stories/ipl-2021-sorry-to-leave-you-in-such-trying-times-says-simon-doull-to-indian-fans/articleshow/82423621.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82423621.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>Former New Zealand cricketer-turned-commentator Simon Doull sent out a heartfelt message to cricket fans in India expressing disappointment over leaving them following the postponement of Indian Premier League (IPL).",
    "Image": "https://static.toiimg.com/thumb/msid-82423726,width-1070,height-580,imgsize-863404,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/sports/cricket/ipl/top-stories/ipl-2021-sorry-to-leave-you-in-such-trying-times-says-simon-doull-to-indian-fans/articleshow/82423621.cms",
    "Text": "Dear India, You have given me so much over so many years and I am sorry to be leaving you in such trying times. To… https://t.co/dYxsA36I2q — Simon Doull (@Sdoull) 1620221357000\n\nNEW DELHI: Former New Zealand cricketer-turned-commentator Simon Doull sent out a heartfelt message to cricket fans in India expressing disappointment over leaving them following the postponement of Indian Premier League ( IPL ).\"Dear India, you have given me so much over so many years and I am sorry to be leaving you in such trying times. To those who are suffering my heart goes out to you and your families. Please do what you can to stay safe. Until next time take care. #india #cricket #love,\" Doull tweeted on Wednesday.Doull was one of the many New Zealanders participating in the IPL. Some of the top Kiwi players like Kane Williamson Kyle Jamieson and Trent Boult were participating in the tournament as players.The New Zealanders, the Aussies and the West Indians were yet to leave the Indian shores. Eight out of 11 England cricketers have reached their country.Some of the South African cricketers too left for their home country on Wednesday afternoon.The Indian cricket board (BCCI) is still discussing ways to send back Aussie cricketers after the national government there banned all flights from India till May 15.The BCCI on Tuesday decided to postpone IPL indefinitely due to Covid-19 positive cases in various teams.",
    "Title": "Sorry to leave you in such trying times: Doull to Indian fans"
  },
  {
    "Date": "Thu, 06 May 2021 08:55:51 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/sports/more-sports/shooting/shooter-apurvi-chandela-tests-positive-for-covid-19-voices-grow-against-camp-in-zagreb/articleshow/82423796.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82423796.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>According to sources, a few coaches and shooters have already conveyed their displeasure to NRAI, arguing against the long camp in foreign shores when India is in the grip of a devastating second wave of Covid-19.",
    "Image": "https://static.toiimg.com/thumb/msid-82423811,width-1070,height-580,imgsize-188500,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/sports/more-sports/shooting/shooter-apurvi-chandela-tests-positive-for-covid-19-voices-grow-against-camp-in-zagreb/articleshow/82423796.cms",
    "Text": "BENGALURU: Ace rifle shooter Apurvi Chandela was the latest from India’s Olympics squad to test positive as voices against National Rifle Association of India ’s ( NRAI ) decision to send the shooters to Zagreb , Croatia, next week for a three-month camp grew louder.According to sources, a few coaches and shooters have already conveyed their displeasure to NRAI, arguing against the long camp in foreign shores when India is in the grip of a devastating second wave of Covid-19 “The entire country is battling the pandemic and families of shooters and coaches are no different. What if any member of a shooter’s family falls ill? How can they come back to help their family? How will they train in peace in Croatia?” sources close to the shooters told TOI.A top NRAI official said that the camp will go on in Zagreb.However, NRAI’s plans to prepare the squad for the Olympics received a jolt after three national coaches – Jaspal Rana, Ronak Pandit and Samaresh Jung – expressed their inability to join the squad citing personal reasons.",
    "Title": "Shooter Apurvi down with Covid, voices grow against Zagreb camp"
  },
  {
    "Date": "Thu, 06 May 2021 08:41:25 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/sports/more-sports/others/visas-rejected-by-switzerland-indian-archers-world-cup-trip-off/articleshow/82423644.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82423644.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>India's Olympic-bound recurve archery team’s visit to Switzerland for World Cup Stage 2 in Lausanne from May 17 to 23 has been called off after the Swiss Embassy’s refusal to issue short-term visas in view of the flying ban imposed on Indian travellers on account of the raging Covid-19 pandemic here.",
    "Image": "https://static.toiimg.com/thumb/msid-82423679,width-1070,height-580,imgsize-224164,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/sports/more-sports/others/visas-rejected-by-switzerland-indian-archers-world-cup-trip-off/articleshow/82423644.cms",
    "Text": "NEW DELHI: India's Olympic-bound recurve archery team’s visit to Switzerland for World Cup Stage 2 in Lausanne from May 17 to 23 has been called off after the Swiss Embassy’s refusal to issue short-term visas in view of the flying ban imposed on Indian travellers on account of the raging Covid-19 pandemic here.The tournament in Lausanne was crucial to Indian women archers’ preparations for the Archery World Cup Stage 3 in Paris from June 21 to 27, which will serve as the final team qualification event for the Tokyo Games.India is yet to secure a women’s team quota place for the Olympics, as two-time Olympian Deepika Kumari has earned an individual quota for the Games and is assured to travel to Tokyo.Indian men’s recurve side of Atanu Das, Tarundeep Rai and Pravin Jadhav has already qualified for the team event, while the trio are also eligible for participation in the individual categories at the Games.For the Lausanne World Cup, the Olympics core group of women archers Deepika, Ankita Bhakat, Komalika Bari and Madhu Vedwan (standby) and the men’s team of Atanu, Tarundeep, Pravin Jadhav and Dhiraj Bommadevara (standby) were selected to represent the country. However, after the first case of Indian Covid variant (double mutant known as B.1.617) was detected in Switzerland in April last week, the State Secretariat for Migration in Berne banned all international travel from India, permitting only Swiss residents and citizens to enter the country.India was already on Switzerland’s ‘red list’ of countries and the citizens from this country were mandatorily subjected to quarantine for ten days upon entering.Archery Association of India’s (AAI) secretary Pramod Chandurkar told TOI: “The Swiss authorities are only processing visas for valid national residence permit and long-term type D (education and employment). They are not issuing Schengen visa type C. They are also not processing short-term visas (tourist, visit or business).\"We requested their embassy office in Delhi for 6-8 days of short visa to Lausanne for the World Cup, but we received a communication from them refusing the same due to the serious Covid-19 situation here.\"Also, there was no point sitting idle in the team hotel quarantining for 10 days and not being able to train and perform at the event. With so many restrictions and non-availability of short-term visas, the archers can’t go.“We are now focused on sending the archers for the Olympic qualifying meet in Paris and the AAI has already started processing visa applications for the same, keeping the strict flying rules and 10-day quarantine in mind. We can’t miss the tournament as the women team’s Olympic qualification is at stake,” he added.",
    "Title": "Swiss visas rejected, Indian archers’ World Cup trip off"
  },
  {
    "Date": "Thu, 06 May 2021 08:24:48 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/sports/football/champions-league/top-stories/chelsea-dominate-real-madrid-to-set-up-all-english-champions-league-final/articleshow/82423279.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82423279.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>Chelsea set up an all-English Champions League final against Manchester City as goals from Timo Werner and Mason Mount beat Real Madrid 2-0 in a dominant display on Wednesday to seal a 3-1 aggregate victory at Stamford Bridge.",
    "Image": "https://static.toiimg.com/thumb/msid-82423495,width-1070,height-580,imgsize-863168,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/sports/football/champions-league/top-stories/chelsea-dominate-real-madrid-to-set-up-all-english-champions-league-final/articleshow/82423279.cms",
    "Text": "The 2021 #UCLfinal is set! 🏆Manchester City 🆚 Chelsea #UCL https://t.co/9WMV1GzbJu — UEFA Champions League (@ChampionsLeague) 1620248425000\n\n🗣️ Mason Mount: \"I can't put it into words, really. I haven't won anything yet, and hopefully we can win. It's goin… https://t.co/xfCLHgOS1Q — UEFA Champions League (@ChampionsLeague) 1620256431000\n\nFriends reunited in London 🤗#UCL https://t.co/BTXZzwqUVI — UEFA Champions League (@ChampionsLeague) 1620256032000\n\nWhat a game!! So proud of this TEAM. One more 💪🏻💙 @ChelseaFC #KTBFFH https://t.co/GNt2CkjSpe — César Azpilicueta (@CesarAzpi) 1620254577000\n\nWE DID IT 💙💙💙 Off to the final!!! 🔥😍😍 #whatateam #Hustle #AlwaysBelieve https://t.co/c8LU44qdBA — Antonio Rüdiger (@ToniRuediger) 1620248946000\n\nCongratulations, @ChelseaFC Here we come again!!! 💙💙💙💙 https://t.co/M6EJqpGtBh — Ramires (@Rami7oficial) 1620251738000\n\nLet’s goooooooooooooo💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙… https://t.co/7QNjybL6fb — Didier Drogba (@didierdrogba) 1620247725000\n\n🔵 Brilliant transitions both from defence to attack and from attack to defence! N'Golo Kanté takes the prize after… https://t.co/Fx8HyYrGbz — UEFA Champions League (@ChampionsLeague) 1620253333000\n\nSee you soon Istanbul! https://t.co/bxyWgSRhBm — Mason Mount (@masonmount_10) 1620250460000\n\nWhat a night. What a team! Incredibly proud, couldn’t be happier right now 🤩💙 https://t.co/52djSAiyDT — Timo Werner (@TimoWerner) 1620250669000\n\nLONDON: Chelsea set up an all-English Champions League final against Manchester City as goals from Timo Werner and Mason Mount beat Real Madrid 2-0 in a dominant display on Wednesday to seal a 3-1 aggregate victory at Stamford Bridge.If anything, the scoreline flattered Madrid as the 13-time European champions had no response to Chelsea's greater strength and speed.The Blues should have ran out far more convincing winners as they toyed with the tired visitors in the second half.However, Werner's cushioned header into an empty net on 28 minutes after Kai Havertz's initial effort came back off the crossbar and Mount's tap-in five minutes from time were enough to seal their place in Istanbul on May 29.\"To never lose the concentration, focus and positive energy on the pitch -- it was a huge performance and well deserved,\" said Chelsea manager Thomas Tuchel, who has masterminded a huge turnaround in Chelsea's season since replacing the sacked Frank Lampard in January.Backed by Russian billionaire owner Roman Abramovich, Chelsea's £220 million spending spree last summer has been rewarded with a first Champions League final since they lifted the trophy for the only time in 2012.\"We never lost the hunger, the desire to defend,\" added Tuchel. \"In the second half we had even better structure to defend and it was a fantastic performance.\"We could have scored so much earlier and more to be safe, but it's no time for criticism now. It's a fantastic achievement and big congratulations to the team.\"Madrid boss Zinedine Zidane welcomed back captain Sergio Ramos for the first time in six weeks, while Eden Hazard was handed a rare start in an injury-hit season on his return to Stamford Bridge.But the Belgian was again a peripheral figure as Madrid's over-reliance on Karim Benzema to provide a goal threat was exposed.\"We needed to be better going forward,\" said Zidane. \"We didn't have any clear chances. They made a number of them and that's football.\"We fought and tried but they deserved to win and go through.\"Madrid's only serious threat came from a quick turn and shot from the edge of the box from Benzema that Edouard Mendy did brilliantly to turn behind midway through the first half.Moments later they were behind as Werner scored just his fourth goal in his last 39 games.N'Golo Kante and Havertz did the hard work as the French midfielder fed Havertz, whose audacious chip over Thibaut Courtois bounced invitingly off the crossbar for Werner to head into an empty net.Chelsea have now kept 18 clean sheets in 24 games since the appointment of Tuchel turned their season around.However, a failure to take their chances at the other end means they are still far from guaranteed a place in the Champions League next season.That lack of a killer touch was exposed after the break as Havertz saw a free header come back off the bar before Mount blasted over with just Courtois to beat.The former Chelsea 'keeper, who controversially forced a move back to Spain in the summer of 2018, kept his current employers in the tie as he then saved one-on-ones with Havertz and Kante, with the Blues' speed on the break too much for Madrid's ageing midfield to cope with.Tuchel was growing increasingly frustrated with his side's inability to put the tie to bed, but could finally relax five minutes from time.Substitute Christian Pulisic left Courtois on the floor and from his cut-back, Mount slid in to finish from close range.Fired by Paris Saint-Germain on Christmas Eve after leading the French champions to their first ever final in this competition last season, Tuchel is headed back to the Champions League showpiece match for a second consecutive season, unlike his former club, who were beaten 4-1 on aggregate by City in the other semi-final.",
    "Title": "Chelsea dominate Real Madrid to set up all-English CL final"
  },
  {
    "Date": "Thu, 06 May 2021 09:14:52 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/sports/cricket/ipl/top-stories/ipl-2021-suspended-england-players-return-home-australians-head-to-maldives-and-lanka/articleshow/82423990.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82423990.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>Barring Eoin Morgan, Dawid Malan and Chris Jordan, who will be flying out of India on Friday to head home, the remaining cricketers from England, who had arrived here to participate in the now-suspended, IPL have returned to the UK.",
    "Image": "https://static.toiimg.com/thumb/msid-82424156,width-1070,height-580,imgsize-1669472,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/sports/cricket/ipl/top-stories/ipl-2021-suspended-england-players-return-home-australians-head-to-maldives-and-lanka/articleshow/82423990.cms",
    "Text": "MUMBAI: Barring Eoin Morgan, Dawid Malan and Chris Jordan, who will be flying out of India on Friday to head home, the remaining cricketers from England , who had arrived here to participate in the now-suspended, IPL have returned to the UK.Those tracking developments said, “the players have been put under quarantine”.Meanwhile, players heading to South Africa are still working with their respective franchises to leave the country at the earliest.“Different franchises are working with different sets of options. For instance, one franchise has availed the services of a private aircraft to help the players get home. But there are others who’re being relatively cost-effective. They’re booking passenger airlines for the players,” sources said.The Australian cricketers, meanwhile, are assembling in Maldives and Sri Lanka and will quarantine there until May 15 before the ban on travel to Australia is lifted.The BCCI and the franchises are more worried right now about individuals who have tested positive for the virus and are quarantining in India.“They will have to fly passenger when it’s time to leave. So it’s imperative they’re taken care of and allowed to finish their quarantine properly before they can leave,” say those in the know.New Zealand cricketers, who will be participating in the World Test Championship final, are quarantining here in the country and will leave for England along with the Indian team.",
    "Title": "IPL: Eng players return home, Aussies head to Maldives & SL"
  },
  {
    "Date": "Thu, 06 May 2021 08:16:30 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/sports/cricket/ipl/top-stories/suspended-for-now-ipl-2021-may-return-as-bcci-mulls-uk-uae-or-australia-as-venues/articleshow/82423385.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82423385.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>The BCCI can still host the remaining matches of the Indian Premier League (IPL) later this year. The board, the league’s governing council (GC), franchises, broadcaster and other stakeholders are unanimous in agreement to this effect.",
    "Image": "https://static.toiimg.com/thumb/msid-82423390,width-1070,height-580,imgsize-919242,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/sports/cricket/ipl/top-stories/suspended-for-now-ipl-2021-may-return-as-bcci-mulls-uk-uae-or-australia-as-venues/articleshow/82423385.cms",
    "Text": "The BCCI can still host the remaining matches of the Indian Premier League IPL ) later this year. The board, the league’s governing council (GC), franchises, broadcaster and other stakeholders are unanimous in agreement to this effect.Where and when is the question.The remaining half of the IPL – ‘Phase-2’ as some are calling it already – will certainly not be held in India, regardless of an available window, enhanced bio-secure bubbles or potential improvement in the Covid-19 situation.The India option is ruled out because overseas cricketers – who wanted to rush back home given the Covid situation in India – will not want to return here in a hurry. And without the overseas cricketers, the IPL is then a slightly fancier ‘Mushtaq Ali’, the domestic T20 tournament.“It has to be played overseas. Certain suggestions have already been heard. The BCCI just has to make up its mind,” top sources in the board said.Three suggestions have come up over planning Phase-2.A) Move the league to UAE , a tried and tested venue that worked successfully in 2020, where the T20 World Cup can also be hosted post Phase-2. After India’s tour of England gets over on September 14, the players participating in the IPL can head to the UAE, finish a week’s quarantine and finish the remaining 31 matches before the World Cup begins around October 22.“If the World Cup is shifted, the whole scheduling will get re-worked anyway,” said those in the know. However, they added: “Weather will be a problem because September remains a very hot month and UAE only begins to cool down October onwards.”B) Moving it to the United Kingdom is another option, also seen as a more viable one, while shifting the T20 World Cup to the UAE. The BCCI can make use of the end of the English summer – end of September and early October – to conclude the league.The Indian team will travel to England next month for the World Test Championship and remain based out of there until the completion of India’s five-Test series.“The weather will be good for cricket . It will suit the broadcaster too because time zones can be adjusted and overseas players from outside of India and England will be willing to travel,” they add.Players can head to the UAE for the T20 World Cup.C) Another option – if BCCI decides, and the government of Australia revises its policies in four months from now – is moving the T20 World Cup scheduled in India this October-November to Australia.India can make this barter and host the 2022 edition, which is scheduled in Australia for now.“Cricket Australia certainly won’t mind this exchange if their government allows. And since international players will anyway arrive there for the World Cup, Perth – which is three-and-half-hours ahead of Indian Standard Time – can host Phase-2 to cater to Indian prime-time,” sources said.“This can happen only if the Australian government changes its mind and if broadcasters are willing to agree,” they add. All the three options will be in play.“A new destination will infuse freshness into the league and that itself will attract viewership. England and Australia are good options,” industry sources said.",
    "Title": "Suspended for now, IPL 2021 may return in UK, UAE or Australia"
  },
  {
    "Date": "Thu, 06 May 2021 10:33:38 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/sports/cricket/ipl/top-stories/health-first-ipl-later-vvs-laxman/articleshow/82424770.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82424770.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>The Covid-19 pandemic in the country is getting angrier by the day, and former India batsman and Sunrisers Hyderabad (SRH) mentor VVS Laxman believes suspending the IPL is the best decision taken keeping everyone's safety in mind.",
    "Image": "https://static.toiimg.com/thumb/msid-82425016,width-1070,height-580,imgsize-500346,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/sports/cricket/ipl/top-stories/health-first-ipl-later-vvs-laxman/articleshow/82424770.cms",
    "Text": "NEW DELHI: After four of the eight Indian Premier League (IPL) franchises were hit with Covid-19 cases in quick succession, the BCCI and the IPL governing council were left with no choice than to postpone the tournament for now. The Covid-19 pandemic in the country is getting angrier by the day, and former India batsman and Sunrisers Hyderabad SRH ) mentor VVS Laxman believes the best decision has been taken keeping everyone's safety in mind.\"Unfortunate as it might appear, the right decision was taken to suspend the IPL following the breach of biosecure bubbles of four franchises across two cities,\" wrote Laxman in his column for The Times of India.\"In these unprecedented times, physical safety and mental health are of paramount importance.\"Covid-positive cases had been found among the franchises even before this IPL season began but the players had assembled from different parts of India then, and the BCCI had all safety measures in place once a player entered his respective team's bio-secure bubble.\"That even carefully structured bubbles can be breached is another lesson in our battle against the coronavirus -- to never let our guard down, even for a millisecond,\" Laxman added.\"We had full confidence in the protocols that had been put in place even when we moved from one city to another, but once we learnt of the positive tests in the Kolkata Knight Riders and Chennai Super Kings' (CSK) camp, our apprehensions mounted.\"We [SRH] had just finished a match against CSK and several of us caught up with old friends, so there was understandable anxiety and unrest until the test results were out.\"SRH wicketkeeper-batsman Wriddhiman Saha's test returned positive.\"I wish Wriddhiman Saha a full and speedy recovery. Wriddhi was slated to play Sunday’s match against Rajasthan Royals, but felt a little under the weather on Saturday night. We immediately placed him in isolation and, despite our prayers, he returned a positive test,\" wrote Laxman.\"We are still wondering how, despite taking all precautions, Wriddhi got infected.\"With the tournament postponed indefinitely now, BCCI's top priority is to get everyone involved in the tournament get back home safely.BCCI and the eight franchises are making adequate arrangements for that, as some of the England players have already returned home and the Australians have headed to Maldives and Sri Lanka to quarantine before returning home.The Australian government has banned entry of all travellers from India until May 15.\"Several of the Indian players from Sunrisers Hyderabad, who live in and around Delhi, have already reached home, while Jonny Bairstow and Jason Roy have departed for England,\" Laxman said.\"A majority of our overseas contingent will leave on Thursday, and we are working with the BCCI to ensure untroubled passage for the Australians, who can’t return home until at least May 15, as per the guidelines laid down by the Australian government.\"There are reports of BCCI mulling over England, UAE and Australia as the possible options for the return of the unfinished tournament later this year.But Laxman felt it's \"premature\" to talk about that.\"As to when this edition of the IPL will resume, that question is premature. The first objective is health. I am sure the BCCI will take appropriate steps to identify a short window for the remaining games, be it after the World Test Championship final or before the T20 World Cup.\"",
    "Title": "Health first, IPL later: VVS Laxman"
  },
  {
    "Date": "Thu, 06 May 2021 03:31:02 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/05/Untitled-design-8.jpg",
    "Link": "https://indianexpress.com/article/sports/football/chelsea-beat-real-madrid-to-set-up-all-english-champions-league-final-vs-man-city-7303882/",
    "Text": "Chelsea's Timo Werner, third from right, celebrates with his teammates after scoring his side's first goal during the Champions League semifinal 2nd leg match between Chelsea and Real Madrid at Stamford Bridge in London, Wednesday, May 5, 2021. (AP Photo/Alastair Grant)\n\nChelsea’s decision to fire a club legend suddenly doesn’t seem so callous after all.\n\nWhile Frank Lampard’s name has hardly been forgotten by the Chelsea fans — there were chants outside Stamford Bridge before kickoff on Wednesday — new manager Thomas Tuchel is quickly creating his own legacy after leading the London club into the Champions League final against Manchester City.\n\nChelsea even made record 13-time European Cup champion Real Madrid look ordinary as goals from Timo Werner and Mason Mount sealed a 2-0 victory that ousted Madrid 3-1 on aggregate.\n\nPerhaps the stragglers leaving the bars near Stamford Bridge could hear the roar Tuchel let out on the field inside the empty stadium long after his players had departed the field. It will certainly have been heard in the Chelsea boardroom by the directors whose decision to dismiss Lampard in January and hire Tuchel now seems vindicated.\n\n“I am very grateful and thankful to have this opportunity,” said Tuchel, who’d been dismissed by Paris Saint-Germain in December despite leading the French club to last year’s Champions League final. “You can never be ahead of plan as a manager and as a player — it does not exist.”\n\nJust like when owner Roman Abramovich made mid-season managerial changes in the 2007-08 and 2011-12 seasons, Chelsea will end the campaign by contesting the biggest game in European football. And by the end of the month two Champions League trophies could be at Stamford Bridge, with Chelsea the first club to reach the men’s and women’s finals in the same season.\n\nEven though the men’s showpiece will be an all-English encounter on May 29, the Premier League rivals will have to fly four hours to play the UEFA showpiece in Istanbul, which is currently in a coronavirus lockdown. While City has never lifted the European Cup, Chelsea’s only triumph came in 2012 when the 22-year-old Mount was in the youth system.\n\nHighlights:\n\n“It’s going to be a stunning game,” Mount said.\n\nUnlike last season’s final — when Tuchel’s PSG lost to Bayern Munich — fans are set to be allowed in. Chelsea supporters have yet to see Tuchel managing their team in the flesh due to England’s ongoing coronavirus restrictions. But they can’t deny the impact he has made.\n\nChelsea was five points outside the four Champions League qualification places when he was hired, but heads into the final four games of the Premier League season in fourth place with a three-point cushion. There’s a chance to pick up a trophy before the trip to Turkey, too, with an FA Cup final against Leicester on May 15 after beating City in the semifinals.\n\nMadrid coach Zinedine Zidane is left to focus on trying on wiping out Atletico Madrid’s two-point lead in Spain to win La Liga, rather than adding to the three Champions League titles he won from 2016 to 2018.\n\n“I think we tried, but the truth is today Chelsea were superior and we have to congratulate them,” Zidane said. “It was complicated throughout the match because they had many chances to score more goals and they deserved their victory.”\n\nAfter conceding a costly away goal last week, Madrid lacked the attacking nous or threat to turn this semifinal around as Chelsea kept an 18th clean sheet in 24 games under Tuchel.\n\nKarim Benzema was denied by the first in a series of fine saves by Chelsea goalkeeper Edouard Mendy before Werner’s opener but the visitors were sluggish, lacking a creative spark from Eden Hazard on an ineffective return to his former home.\n\n\n\nEven in a debut season of misfortune, not even Werner could miss in the 28th minute when presented with an unguarded net to head into from close range after Kai Havertz had lobbed former Chelsea goalkeeper Thibaut Courtois and hit the crossbar.\n\n“I had to wait a long time for the ball coming down — it felt like hours,” Werner said.\n\nThe chants of “Timo” from the substitutes’ bench reflected the delight from his teammates that the Germany forward had scored only his fourth goal in 35 games for Chelsea. For all the scrutiny faced, though, Werner has still managed 12 goals and 10 assists since last year costing Chelsea up to $68 million.\n\nFor all Chelsea’s threat, Madrid only needed to score once to force the second leg into extra time. When the second half opened with Havertz heading against the crossbar and having a low shot saved it looked like the misses could prove costly.\n\n“Keep on pushing guys,” Tuchel urged from the sideline.\n\nAnd so they did, helped by the arrival of Christian Pulisic from the bench as Werner’s replacement to spark the second goal. The American headed to N’Golo Kante and received the ball back to feed Mount, who lifted a shot over Courtois in the 85th.\n\n“I have to go on and do my bit,” Pulisic sad, “be creative and try to finish the game off strong and luckily I was able to do that.”\n\nNot that Pulisic was satisfied waiting more than an hour to enter the game.\n\n“Very frustrated — I wanted to play from the beginning, as I always do,” said the forward signed in 2019 from Borussia Dortmund. I’ve had to continue to prove myself over and over again. … Nothing can stop me, really.”",
    "Title": "Chelsea beat Madrid to set up all-English Champions League final vs Man City"
  },
  {
    "Date": "Thu, 06 May 2021 04:39:10 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/05/Untitled-design-3-2.jpg",
    "Link": "https://indianexpress.com/article/sports/cricket/after-suspending-the-ipl-can-india-host-the-t20-world-cup-7303954/",
    "Text": "It remains to be seen whether India tries to move the IPL to the UAE. The BCCI has already suggested the UAE as the alternative venue for the T20 World Cup if things don’t improve enough for India to stage the touranment. (FILE)\n\nThe postponement of cricket’s richest league because of surging coronavirus cases has raised questions about India’s ability to host the Twenty20 World Cup later this year.\n\nThe Board of Control for Cricket in India last month gambled on going ahead with its marquee IPL tournament during the pandemic.\n\nBut as COVID-19 cases increased closer toward 400,000 a day across India, the tournament’s so-called bio-secure bubble was breached this week when players and team staff started returning positive tests for the coronavirus.\n\nThe IPL was postponed indefinitely on Tuesday, leaving the BCCI and the International Cricket Council pondering how or if India can host the 16-team T20 World Cup in October and November.\n\nMany of the world’s star players who compete in the IPL were scrambling to depart. The BCCI assured players it would do everything possible to help them get home but there’ll be difficulties for some. Australia, for example, has temporarily barred travelers from India. There are 38 Australians either playing, working as coaches or as commentators in the IPL.\n\nLast year, the BCCI staged the IPL in the United Arab Emirates because of the pandemic. But this year India wanted to bring the tournament back home, at least in part to use it as a rehearsal for the World Cup.\n\nTo cut down on travel, the competition was designed to move the teams into two cities in phases. But the cracks started to appear in the bio-secure bubble once the franchises were shifted to Ahmedabad and Delhi — two cities experiencing surges of coronavirus cases — after the first phase of the tournament was completed at Chennai and Mumbai.\n\nOn Monday, two players from Kolkata Knight Riders tested positive at Ahmedabad and Game 30 was postponed — the first major delay of the tournament that started on April 9.\n\nOn Tuesday, it was revealed that Chennai Super Kings’ bowling coach Lakshmipathy Balaji and one of its support staff members returned positive tests in Delhi and Sunrisers Hyderabad wicketkeeper Wriddhiman Saha also tested positive and was isolated.\n\nOrganizers made the decision to suspend competition indefinitely. The BCCI is adamant that the IPL will resume once the pandemic situation improves, but windows for the tournament are limited.\n\nIt remains to be seen whether India tries to move the IPL to the UAE. The BCCI has already suggested the UAE as the alternative venue for the T20 World Cup if things don’t improve enough for India to stage the touranment.\n\n“One thing I want to make very clear, it (IPL) has not been cancelled. It has been suspended, it has been postponed, it has been deferred. So it will happen,” BCCI vice-president Rajiv Shukla told the IPL’s official broadcasters. “The remainder of the IPL will happen but in due course.”\n\nIndia successfully hosted matches against England during the pandemic in Chennai and Ahmedabad and has also shortlisted eight cities to host the T20 World Cup. But coordinating a World Cup featuring 16 teams will be a harder assignment again.\n\nIndia has already reported more than 20 million COVID-19 cases, and thousands of people are dying every day.",
    "Title": "After suspending the IPL, can India host the T20 World Cup?"
  },
  {
    "Date": "Thu, 06 May 2021 02:37:42 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2019/05/kotla-1200.jpg",
    "Link": "https://indianexpress.com/article/sports/ipl/two-held-at-kotla-for-betting-on-ipl-games-similar-incident-in-ahmedabad-also-7303786/",
    "Text": "As high-profile cricket matches are taking place inside bio-bubbles, bookies are now targeting people who work on a contractual basis inside the stadium. (Kotla ground/FILE)\n\nTwo men suspected to be involved in betting were arrested from the Arun Jaitley stadium on Sunday during the Indian Premier League (IPL) match between Rajasthan Royals (RR) and Sunrisers Hyderabad.\n\nThe two were caught by police, with help from the anti-corruption unit of the Indian cricket board, after they entered the stadium using fake identity cards. Both have been produced before a Delhi Court and sent to five-day police custody.\n\nA similar kind of incident took place at the Narendra Modi Stadium in Ahmedabad last week where the BCCI’s anti-corruption unit nabbed two persons passing information on the phone. They were handed to Ahmedabad Police.\n\nBCCI anti-corruption unit chief Shabbir Khandwawala said that in both cases, it was their ACU officer who caught the suspects.\n\n“In Delhi, our ACU officer saw a man talking on the phone continuously. He was carrying housekeeping accreditation with him. When our officer tried to catch him, he ran away but we got his phone. We handed all the details to Delhi Police, who later arrested the suspects,” Khandwawala said.\n\n\n\nAdditional DCP (Central) Rohit Meena said the accused have been identified as Manish Kansal (38), posing as housekeeping staff, and Krishan Garg (26), who acted as a health worker with the South Delhi Municipal Corporation (SDMC). “We have lodged an FIR against them at IP Estate police station and recovered the accreditation cards from their possession. We are now trying to find out the authenticity of the accreditation cards and how they got them,” Meena said.\n\nPolice personnel deployed at the stadium also shared details of the arrest with BCCI’s anti-corruption unit. “After monitoring their activities for around 45 minutes, both of them were taken into custody and questioned by officials. They initially tried to mislead the investigators by cooking a false story and claiming to be officials, but after sustained interrogation, they broke down. They confessed that they were involved in illegal betting,” a senior police officer said.\n\nAs high-profile cricket matches are taking place inside bio-bubbles, bookies are now targeting people who work on a contractual basis inside the stadium.\n\nKhandwawala, a former Gujarat DGP, explained how the suspects might have got access to accreditation cards. “The association must have given a contract to a company, which hires people on a daily basis. They might be getting 200 rupees per day. The bookies target such people and pay them an extra amount to pass on information. We are in touch with police and trying to seek more information with them.”\n\nThe ACU had also alerted Mumbai Police during the first leg of the tournament when a person of interest and well-known bookie stayed at the same hotel as an IPL team.\n\n“They didn’t approach anyone but it was a suspect and a person of interest. We informed Mumbai Police and they raided the hotel and took action on it,” Khandwawala said.\n\nThis is not the first such recent instance at the Delhi stadium during this edition of the IPL.\n\nBefore this match, one man posing as housekeeping staff was caught by the ACU. He was giving ball-by-ball details over phone. He was questioned by the ACU officials, but before they could call the police, he managed to escape from their custody. ACU officials later approached Delhi Police and filed a complaint after handing over his cell phone to them.\n\nWhy being at the ground is key (Edot)\n\nBookies take advantage of the time lag between the actual action and when it appears on television. This period could even be longer than 10 seconds, enough time for someone in the stadium to inform the bookie at a remote location about what happened on a particular delivery. The bookie thus gains an advantage over someone who is watching the game on television and placing bets. Illegal bookmakers often employ hired hands — they are called pitch-siders — at stadiums to give them ball-by-ball updates to exploit the delay in live pictures.",
    "Title": "Two held at Kotla for betting on IPL games; similar incident in Ahmedabad also"
  },
  {
    "Date": "Thu, 06 May 2021 02:20:39 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2020/10/148841-clraytzonv-1602133322.jpg",
    "Link": "https://indianexpress.com/article/sports/ipl/ms-dhoni-delays-return-to-ranchi-till-all-his-csk-teammates-depart-7303778/",
    "Text": "Dhoni has said that he will wait for the foreigners to leave first and the other Indian players next before he goes home from Delhi, where the team is based. (BCCI/IPL)\n\nFormer India captain Mahendra Singh Dhoni has informed his Chennai Super Kings (CSK) teammates that he will be the last person to board the flight back home.\n\nDhoni has said that he will wait for the foreigners to leave first and the other Indian players next before he goes home from Delhi, where the team is based.\n\nIn a virtual meeting with his teammates, Dhoni said that since the IPL is happening in India, the foreign players and support staff should get the preference to travel first to reach their homes abroad. And the Indian team players will later depart for home.\n\n“Mahibhai said that he will be the last person to leave the hotel. He wanted foreigners to leave first, then the Indian players. He will be taking the last flight tomorrow when everyone reaches their home safe and secure,” a member of CSK told The Indian Express.\n\nCSK organised a charter flight for its players from Delhi. A ten-seater flight carrying CSK players went to Rajkot and Mumbai in the morning while the evening charter plane dropped players from Bangalore and Chennai. Dhoni is scheduled to fly on Thursday evening to his home in Ranchi.\n\n\n\nTeams like Mumbai Indians and Kings XI Punjab also organised charter flights for its Indian players while Rajasthan Royals, Kolkata Knight Riders, and Sunrisers Hyderabad players boarded commercial flights to their respective destinations.\n\nMany players took cabs to reach their respective destinations – from Ahmedabad to Mumbai and from Delhi to Punjab.\n\nMaldives stop for Aussies\n\nThe Indian Express understands that BCCI is helping the franchises to book a combined charter flight for Australian players, support staff and umpires who were part of IPL. The Australians have preferred the Maldives for their stay until flights to Australia resume. The Australian players are expected to fly to the Maldives by May 6.\n\nThe Indian board had given two options — the Maldives and Sri Lanka — for Australian players to fly to before their country lifts the ban on citizens travelling from India. The Australian government had shut all flights from India until May 15 after India saw a steep rise in the Covid-19 cases in the past few weeks. On Tuesday, BCCI treasurer Arun Dhumal had said, “We stand by our word that for us, the IPL is not complete until our players and officials reach their homes safe and secure. We are working on that and will come out with a detailed plan in two days.”\n\nStay safe daddy, come home soon we love you. @davidwarner31 pic.twitter.com/VXkrIzWomx — Candice Warner (@CandiceWarner31) May 4, 2021\n\nThe commentator from Australia Michael Slater is already in the Maldives and has been firing barbs at Australia’s prime minister John Morrison. “Amazing to smoke out the PM on a matter that is a human crisis. The panic, the fear of every Australian in India is real! How about you take your private jet and come and witness dead bodies on the street!” he tweeted on Wednesday.\n\nThree-day quarantine\n\nThe BCCI has informed all Indian players and support staff that they will have to undergo three days of isolation at home and another RT-PCR Test will be conducted on the third day after their arrival.\n\nUK players reach home\n\nEight of the 11 UK players who took part in IPL have reached their country. The other three – Eoin Morgan, Dawid Malan, and Chris Jordan – are expected to reach in a couple of days. Mooen Ali, Jonny Bairstow, Jos Buttler, Sam Billings, Sam Curran, Tom Curran, Jason Roy, and Chris Woakes are the eight who have reached and are quarantining in government-approved hotels.\n\nThis also means that the players will be available for the Test series against New Zealand at home in June.\n\nBangladesh players wait\n\nShakib Al Hasan and Muztafizur Rahman will soon be taking a chartered flight back home from Delhi. Commercial flights from India have been banned by the Bangladesh government since April 24 and the players will have to undergo 14-day quarantine after they reach.\n\nSouth Africans leave\n\nThe 11 South African players have left for their country as there have been no restrictions imposed by their government on air travel.\n\nThey will be quarantined once they reach. Ab de Villiers, Quinton de Kock, Marco Jansen, Faf du Plessis, Lungi Ngidi, Imran Tahir, Kagiso Rabada, Anrich Nortje, Chris Morris, David Miller, and Gerald Coetzee are the players in the tournament.",
    "Title": "MS Dhoni delays return to Ranchi till all his CSK teammates depart"
  },
  {
    "Date": "Thu, 06 May 2021 08:23:31 +0530",
    "Description": "Chelsea set up an all-English Champions League final against Manchester City as goals from Timo Werner and Mason Mount helped them beat Real Madrid 2-0 in a dominant display on Wednesday to seal a 3-1...",
    "Image": "https://c.ndtvimg.com/2021-05/sn9rs3k_chelsea-celebration-afp_625x300_06_May_21.jpg",
    "Link": "https://sports.ndtv.com/football/chelsea-vs-real-madrid-chelsea-dominate-real-madrid-to-set-up-all-english-champions-league-final-2432855",
    "Text": "Chelsea set up an all-English Champions League final against Manchester City as goals from Timo Werner and Mason Mount beat Real Madrid 2-0 in a dominant display on Wednesday to seal a 3-1 aggregate victory at Stamford Bridge. If anything, the scoreline flattered Madrid as the 13-time European champions had no response to Chelsea's greater strength and speed. The Blues should have ran out far more convincing winners as they toyed with the tired visitors in the second half. However, Werner's cushioned header into an empty net on 28 minutes after Kai Havertz's initial effort came back off the crossbar and Mount's tap-in five minutes from time were enough to seal their place in Istanbul on May 29.\n\n\"To never lose the concentration, focus and positive energy on the pitch -- it was a huge performance and well deserved,\" said Chelsea manager Thomas Tuchel, who has masterminded a huge turnaround in Chelsea's season since replacing the sacked Frank Lampard in January.\n\nBacked by Russian billionaire owner Roman Abramovich, Chelsea's £220 million spending spree last summer has been rewarded with a first Champions League final since they lifted the trophy for the only time in 2012.\n\n\"We never lost the hunger, the desire to defend,\" added Tuchel. \"In the second half we had even better structure to defend and it was a fantastic performance.\n\n\"We could have scored so much earlier and more to be safe, but it's no time for criticism now. It's a fantastic achievement and big congratulations to the team.\"\n\nMadrid boss Zinedine Zidane welcomed back captain Sergio Ramos for the first time in six weeks, while Eden Hazard was handed a rare start in an injury-hit season on his return to Stamford Bridge.\n\nBut the Belgian was again a peripheral figure as Madrid's over-reliance on Karim Benzema to provide a goal threat was exposed.\n\n\"We needed to be better going forward,\" said Zidane. \"We didn't have any clear chances. They made a number of them and that's football.\n\n\"We fought and tried but they deserved to win and go through.\"\n\n- Chelsea not made to pay for missed chances -\n\nMadrid's only serious threat came from a quick turn and shot from the edge of the box from Benzema that Edouard Mendy did brilliantly to turn behind midway through the first half.\n\nMoments later they were behind as Werner scored just his fourth goal in his last 39 games.\n\nN'Golo Kante and Havertz did the hard work as the French midfielder fed Havertz, whose audacious chip over Thibaut Courtois bounced invitingly off the crossbar for Werner to head into an empty net.\n\nChelsea have now kept 18 clean sheets in 24 games since the appointment of Tuchel turned their season around.\n\nHowever, a failure to take their chances at the other end means they are still far from guaranteed a place in the Champions League next season.\n\nThat lack of a killer touch was exposed after the break as Havertz saw a free header come back off the bar before Mount blasted over with just Courtois to beat.\n\nThe former Chelsea 'keeper, who controversially forced a move back to Spain in the summer of 2018, kept his current employers in the tie as he then saved one-on-ones with Havertz and Kante, with the Blues' speed on the break too much for Madrid's ageing midfield to cope with.\n\nTuchel was growing increasingly frustrated with his side's inability to put the tie to bed, but could finally relax five minutes from time.\n\nPromoted\n\nSubstitute Christian Pulisic left Courtois on the floor and from his cut-back, Mount slid in to finish from close range.\n\nFired by Paris Saint-Germain on Christmas Eve after leading the French champions to their first ever final in this competition last season, Tuchel is headed back to the Champions League showpiece match for a second consecutive season, unlike his former club, who were beaten 4-1 on aggregate by City in the other semi-final.",
    "Title": "Chelsea Dominate Real Madrid To Set Up All-English Champions League Final"
  },
  {
    "Date": "Thu, 06 May 2021 02:55:20 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/05/Untitled-design-7.jpg",
    "Link": "https://indianexpress.com/article/sports/football/champions-league-man-city-vs-psg-riyad-mahrez-showing-up-when-manchester-city-need-him-most-7303814/",
    "Text": "A Manchester City break came in the 62nd minute. It wasn’t the quickest counterattack, as a good number of Paris Saint Germain players tracked back at the Etihad Stadium on Tuesday. Phil Foden carried the ball down the left, squaring to Kevin De Bruyne under pressure. The Belgian returned it to Foden who was well on his way into the PSG box after a moment. On the other side of the pitch, Riyad Mahrez darted forward unmarked by anybody in a Parisian jersey. Once Foden drilled a low cross Mahrez was there, happily slotting home his and City’s second in the Champions League second leg semi-final. City would go on to win 4-1 on aggregate.\n\nIn many ways, that undetected run represents Mahrez’s career. A crafty left-footer, blessed with speed and the ability to dribble at break-neck pace, tends to fly under the radar – especially in a star-studded line-up. Thriving in his low-key role, it’s helped him become one of the most devastating players in front of goal.\n\nThe 30-year-old France-born Algerian scored three goals over the two semi-final legs for his club. And it helped take City to its first ever Champions League final.\n\nLow-profile match winner\n\nWhen Mahrez was at Leicester City, his star was overshadowed by Jamie Vardy. Even in that historic 2015-16 Premier League winning season, where Mahrez scored 17 times and made 11 assists, Vardy’s 24 goals – including a Premier League record of scoring in 11 consecutive matches – eclipsed the Algerian.\n\nChampions League – Semi Final Second Leg – Manchester City v Paris St Germain – Etihad Stadium, Manchester, Britain – May 4, 2021 Manchester City’s Riyad Mahrez celebrates scoring their second goal. (REUTERS/Phil Noble) Champions League – Semi Final Second Leg – Manchester City v Paris St Germain – Etihad Stadium, Manchester, Britain – May 4, 2021 Manchester City’s Riyad Mahrez celebrates scoring their second goal. (REUTERS/Phil Noble)\n\nAt Manchester City, who dished out GBP 60 million to secure his services – making him then the most expensive African footballer – Mahrez is still not the first name that comes to mind. There is De Bruyne, Raheem Sterling, Sergio Aguero (for whom this is the final season), and even the new star Foden.\n\nUnder the radar, yet still a vital cog in his side. That’s also how he was first noticed by the bigger names in Europe.\n\nUnspectacular Beginnings\n\nBorn in Sarcelles, a poor commune in Northern Paris, to an Algerian father and Moroccan mother, Mahrez was a self-taught street footballer.\n\nThe silky skills though weren’t enough for him, at 18, to find a place in fourth division team Quimper. What he had in skill, for the scouts, was not enough for what he lacked in physicality. The team’s manager eventually had his way and forced the directors to sign the player.\n\nA few years later, while playing in the French Ligue 2 with Le Havre, he first came into contact with then Championship club (second division) Leicester City – who he first thought was a rugby team. Incidentally, the English scouts had not travelled to France to look at him, but were rather there to spy on his teammate Ryan Mendes. But Mahrez captured their imagination.\n\n“Riyad was a bit raw but he had a great touch,” Steve Walsh, the club’s head of recruitment told the Daily Mail. “He could kill the ball dead and go past people. I liked his positivity. Some of his decision-making wasn’t that great and defensively he wasn’t the best, but you could see that he had real talent.”\n\nHe moved to Leicester in early 2014 following a GBP 450,000 transfer, helping them gain promotion to the Premier League before moving to Manchester City in 2018.\n\nUnwavering self-belief\n\nSlight frame notwithstanding, his flair, eye for goal and a killer pass could not be undervalued. Nor could his spirit be broken.\n\n“How did I prove them wrong? Just with my ability, my quality,” he described his mentality to Four-Four Two. “They would say those things, then we’d play a game, I’d play well and they’d change their opinion. I used to play a lot in (Paris) and it helped me.”\n\nHe scored 17 goals, including a hat-trick against Swansea City to help the Foxes win the Premier League title. This season he’s scored 15 goals in all competitions, including four in the Champions League.\n\nImproved defensive skills\n\nUnder Nigel Pearson, who managed Leicester while they were in the English Championship, he gained confidence and experience. Under Claudio Ranieri, he was allowed to use his fleet-footed skills at will to wreak havoc of defences.\n\nUnder Pep Guardiola at Manchester City, he’s become aware of his defensive role. In the second leg against PSG, he made four tackles and interceptions in the first half alone.\n\nRaking up the titles\n\nSo far Mahrez has won three Premier League titles (including in the on-going season). He helped Algeria win the 2019 African Cup of Nations title, its first since 1990 and second overall.",
    "Title": "Riyad Mahrez showing up when Manchester City need him most"
  },
  {
    "Date": "Thu, 06 May 2021 11:41:29 +0530",
    "Description": "IPL 2021: Sourav Ganguly said that according to the reports the BCCI has received, there was no breach of the bubble during the now-postponed IPL 2021.",
    "Image": "https://c.ndtvimg.com/2021-05/5t918sk8_sourav-ganguly-instagram_625x300_06_May_21.jpg",
    "Link": "https://sports.ndtv.com/cricket/indian-premier-league-2021-how-coronavirus-entered-ipl-bio-bubble-sourav-gangulys-reply-2435634",
    "Text": "Days after the Indian Premier League (IPL) 2021 was postponed, the Board of Control for Cricket in India (BCCI) president Sourav Ganguly defended the board's decision to stage the T20 tournament in the country amid the coronavirus pandemic. The former India captain, while explaining it is difficult to contain the virus even inside a bio-secure environment, cited the example of virus breaching Premier League bubble and affecting football players in the UK.\n\nSpeaking about a potential breach in the bio-bubble, Ganguly, in an interview with the Indian Express, said the report received by the board suggests there was no breach.\n\n\"I don't think so. The report we got is that there's no breach of the bubble. How it happened is very difficult to say. How so many people are getting (infected) in the country is also very difficult to say,\" Ganguly was quoted as saying.\n\nFour franchises, Kolkata Knight Riders, SunRisers Hyderabad, Delhi Capitals and Chennai Super Kings, reported positive Covid cases within their camps after which the 14th edition of the IPL was postponed indefinitely.\n\n\"Professional hands around the world can't control it (virus penetrating the bubble). When it was happening in England (second wave of the pandemic), there were cases in the English Premier League. Manchester City, Arsenal players got infected,\" Ganguly said.\n\nThe former India skipper mentioned that due to a rigid schedule, it is difficult for the board to reschedule games easily.\n\nPromoted\n\n\"(Premier League) Matches got rescheduled. Because their season is six months long, they can do it. But our season is tight. Since we have to (release) players to their respective countries, rescheduling was very difficult,\" Ganguly added.\n\nThe former left-handed batsman further said that there were discussions to host the 14th edition of IPL in the UAE but since there were not many cases back then in the country, the BCCI decided to stage it in India.",
    "Title": "How Coronavirus Entered IPL Bio-Bubble? Sourav Ganguly's Reply"
  },
  {
    "Date": "Thu, 06 May 2021 10:43:04 +0530",
    "Description": "Four members of New Zealand's Test contingent involved in the now-suspended IPL, including captain Kane Williamson, will leave India for the United Kingdom on May 11 while the rest will make their way...",
    "Image": "https://c.ndtvimg.com/2020-11/jd548v78_kane-williamson-srh-bcciipl_625x300_09_November_20.jpg",
    "Link": "https://sports.ndtv.com/cricket/new-zealands-ipl-based-test-players-to-leave-for-england-on-may-11-says-nzc-2434740",
    "Text": "Four members of New Zealand's Test contingent involved in the now-suspended IPL, including captain Kane Williamson, will leave India for the United Kingdom on May 11 while the rest will make their way back home on Friday, the country's cricket board has announced. New Zealand are scheduled to play hosts England in a two-match Test series, beginning on June 2, before facing India in the World Test Championships final at Southampton from June 18. \"We've worked closely with the BCCI and the IPL franchises on the various departure strategies and we're very appreciative of their support during what is, clearly, a very challenging time,\" New Zealand Cricket (NZC) chief executive David White said in a statement on Thursday.\n\nSkipper Williamson, pacer Kyle Jamieson and spinner Mitchell Santner, as well as physio Tommy Simsek, will remain in a mini-bubble in New Delhi before departing for the UK, ahead of preparations for the Test series against England, and the WTC final against India.\n\nThere were 17 New Zealanders involved in the IPL, including 10 players.\n\n\"We are also very grateful to the England and Wales Cricket Board for accommodating the early arrival of the four members of the Test squad currently in India.\"\n\nNZC said May 11 is the earliest date it could obtain for the team's arrival in the UK.\n\nHowever, pace spearhead Trent Boult will return home briefly to see his family before joining the Test squad in early June, for the second match against England and the WTC final.\n\nThe New Zealand-based Test squad members will depart for England on May 16 and 17.\n\n\"Along with the balance of the New Zealand-bound IPL players, support staff and commentators, Boult is scheduled to depart New Delhi tomorrow on one of two charter flights, arriving in Auckland on Saturday before undergoing managed isolation,\" the NZC stated.\n\n\"...Boult will leave MIQ (Managed Isolation and Quarantine) on May 22 and will spend a week at home with his family, training at Mt Maunganui before departing for the UK in early June,\" it added.\n\nNew Zealand team trainer Chris Donaldson, who has been with the Kolkata Knight Riders, will also return home briefly to see his family before reconnecting with the Test squad.\n\nWhite said Boult and Donaldson will return home for the three-week period with the \"blessing\" of the cricket board and the national team management.\n\n\"We're completely supportive of Chris and Trent taking the opportunity to see their families before heading to the UK,\" said White.\n\n\"They've always been the consummate professionals and we're more than happy to accommodate these arrangements.\"\n\nWhite said IPL players, support staff and commentators returning to New Zealand would adhere to all regulatory protocols, including pre-departure COVID-19 tests.\n\nPromoted\n\nThose returning home from India also include Stephen Fleming, Brendon McCullum, Kyle Mills, Shane Bond, Mike Hesson, Tim Seifert, Adam Milne, Scott Kuggeleijn and James Pamment.\n\nThe league was suspended after four players and two coaching staff members from three different teams tested positive for COVID-19 inside the bio-bubble.",
    "Title": "New Zealand's IPL-Based Test Players To Leave For England On May 11: NZC"
  }
]