[
  {
    "Date": "Thu, 06 May 2021 01:07:05 +0000",
    "Description": "After a series of high-altitude test flights that ended in explosions, the new vehicle set down in one piece on a Texas launchpad.",
    "Image": "https://static01.nyt.com/images/2021/05/05/multimedia/05starship-sub-video-top/05starship-HP-promo-sub-facebookJumbo.jpg",
    "Link": "https://www.nytimes.com/2021/05/05/science/spacex-starship-launch.html",
    "Text": "A few weeks ago, NASA awarded a contract to SpaceX for $2.9 billion to use Starship to take astronauts from lunar orbit to the surface of the moon. The contract is part of the Artemis program, and NASA had been expected to choose more than one company to build a moon lander, mirroring the approach the space agency has used for hiring companies to take cargo and now astronauts to the International Space Station.\n\nAfter the announcement, NASA’s decision was challenged by the two other companies that were competing for the contract: Blue Origin, the private company founded by Jeff Bezos, the chief executive of Amazon; and Dynetics, a defense contractor in Huntsville, Ala. NASA has now instructed SpaceX to halt work on the lunar Starship until the Government Accountability Office makes a decision on the protests. The challenge does not affect SpaceX’s work on the Starship models currently being tested in Texas.\n\nMr. Musk’s company has become successful in the launch business, and it is now one of the world’s most valuable privately held companies. Its Falcon 9 rockets have become a dominant workhorse for sending satellites into orbit. It routinely transports cargo and astronauts to the International Space Station. In the last month, it has launched four astronauts to the space station for NASA, and later brought home another crew in a nighttime splashdown on Saturday.\n\nHowever, many are skeptical of Mr. Musk’s assertion that the company is just a few years from sending a Starship to Mars, noting that he has repeatedly set timelines for SpaceX that proved far too optimistic.\n\nIn 2019, when he provided an update on the development of Starship, he said that a high-altitude test would occur within months and that orbital flights could occur early in 2020.\n\nInstead, several catastrophic failures happened because of faulty welding. When the propellant tanks stopped rupturing, two of the prototypes made short successful flights last year. Those earlier Starship prototypes resembled spray paint cans with their labels removed, rising nearly 500 feet using a single rocket engine before setting back down at the Texas test site.\n\nAlthough it has lifted off the ground many times, Starship is a long way from being ready for a trip to orbit. But SpaceX already has its eyes on future tests that will send subsequent Starship prototypes to much greater altitudes. In March, Mr. Musk shared a picture of a prototype of the large booster stage that will be needed for a trip to space. It is over 200 feet tall.",
    "Title": "Watch: SpaceX Launch and Landing of Starship SN15"
  },
  {
    "Date": "Thu, 06 May 2021 08:40:32 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/gadgets-news/read-sundar-pichais-email-on-google-bringing-employees-back-in-offices/articleshow/82423676.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82423676.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>In his email, Pichai wrote that Google is “testing new multi-purpose offices and private workspaces, and working with teams to develop advanced video technology that creates greater equity between employees in the office and those joining virtually.”",
    "Image": "https://static.toiimg.com/thumb/msid-82423661,width-1070,height-580,imgsize-366769,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/gadgets-news/read-sundar-pichais-email-on-google-bringing-employees-back-in-offices/articleshow/82423676.cms",
    "Text": "Several parts of the world — including India and Brazil — are still being severely impacted by the coronavirus pandemic. However, some regions are coming back to a sense of normalcy and people are at least thinking about going back to life as we knew it. In such times, Google CEO Sundar Pichai has sent an email to Google employees detailing how the company plans to bring employees back to offices.\n\nIn his email, Pichai wrote that Google is “testing new multi-purpose offices and private workspaces, and working with teams to develop advanced video technology that creates greater equity between employees in the office and those joining virtually.”\n\nGoogle, as per Pichai, will move to a hybrid week culture. “We’ll move to a hybrid work weak where most Googlers spend approximately three days in the office and two days wherever they work best.”\n\nThe company expects about 60% of Google employees to come to offices together, 20% to work from new office locations whereas the rest 20% will continue working from home.\n\n“I am profoundly optimistic that once we do, we will be able to come back together in our offices to see all the people we have missed. And we’ll be able to work together in entirely new ways that improve both our work and our lives,” noted Pichai in his email.\n\nHere’s the full email Pichai wrote to the employees:\n\nHi Googlers,\n\nWe’ve spent the last year focused on supporting employees during the pandemic. I hope the extra benefits such as Carer ’s Leave, the work-from-home allowance, the extra reset days, and the ability to work from wherever you need have been helpful in getting through this tough time.\n\nAnd we’re not through it yet. It’s heartbreaking to see COVID surging in places like India, Brazil, and many others around the world. If you live in one of these places, please focus on taking care of yourselves and your loved ones right now. We are here to support however we can.\n\nIn other areas, conditions are less dire and people are beginning to open up their lives and think about returning to the office. In fact, in places where we’ve been able to reopen Google offices in a voluntary capacity, we’ve seen nearly 60% of Googlers choosing to come back to the office.\n\nFor more than 20 years, our employees have been coming to the office to solve interesting problems — in a cafe, around a whiteboard, or during a pickup game of beach volleyball or cricket. Our campuses have been at the heart of our Google community and the majority of our employees still want to be on campus some of the time. Yet many of us would also enjoy the flexibility of working from home a couple days of week, spending time in another city for part of the year, or even moving there permanently. Google’s future workplace will have room for all of these possibilities.\n\nOver the last year, a team within REWS has been reimagining a hybrid workplace to help us collaborate effectively across many work environments. They’re testing new multi-purpose offices and private workspaces, and working with teams to develop advanced video technology that creates greater equity between employees in the office and those joining virtually. All of these efforts will help us work with greater flexibility and choice once we’re able to return to our offices globally.\n\nThat flexibility will come in a few different forms — and your product areas and functions will share more details on all of these changes by mid-June. Here are the key principles:\n\nA more flexible work week:\n\nWe’ll move to a hybrid work week where most Googlers spend approximately three days in the office and two days wherever they work best. Since in-office time will be focused on collaboration, your product areas and functions will help decide which days teams will come together in the office. There will also be roles that may need to be on site more than three days a week due to the nature of the work.\n\nMore choice around where you work:\n\nMore locations globally: One of Google's biggest advantages is our global footprint. We are investing in many great communities globally — which creates more opportunity for employees to move around throughout their careers. By mid-June your PAs and functions will come back with a process by which you can apply to move to another office. In granting approvals, they’ll take into account whether business goals can be met in the new location and whether your team has the right infrastructure in the site to support your work.\n\nRemote work: We’ll also offer opportunities for you to apply for completely remote work (away from your team or office) based on your role and team needs. Before the pandemic, we had thousands of people working in locations separate from their core teams. I fully expect those numbers to increase in the coming months as we develop more remote roles, including fully all-remote sub teams. You’ll be able to apply for remote work within your product area or function. As with location transfers, your leads will evaluate whether remote work can support the goals of the team and business. Whether you choose to transfer to a different office or opt for completely remote work, your compensation will be adjusted according to your new location.\n\nTaken together these changes will result in a workforce where around 60% of Googlers are coming together in the office a few days a week, another 20% are working in new office locations, and 20% are working from home.\n\nMore flexibility for your life:\n\nWork-from-anywhere weeks: Going forward, Googlers will be able to temporarily work from a location other than their main office for up to 4 weeks per year (with manager approval). The goal here is to give everyone more flexibility around summer and holiday travel.\n\nFocus time: Product areas and functions will also offer focus hours so we limit internal meetings during times when people need to be heads down on projects.\n\nReset days: We’ll continue offering extra “reset” days to help employees recharge during the pandemic in 2021. Our next global day off will be on Friday, May 28 (or the following work day if you’re already not working on the 28th). Please enjoy it!\n\nI know this past year hasn’t been easy for anyone and many Googlers are still suffering as the pandemic wears on. We will get through it — together — as a Google community.\n\nI am profoundly optimistic that once we do, we will be able to come back together in our offices to see all the people we have missed. And we’ll be able to work together in entirely new ways that improve both our work and our lives.\n\nThe future of work is flexibility. The changes above are a starting point to help us do our very best work and have fun doing it.\n\nLook forward to continuing the conversation with all of you.\n\nSundar\n\n",
    "Title": "Read Sundar Pichai’s email on Google bringing employees back in offices"
  },
  {
    "Date": "Thu, 06 May 2021 11:21:23 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/gadgets-news/xiaomi-may-soon-launch-redmi-note-10-pro-5g-with-qualcomm-processor/articleshow/82425698.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82425698.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>Redmi Note 10 Pro 5G may be powered by Qualcomm Snapdragon 750G processor. The company may soon launch the handset in India.",
    "Image": "https://static.toiimg.com/thumb/msid-82425697,width-1070,height-580,imgsize-34963,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/gadgets-news/xiaomi-may-soon-launch-redmi-note-10-pro-5g-with-qualcomm-processor/articleshow/82425698.cms",
    "Text": "Redmi Note 10 Pro 5G may be powered by Qualcomm Snapdragon 750G processor. The company may soon launch the han... Read More\n\nXiaomi is reportedly working on a 5G model of Redmi Note 5 Pro. According to a new rumour, the upcoming 5G phone is expected to be powered by a Snapdragon processor. The company may soon launch the handset in India, it says.\n\nThe rumour comes with an alleged image of the promo of the phone for the Spanish market. The phone resembles the rear design of Redmi Note 10 Pro with a quad camera setup. The promo also mentions the availability of Qualcomm 5G chipset on the device. It is likely that the Redmi Note 10 Pro 5G may be powered by Qualcomm Snapdragon 750G processor.\n\nRedmi Note 10 series comprises three phones — the standard Redmi Note 10, Redmi Note 10 Pro and Redmi Note 10 Pro Max. Both Pro models are 4G enabled, the cheaper Redmi Note 10 offers 5G connectivity.\n\nWhile Xiaomi offers many 4G phones under its Mi brand, Redmi Note 10 Pro 5G could be the company’s first mainstream 5G Redmi smartphone to be launched in India. It is expected that the phone may come with similar features as the 4G model of Redmi Note 10 Pro.\n\nRedmi Note 10 Pro: Specifications\n\nRedmi Note 10 Pro comes with a starting price of Rs 15,999. The smartphone is powered by Qualcomm Snapdragon 732G octa-core chipset and runs on MIUI 12 based on Android 11 operating system. The smartphone features a 6.67-inch FHD+ Super AMOLED screen.\n\nThe handset has a quad camera setup at the back. The system comprises a 64MP main sensor paired with an 8MP ultrawide lens, a 5MP super-macro lens and a 2MP depth sensor. It is backed by a 5,020mAh battery with 33watt fast charger.\n\n",
    "Title": "Xiaomi may soon launch Redmi Note 10 Pro 5G with Qualcomm processor"
  },
  {
    "Date": "Thu, 06 May 2021 11:39:09 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/gadgets-news/heres-why-oneplus-watch-always-on-display-update-may-not-make-users-happy/articleshow/82425990.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82425990.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>OnePlus launched its first smartwatch -- OnePlus Watch — in India with its latest OnePlus 9 series of smartphones. Last month the company announced that it will soon bring Always-on display on the smartwatch.",
    "Image": "https://static.toiimg.com/thumb/msid-82425968,width-1070,height-580,imgsize-550074,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/gadgets-news/heres-why-oneplus-watch-always-on-display-update-may-not-make-users-happy/articleshow/82425990.cms",
    "Text": "NEW DELHI: OnePlus launched its first smartwatch -- OnePlus Watch — in India with its latest OnePlus 9 series of smartphones. Last month the company announced that it will soon bring Always-on display on the smartwatch.\n\nNow, keeping to its promise the smartphone maker has started rolling out a software update which brings, Always-On display on the OnePlus Watch. But the inclusion of this feature will affect the battery life of the smartwatch.\n\nThe inclusion of Always-On display will decrease the battery life of the wearable as the screen will constantly remain on. This also means that the battery life will be reduced to half. So, after installing the update, it is possible that the OnePlus Watch will be able to deliver only 7 days of battery backup instead of 14 days.\n\nAlong with the Always-On display, the latest update also brings Marathon workout mode and fixes some issues which promise to improve the system stability.\n\nOnePlus Watch specifications\n\nOnePlus Watch features a 1.39-inch OLED display with 454×454 pixel resolution. As confirmed by the company, the OnePlus Watch uses RTOS style software the same as the one you will see in smartwatches from Amazfit. Users will also be able to connect the smartwatch with the OnePlus TV and also use it as a remote. The device comes with an IP68 rating which makes it dust and water-resistant.\n\nThe OnePlus Watch offers features like sleep monitoring, air pressure monitoring and blood oxygen level monitoring. The wearable also offers 110 workout modes which include walking, jogging, running, marathon, outdoor cycling, indoor cycling, freestyle training, swimming and more.\n\nThe company also confirmed that users will be able to track all health data using the OnePlus health app. The smartwatch also packs 4GB internal storage.\n\nThe OnePlus Watch comes with Wrap Charge fast charging support. The company claims that the smartwatch will offer a week's battery life with 20 minutes of charging.\n\n",
    "Title": "Here's why OnePlus Watch Always-On Display update may not make users happy"
  },
  {
    "Date": "Thu, 06 May 2021 11:19:11 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/gadgets-news/samsung-galaxy-tab-a7-lite-launch-soon-as-support-page-goes-live/articleshow/82425670.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82425670.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>As per the listing, Samsung Galaxy Tab A7 Lite will have both WiFi and LTE+WiFi models. It is expected to be powered by MediaTek Helio P22T processor with Imagination Tech PowerVR GE8320 GPU. The handset may pack 3GB of RAM.",
    "Image": "https://static.toiimg.com/thumb/msid-82425669,width-1070,height-580,imgsize-13192,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/gadgets-news/samsung-galaxy-tab-a7-lite-launch-soon-as-support-page-goes-live/articleshow/82425670.cms",
    "Text": "As per the listing, Samsung Galaxy Tab A7 Lite will have both WiFi and LTE+WiFi models. It is expected to be p... Read More\n\nLive support page of Samsung Galaxy Tab A7 Lite was spotted on the company’s official website. The tablet was listed on Samsung's website in regions including India, Africa, and Romania.\n\nWhile the support page does not reveal any features of the upcoming device. The tablet has allegedly been spotted on Google Play Console listing site with key specifications.\n\nAs per the listing, Samsung Galaxy Tab A7 Lite will have both WiFi and LTE+WiFi models. It is expected to be powered by MediaTek Helio P22T processor with Imagination Tech PowerVR GE8320 GPU. The handset may pack 3GB of RAM.\n\nThe tablet is likely to run on Android 11 operating system out-of-the-box. The device may come with a screen having 800x1340 pixel resolution. It is expected to have a single camera on the rear side. However, there will be no LED flash light.\n\nThe device has also appeared on Geekbench benchmark listing site. As per the website, the Galaxy Tab A7 Lite may weigh 300 grams and measure 212.5 x 124.7 x 8 mm. It is said to house a 5,100mAh battery. The device may be equipped with a USB Type-C charging port and could offer 15watt fast charging.\n\n",
    "Title": "Samsung Galaxy Tab A7 Lite launch soon as support page goes live"
  },
  {
    "Date": "Thu, 06 May 2021 01:10:30 GMT",
    "Description": "Research by Which? looked at a selection of older routers still being used by customers.",
    "Image": "https://ichef.bbci.co.uk/news/1024/branded_news/14EC1/production/_118379658_modem.jpg",
    "Link": "https://www.bbc.co.uk/news/technology-56996717",
    "Text": "\"We have been trying to convince one of the ISPs in question to fix a critical security flaw that allows several million of their customer routers to be remotely hijacked and gain access to home networks,\" he said.",
    "Title": "Millions at security risk from old routers, Which? warns"
  },
  {
    "Date": "Thu, 06 May 2021 08:50:49 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/gadgets-news/flipkart-daily-trivia-quiz-may-6-2021-get-answers-to-these-five-questions-to-win-gifts-and-discount-vouchers/articleshow/82423770.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82423770.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>Only the first 50,000 participants will be eligible for the quiz prize.",
    "Image": "https://static.toiimg.com/thumb/msid-82423741,width-1070,height-580,imgsize-37455,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/gadgets-news/flipkart-daily-trivia-quiz-may-6-2021-get-answers-to-these-five-questions-to-win-gifts-and-discount-vouchers/articleshow/82423770.cms",
    "Text": "Which of these IPL team has been captained by Gautam Gambhir?\n\nKolkata Knight Riders Recently Kane Williamson replaced which player as the captain of sunrisers Hyderabad?\n\nDavid Warner Which defunct IPL team has won an IPL title?\n\nDeccan Chargers Royal challengers Bangalore defeated which team by the margin of 1 run in the IPL 2021 season?\n\nDelhi Capitals Who among these has only played for only one IPL team in their career?\n\nRishabh Pant\n\nWalmart-owned Flipkart is back with another dose of its daily trivia quiz. The quiz offers participants a chance to win gifts, discount coupons and Flipkart Super Coins .It starts daily at 12pm. In order to win these prizes, one has to answer all questions of the quiz correctly.Flipkart daily trivia quiz has five questions that must be answered correctly to become eligible for the prize. Each question has four options to choose the correct answer from.The questions are based on general knowledge and current affairs.The quiz is available under the Games zone section.Only the first 50,000 participants will be eligible for the quiz prize.Here are five questions of today’s quiz along with their respective answers",
    "Title": "Flipkart daily trivia quiz May 6, 2021: Get answers to these five questions to win gifts and discount vouchers"
  },
  {
    "Date": "Thu, 06 May 2021 09:27:20 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/gadgets-news/amazon-app-quiz-may-6-2021-get-answers-to-these-five-questions-and-win-dyson-air-purifier-for-free/articleshow/82424148.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82424148.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>Results of today’s quiz will be announced on May 7.",
    "Image": "https://static.toiimg.com/thumb/msid-82424145,width-1070,height-580,imgsize-19912,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/gadgets-news/amazon-app-quiz-may-6-2021-get-answers-to-these-five-questions-and-win-dyson-air-purifier-for-free/articleshow/82424148.cms",
    "Text": "As of 2021, Kangana Ranaut is the actress with the second-most National Awards, after whom?\n\nShabana Azmi Permanent Indus Commission is a bilateral commission to discuss water sharing between India and which other country?\n\nPakistan What title was used by UNCTAD for the recent update of their Trade and Development Report 2020?\n\nOut of the frying pan ... Into the fire? The tail of this animal helps with what during running?\n\nBalance The second book printed in what language, translated from French, is about this game?\n\nEnglish\n\nOnline commerce platform Amazon is back with its daily app quiz. As part of the quiz today, the e-tailer is giving the participants a chance to win Dyson air purifier for free.The daily app quiz comprises five questions that are based on general knowledge and current affairs. A participant has to answer all questions of the quiz correctly to become eligible for the prize.For those unaware, Amazon quiz is an aap only quiz. It is available only on Amazon’s mobile app. The quiz starts daily at 12 am and continues till 12 midnight. There is usually one winner of the quiz who is chosen via lucky draw.Results of today’s quiz will be announced on May 7.Here are five questions of today’s quiz along with their respective answers that can help you win Dyson air purifier for free.",
    "Title": "Amazon app quiz May 6, 2021: Get answers to these five questions and win Dyson air purifier for free"
  },
  {
    "Date": "Thu, 06 May 2021 07:57:07+5:30 ",
    "Description": "On Tuesday, India granted permission to several telecom service providers to conduct a six-month trial for the use and application of 5G technology in the country, except for the Chinese firms",
    "Image": "https://images.livemint.com/img/2021/05/06/600x338/5ginternet-k1nC--621x414@LiveMint_1620267981797.jpg",
    "Link": "https://www.livemint.com/technology/tech-news/top-us-congressman-lauds-india-s-decision-to-exclude-china-from-5g-trials-11620267864933.html",
    "Text": "Washington DC: Michael McCaul, US House Foreign Affairs Committee Lead Republican, and China Task Force Chairman, has praised India's decision to exclude Chinese \"Communist Party-controlled\" companies from participating in the country's 5G networks.\n\n\"India's decision to exclude Huawei and ZTE from its 5G trials is good news for the people of India and the world. People's Republic of China law requires any Chinese company - including Huawei and ZTE - to work for the Chinese Communist Party if asked,\" McCaul said in a statement.\n\n\"It's a risk that can't be mitigated unless these companies are excluded from our networks, and I'm glad that India has recognized this threat. India has once again proven why it is a global leader in the fight against security threats posed by CCP-controlled technology,\" he added.\n\nThe China Task Force report released last year called for the US government to work with partners and allies, like India, to ensure \"CCP-controlled technology\" companies do not have access to their 5G networks.\n\nOn Tuesday, India granted permission to several telecom service providers to conduct a six-month trial for the use and application of 5G technology in the country, except for the Chinese firms.\n\nThe Indian Telecom Ministry granted approval to over a dozen firms spanning multiple nationalities - Jio Platforms, Airtel, Vodafone Idea and MTNL, reported TechCrunch.\n\nThese firms, the ministry said, will work with original equipment manufacturers and tech providers Ericsson, Nokia, Samsung and C-Dot. Jio Platforms, additionally, has been granted permission to conduct trials using its own homegrown technology.\n\nIn a press note, the Department of Telecommunications (DoT) did not specify anything about China, but a person familiar with the matter confirmed that Chinese giants Huawei and ZTE are not among those who have received the approval, reported TechCrunch.\n\nThis story has been published from a wire agency feed without modifications to the text. Only the headline has been changed.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter.",
    "Title": "Top US Congressman lauds India's decision to exclude China from 5G trials"
  },
  {
    "Date": "Thu, 06 May 2021 11:41:57 +0530",
    "Description": "PUBG game developer Krafton on Thursday announced Battlegrounds Mobile India as its dedicated game for the Indian market. The new mobile game is touted to bring premium, AAA multiplayer gaming...",
    "Image": "https://i.gadgets360cdn.com/large/battlegrounds_mobile_india_teaser_image_krafton_1620281500189.jpg",
    "Link": "https://gadgets.ndtv.com/games/news/pubg-mobile-india-battlegrounds-launch-krafton-announcement-data-privacy-2435645",
    "Text": "Krafton, the South Korean company behind PUBG, on Thursday announced Battlegrounds Mobile India as its dedicated game for the Indian market. The new battle royale game is touted to bring a premium, AAA multiplayer gaming experience along with exclusive in-game events such as outfits and features. Battlegrounds Mobile India will also debut with its own esports ecosystem that will include tournaments and leagues, the company said in a press statement. In addition to announcing the details about Battlegrounds Mobile India, Krafton released a video teaser of the new game that suggests similarities with PUBG Mobile, which was banned in the country last year.\n\nBattlegrounds Mobile India will be available for pre-registrations before its official launch in the country, Krafton said. The new game is projected to be exclusive to India, and its logo will feature the tri-colour theme to attract Indian mobile gamers.\n\n“Krafton will collaborate with partners to build an esports ecosystem while bringing in-game content regularly, starting with a series of India specific in-game events at launch, to be announced later,” the company said.\n\nThe company also claimed that all data collection and storage of Battlegrounds Mobile India will be in full compliance with all applicable laws and regulations in India and for players in the country. This could be in response to the government concerns over data privacy and security on PUBG Mobile that eventually led to its ban in September last year.",
    "Title": "PUBG Mobile India's New Avatar 'Battlegrounds Mobile India' Announced"
  },
  {
    "Date": "Thu, 06 May 2021 10:56:31 +0530",
    "Description": "Europe's first 3D-printed concrete house and the world's first commercial housing project in the city of Eindhoven has gotten its first tenants. With Project Milestone, the city of Eindhoven hopes...",
    "Image": "https://i.gadgets360cdn.com/large/project_milestone_3dprintedhouse_1620278650999.jpg",
    "Link": "https://gadgets.ndtv.com/laptops/news/dutch-firm-builds-first-commercial-house-printed-with-3d-technology-2434943",
    "Text": "Europe's first 3D-printed concrete house and the world's first commercial housing project in the city of Eindhoven has gotten its first tenants. With Project Milestone, the city of Eindhoven hopes to pave the way for wide-scale construction of 3D houses equipped with all modern comforts. The three-room single-floor house is spread over 1,000 square feet and has a wooden roof. Shaped like a boulder, it is surrounded by greenery and open space on each side. Four more houses are to be readied under the Milestone Project at the location being developed as a “sculpture garden”.\n\nThese houses are intended to be occupied for at least several decades, according to information available on the project's website. The builders say the 3D printing technology gives them freedom, whereas the traditional concrete designing was very rigid. They say that one of the advantages of using a 3D concrete printer is its ability to lay concrete only where it is needed, thereby reducing wastage and CO2 emissions from more cement use.\n\n3D concrete printing also allows builders to design very fine concrete structures. Another advantage of this technology is that builders can cater to individual wishes of customers without raising the cost of construction. For this project, the builders said, the 3D technology helped them blend the houses with the wooden surroundings naturally as if they have always been in this wooded oasis.\n\nThe work on the project began during the 2016 Dutch Design Week, when the Municipality of Eindhoven and TU Eindhoven expressed their intention to build these houses. In 2017, the business community joined in and now the first occupants have moved into the first house.\n\nThe building elements of the first house were printed at Eindhoven University of Technology, but the fifth house, a two-story building, will be printed on site.\n\nA few days ago, India also got its first 3D-printed house in Chennai. The single-storey house is 600 square feet and it was constructed using indigenous concrete 3D printing technology.\n\nThe team that built the house said that they printed the structure using a specialty concrete that they had developed to print large-scale 3D structures. They said the mix was based on ordinary portland cement, which has a lower water-cement ratio. The use of such local materials would also reduce the need to transport concrete long distances, reducing the environmental impact.",
    "Title": "Dutch Firm Builds First Commercial House Printed With 3D Technology"
  },
  {
    "Date": "Thu, 06 May 2021 11:28:21 +0530",
    "Description": "Google has announced Entertainment Space for Android tablets that offers tailored content to users. It has three tabs - Watch, Games and Read - that allow users to watch videos, play games, and...",
    "Image": "https://i.gadgets360cdn.com/large/google_entertainment_space_1620280673305.jpg",
    "Link": "https://gadgets.ndtv.com/tablets/news/google-entertainment-space-android-tablets-launch-videos-games-books-2435436",
    "Text": "Google has announced Entertainment Space for Android tablets that curates tailored content, including movies, shows, videos games, and books from various platforms in one place. This new one-stop, personalised space essentially offers an Android TV-like experience on Android tablets. While Kids Space, which was launched last year, is recommended for children under 9, Entertainment Space caters to “the rest of the family members”. Google says that over 30 percent more people started using Android tablets in 2020 as compared to 2019.\n\nAs per a blog post by Google, Entertainment Space will be available on Walmart onn. tablets in the US starting this month. Google says that it will be rolled out globally to new and select existing Android tablets from Lenovo, Sharp, among others later this year.\n\nEntertainment Space will save time and help users avoid having to hop between apps to watch, play, or read. “Once you sign in to your subscription apps, Entertainment Space will show you your content in one place and tailored for you,” says Google. If multiple members of the family use the same tablet, users can also have personalised profiles.\n\nEntertainment Space has three tabs on the top that will allow users to quickly choose whether they want to watch content, play games, or read books. In the Watch tab, users can move between streaming services they have subscribed to, and find movies, TV shows or videos, as well as rent or buy from Google TV. It also offers a ‘Continue Watching' row — like the Android TV interface and that of most OTT apps — to quickly resume the show from where you left it.\n\nIn the Games tab, users can install and play games from Google Play store. It will also have a ‘Continue Playing' row, just like in the Watch tab. The third is the Read tab that will allow users to read books. This section collates your existing ebooks and the ones you purchase from the Google Play store. Furthermore, users can also listen to audiobooks via the Read tab in Entertainment Space.",
    "Title": "Google Introduces Entertainment Space for Android Tablets"
  },
  {
    "Date": "Thu, 06 May 2021 04:30:48 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/05/Google.jpg",
    "Link": "https://indianexpress.com/article/technology/tech-news-technology/google-ceo-sundar-pichai-pushes-for-new-hybrid-workplace-model-in-email-to-employees-7303879/",
    "Text": "Google is reimagining the office and post Covid-19 workplace environment through a series of new initiatives. On Wednesday, in an email sent to employees, Google’s chief executive officer Sundar Pichai said the company a workforce where about 20 per cent of the staff would work from home on a permanent basis, while another 20 per cent would shift to new offices. The rest 60 per cent of the staff will be working from their current location.\n\n“We’ll move to a hybrid work week where most Googlers spend approximately three days in the office and two days wherever they work best,” Pichai said in the email. “There will also be roles that may need to be on site more than three days a week due to the nature of the work,” he added.\n\nGoogle will offer four weeks per year where staff can work from anywhere with manager approval. The idea, as per the MountainView, California-based tech giant, is to give everyone “more flexibility” around summer and holiday travel.\n\nThe global pandemic has changed how we work. While work from home is currently the norm, but as economies begin to begin up, larger organisations such as Google are in favor of a hybrid office model after Covid. However, Facebook and Twitter, are emphasing on work from home “forever”.\n\n“The future of work is flexibility,” Pichai said. He said the new changes are aimed to help employees do their best at work. Google first began opening its US offices in a limited capacity in April.\n\nIndia-born Pichai also said that it was “heartbreaking” to see increasing Covid-19 cases in places such as India and Brazil. “Please focus on taking care of yourselves and your loved ones right now. We are here to support however we can,” he said.",
    "Title": "Google CEO Sundar Pichai pushes for new ‘hybrid workplace’ model in email to employees"
  },
  {
    "Date": "Thu, 06 May 2021 11:24:30 +0530",
    "Description": "Jeff Bezos' Blue Origin will send its first crew to space on July 20 and is offering one of the seats to the winner of an online auction, the company said.",
    "Image": "https://i.gadgets360cdn.com/large/newshepard_twitter_1620280828791.jpg",
    "Link": "https://gadgets.ndtv.com/science/news/blue-origin-first-crew-space-flight-date-july-jeff-bezos-online-auction-winner-seat-2435377",
    "Text": "Jeff Bezos' Blue Origin will send its first crew to space on July 20 and is offering one of the seats to the winner of an online auction, the company said Wednesday.\n\nThe trip will last a total of ten minutes, four of which passengers will spend above the Karman line that marks the recognised boundary between Earth's atmosphere and space.\n\n\"We've been perfecting our ability to launch, land, and repeat,\" a video accompanying the announcement said.\n\nOn July 20th, #NewShepard will fly its first astronaut crew to space. We are offering one seat on this first flight to the winning bidder of an online auction. Anyone can place an opening bid by going to https://t.co/6DpTdTxo36. #GradatimFerociter pic.twitter.com/jBMFYX7xHg — Blue Origin (@blueorigin) May 5, 2021\n\n\"Our next launch will be the first time astronauts will fly aboard New Shepard.\"\n\nThe reusable suborbital rocket system was named after Alan Shepard, who sixty years ago on Wednesday became the first American in space.\n\nNew Shepard has successfully carried out 15 uncrewed test runs launching from its facility in the Guadalupe Mountains of West Texas.\n\nAfter lift-off, the capsule, which carries up to six crew members, separates from its booster, then spends four minutes at an altitude exceeding 60 miles (100 kilometres), during which time those on board experience weightlessness and can observe the curvature of Earth from space.\n\nThe booster lands autonomously on a pad two miles from the launch site, and the capsule floats back to the surface with three large parachutes that slow it down to about a mile an hour when it lands.\n\nBlue Origin said the bidding will be unsealed on May 19 before a final-stage live online auction on July 12 when the winner is announced.\n\nThe proceeds will go to the company's foundation, Club for the Future, which aims to inspire future generations to pursue careers in STEM.\n\nBlue Origin has not yet published its prices but its clientele is expected to mainly be wealthy individuals.\n\nVirgin Galactic, the company founded by British billionaire Richard Branson, is also developing a spacecraft capable of sending clients on suborbital flights. Some 600 people have booked flights, costing $200,000 (roughly Rs. 1.5 crores) to $250,000 (roughly Rs. 1.84 crores).\n\nElon Musk's SpaceX is planning orbital flights that would cost millions of dollars and send people much further into space.\n\n",
    "Title": "Jeff Bezos' Blue Origin Will Fly First Crew to Space in July"
  },
  {
    "Date": "Thu, 06 May 2021 03:06:56 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/05/AP21125814171456.jpg",
    "Link": "https://indianexpress.com/article/technology/science/spacex-launches-lands-starship-in-1st-successful-flight-7303838/",
    "Text": "In this image from video made available by SpaceX, a Starship test vehicle descends during a flight test in Boca Chica, Texas on Wednesday, May 5, 2021. (SpaceX via AP)\n\nSpaceX launched and successfully landed its futuristic Starship on Wednesday, finally nailing a test flight of the rocketship that Elon Musk intends to use to land astronauts on the moon and send people to Mars.\n\nThe previous four tests flights ended in fiery explosions before, during or soon after touchdown at the southeastern tip of Texas, near Brownsville.\n\nThis latest upgraded version of SpaceX’s full-scale, stainless steel, bullet-shaped rocketship soared more than 6 miles (10 kilometers) over the Gulf of Mexico before flipping and descending horizontally, and then going vertical again just in time for touchdown.\n\n\n\n“Starbase Flight Control has confirmed, as you can see on the live video, we are down. The Starship has landed!” announced launch commentator John Insprucker.\n\nA fire at the base of the 160-foot (50-meter) rocket quickly was extinguished, and the rocket remained standing after the six-minute flight. Musk tweeted the landing was “nominal” _ by the book, in other words.\n\nSuccess came on the 60th anniversary of the flight of first American in space, Alan Shepard. And it capped a stunning two weeks of achievements for SpaceX: the launch of four more astronauts to the space station for NASA, the nation’s first nighttime crew splashdown since the Apollo moonshots, and a pair of launches for its mini internet satellites.\n\nIn this image from video made available by SpaceX, a Starship test vehicle sits on the ground after returning from a flight test in Boca Chica, Texas on Wednesday, May 5, 2021. (SpaceX via AP) In this image from video made available by SpaceX, a Starship test vehicle sits on the ground after returning from a flight test in Boca Chica, Texas on Wednesday, May 5, 2021. (SpaceX via AP)\n\nLess than a month ago, NASA chose SpaceX’s Starship to deliver astronauts to the lunar surface in the next few years. The $3 billion contract was halted last week, however, after the losing companies _ Jeff Bezos’ Blue Origin and Dynetics _ protested the selection.\n\nMusk said last month that the NASA money will help development of Starship, which is meant to eventually launch atop a Super Heavy booster. He said it’s been a “pretty expensive” project so far and mostly funded internally. The first high-altitude test was in December.\n\n“As you can tell, if you’ve been watching the videos, we’ve blown up a few of them. So excitement guaranteed, one way or another,” Musk told reporters after the private company’s second crew flight on April 23.\n\nLong after Wednesday’s touchdown, Starship was still standing tall.",
    "Title": "SpaceX launches, lands Starship in 1st successful flight"
  },
  {
    "Date": "Thu, 06 May 2021 10:46:14 +0530",
    "Description": "SpaceX achieved the first successful touchdown of its prototype Starship SN15 rocket during the latest test flight of the next-generation launch vehicle in south Texas, after four previous landing...",
    "Image": "https://i.gadgets360cdn.com/large/starship_sn15_reuters_1620278009156.jpg",
    "Link": "https://gadgets.ndtv.com/science/news/space-starship-sn15-sn-15-landing-safe-rocket-prototype-fail-crash-explosion-elon-musk-alan-shepard-nasa-2434785",
    "Text": "SpaceX achieved the first successful touchdown of its prototype Starship rocket during the latest test flight of the next-generation launch vehicle in south Texas on Wednesday, after four previous landing attempts ended in explosions.\n\nThe feat marked a key milestone for the private rocket company of billionaire tech mogul Elon Musk in its development of a resusable heavy-lift launch vehicle to eventually carry astronauts and large cargo payloads to the Moon and Mars.\n\nLive feed of Starship SN15 flight test → https://t.co/Hs5C53qBxb https://t.co/chZjdVAute — SpaceX (@SpaceX) May 5, 2021\n\nThe Starship SN15 blasted off from the SpaceX launch site in Boca Chica, Texas, along the Gulf Coast and reached its planned maximum altitude of 10 kilometres (6 miles), then hovered momentarily before flying nose-down under aerodynamic control back toward Earth.\n\nManeuvering itself back into vertical position under rocket thrust as it approached the ground, the 16-story, three-engine vehicle descended to a gentle touchdown on its landing gear.\n\n\"We are down, the Starship has landed,\" SpaceX principal integration engineer John Insprucker said during live commentary for the flight.\n\nA video feed of the landing showed flames continuing to burn at the base of the rocket after the engines cut off, but an automated fire-suppression system trained a steady stream of water onto the landing pad, eventually extinguishing the blaze.\n\nThe flight came on the 60th anniversary of the first spaceflight by an American astronaut - Alan Shepard's launch on a 15-minute suborbital mission atop NASA's Mercury-Redstone rocket from Cape Canaveral, Florida.\n\nMusk declared success on Twitter, posting a terse message in the understated parlance of spaceflight: \"Starship landing nominal!\"\n\nFour previous test flights of Starship prototypes - SN8 in December, SN9 in February, and SN10 and SN11 in March - all blasted off successfully but blew to pieces.\n\nThe complete Starship rocket, which will stand 394 feet (120 metres) tall when mated with its super-heavy first-stage booster, is SpaceX's next-generation launch vehicle at the center of Musk's ambitions to make human space travel more affordable and routine.\n\nA first orbital Starship flight is planned for year's end. Musk has said he intends to fly Japanese billionaire Yusaku Maezawa around the moon with the Starship in 2023.\n\n© Thomson Reuters 2021\n\n",
    "Title": "Elon Musk's SpaceX Starship Rocket Prototype Achieves First Safe Landing"
  },
  {
    "Date": "Thu, 06 May 2021 10:48:25 +0530",
    "Description": "Swiggy executive Harnidh Kaur tweeted the arrival of this new Care Corner widget inside the Swiggy app. This section can be found on the homepage itself and clicking on it opens up a curated list of...",
    "Image": "https://i.gadgets360cdn.com/large/swiggy_care_corner_1620277450747.jpg",
    "Link": "https://gadgets.ndtv.com/apps/news/swiggy-care-corner-curates-list-of-genie-activities-healthy-food-options-covid-19-relief-efforts-2434810",
    "Text": "Swiggy has introduced a special Care Corner inside its app to help with COVID-19 relief efforts. The food delivery app now has a dedicated section that intends to help those who are quarantined at home. This Care Corner is essentially highlighting all the things Swiggy Genie can help you do, without stepping out. This includes sending homemade food, care packages, medicines, or even groceries. Additionally, Swiggy has also partnered with HealthifyMe to curate a list of healthy food items from trusted eateries nearby.\n\nSwiggy executive Harnidh Kaur tweeted the arrival of this new Care Corner widget inside the Swiggy app. This section can be found on the homepage itself and clicking on it opens up a curated list of services and delivery that one can avail if they can't leave the house. This also helps those who can't go over personally to deliver homemade food or care packages, and Swiggy Genie enables these users to carry their packages over for them. The Care Corner informs users that they can send homemade food, and care packages that include personal care items for those in need.\n\nUsers can even ask Swiggy Genie to pick up medicines from pharmacies and get groceries from stores nearby. Swiggy Genie, a revamped avatar of Swiggy Go, was launched during the first wave of the pandemic last year. It is essentially a Dunzo-like service of pick up and drop of items from anywhere within the city.\n\nFurthermore, the new Swiggy Care Corner also curates a list of food items that you can order from nearby trusted eateries during your quarantine days. The biggest challenge that most people face during their isolation period is getting good food delivered at home and Swiggy looks to help these users with a curated list. The company claims that it partnered with HealthifyMe to craft this list. It includes comforting treats that give you the feel of homemade-style food and healthy choices that are good for your immunity. At the end of the Care Corner section, Swiggy has also published donation links for Give India and ImpactGuru to help collect funds for essential healthcare supplies and oxygen cylinders.",
    "Title": "Swiggy Introduces Care Corner to Highlight Services Beneficial for COVID-19 Relief"
  },
  {
    "Date": "Thu, 06 May 2021 10:18:35 +0530",
    "Description": "Top US lawmakers have applauded India's decision to not allow Chinese telecom companies to conduct 5G trials in the country.",
    "Image": "https://i.gadgets360cdn.com/large/huawei_white_reuters_1614325448609.jpg",
    "Link": "https://gadgets.ndtv.com/telecom/news/5g-trials-india-huawei-zte-ban-us-lawmakers-applaud-reliance-jio-airtel-vodafone-idea-vi-mtnl-2434360",
    "Text": "Top US lawmakers have applauded India's decision to not allow Chinese telecom companies to conduct 5G trials in the country.\n\nThe Department of Telecom in India on Tuesday had approved applications of telecom companies Reliance Jio, Bharti Airtel, Vodafone Idea, and MTNL to conduct 5G trials but none of them would be using technologies of Chinese entities.\n\n\"India's decision to exclude Huawei and ZTE from its 5G trials is good news for the people of India and the world,\" House Foreign Affairs Committee Lead Republican and China Task Force Chairman Michael McCaul said in a statement on Wednesday.\n\n\"People's Republic of China law requires any Chinese company – including Huawei and ZTE – to work for the Chinese Communist Party if asked,” McCaul said.\n\nThe previous Trump administration had designated Chinese tech companies as posing a national security risk.\n\nThe US is also asking its friends and allies not to opt for a technology that is controlled by the Communist Party of China.\n\n\"It's a risk that can't be mitigated unless these companies are excluded from our networks, and I'm glad that India has recognised this threat. India has once again proven why it is a global leader in the fight against security threats posed by CCP-controlled technology,” McCaul said.\n\nCongressman Mike Waltz also thanked India for its decision. \"Thank you to India for denying the inclusion of CCP-run Huawei in their telecommunications,” he said. \"As the world's largest democracy, India will be a critical ally in confronting China and securing our supply chains,” Waltz said.",
    "Title": "5G Trials: US Lawmakers Applaud India's Move to Not Allow Chinese Companies"
  },
  {
    "Date": "Thu, 06 May 2021 10:54:10 +0530",
    "Description": "Stranger Things season 4 trailer release date and time might be May 6 at 6:30pm IST / 2pm BST / 6am PT. Stranger Things season 4 expected to release in 2022.",
    "Image": "https://i.gadgets360cdn.com/large/stranger_things_season_3_1620278590275.jpeg",
    "Link": "https://gadgets.ndtv.com/entertainment/news/stranger-things-season-4-trailer-release-date-time-netflix-cast-2434907",
    "Text": "Stranger Things season 4 might get a new trailer on Thursday, May 6, if a cryptic new video from the Netflix series' official YouTube channel is to be believed. The video, titled “HNL Control Room” — HNL stands for Hawkins National Laboratory — doesn't show much except a bunch of TV screens that briefly switch from static to display ever more cryptic teasers featuring a playroom, a chessboard, and a blood-coated Magic 8-Ball. But it's the accompanying description that hints at something more.\n\n“Due to technical difficulties, Hawkins National Laboratory will be closed until further notice. We will be back in service tomorrow at 9:00 AM ET,” the description for the new Stranger Things HNL Control Room YouTube video reads. Given the video was published Wednesday, it suggests that we should expect something on Thursday, May 6 at 6:30pm IST / 2pm BST / 6am PT. With Stranger Things season 4 back in production since September last year, a new trailer could definitely be on the cards.\n\nWe have already had the one teaser, all the way back in February last year before COVID-19 ripped through the world and brought a halt to Stranger Things season 4 filming in mid-March. Production then resumed in late September and the series' stars were spotted in several locations across October and until late January. At the end of March, actor Gaten Matarazzo said that filming was far from over. Co-star Finn Wolfhard had previously said that season 4 wouldn't be out before 2022.\n\nIn that interview, Wolfhard also teased what to expect from Stranger Things season 4: “Every season it gets darker. With season 3 I was like, ‘This is the darkest season that there'll ever be, like the exploding rats and everything.' But really, season 4 so far, it's the darkest season there's ever been. Every year, it gets amped up. Every year it gets funnier and darker and sadder, and everything.”\n\nStranger Things executive producer Shawn Levy noted that the COVID-19 delays allowed the creators, the Duffer brothers, to finish writing all episodes before they began filming: “The pandemic definitely massively delayed shooting and therefore the launch of our current season 4. But it impacted very positively by allowing the Duffer brothers, for the first time ever, to write the entire season before we shoot it and to have time to rewrite in a way that they rarely had before so the quality of these screenplays are exceptional, maybe better than ever.”\n\nIn addition to Matarazzo and Wolfhard, Stranger Things season 4 also stars Winona Ryder, David Harbour, Millie Bobby Brown, Caleb McLaughlin, Noah Schnapp, Sadie Sink, Natalia Dyer, Charlie Heaton, Joe Kerry, Maya Hawke, Priah Ferguson, Cara Buono, Brett Gelman, Jamie Campbell Bower, Eduardo Franco, Joseph Quinn, and Matthew Modine.\n\nStranger Things season 4 is expected in 2022. A trailer might drop Thursday.",
    "Title": "Is Stranger Things Season 4 Trailer Releasing Today?"
  },
  {
    "Date": "Thu, 06 May 2021 11:01:25 +0530",
    "Description": "Redmi Note 10 Pro 5G is tipped to debut soon. The new Redmi phone is speculated to have Qualcomm Snapdragon 750G SoC onboard.",
    "Image": "https://i.gadgets360cdn.com/large/redmi_note_10_pro_5g_image_twitter_abhishek_yadav_1620279004621.jpg",
    "Link": "https://gadgets.ndtv.com/mobiles/news/redmi-note-10-pro-5g-launch-snapdragon-750g-specifications-xiaomi-rumour-2435016",
    "Text": "Redmi Note 10 Pro 5G is tipped to be launched with a 5G-supporting Qualcomm Snapdragon SoC soon. Although the smartphone is yet to receive an official confirmation, an image suggesting its existence has emerged on social media. Redmi Note 10 Pro 5G is speculated to have the Qualcomm Snapdragon 750G SoC. It may also come with a 120Hz AMOLED display that was one of the USPs of its 4G variant that debuted in India alongside Redmi Note 10 and Redmi Note 10 Pro Max in March.\n\nTipster Abhishek Yadav tweeted the image suggesting the development of Redmi Note 10 Pro 5G. The promo image is available in Spanish language, indicating that the new phone might arrive first in Spain. Also, the design appearing on the image looks quite similar to the regular Redmi Note 10 Pro variant. There could be a new hardware internally, though.\n\nThe tipster said that Redmi Note 10 Pro 5G could come with Qualcomm Snapdragon 750G SoC. The promo image also has Qualcomm's branding. However, Xiaomi has not yet provided any specific details through its official social media channels.\n\nGadgets 360 was not able to independently verify the reported details about Redmi Note 10 Pro 5G.\n\nXiaomi has been rumoured to launch the Redmi Note 10 Pro in a 5G model for some time. The phone allegedly appeared on multiple certification websites including the Bureau of Indian Standards (BIS) one in January. The company, however, launched its 4G model instead in March. Xiaomi also announced a 5G variant of Redmi Note 10 in the US and European markets in March that starts at $199 (roughly Rs. 14,700) for the 6GB + 64GB storage variant.\n\nIn India, the 4G variant of Redmi Note 10 Pro starts at Rs. 15,999. The phone includes features such as a 6.67-inch full-HD+ (1,080x2,400 pixels) Super AMOLED display and a quad rear camera setup with a 64-megapixel primary sensor. It also has an octa-core Qualcomm Snapdragon 732G SoC and includes up to 8GB RAM as well as up to 128GB of onboard storage.\n\nDetails about the arrival of the Redmi Note 10 Pro 5G are yet to be revealed by Xiaomi. However, the Chinese company is launching the Redmi Note 10S in India on May 13 as its newest model in the Redmi Note 10 series. That model is already available in some global markets and is not likely to come to the Indian market with 5G support.",
    "Title": "Redmi Note 10 Pro 5G With Snapdragon 750G SoC Tipped to Debut Soon"
  },
  {
    "Date": "Thu, 06 May 2021 10:00:51 +0530",
    "Description": "Facebook's oversight board upheld the company's suspension of former US President Donald Trump but said the company was wrong to make the suspension indefinite and gave it 6 months to determine a...",
    "Image": "https://i.gadgets360cdn.com/large/donald_trump_reuters_1620275282280.jpg",
    "Link": "https://gadgets.ndtv.com/social-networking/news/facebook-donald-trump-ban-oversight-board-upheld-suspension-six-months-determine-return-2434087",
    "Text": "Facebook's oversight board on Wednesday upheld the company's suspension of former US President Donald Trump but said the company was wrong to make the suspension indefinite and gave it six months to determine a \"proportionate response.\"\n\nTrump called the decision and his banning across tech platforms \"a total disgrace\" and said the companies would \"pay a political price.\"\n\nThe much-awaited board verdict has been watched for signals on how the world's largest social media company will treat rule-breaking political leaders in the future, a key area of controversy for online platforms.\n\nThe board, created by Facebook to rule on a small slice of its content decisions, said the company was right to ban Trump following the January 6 storming of the US Capitol by Trump supporters.\n\nFacebook indefinitely blocked Trump's access to his Facebook and Instagram accounts over concerns of further violent unrest following the January 6 riot. It enacted the suspension after removing two of Trump's posts during the Capitol riot, including a video in which he said supporters should go home but reiterated his false claim of widespread voter fraud, saying \"I know your pain. I know you're hurt. We had an election that was stolen from us.\"\n\nBut the board said Facebook should not have imposed an indeterminate suspension without clear standards and said the company should determine a response consistent with rules applied to other users. It said Facebook could determine that Trump's account could be restored, suspended temporarily or permanently banned.\n\n\"Indefinite penalties of this sort do not pass the international or American smell test for clarity, consistency, and transparency,\" said former federal Judge Michael McConnell, co-chair of the Oversight Board, during a press conference after publishing its decision on Wednesday.\n\nIn an interview with Reuters, board co-chair and former Danish Prime Minister Helle Thorning-Schmidt said public figures should not be allowed to incite violence or create harm though their posts, but that Facebook \"can't just invent new sanctions as they go along.\"\n\nIn its decision, the board said Facebook refused to answer some of the 46 questions it posed, including those on how its news feed affected the visibility of Trump's posts, and whether the company planned to look into how its technology amplified content as it had done in the events leading to the Capitol siege.\n\nThe board said Facebook's existing policies, such as deciding when material is too newsworthy to remove, need to be more clearly communicated to users. It also called on Facebook to develop a policy that governs how it handles novel situations where its existing rules would be insufficient to prevent imminent harm. See takeaways from the board's decision.\n\nFacebook's business has thrived during the controversy and its main source of revenue, advertising, has boomed as COVID-19 pandemic restrictions begin to ease in the United States, but lawmakers across the political spectrum have raised concerns about the power of Facebook and other social media, many calling for new regulations and some calling for breakups of big tech.\n\nTrump called the move \"an embarrassment to our Country,\" and added that \"Free Speech has been taken away from the President of the United States because the Radical Left Lunatics are afraid of the truth, but the truth will come out anyway, bigger and stronger than ever before.\"\n\nAt a Financial Times conference after the verdict, Nick Clegg, Facebook's vice president of global affairs and communication, said the company would hope to resolve the matter \"considerably faster\" than six months.\n\nTech platforms have grappled in recent years with how to police world leaders and politicians that violate their guidelines. Facebook has come under fire both from those who think it should abandon its hands-off approach to political speech and those, including Republican lawmakers and some free-expression advocates who saw the Trump ban as a disturbing act of censorship.\n\nFacebook was one of a slew of social media sites that barred the former president, including Twitter, which banned him permanently, a move welcomed by some civil rights groups and social media researchers. Political leaders from German Chancellor Angela Merkel to US Senator Bernie Sanders expressed concern that private companies could silence elected officials on their sites.\n\nAt the time of the suspension, Facebook Chief Executive Mark Zuckerberg said \"the risks of allowing the president to continue to use our service during this period are simply too great.\" The company later referred the case to its recently established board, which includes academics, lawyers and rights activists.\n\nThe binding verdict means Trump will not for now be able to return to Facebook's platforms, where he had a combined 59 million followers across Facebook and Instagram. His campaign spent about $160 million (roughly Rs. 1,180 crores) on Facebook ads in 2020, according to Democratic digital firm Bully Pulpit Interactive's campaign tracker.\n\nOn Tuesday, Trump launched a web page to share messages that readers can then re-post to their Facebook or Twitter accounts. A senior adviser has said Trump also plans to launch his own social media platform.\n\nWednesday's decision marks a milestone for the oversight board, which Facebook financed with $130 million (roughly Rs. 960 crores). The body has been hailed as a novel experiment by some researchers but criticised by those who have been skeptical about its independence or view it as a PR stunt to deflect attention from the company's more systemic problems.\n\n\"This verdict is a desperate attempt to have it both ways, upholding the 'ban' of Donald Trump without actually banning him, while punting any real decisions back to Facebook,\" said a group of academics, experts and Facebook critics known as the \"Real Facebook Oversight Board.\"\n\n\n\n© Thomson Reuters 2021\n\n",
    "Title": "Facebook Oversight Board Upholds Donald Trump Ban From Platform"
  },
  {
    "Date": "Thu, 06 May 2021 11:42:44 +0530",
    "Description": "Mi TV P1 series including 32-inch, 43-inch, 50-inch, and 55-inch models have been launched in Italy. The TV models run on Android TV and have a standard 60Hz refresh rate.",
    "Image": "https://i.gadgets360cdn.com/large/Mi_TV_P1_series_launch_1620281051883.jpg",
    "Link": "https://gadgets.ndtv.com/tv/news/mi-tv-p1-android-tv-series-price-eur-279-449-599-649-launch-specifications-features-xiaomi-2435540",
    "Text": "Mi TV P1 series has been unveiled by Xiaomi in Italy and it comes in four screen sizes — 32-inch, 43-inch, 50-inch, and 55-inch. The Mi TV P1 series runs on Android TV and its models have mostly the same features except the difference in screen sizes. The starting 32-inch model, however, has slightly different specifications compared to the rest of the series. Mi TV P1 Android TV series offers a standard 60Hz refresh rate on its models, along with access to Google Play store and built-in Chromecast. The TV models are powered by MediaTek SoCs and come with slim bezels on all sides.\n\nMi TV P1 series price, availability\n\nMi TV P1 series starts at EUR 279 (roughly Rs. 24,800) for the 32-inch model and the 43-inch model costs EUR 449 (roughly Rs. 39,900). Pricing for these models have been shared by a local online publication, Italy 24 News. The 50-inch model costs EUR 599 (roughly Rs. 53,200) and the 55-inch model costs EUR 649 (roughly Rs. 57,600), as per the listings on the official Xiaomi Italy website.\n\nThe publication says that the 43-inch and 55-inch models will go on sale in Italy from May 21. As of now, Xiaomi has not shared any information on the availability of the Mi TV P1 series models in India and other global markets.\n\nMi TV P1 series specifications\n\nThe Mi TV P1 series, as mentioned earlier, has 32-inch, 43-inch, 50-inch, and 55-inch models. According to the Italian publication, the specifications for the all models are pretty much except for the lower-end 32-inch model having some key differences. The 32-inch TV runs on Android TV 9 while the other models run on Android TV 10. The 32-inch model comes with an HD-ready (1,366x768 pixels) panel while the other three models feature 4K (3,840x2,160 pixels) panels. All models have a standard 60Hz refresh rate and a 178-degree viewing angle.\n\nUnder the hood, the Mi TV P1 series 4K models are powered by a quad-core MediaTek MT9611 SoC with a Mali G52 MP2 GPU. They have 2GB RAM and 16GB internal storage. The 4K models boat of 88 percent coverage of NTSC colour gamut and 94 percent DCI-P3. They support Dolby Vision, HDR10+, and HLG. For audio, the Mi TV P1 series comes with two 10W speakers supporting Dolby Audio and DTS-HD. For connectivity, the 4K models get dual-band Wi-Fi, Bluetooth v5.0, three HDMI ports, two USB ports, one Ethernet port, an Optical Digital Audio out port, and a 3.5mm headphone jack.\n\nGoogle Podcasts, Spotify,\n\nIs Mi 11X the best phone under Rs. 35,000? We discussed this on Orbital , the Gadgets 360 podcast. Later (starting at 23:50), we jump over to the Marvel series The Falcon and the Winter Soldier. Orbital is available on Apple Podcasts Amazon Music and wherever you get your podcasts.\n\nAffiliate links may be automatically generated - see our ethics statement for details.",
    "Title": "Mi TV P1 Series Running Android TV, 60Hz Refresh Rate Launched"
  },
  {
    "Date": "Thu, 06 May 2021 01:56:00 +0000",
    "Description": "Oh, the pasta-bilities: Researchers at Carnegie Mellon University are playing with their food.",
    "Image": "https://www.cnet.com/a/img/FNBsQ2t5l_HNoEjYL3Vs4iGx8sE=/1200x630/2021/05/06/a3f22b93-2ec5-4d3a-9fd3-6031bc6c9c09/multi-pasta-social.jpg",
    "Link": "https://www.cnet.com/news/the-strange-pasta-that-transforms-into-3d-shapes-as-you-cook/#ftag=CADf328eec",
    "Text": "Morphing Matter Lab/Carnegie Mellon University\n\nMaybe food can be fun.\n\nA paper published by researchers at Carnegie Mellon University revealed a new variety of pasta that starts out flat, but -- incredibly -- transforms into unique, 3D shapes after being boiled for seven minutes. But beyond the shape gimmick, the pasta is unique in other ways: it requires less packaging, creates a smaller carbon footprint, and cooks faster than regular dried pasta.\n\nHow does it work? Well, machines press tiny grooves into flat pasta dough made of semolina flour and water. Those grooves form patterns that react with the hot cooking water and turn the flat noodles into waves, tubes, spirals and other shapes. But since it's flat when boxed up, it doesn't need as much packaging and storage space as already 3D noodles would require. That could make it useful in a number of places where space is at a premium, including disaster sites, or even astronauts in space stations.\n\nMorphing Matter Lab/Carnegie Mellon University\n\nAnd as for the inspiration for this sci-fi food? You might have to thank furniture makers such as IKEA.\n\n\"We were inspired by flat-packed furniture and how it saved space, made storage easier and reduced the carbon footprint associated with transportation,\" said researcher Lining Yao.",
    "Title": "The strange, flat pasta that transforms into 3D shapes as you cook     - CNET"
  },
  {
    "Date": "Thu, 06 May 2021 02:42:00 +0000",
    "Description": "Meet the latest internet slang reminding you you're out of touch.",
    "Image": "https://www.cnet.com/a/img/K0u4ph4pfWv8XK3wToT1XYtDGPE=/1200x630/2021/05/05/4283008d-8972-4e68-ad5a-bb57571de916/image-8.jpg",
    "Link": "https://www.cnet.com/how-to/what-cheugy-means-and-how-to-know-if-youre-a-cheug/#ftag=CADf328eec",
    "Text": "Universal Pictures\n\nThe internet is serving up a new way to let you know you're past your prime. You might have noticed the word \"cheugy\" popping up online and wondered what it means and how to pronounce it. New slang is a surefire way to make you question your fleeting youth. In this case, that couldn't be more true. In short, cheugy is a trendy way to say something is passe, and the word's having a moment on TikTok, where folks are busy labeling what's cheugy, having existential crises over being cheugy or just embracing life as a cheug.\n\nRegardless of your cheug status, here's what you need to know.\n\nSo, what does cheugy mean?\n\nCheugy means something that's off-trend. If you look up examples of what's cheugy, though, you'll notice people aren't talking about big hair from the '80s or madras shirts from the '60s. Cheugy seems to be particularly pegged to millennial fashion, style and more. If you're familiar with the word \"basic,\" it's not far off from that. Gird your Pumpkin Spice lattes.\n\nWhat qualifies as cheugy?\n\nThere's no hard and fast rule about what makes something cheugy. If you watch enough TikToks explaining what cheugy is, or check out the Instagram account @CheugLife, you'll run into examples that will start to form a certain picture: the chevron pattern, anything that says \"girl boss\" on it, graphic T-shirts, Ugg boots, being a little too into Disney as an adult. If you've ever bought a wooden sign from Target that says \"Gather,\" that's cheugy. If you have merch from The Office, Harry Potter or Star Wars, that's also cheugy.\n\nWhere did the word cheugy come from?\n\nAt the end of March, TikTok user Hallie Cain posted a video explaining that her friends had a word they used for things that were no longer trendy. According to The New York Times, the word was created by one of Cain's friends, Gaby Rassan, who coined it in 2013 when she was in high school and trying to figure out a term for people who were just a bit off-trend.\n\n\"There was a missing word that was on the edge of my tongue and nothing to describe it and 'cheugy' came to me. How it sounded fit the meaning,\" Rassan told The New York Times.\n\nCheugy's actually had an entry on Urban Dictionary since 2018: \"The opposite of trendy. Stylish in middle school and high school but no longer in style. Used when someone still follows these out of date trends. This may include but not be limited to fashion, habits on social media, usage of slang, etc.\"\n\nOn TikTok, though, the word is gaining traction, with a million and a half views so far for videos tagged with #cheugy.\n\nWait, is this sexist?\n\nIt's a good question. A lot of the examples you run into, whether the aforementioned girl boss energy, Ugg boots or a tank top that says \"rosé all day,\" can feel gendered, like they're taking a particular swipe at millennial women. One TikToker, @rod, who creates a lot of content based on being a millennial, did a video specifically focusing on all cheugy stuff you might associate more with men, like golf polos, Axe body spray and cargo shorts.\n\nIn a piece on cheugy, Rolling Stone made the argument that bullying is what happens when you \"weaponize markers of someone's identity against them\" and that poking fun at someone for posting Minion memes doesn't quite meet that standard.\n\nHow do you pronounce cheugy?\n\nIt sounds like chew-ghee. In noun form (a cheug), it sounds like choog.\n\nAre you cheugy?\n\nI mean, if you have to ask...",
    "Title": "What cheugy means, and how to know if you're a cheug     - CNET"
  },
  {
    "Date": "Thu, 06 May 2021 04:15:03 +0000",
    "Description": "Laura Donnelly and Ann Skelly, who star in the new HBO Max series The Nevers, are on CNET's I'm So Obsessed podcast.",
    "Image": "https://www.cnet.com/a/img/ZSTXJg2KJKoFVy-LT73-YhsgoOA=/1200x630/2021/05/05/948f0300-eb95-4b89-842c-684a72408125/nvr-101-081019-kb-009rt-2.jpg",
    "Link": "https://www.cnet.com/news/the-nevers-ann-skelly-clears-the-air-im-not-dating-brad-pitt-laura-donnelly-hbo-max/#ftag=CADf328eec",
    "Text": "Keith Bernstein/HBO\n\nI'm So Obsessed (subscribe here)\n\nThe Nevers on HBO Max is part X-Men, part League of Extraordinary Gentlemen and part sci-fi thriller. Driving the show are complex female characters, two of whom are portrayed by Laura Donnelly and Ann Skelly. Donnelly plays Amalia True, a mysterious, quick-fisted widow, and Skelly is Penance, a brilliant young inventor. Both were \"touched\" during a mysterious event in Victorian England that left them, and others, with abilities.\n\nDonnelly and Skelly were both guests on CNET's I'm So Obsessed podcast. They discussed how the large scale of the world within The Nevers allows the show to deal with both \"Victorian things\" and issues that we experience in 2021.\n\n\"This story very much resonates with society as we know it today,\" said Donnelly. \"Many of the issues we're grappling with at the moment have to do with equality and power. What happens to people who don't have power and suddenly get it? How does the established power of society deal with that?\"\n\nThe Nevers was conceived, written and filmed in part by Joss Whedon who is best known for the shows Buffy The Vampire Slayer, Angel and Firefly. Some actors and co-workers who worked with Whedon over the past two decades have alleged on-set abuse. In 2020, after filming wrapped, Whedon left The Nevers and was replaced by Philippa Goslett. Many cast and crew members on the show said that they had a positive experience working with Whedon before he left.\n\n\"My experience with Joss was great,\" said Donnelly. \"He was a very supportive, collaborative director.\"\n\n\"We all had a brilliant work relationship,\" said Skelly. \"And the whole set functioned in a very cohesive way.\"\n\nBefore The Nevers, Donnelly was best known for her role as Jenny Fraser on the series Outlander. She has a notable career on stage earning a Best Actress Olivier Award in 2018 for her performance as Caitlin Carney in the play The Ferryman.\n\nSkelly has been in a handful of films and TV shows and in 2018 was nominated for a Best Actress Irish Film and Television award for her performance in the film Kissing Candice.\n\nKeith Bernstein/HBO\n\nYou can listen to my entire conversation with Donnelly and Skelly in the player above or on Apple Podcasts. Donnelly discusses fighting in a Victorian corset, Skelly shares drawing inspiration from Albert Einstein and both explain how they instantly became friends.\n\nWhen I asked if either had anything more to say, Skelly stated exasperatedly, \"I'm not dating Brad Pitt. I just want those rumors to end.\"\n\nAfter a beat, Donnelly, Skelly and I shared a laugh.\n\nYou can watch The Nevers on HBO Max with new episodes airing Sunday nights. You can subscribe to I'm So Obsessed on your favorite podcast app. In each episode, Connie Guglielmo and I catch up with an artist, actor or creator to learn about their work, career and current obsessions.",
    "Title": "The Nevers' Ann Skelly clears the air: 'I'm not dating Brad Pitt'     - CNET"
  },
  {
    "Date": "Thu, 06 May 2021 03:35:00 +0000",
    "Description": "The final is on! Man City vs. Chelsea.",
    "Image": "https://www.cnet.com/a/img/YhXkXnnSlW4Il10luvzCGqEhNYQ=/1200x630/2021/05/06/b7ddd4fa-0437-443b-a449-c5351158baa1/gettyimages-85981124.jpg",
    "Link": "https://www.cnet.com/news/man-city-vs-chelsea-in-the-champions-league-final-start-date-kick-off-time-how-to-watch/#ftag=CADf328eec",
    "Text": "Jamie McDonald/Getty Images\n\nWell, that's it. We have our Champions League final. It's Man City vs. Chelsea in an all-English final.\n\nGiven current form, it's a final that almost felt inevitable and, based on current form, Man City are rightful favourites. But anything can happen in football. Since sacking Lampard and bringing in Thomas Tuchel, Chelsea have looked and played like a different team -- a much better team.\n\nThis should be a cracker of a final.\n\nRead more: How to watch Premier League games live in the US today without cable\n\nHere's everything you need to know...\n\nWhen does the Champions League Final take place?\n\nMan City vs. Chelsea\n\nUS\n\nThe final between Man City and Chelsea takes place on May 29. Kick-off will most likely be 3 p.m. ET (12 noon PT).\n\nUK\n\nThe second leg between Chelsea and Real Madrid. Kick-off will most likely be 8 p.m. GMT.\n\nAustralia\n\nThe final between Man City and Chelsea takes place on May 30. Kick-off will most likely be 5 a.m. AEDT.\n\nWhere is the Champions League Final taking place?\n\nThe final is taking place at Attaturk Olympic Stadium in Istanbul, Turkey.\n\nHow to watch\n\nUS\n\nThe long and short of it is, your best bet is signing up with .\n\nAll the details on Paramount Plus' online coverage of Champions League matches can be found . Paramount Plus has access to all Champions League matches. You'll also be able to watch all matches in the Europa League, the second-tier European competition.\n\nUnivision has the rights to the US Spanish broadcast of the Champions League, however. You can find out more here.\n\nUK\n\nIf you want to watch Champions League football in the UK, our recommendation is sign up with BT Sport.\n\nBT Sport is streaming all the Champions League matches, but it also gives you access to a bunch of other good stuff, like UFC, so it's worth getting.\n\nAustralia\n\nMuch like the English Premier League, Optus Sport is showing all the Champions League matches in Australia.\n\nIf you care about watching soccer at all, the Optus Sport deal is a good one. Especially if you follow the EPL which, being the most high profile league on the planet, most soccer fans do.\n\n\n\nDisclaimer: I subscribe to the service and love it. Easy access to all matches on my smart TV and works nicely with a mobile app.",
    "Title": "Man City vs. Chelsea in the Champions League Final: Start date, kick-off time, how to watch     - CNET"
  },
  {
    "Date": "Thu, 06 May 2021 03:37:00 +0000",
    "Description": "\"No bird too tall.\" Artists and photographers rejoice at the change, as do Twitter users who want to post photos of wookiees and tall hats.",
    "Image": "https://www.cnet.com/a/img/vseVyStk1MLoKLQ4jAnTBEtV4ag=/1200x630/2021/05/05/181d8452-fb96-43b9-b224-4be4fbc02ec8/groot.jpg",
    "Link": "https://www.cnet.com/news/twitter-improves-image-crops-happy-users-flood-site-with-vertical-photos/#ftag=CADf328eec",
    "Text": "Giraffes and Chewbacca are having their best day ever.\n\nTwitter on Wednesday rolled out improvements to the way images are viewed and posted, and joyful users quickly deluged the platform with vertical photos that previously might have shown up in timelines with an odd or unfortunate crop.\n\nNow, when users tweet a photo uploaded with their iOS or Android device, it will appear in the timeline in its entirety. Plus, users can preview what an image will look like in the tweet composer pre-post rather than having to pray to the cropping algorithm not to cut off Mr. Meow Meow's head.\n\n\"Twitter crop is gone,\" the site Fandom wrote alongside a photo of a lanky, left-leaning Groot. In the olden days (earlier this week), the same photo of the plant-like Guardians of the Galaxy star might have focused only on his trunk. Now Twitter users get to see Groot's entire face of flora before clicking on the tweet to expand the photo.\n\nTwitter crop is gone 👋 pic.twitter.com/jiOBoLX2wo — Fandom (@getFANDOM) May 5, 2021\n\n\"No bird too tall, no crop too short,\" Twitter wrote in a tweet announcing the change. \"Introducing bigger and better images on iOS and Android, now available to everyone.\"\n\nno bird too tall, no crop too short\n\n\n\nintroducing bigger and better images on iOS and Android, now available to everyone pic.twitter.com/2buHfhfRAx — Twitter (@Twitter) May 5, 2021\n\nTwitter first announced back in March that it was testing new features to improve how photos appear on the platform. The site also recently updated to 4K images.\n\n\"Today's launch is a direct result of the feedback people shared with us last year that the way our algorithm cropped images wasn't equitable,\" a Twitter spokesperson said Wednesday, referring to charges of racial bias in its photo preview generator. The spokesperson added that very wide or tall images will still be center-cropped by default, \"but this is something we're working to improve.\"\n\nA quick glance through the trending Twitter crop is gone topic indicated wide support for the latest shift, especially among creatives.\n\n\"Fabulous news for photographers and artists,\" one Twitter user wrote, sharing a photo of a bird whose outstretched wings could be seen in both directions even before the image gets expanded.\n\nThe 'Twitter crop' has gone!!!! 😀\n\nFabulous news for photographers and artists! 🙏👌\n\nHere's a Great Tit pic to celebrate! 🎉🐦😊 pic.twitter.com/yzIeY1dS0f — Carl Bovis (@CarlBovisNature) May 5, 2021\n\n\"Twitter crop is gone. Time to repost my vertical art,\" posted another.\n\nsome old vertical abstract art to celebrate the end of twitter crop pic.twitter.com/d37TJok4WT — chi (mars) ༊*·˚*⭒‧₊˚ᵕ̈˳ (@GROOVYCHl) May 5, 2021\n\nTwitter crop is gone! Artists we will be held back no longer !! pic.twitter.com/J6SfXmTFzC — Xiao Tong 🦋CTC (@Velinxi) May 5, 2021\n\nNow that the twitter crop is gone you can see the whole sky in my art! pic.twitter.com/Vm0o9xHARM — Matt Fisher (@MattFDraws) May 5, 2021\n\nTWITTER CROP IS GONE??\n\nARTISTS! TODAY WE RISE! 🚀🚀 pic.twitter.com/YahvsHGp1V — MJ 🐭 (@minjimouse_art) May 5, 2021\n\nAll visual artists celebrating the new Twitter crop like: pic.twitter.com/Q31VlKrrMH — xan (@xandrei) May 5, 2021\n\nBut visual artists aren't the only ones celebrating the change. Along with countless images of art shared in response to the news came jokes about tall hats, people (and puppets) with tufts of hair and, well, those with long body parts.\n\nTo celebrate the demise of Twitter crop... pic.twitter.com/Ji1F1px6uI — Rahul Kohli (@RahulKohli13) May 5, 2021\n\ntwitter crop is gone post all the puppeteer photos pic.twitter.com/fR21BNGfxy — elyse! 🌼✏️ (@toonfully) May 5, 2021\n\n\"Twitter Crop is gone?\"\n\n\n\nHa! We'll see about that!! pic.twitter.com/ww4Tz0YIwI — JakeWhyman (@Jake_Whyman) May 5, 2021\n\nAs The Verge points out, the change does take away the element of surprise that comes with seeing part of an image and then having an aha moment once you expand to see the full picture. But that seems like a small price to pay for not having to worry about which photo of Long Boi the tall duck you choose to tweet.",
    "Title": "Twitter improves image crops, happy users flood site with vertical photos     - CNET"
  },
  {
    "Date": "Thu, 06 May 2021 03:33:00 +0000",
    "Description": "Step right up and meet some of the Targaryens who came before Daenerys -- and their friends and enemies.",
    "Image": "https://www.cnet.com/a/img/WkhOMEzBqwIXmR7Kh3i1VbKHb70=/1200x630/2021/05/05/731952b7-2732-4547-89a5-2b35cfda398b/hotd-emma-d-arcy-matt-smith.jpg",
    "Link": "https://www.cnet.com/news/hbo-shares-new-photos-from-upcoming-game-of-thrones-prequel-house-of-the-dragon/#ftag=CADf328eec",
    "Text": "Game of Thrones fans finally have some photos from upcoming prequel House of the Dragon to pore over. The HBO show is based on Game of Thrones' author George R.R. Martin's enormous book Fire & Blood, which delves into the violent and fascinating history of the Targaryen family, hundreds of years before Daenerys came along. Yes, this is the family with the whitish-blond hair, fierce dragon-riding skills and penchant for marrying their own relatives.\n\nOllie Upton/HBO\n\nIn a statement, HBO says production on the show has just started and it will be available to stream on HBO Max in 2022. HBO shared a not-very-revealing photo in April, showing various members of the production team seated at computers. But these images are much better, showing actors in full costume and makeup.\n\nEmma D'Arcy, shown above, plays Princess Rhaenyra Targaryen, a dragon rider and the firstborn of the king. But as in many royal families, the only problem is she wasn't born male.\n\nMatt Smith, known to many as the eleventh Doctor in Doctor Who, and Prince Philip the Duke of Edinburgh in The Crown, plays Prince Daemon Targaryen, the younger brother to King Viserys and heir to the throne, a peerless warrior and a dragon rider.\n\nOllie Upton/HBO\n\nSteve Toussaint plays Lord Corlys Velaryon, aka a nautical adventurer known as The Sea Snake. He's the lord of House Velaryon, which claims the largest navy in the world and is even richer than the Lannisters (remember them?).\n\nOllie Upton/HBO\n\nOlivia Cooke plays Alicent Hightower, daughter of Otto Hightower, the hand of the king, and \"the most comely woman in the Seven Kingdoms.\"\n\nWelsh actor Rhys Ifans plays Otto Hightower, a loyal and faithful servant to both his king and his realm. But he believes the greatest threat to the realm is the king's brother, Daemon, and his position as heir to the throne.\n\nHBO\n\nAnd with the show's focus on a family of dragon riders, you bet there will be dragons. HBO released looks at the concept art of the dragons back in December. In 2019, Sven Martin, one of the designers of the Game of Thrones dragons, told CNET the fantastical creatures are actually based in part on real animals and how they move.",
    "Title": "HBO reveals new photos from Game of Thrones prequel House of the Dragon     - CNET"
  },
  {
    "Date": "Thu, 06 May 2021 01:00:04 +0000",
    "Description": "Are you missing any of the three stimulus checks? We'll explain what you need to do to get in touch with the IRS to have the agency track down your money.",
    "Image": "https://www.cnet.com/a/img/UWZaWwV3i43acW-L0WwYDNISHsw=/1200x630/2019/01/14/60292ca3-3c75-4082-be95-6052a71f7238/blue-light-glasses-4.jpg",
    "Link": "https://www.cnet.com/personal-finance/still-dont-have-your-stimulus-check-how-to-request-an-irs-trace-to-track-your-payment/#ftag=CADf328eec",
    "Text": "Sarah Tew/CNET\n\nIf you haven't received one of the 163 million stimulus payments the IRS has sent so far, know that the agency will be sending payments to those who qualify till the end of the year. However, if you think something is wrong and your $1,400 payment is lost, it may be time to take action and track down your missing money -- and that's for any of the first, second and third rounds of stimulus payments.\n\nIf you're eligible for any of the stimulus checks but they never arrived, there may be a problem with the payment -- especially if the IRS doesn't have your correct information on file (like an address if you moved). You may also be owed a \"plus-up\" payment if you received some but not all of your $1,400 payment -- you should automatically receive it without having to amend your tax form. (You might also be able to take advantage of a number of other savings opportunities thanks to the latest stimulus law.)\n\nWe'll show you some ways to track your payment, either through a Recovery Rebate Credit (even if you don't usually file taxes) or an IRS payment trace. Plus, here's what we're hearing about a potential fourth stimulus check, what may happen with student loan forgiveness, how to get a $50 discount on your internet bill and the latest on the child tax credit. (Calculate your total here.) This story has been updated.\n\nWhen you should be concerned about a missing stimulus payment\n\nThird stimulus checks are still being sent, so we'd suggest holding out a little longer. If you didn't get your first or second check at all, though, it's time to act. In general, this chart shows when you can and should request an IRS payment trace, which is designed to hunt down a stimulus check the agency says it sent. More below on exactly how a payment trace works, how to get started and when to use it.\n\nWhen to request an IRS payment trace Method of payment Time passed since IRS says it sent your payment Direct deposit 5 days Check mailed to standard address 4 weeks Check mailed to a forwarded address 6 weeks Check mailed to a foreign address 9 weeks\n\nThis timeline was the same for the first and second checks as well. If your first or second stimulus check is missing, you can no longer use the Get My Payment tool to track it down. Here's how to find the amount of your first two stimulus checks.\n\nIf the IRS tracker app says your stimulus check was sent, but you never got it, what can you do?\n\nThe IRS continues to send out the third stimulus check to millions of people, so there's a good chance that if you haven't gotten yours yet, it's in the works. You can check the status of your third check. You need to plug in your Social Security number or Individual Taxpayer Identification Number, date of birth, street address and ZIP or postal code.\n\nThe portal will show your payment status, if your money has been scheduled to send and the payment method (direct deposit or by mail) and date. You might also see a different message or an error. (Here's how to track your mailed check through the USPS.)\n\nYou'll need to request a payment trace if the Get My Payment portal shows your payment was issued but you haven't received it within the time frame outlined in the chart above.\n\nNow playing: Watch this: Stimulus plus-up payments: What you need to know\n\nYou got a letter from the IRS confirming your stimulus payment, but never got any money. What should you do?\n\nAbout 15 days after the IRS sends your third stimulus check (by either direct deposit, paper check or EIP card), you should get a letter from the agency confirming your payment. The IRS is now sending these letters for the third payment.\n\nIf you received this letter -- also called Notice 1444, Your Economic Impact Payment -- but you never got your payment, you'll need to request a payment trace. Make sure you keep the letter: You'll need the information to file your claim. (Here's what to do if you lost the IRS letter about your stimulus check.) The same is true for the first and second stimulus checks as well.\n\nHow to request an IRS payment trace and claim any of your missing stimulus payments\n\n\n\nTo request a payment trace, call the IRS at 800-919-9835 or mail or fax a completed Form 3911, Taxpayer Statement Regarding Refund (PDF). Note: If you call the number, you'll have to listen through the recorded content before you can connect with an agent.\n\nTo complete Form 3911 for your third stimulus check, the IRS provides the following instructions:\n\n1. Write \"EIP3\" on the top of the form (EIP stands for Economic Impact Payment.)\n\n2. Complete the form answering all refund questions as they relate to your payment.\n\n3. When completing item 7 under Section 1:\n\nCheck the box for \"Individual\" as the Type of return .\n\n. Enter \"2021\" as the Tax Period .\n\n. Do not write anything for the Date Filed .\n\n. Sign the form. If you're married and filing together, both spouses must sign the form.\n\nYou should not mail Form 3911 if you've already requested a trace by phone. And the IRS said you should not request a payment trace to determine if you were eligible to get a check or to confirm the amount you should have received.\n\nNow playing: Watch this: Stimulus check 3: How much money you'll get\n\nHow does the IRS process your payment trace?\n\nThe IRS will do the following to process your claim, according to its website:\n\nIf you didn't cash the check, the IRS will issue a replacement. If you discover the original check among your belongings, you're expected to return it as soon as possible.\n\nIf you did cash the refund check, expect a claim package from the Bureau of the Fiscal Service, which will include a copy of the cashed check. Follow the included instructions. The bureau will review your claim and the signature on the canceled check before deciding whether it will issue a replacement. This is presumably to guard against stimulus check fraud\n\nHow long will it take for your stimulus check to arrive after filing a payment trace?\n\nYou should get a response from the IRS about six weeks after the agency receives your request for a payment trace, according to its website. But this could be delayed due to limited staffing. We've asked the IRS for more information.\n\nFor more on stimulus checks, here's what we know about a potential fourth stimulus check and what else is in the stimulus package that may help you financially.",
    "Title": "Still don't have your stimulus check? How to request an IRS trace to track your payment     - CNET"
  },
  {
    "Date": "Thu, 06 May 2021 03:00:03 +0000",
    "Description": "After you get your third stimulus check, you'll receive a letter in the mail signed by President Joe Biden confirming your payment. Here's why you want to keep it -- and what to do if you didn't.",
    "Image": "https://www.cnet.com/a/img/6QFL23jxABhRVMUkXXSNTkB71pU=/1200x630/2021/01/05/2bde1ab2-3c36-48a8-b426-610a498d30ff/34-2021-cash-money-stimulus-bill-600-dollars-check-americans-congress-signed-law-direct-deposit-mail.jpg",
    "Link": "https://www.cnet.com/personal-finance/got-your-third-stimulus-check-keep-the-irs-letter-heres-why-and-what-to-do-if-you-lost-it/#ftag=CADf328eec",
    "Text": "Angela Lang/CNET\n\nThe IRS has sent out 164 million third stimulus checks total, with more than 1.1 million more sent this week. After it sends the checks, the agency mails a letter signed by President Joe Biden confirming your payment. But if you still didn't get your check -- or you think the amount is wrong (check with our stimulus calculator) -- keep the IRS notice to claim what you're supposed to get under the American Rescue Plan Act.\n\nIf the IRS based your total on your 2019 taxes but you made less money in 2020, you may be owed more than you actually got. You may have also gained a dependent, like a new baby, that the IRS didn't use to calculate your amount. And if you moved recently, make sure you let the USPS and IRS know so the document arrives at your correct address.\n\nIf you're part of the millions of people who didn't get a first or second stimulus payment you were eligible for, you'll need to claim it as a Recovery Rebate Credit when you file your 2020 tax return -- which is due May 17. (You can use our first stimulus check calculator and second payment calculator to help find your estimated total.) If you never received the IRS letter or you misplaced it, we can tell you how to get a copy so you can claim your missing stimulus money from the third check so you can trigger an IRS payment trace. By the way, here's what to know about a fourth stimulus check and how to get a $50 discount on your internet bill.\n\nWhat the IRS letter (Notice 1444) is for, and why you should hold on to it\n\nThe IRS is now sending out a letter following your third stimulus check, confirming your payment. Officially called Notice 1444-C, the letter signed by Biden shows you the amount you were paid and how you were paid -- by mail or direct deposit. The letter also advises you to check the Get My Payment tool or call a phone number at the bottom of the letter if you've not received your check.\n\nWith the two first stimulus payments, the IRS also sent a confirmation letter in the mail within 15 days of your payment going out -- Notices 1444-A and 1444-B.\n\nIf you believe you received the wrong amount -- such as a dependent was skipped -- or the total doesn't match the estimated amount from our stimulus calculator, it could indicate that you may need to hunt down your missing money using this letter. The IRS advises you to hold on to the letter for your 2021 tax records.\n\nWhat this really means is that it's useful if you need to claim missing money in the future, as you can now on your 2020 taxes as a recovery rebate credit for the first two checks.\n\nHere's more information on using the Recovery Rebate Credit Worksheet to figure out the credit from the first two checks that you can claim on your 2020 taxes. You'll essentially enter the total amount you determine you're owed on line 30 of the 2020 1040 or 1040-SR tax forms.\n\nNow playing: Watch this: Stimulus check 3: How much money you'll get\n\nWhat if your address has changed recently?\n\nThe IRS would have mailed a notice to your last known address with your information on the payment. You'll need to inform the IRS and USPS if you've moved. The IRS needs to independently have your correct information on file.\n\nWhere you can find the IRS details if you can't find the physical letter\n\nIf you don't have the IRS confirmation notice, you should be able to find the information in your federal tax account, using the IRS website.\n\nIf you don't have an account set up with the IRS, head to the IRS account page and tap the blue button that says Create or view your account to get started.\n\nYou'll need to have some information on hand to set up your account, including tax and financial information, plus an email address and a mobile phone number to receive activation codes.\n\nThe IRS said for married couples who are filing jointly, each spouse will need to log in to their own account.\n\nSarah Tew/CNET\n\nWhat to do if you can't complete the IRS registration at this time\n\nThe online registration process can take about 15 minutes. During the setup process, the IRS will first email and then text two activation codes. If the codes don't come through, the agency will mail you a letter with an activation code, which can take five to 10 days to get to you. If you want to track the letter, you can use this free service from the USPS.\n\nOnce you've set up your online account with the IRS, you can check your account for the information contained in the notice. If your stimulus payment information is not available when you check, the IRS said it should be in the coming weeks.\n\nHere's more information on tax season and your stimulus check, everything you need to know about the third stimulus check and what could happen with a fourth stimulus check. Here's what we know about payments for the Child Tax Credit.",
    "Title": "Got your third stimulus check? Keep the IRS letter. Here's why and what to do if you lost it     - CNET"
  },
  {
    "Date": "Thu, 06 May 2021 03:16:01 +0000",
    "Description": "Commentary: It's great but there are still a couple of frame rate nitpicks that annoy me.",
    "Image": "https://www.cnet.com/a/img/5ONGt6GXXfKbl2ZqkrQ_pSGj0Mc=/1200x630/2020/10/27/c5135f07-7315-4f67-b5aa-e31aee9dbe61/xbox-series-x-s-console-hoyle-studio-promo-8.jpg",
    "Link": "https://www.cnet.com/news/thanks-to-fps-boost-xbox-series-s-is-an-incredible-value-at-300/#ftag=CADf328eec",
    "Text": "Andrew Hoyle/CNET\n\nIn February, Xbox introduced a new feature for the Xbox Series S and Series X called FPS Boost. It allows certain backward-compatible Xbox One games, which originally ran at 30 frames per second, to now run at 60fps or higher on the newer consoles. These enhancements are done in-house by the Xbox hardware group and don't require developer input.\n\nThis week, Microsoft announced that 74 new games would now support FPS Boost, including Far Cry 5, Assassin's Creed Unity, Recore and Alien Isolation. The tally so far is 97 games across the Series X and Series S with the FPS Boost treatment.\n\nThe ability to play these older titles at frame rates some of these games were never meant to run at dramatically increases the value of the Xbox Series S. So much so that I might actually start recommending it over the Series X.\n\nFrame rate is everything\n\nThat's right. Frame rate means everything to me. I've had both the Xbox Series S and Series X since they launched in November, and in that time I've become a complete frame rate snob. For me, frame rate is the most important attribute when it comes to judging how \"next gen\" a game looks.\n\nAnd if a game doesn't at least offer a 60fps mode, I will likely not play it. Sounds harsh, I know, but it's true. Games that run at 60fps look smoother, are more aesthetically pleasing and respond more quickly than lower frame-rate games. Once you've experienced it in more than a handful of games, it's hard to go back to 30fps.\n\nAll of this is why I had a difficult time recommending the Xbox Series S to friends looking for a next-generation system when I first bought it back in November. Aside from the faster load times, most backwards-compatible games ran no better than they did originally. There were a few games that were optimized for the Series S, like Gears 5, that looked great and ran at 60fps. But there weren't nearly enough of these.\n\nThat's all changed now, thanks to the huge influx of both FPS Boost games and also the release of more and more Series S optimized games.\n\nMicrosoft\n\n'Optimized for Series X|S'\n\nWhat if a game doesn't use FPS Boost? That's where the optimizations for Series X and S come in. These essentially take a game that's available on the Xbox One and adds new features like a higher resolution, more graphical effects and of course a 60fps (and or higher) frame rate. These optimizations are typically handled by the developers themselves.\n\nI hate to admit it, but I will buy games I have only a passing interest in if I see that they have the \"X|S\" optimized logo. I did that with Mortal Shell and The Avengers. Also, recently Xbox announced that Sea of Solitude had received the FPS Boost treatment. I'd never even heard of that game before I'd heard about the update, but I downloaded it via Xbox Game Pass Ultimate the day of the FPS Boost announcement. I will at least now give it a try.\n\nSome frustrations still\n\nAs much as I appreciate the improvements made over the last few months, there are still some frustrations. Sometimes games get a 60fps patch on the Series X, but not on the Series S. The Outer Worlds and Wreckfest both now run at 60fps on the Series X, but still top out at 30fps on the Series S.\n\nThis is likely because of the difference in graphical bandwidth between the 12 teraflop GPU in the Series X and the 4 teraflop one in the Series S. Getting some games to run at a consistent 60fps on the Series S -- without using FPS Boost -- might take more work.\n\nRead more: Xbox Series X: Game Pass is the secret weapon\n\nThe system of choice?\n\nIf you're a hardcore gamer willing to pay $500 (£450, AU$749) for a console -- if you can find one, that is -- the Series X is for sure the system for you. I don't own a PlayStation 5 and likely won't until the end of the year, so can't speak to its quality, but my colleague Dan Ackerman recommends it -- again, if you can find it.\n\nHowever, if you don't fit the above description, the Series S is a great alternative next-gen system. The consoles are a bit easier to find and the value proposition of the SSD speed, performance in optimized games and FPS Boost games is unmatched. When you combine that with Game Pass for $10 or $15 (£11, AU$16) a month, it's a ridiculous value that will only get better over the next few months as more and better games are released.",
    "Title": "Thanks to FPS Boost the Xbox Series S is an incredible value at $300     - CNET"
  },
  {
    "Date": "Thu, 06 May 2021 03:43:00 +0000",
    "Description": "It's the first time a flight of Elon Musk's Mars rocket prototype didn't end in a huge kaboom.",
    "Image": "https://www.cnet.com/a/img/YbuKiEBogFrA7h_Taw0pGW23fHM=/1200x630/2021/04/16/cb24b1c1-e40d-464e-98a0-efb14c7437fe/51006497323-78a8282170-k.jpg",
    "Link": "https://www.cnet.com/news/spacex-starship-sn15-rocket-nails-first-landing-without-exploding/#ftag=CADf328eec",
    "Text": "SpaceX\n\nSpaceX successfully launched an updated prototype of its next-generation Starship vehicle on Wednesday, and after a handful of attempts that all ended in dramatic explosions during the landing phase, SN15 is the first to finally touch down softly.\n\nThe early, three-engine version of a rocket that Elon Musk, SpaceX head honcho, hopes will eventually take humans to Mars flew to an altitude of about 6.2 miles (10 kilometers), did a brief single-engine hover before flipping horizontal for its long coast towards the landing pad. It then lit back up to flip to vertical position and came in for a soft and rather pretty landing powered by a landing burn from just two of its Raptor engines.\n\nSpaceX video capture/CNET\n\nThe landing caps off a busy period for SpaceX that has seen the return of astronauts to Earth aboard a Crew Dragon and a milestone Starlink launch, not to mention Musk is hosting Saturday Night Live this week.\n\nStarship landing nominal! — Elon Musk (@elonmusk) May 5, 2021\n\n\"The past few weeks have been full of accomplishments by the SpaceX team,\" said SpaceX engineer and commentator John Insprucker on the SpaceX livestream. \"An outstanding period as we work to enable the future of human spaceflight.\"\n\nElon Musk's space company conducted high-altitude test flights of prototypes SN8 through SN11 and had long planned to integrate what Musk called \"major upgrades\" into SN15. The company skipped SN12, SN13 and SN14, which were never fully assembled.\n\nMusk said SN15 \"has hundreds of design improvements across structures, avionics/software and engine,\" including, apparently, upgrades to cover some of the problems that prevented SpaceX from sticking the landing without a rapid unscheduled disassembly.\n\nFollow CNET's 2021 Space Calendar to stay up to date with all the latest space news this year. You can even add it to your own Google Calendar.",
    "Title": "SpaceX Starship SN15 rocket nails first landing without exploding     - CNET"
  },
  {
    "Date": "Thu, 06 May 2021 00:17:00 +0000",
    "Description": "The bugs of Brood X are tunneling out from underground in 15 US states, plus Washington, DC, for a massive mating frenzy. Here are answers to some of the most common questions.",
    "Image": "https://www.cnet.com/a/img/YVYekrRlyALFVpoxrKLl5Ct6WS0=/1200x630/2021/01/28/cd850721-c56d-4d0d-bda1-11c466ab1141/629445851.jpg",
    "Link": "https://www.cnet.com/how-to/trillions-of-brood-x-cicadas-have-started-emerging-for-first-time-in-17-years-what-to-know/#ftag=CADf328eec",
    "Text": "Getty Images\n\nParts of the eastern United States are about to witness a remarkable natural spectacle: trillions of cicadas tunneling out from their underground homes for the first time in 17 years to fill outdoor spaces and share their inescapably loud mating calls.\n\nPeriodical cicadas, as they're known, are different than annual cicadas. They spend almost their whole lives a foot or two underground, living on sap from tree roots. Then, in the spring of their 13th or 17th year, depending on the type, mature cicada nymphs emerge for a brief adult stage, synchronously and in huge numbers. Really huge numbers.\n\nGIF by Leslie Katz/CNET\n\nThe insects climb up the nearest vertical surface, often the tree whose roots sustained them. They shed their exoskeletons and inflate their wings. After a few days resting and waiting for their shells to harden, the mating begins. The frenzy is impossible to miss once hordes of males start emitting their high-pitched mating song. That happens via sound-producing structures called tymbals on either side of their abdomen.\n\n\"They may amass ... in parks, woods, neighborhoods and can seemingly be everywhere,\" Michigan State University entomologist Gary Parsons explained in an MSU question and answer session on the phenomenon. \"When they are this abundant, they fly, land and crawl everywhere, including occasionally landing on humans.\"\n\nHere are answers to some of the main questions about 2021's big cicada emergence.\n\nWhat is Brood X?\n\nThe eastern United States is home to six species of periodical cicadas that emerge in different years. Groups of cicadas that share the same emergence years are known as broods.\n\nThis spring, it'll be time for members of one of the largest broods of 17-year cicadas, called Brood X or the Great Eastern Brood, to crawl out from their subterranean hideouts and show off their black bodies and bold red eyes. Expect to see all three 17-year species: Magicicada septendecim, Magicicada cassini and Magicicada septendecula.\n\nWhich states will be impacted?\n\nParts of 15 states, as well as Washington, DC, will hear the romantic serenades of males in trees, trying to attract females. The states are Delaware, Georgia, Illinois, Indiana, Kentucky, Maryland, Michigan, North Carolina, New Jersey, New York, Ohio, Pennsylvania, Tennessee, Virginia and West Virginia.\n\nWalking the dog after sunset. Thought wind was gently rustling leaves, except the noise was coming from my feet. #Cicadas are emerging. @capitalweather’s prediction was spot on. #broodx pic.twitter.com/H29ISpWPkx — Christina TylerWenks (@MusikFrau) May 3, 2021\n\nWhen will the cicadas emerge?\n\nCicada Safari\n\nThe return of the cicadas typically starts around early- to mid-May (sightings of adult cicadas have already been reported in Georgia, North Carolina, southeast Tennessee and the Washington, DC area) and runs through late June. It is, needless to say, a quite sight. Some people view the mass of insects as a pesky annoyance, but others welcome it as an awe-inspiring wonder of nature. Some in the latter category even regularly travel around the US to cicada emergence areas to experience the sights and sounds and help scientists map the creatures.\n\n\"There's an awesomeness to it because you're surrounded by thousands, maybe millions of these creatures that weren't there the day before,\" says Dan Mozgai, one of those citizen scientists. \"It's like an alien invasion, like being in a movie.\"\n\nA free app created at Cincinnati's Mount St. Joseph University, called Cicada Safari and available for iOS and Android, lets the cicada-curious record periodical-cicada sightings. They can also record sightings at the websites Cicada Mania and iNaturalist, a joint initiative of the California Academy of Sciences and the National Geographic Society. Cicada mapping helps scientists verify the periodical insects' life cycles, as well as broods' relationships to one another, to gain a better understanding of biodiversity, biogeography and ecology.\n\nBecause Brood X occurs four years after Brood VI and four years before Brood XIV and because the three broods are adjacent to one another in parts of their geographic ranges, cicada trackers may spot \"stragglers\" from other broods this year.\n\n\"From a biological perspective, four-year stragglers from either of these broods are of interest because they can cause gene flow among these broods,\" the University of Connecticut explains. \"From a practical perspective, four-year stragglers from any of these broods complicate mapping efforts, because populations may be difficult to assign to a brood.\"\n\nStragglers may confuse mapping efforts, but the university stresses that a \"misleading map is worse than no map at all.\"\n\nWhy do so many come out at once?\n\n\n\nIt's thought that by emerging in such huge numbers, enough of them can avoid predators and live on to mate -- basically, strength in numbers.\n\nThe cicadas typically begin to come out when soil temperatures 8 inches (20 centimeters) underground reach 64 degrees Fahrenheit (18 degrees Celsius). \"That seems to be the trigger that causes them all to emerge over a few days or weeks in one area,\" Parson says. A warm rain often triggers their emergence.\n\nBecause periodical cicadas are sensitive to climate, patterns of different broods and species reflect climatic shifts, note John Cooley and Chris Simon, professors of ecology and evolutionary biology at the University of Connecticut.\n\n\"For example, genetic and other data from our work indicate that the 13-year species Magicicada neotredecim, which is found in the upper Mississippi Valley, formed shortly after the last glaciation,\" they write in a piece for The Conversation. \"As the environment warmed, 17-year cicadas in the area emerged successively, generation after generation, after 13 years underground until they were permanently shifted to a 13-year cycle.\"\n\nWhat does the male mating call sound like?\n\nIt varies by species, but it can sound like a high-pitched electric buzz, a chirp or a rattle (hear it below). The calls of a group of males can exceed 90 decibels, about the same level as a motorcycle at 25 feet (about 8 meters) away. The females respond to the males' come-hither calls by clicking their wings, and all the back and forth makes for a distinctive symphony.\n\nHear the 17-year cicadas Your browser does not support the audio element.\n\nCan cicadas hurt me?\n\nNope, the insects are harmless. They don't sting, bite or carry diseases, and they typically don't come indoors, though they do gather on outside walls.\n\n\"The only way they could get inside is accidentally flying in through an open door or window, or because they had landed on a person who then carried them inside unnoticed,\" Parsons says.\n\nDuring dense emergences, females can lay enough eggs in branches to damage young trees, but the abundant egg-laying also naturally prunes trees, resulting in more flowers and fruit in the years that follow. The cicadas boast other ecological benefits as well. Periodical cicadas aerate large amounts of soil when they emerge en masse, and when they die, their decaying bodies enrich the ground with nutrients.\n\nCan pest control pros help me?\n\nWhen people call for help during cicada emergence, those in pest control are largely in the position of educating clients about why the pest pros aren't going to show up and spray down their yard with pesticide.\n\n\"We really want people to understand and know that pesticides are not the answer, which sounds really funny coming from a pest control company,\" Frank Meek of pest control company Orkin tells my CNET colleague Erin Carson. \"Pesticides are not the thing to use on this insect. They don't work for it, and it's a waste of product, and it's a danger to the environment just to spray down because you're afraid of the cicadas.\"\n\nHow long will Brood X stick around?\n\nThe mass mating lasts at least three to four weeks. Soon after, the newly hatched nymphs will crawl to the edge of the tree branches where the females laid their eggs, drop to the ground and burrow in for the next 17 years. And so the cycle begins again. Godspeed, Brood X.",
    "Title": "Trillions of Brood X cicadas emerging for first time in 17 years: What to know     - CNET"
  },
  {
    "Date": "Thu, 06 May 2021 01:01:00 +0000",
    "Description": "Amazon's TV game is solid.",
    "Image": "https://www.cnet.com/a/img/ywbIxIYSBvpHEAP9yb23ssCIwso=/0x3:3198x1800/1200x630/2021/05/06/8a199c20-cd98-484f-a55a-2a89f18f905f/https-bamsmackpow-com-files-image-exchange-2018-08-ie-67283.jpg",
    "Link": "https://www.cnet.com/news/the-24-best-tv-shows-to-watch-on-amazon-prime-video/#ftag=CADf328eec",
    "Text": "Amazon\n\nAmazon Prime Video is peppered with original gems and co-productions with studios from other countries. All you have to do is use this list to sift through and find the very best of the bunch. If you're a recent (or longtime) Kathryn Hahn admirer following WandaVision, you'll find her starring in a smart and interestingly-titled comedy just below. Elsewhere, head to Australia with Picnic at Hanging Rock or the UK with Good Omens. Great stuff.\n\nRead more: The 20 best movies to watch on Amazon Prime Video | Everything you need to know to sign up to Amazon Prime Video\n\nInvincible For those who aren't a fan of cartoons, Invincible could be your converter, up there with other adult cartoons like BoJack Horseman and Rick and Morty. Based on a comic book from Robert Kirkman, the creator of the Walking Dead, Invincible follows 17-year-old Mark Grayson and his training to become a superhero just like his father, who happens to be the most powerful superhero on the planet. Episodes run long at nearly 50 minutes, connected into one big, blood-spattered story. A subversive series with a huge cast featuring Steven Yeun, Sandra Oh and J.K. Simmons, Invincible will engross you in its smart animated world.\n\nI Love Dick Amazon Going on a Katheryn Hahn binge after WandaVision? Marvel's new favorite witch starred in one season of this 2016 comedy with a memorable title. Her character's name is just as memorable: Chris Kraus, an artist and filmmaker who moves to Texas with her husband. She quickly falls in love with his fellowship sponsor, played by Kevin Bacon. Yes, Kevin Bacon is in this. The dynamic of her marriage shifts as her infatuation challenges everything in smart and provocative and adult ways. Sadly, I Love Dick didn't score a second season, but the first is well worth your time.\n\nInformer Amazon Studios This gripping British series is about, yes, an informer, and the murky territory involved in coercing someone to take on the dangerous gig. Paddy Considine (who now has a gig on the Game of Thrones prequel) stars as DS Gabe Waters, a counterterrorism officer tasked with infiltrating a far-right movement in West Yorkshire. Partnered with an excellent Bel Powley (The Morning Show, The King of Staten Island) as the young and inquisitive DC Holly Morten, he attempts to bring British Pakistani Raza (Nabhaan Rizwan) on board to uncover information about a possible terrorist attack. A provocative thriller that will keep you on your toes.\n\nPicnic at Hanging Rock (2018) Amazon Studios This TV version of Picnic at Hanging Rock isn't quite a masterpiece like the 1975 film adaptation of the classic Australian novel. But it's just as mysterious, unfurling a dreamy yet eerie veil over a fictional disappearance in the isolated Australian bush. When three students and their governess go missing after a picnic at the rock area, hysteria sets into the community and the esteemed Appleyard College, led by Natalie Dormer's formidable headmistress. Dark secrets emerge, keeping you hanging on until the end.\n\nGood Omens Chris Raphael This adaptation of Neil Gaiman and Terry Pratchett's novel pairs two other UK treasures in David Tennant and Michael Sheen. They play the demon Crowley and the angel Aziraphale respectively in this miniseries that sees Earth on the brink of destruction thanks to a final battle between Heaven and Hell. Decidedly against this, after enjoying their time on the planet, the bickering pair team up and attempt to prevent Armageddon. With a stacked cast, including a cameo from Benedict Cumberbatch as, well, Satan, Good Omens is a worthy adaptation, largely thanks to Tennant and Sheen's double act.\n\nThe Wilds Amazon Amazon's first original young adult offering is an intriguing combination of Lost and the Breakfast Club -- and it works. Crucially, the cast of characters who find themselves stranded on a deserted island are all teenage girls. To them, that makes life even more excruciating. Each has a very different background -- from spoiled rich girl to Native American -- but they have to put aside their differences to survive, learning a thing or two about themselves on the way. Things get even more dark and thrilling when Rachel Griffiths' Gretchen Klein comes into the picture as the head of the secretive Dawn of Eve program.\n\nTales from the Loop Amazon Not just another show about a small town where strange things happen, Tales from the Loop has a lot more underneath the surface. Drawing from a narrative art book by Swedish artist Simon Stålenhag, the series is stunning to look at, meticulous as can be with symmetrical frames. Light and space are infused with a painterly feel. The interconnected townspeople are similarly nuanced, their stories exploring loneliness, aging, the impact of technology and more through sci-fi ideas.\n\nTruth Seekers Amazon Longtime comedy pair Simon Pegg and Nick Frost (Shaun of the Dead, Hot Fuzz) hit the small screen with Truth Seekers, a surprisingly dark comedy with a sinister edge. Frost plays Gus, a paranormal investigator when he's not working for Dave's (Pegg) broadband company taking assignments in creepy houses across the UK. The ghost-a-week format turns into solving a larger conspiracy, with a few guest stars who're clearly having a ball. It won't top Pegg and Frost's list of best projects, but it's good fun, especially around Halloween.\n\nHanna Amazon Prime The premise of Hanna, a Joe Wright action thriller from 2011, is so good Amazon fleshed it out for a TV series. Starring Esme Creed-Miles as the skilled young assassin living in the Romanian wilderness, Hanna the TV show expands the teen's backstory and explains why the CIA's Marissa Wiegler has an obsession with capturing her.\n\nAmazon Studios A comedy-drama set in New York's classical music scene, Mozart in the Jungle is as whimsical as its title suggests. Upcoming oboist Hailey meets eccentric conductor Rodrigo, who's tasked with revitalizing the New York Symphony. Never losing you with jargon, Mozart in the Jungle charmingly reveals an edgier side to the world of strings, playing its own symphony of sex, drugs and rock 'n' roll.\n\nAmazon Studios The Boys stormed Amazon last year with its ultra-violent tale of antihero vigilantes seeking revenge against the world's most beloved superheroes. But these heroes aren't what they seem: Their corporate overlords cover up their shady personal lives, including sexual harassment and the odd assassination. With social commentary, black comedy and pops of gore, The Boys takes a thrilling and unapologetic step away from the family-friendly genre.\n\nAmazon Studios A sex scandal in the UK Parliament? Starring Hugh Grant and Ben Wishaw? You can thank Russell T. Davies for dramatizing this slice of late-'70s British politics. Jeremy Thorpe, a Liberal member of Parliament, wants to silence unhappy ex-lover Norman before his career ends up in tatters. Watch the murder conspiracy, big trial and media scrutiny through A Very English Scandal's darkly funny lens.\n\nAmazon Studios Transparent's unique story follows the Pfefferman siblings who discover their dad is transitioning into a woman named Maura. Other aspects of the Pfefferman's lives, like a sour marriage and a disappointing child, give this tightly scripted comedy-drama a relatable side. Poignant and ambitious, Transparent is a show to look out for.\n\nAmazon Studios While season 2 of Homecoming didn't quite find its feet, season 1 hit the ground running. Julia Roberts stars in this psychological thriller about an army rehabilitation facility run by questionable owners. Using an effective, mystery-building narrative that covers two timelines, Homecoming is high on tension and paranoia as it reveals what the facility's true purpose is. Fun fact: The series uses the actual scores of movies from Alfred Hitchcock, Stanley Kubrick and more.\n\nAmazon Studios This unique series uses the Rotoscoping animation technique to tell the story of a young woman who, after suffering a near-fatal car accident, discovers she can manipulate time. Intriguing, right? It gets better: Bob Odenkirk plays Alma's dead father, who enlists her help in investigating his murder. Bending both time and space, Undone is surreal and beautifully existential for those looking for deep material.\n\nAmazon Studios While The Tick was sadly canceled after two seasons, the superhero comedy will still give you a hit of fast-paced, colorful action with its tongue firmly in its cheek. Based on the comic book character, The Tick is a bulletproof hero who wears a, yep, blue tick suit. His sidekick? The meek Arthur who wears a ... moth suit. Their nemesis is The Terror, a supervillain in their city's underworld. If you want to sit back and watch pure superhero entertainment, you've found the right show.\n\nAmazon Studios The Man in the High Castle imagines an alternate history where the Axis powers (Rome-Berlin-Tokyo) win World War II. Based on a Philip K. Dick novel, the series follows characters in the '60s who live in a parallel universe, where Nazi Germany and the Empire of Japan control the US. But there's impossible newsreel footage surfacing of a world where Germany and Japan lose the war, causing some to rebel. To really hammer home its dystopia credentials, The Man in the High Castle is steered by producer Ridley Scott. Fully realized and with a focused plot, this is gripping TV.\n\nAmazon Studios Amazon rescued The Expanse from the realm of canceled TV, bringing us a fourth season with a fifth to come. Thank goodness it did, because The Expanse is smart sci-fi with realistic characters, high production values and a dash of detective noir. Set in a future where humanity has colonized the Solar System, a conspiracy threatens to start a cold war between the largest powers. A band of antiheroes find themselves at the center. Look forward to more space western themes in the consistently excellent later seasons.\n\nAmazon Studios Con man Marius walks free from jail, only to be hunted by the gangster he once robbed. So he assumes the identity of his cell mate Pete and walks back into the lives of Pete's estranged family, who are none the wiser. Bryan Cranston brings all the gravitas to gangster Vince in this part-drama, party-comedy. The twists and dicey situations will carry you through the addictive episodes as quickly as Pete pulls his cons.\n\nAmazon Studios This long-running police procedural, inspired by Michael Connelly novels, gets everything right for old-fashioned detective drama. We follow Los Angeles police detective Harry Bosch, who's haunted by the death of his mother. While catching serial killers and keeping his family safe, he investigates her murder. Functional and no-nonsense, Bosch provides steady mystery with an equally steady lead.\n\nAmazon Studios A '50s housewife who becomes a standup comic? This brilliant series from Gilmore Girls creator Amy Sherman-Palladino, is filled with sparkling performances from Rachel Brosnahan and Alex Borstein, with dialogue to match. Set in a vibrant and changing New York, our delightful heroine moonlights as a comedian, while doing her duties as an upper class Jewish American housewife. With impressive visuals, warmth and zingers, The Marvelous Mrs. Maisel is the full package.\n\nAmazon Studios Not only does this horror anthology series feature Japanese folklore and explorers heading into uncharted territory, but its first chapter stars pre-Chernobyl Jared Harris. He plays the captain of Arctic explorer ships that end up stuck in the ice. On top of the harsh conditions and cabin fever, an unknown presence in the mist stalks the crew. Strung with atmospheric dread, The Terror is thrilling, prestige horror. The Terror is available on Prime Video in Australia and AMC in the US (here's a VPN guide).\n\nAmazon Studios If somehow the Fleabag train passed you by, it's time to let it hit you at its full, incredible force. Phoebe Waller-Bridge writes and stars in the play-turned extraordinary comedy series. A 30-something woman who runs a cafe lives a sex-filled life with a sense of humor that hides the tragedies she hasn't yet come to terms with. Just about word-for-word perfect, with a fourth-wall breaking device, Fleabag frequently does its best to both shock and devastate you, while being ridiculously funny.\n\nAmazon Studios Featuring Carrie Fisher's final TV role, Catastrophe is a rom-com about messy, chaotic people. Londoner Sharon and Bostonian Rob have a one-week stand that results in an unplanned pregnancy and Rob moving to the UK so they can start a family. The tricky part: Sharon and Rob don't know the first thing about each other. Covering age, sex, parenthood, marriage and love in its open book, Catastrophe is a superb rom-com that gives you four seasons to devour.\n\n\n\n",
    "Title": "The 24 best TV shows to watch on Amazon Prime Video     - CNET"
  },
  {
    "Date": "Thu, 06 May 2021 04:30:05 +0000",
    "Description": "A wave of 1.1 million stimulus checks is now going out from the IRS this week. Here's how to check your payment delivery status and if you're due a plus-up payment as part of the American Rescue Plan.",
    "Image": "https://www.cnet.com/a/img/v9jpzq3TroNWXlV-iAoW_H6iXf8=/1200x630/2021/03/16/092ad1c2-f268-4fd7-9ec3-380bf4a4ae5e/032-cash-money-third-stimulus-checks-biden-federal-unemployment-1400-300-payments.jpg",
    "Link": "https://www.cnet.com/personal-finance/stimulus-check-plus-up-payment-status-irs-schedule-deadline-more-to-know/#ftag=CADf328eec",
    "Text": "Sarah Tew/CNET\n\nAnother batch of third stimulus checks is going out this week from the IRS, with 1.1 million payments for more than $2 billion in the mail and as direct deposit as of Wednesday. That makes 164 million payments since March's American Rescue Plan became law. But the IRS is not done. If you qualify for a payment, know that the agency is keeping to a regular payment schedule, sending out weekly batches of money. And that third check may not be all your get from the IRS.\n\nIn addition to the check up to $,1400, you may be eligible for a \"plus-up\" payment, if the IRS underestimated your your dollar amount by using an older tax return when it calculated your payment. And once you get your payment, keep an eye out for a letter from President Joe Biden with information about your third check. See below for why you want to hold on to this confirmation letter. (You may still be waiting for your tax refund, too. Here's how to check on that using the IRS tracker.) Among the payments the IRS has teed up include checks for nonfilers -- people who don't normally file a tax return -- and for those who receive SSI and SSDI benefits.\n\nHere's what to know about the IRS timeline for payments, including how to report a stimulus check problem and when it's time to file a payment trace. If you have kids, keep an eye out for child tax credit payments for up to $3,600 to start this summer, and how to claim up to $16,000 for child care expenses. Also, here's how to check on the status of your tax refund. In a speech last week, Biden talked about what money you could receive as part of his administration's next two stimulus proposals, beyond the American Rescue Plan, including talk of a fourth check. This story is frequently updated.\n\nPlus-up stimulus payments go out each week alongside the third round of checks\n\n\n\nYou could be due a plus-up payment, depending on which year's tax form the IRS used when it calculated your third payment. The IRS may have calculated the amount of your payment using an older tax form instead of your 2020 filing. If that happened to you, once the IRS receives your 2020 tax return and calculates your third payment again, under the American Rescue Plan, you could be due more money based on information from your current filing -- or on other factors if you don't usually file.\n\nThe IRS said it will automatically send these plus-up stimulus payments if it needs to square up the amount it owes you, but to double-check the math, you may want to confirm how much money you should expect this stimulus round, and then track your payment.\n\nShould you track the status of your stimulus check using the IRS tracker?\n\n\n\nKnowing the status of your payment is an important part of making sure you know where your full payment stands. With the IRS Get My Payment tracker tool, you can get a daily update on the status of your payment. The online app can also alert you with a message if there's a problem with your payment that you may need to address.\n\nIf you expect your payment is coming in the mail, you use a free tool from the USPS to track your mailed stimulus payment.\n\nIRS stimulus payment timeline through December 2021\n\n\n\nMost of the third stimulus check payments have gone out from the IRS and US Department of the Treasury based on what information the IRS has on hand to determine payment amounts. The March stimulus law, however, gives these federal agencies until Dec. 31, 2021, to send out all the third checks. That gives the IRS room to process 2020 tax returns and square up payments for those who are owed plus-up amounts, folks who file a 2020 tax extension and other groups, like those who moved or don't have a fixed address (such as people experiencing homelessness).\n\nIf all or part of your stimulus check doesn't arrive by then, you'll need to claim missing money via a 2021 tax return in April 2022, a year from now. This would be similar to the Recovery Rebate Credit for claiming missing money from the first two checks, which is currently in effect for 2020 taxes.\n\nStimulus check payments made to date\n\nDirect deposit Paper checks EIP Card Direct Express Card Plus-up 1st payment batch -- March 17 90 million ($242 billion) 150,000 ($442 million) Not disclosed Not disclosed Not disclosed 2nd payment batch -- March 24 17 million ($38 billion) 15 million ($34 billion) 5 million ($11 billion) Not disclosed Not disclosed 3rd payment batch, including Social Security -- April 3 2 million ($5 billion) 2 million ($5 billion) Not disclosed Not disclosed Not disclosed 4th payment batch, including first plus-up payment -- April 7 24 million ($33 billion) 1 million ($3 billion) Not disclosed 3.1 million 1 million ($2 million) 5th payment batch, including nonfiler veterans -- April 14 1.2 million ($2 billion) 800,000 ($1.4 billion) Not disclosed Not disclosed 700,000 ($1.2 billion) 6th payment batch -- April 21 900,000 ($1.5 billion) 1.1 million ($1.8 billion) Not disclosed Not disclosed 700,000 ($1.2 billion) 7th payment batch -- April 28 1.1 million ($2.5 billion) 850,000 ($1.8 billion) Not disclosed Not disclosed 730,000 ($1.3 billion) 8th payment batch -- May 5 600,000 ($1.1 billion) 500,000 ($900 million) Not disclosed Not disclosed 570,000 ($1 billion)\n\nKeep that Biden stimulus letter from the IRS\n\n\n\nHold on to that letter the IRS is sending you from Biden that confirms your stimulus payment, including the amount. That IRS letter -- officially called Notice 1444-C -- is your proof the IRS sent a payment in case you don't actually receive it or if you received less than you qualify for and need to claim the missing amount later. Here's more on what to do with that IRS letter.\n\nNow playing: Watch this: Stimulus plus-up payments: What you need to know\n\nThe IRS may owe you money from the first and second stimulus checks\n\n\n\nPlus-up payments are going out weekly along with the third round of checks, but they may not be the only money you're due. For money missing from the first two checks, you need to claim that on your 2020 taxes. You have until Tax Day to do that, which in 2021 is May 17. We suggest making sure you also know where to find your adjusted gross income. Tax nonfilers may need to be proactive about claiming a new dependent, too.\n\nNow playing: Watch this: Stimulus check 3: How much money you'll get\n\nWhat if you have a problem with your stimulus payment? Start here to see an update on its status\n\n\n\nThe IRS doesn't want you to call if you have any issue with the delivery or amount of your stimulus check. So what to do instead? Our guide walks you through how to report stimulus check problems, including checks that never arrived (try filing a payment trace), direct deposit payments that go to the wrong account and other issues.\n\nDid you get less money than you expected in your check?\n\nThe IRS isn't particularly big on communicating how much money it calculates for your stimulus check. You won't find that figure in the agency's online tracking tool, but you will see it in the confirmation letter you'll receive in the mail. (And here's why you got the payment size you did.)\n\nSo what happens if you use our stimulus check calculator and notice the numbers seem way off, or the IRS letter quotes an amount you didn't receive? Start by triple-checking your qualifications to make sure you're eligible for the total you expect. Remember the IRS is automatically sending plus-up payments and that happens after the agency receives your 2020 tax return. If you had a baby or added a dependent in 2020, you won't need to file an amended tax form to claim the supplement.\n\nThe IRS could open up claims for missing stimulus money before its Dec. 31 deadline to stop sending checks. If not, you might have to wait a year to claim it -- when you file your 2021 taxes in 2022 (even if you're a nonfiler who isn't typically required to file taxes).\n\nWhy your stimulus money may not have arrived\n\nAlso, here's what to know if the IRS sent a letter confirming it sent your stimulus payment, but the money never arrived. Here's more information on problems you might encounter with your stimulus check.\n\nStimulus check delivery start and end dates First direct deposits made March 17 (official) First paper checks sent Week of March 15 First EIP cards sent Week of March 22 First Social Security, SSI, SSDI payment sent Weekend of April 3, most arriving April 7 First plus-up payments Weekend of April 3 VA benefits for veteran nonfilers Week of April 14 IRS deadline to finish sending checks Dec. 31, 2021 (mandated by the bill) Last date to receive a check January 2022 (if mailed checks sent late December) Final claims for missing stimulus money 2021 tax season likely (in 2022)\n\nYour 2020 tax return really does make a big difference in your payment total\n\n\n\nTaxes are due May 17. So how will the IRS figure out how much it owes you? It will calculate your total (you can also do that here) based on the most recent tax filing it's processed at the time it's ready to tabulate the amount of your stimulus check.\n\nIf you know your tax return was already processed, your total will likely be based on your 2020 adjusted gross income, not on your 2019 AGI. That presents complications if the difference between the two years disqualifies you from getting a third stimulus check.\n\nOn the flip side, if the IRS uses your 2019 taxes and you're owed more money based on your 2020 AGI and dependents, you could get a plus-up payment. If you got more money than you're owed, you'll only need to return it to the IRS in some cases.\n\nSarah Tew/CNET\n\nStimulus check details for Social Security SSI and SSDI recipients and for veterans\n\n\n\nVeterans receiving VA benefits and people who get SSDI and SSI benefits are now receiving stimulus checks from the IRS and Treasury. Delivery details should now be available in the Get My Payment tool.\n\nYou might get your stimulus money by direct deposit to existing Direct Express cards if this is how you normally receive benefits, and if you didn't file taxes in 2019 or 2020. Otherwise, the money could come in the mail (here's what to look for so you know it's legit). The SSA says that Social Security beneficiaries like SSI and SSDI groups will not receive an EIP debit card.\n\nIf you're a tax nonfiler and you used the IRS' Non-Filers tool by November 2020 to submit information, you may have already received your check before other Social Security recipients.\n\nSarah Tew/CNET\n\nThere's more: Extra rules and exceptions to know\n\n\n\nStimulus checks aren't necessarily a one-size-fits-all situation. Here are guides for:\n\nAnd here's everything you need to know about the third stimulus check, how to calculate your stimulus total and every way the stimulus law can bring you more money.",
    "Title": "Stimulus check: Plus-up payment status, IRS schedule deadline, more to know     - CNET"
  }
]