[
  {
    "Date": "Thu, 06 May 2021 10:06:48+5:30 ",
    "Description": "Harris, 56, is the first woman, the first Black American, and the first South Asian American to be elected US Vice President.India is currently dealing with a raging second of coronavirus ",
    "Image": "https://images.livemint.com/img/2021/05/06/600x338/2021-05-05T214902Z_1517334193_RC2X9N9B93T0_RTRMADP_3_USA-HARRIS-MEXICO-GUATEMALA_1620275515950_1620275554526.JPG",
    "Link": "https://www.livemint.com/news/world/us-vice-president-kamala-harris-to-deliver-message-of-solidarity-with-india-tomorrow-11620274836943.html",
    "Text": "Vice President Kamala Harris on Friday will deliver a message of solidarity with the people of India, as the US partners with the country to save lives and hasten the end of the coronavirus pandemic, the State Department has said.\n\nHarris is slated to deliver her address at the top of an online event “Bolstering US Covid Relief Efforts in India: Perspectives from the Diaspora\" organised by the State Department.\n\nHarris, 56, is the first woman, the first Black American, and the first South Asian American to be elected US Vice President.\n\n“Kamala Harris will provide an opening message on US solidarity with the people of India as we partner to save lives & hasten the end of the pandemic,\" the South and Central Asia Bureau of the State Department announced on Wednesday.\n\nThe event on Friday noon local time will be hosted by Ervin Massinga, senior advisor in the South and Central Asia Bureau of the State Department.\n\nMassinga will provide an overview of the US government's relief efforts and panelists will discuss commercial and civil society-led efforts to address the current emergency, what support will be needed to re-open India after the second wave, and how they can align efforts to bring the two countries closer together moving forward.\n\nHarris’s remarks would be followed by a panel discussion featuring diaspora leaders including Virginia State Senator Ghazala Hashmi; Lata Krishnan from American Indian Foundation; Indiaspora founder M R Rangaswami and Gunisha Kaur, Assistant Professor at Weill Cornell Medicine, Medical Director, Weill Cornell Center for Human Rights.\n\nThis story has been published from a wire agency feed without modifications to the text. Only the headline has been changed.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter.",
    "Title": "US Vice President Kamala Harris to deliver message of solidarity with India tomorrow"
  },
  {
    "Date": "Thu, 06 May 2021 11:18:23+5:30 ",
    "Description": "Earlier on April 29, an earthquake of magnitude 3.6 on the Richter scale had struck Assam's Sonitpur",
    "Image": "https://images.livemint.com/img/2021/05/06/600x338/AFP_98W2AZ_1620280050147_1620280070148.jpg",
    "Link": "https://www.livemint.com/news/india/36-magnitude-earthquake-hit-assam-s-tezpur-11620279676561.html",
    "Text": "An earthquake of magnitude 3.6 on the Richter scale occurred at 10.30 am near Assam's Tezpur, said the National Centre for Seismology.\n\nEarlier on April 29, an earthquake of magnitude 3.6 on the Richter scale had struck Assam's Sonitpur . This was the seventh tremor after the earthquake of 6.4 magnitude on the Richter scale struck Assam's Sonitpur on 28 April.\n\nOn 28 April, around 10 earthquakes had hit the Sonitpur throughout the day. According to NCS, the area is seismically very active falling in the highest Seismic Hazard zone V associated with collisional tectonics where Indian plate subducts beneath the Eurasian Plate.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter.",
    "Title": "3.6 magnitude earthquake hit Assam's Tezpur"
  },
  {
    "Date": "Thu, 06 May 2021 10:24:20+5:30 ",
    "Description": "'Do not travel to India due to COVID-19. Exercise increased caution due to crime and terrorism,' the State Department said on Wednesday in its latest travel advisory ",
    "Image": "https://images.livemint.com/img/2021/05/06/600x338/848eb45237bd4707aeb0151545cbccc7-848eb45237bd4707aeb0151545cbccc7-1_1617761123564_1620276836446.jpg",
    "Link": "https://www.livemint.com/news/india/do-not-travel-to-india-due-to-covid-19-us-reissues-travel-advisory-11620276655915.html",
    "Text": "Washington: The US has reissued its travel advisory on India, urging its citizens not to travel to the country due to an unprecedented surge in the COVID-19 cases there.\n\nIndia is struggling with a second wave of the pandemic with more than 3,00,000 daily new coronavirus cases being reported in the past few days, and hospitals are reeling under a shortage of medical oxygen and beds.\n\n“Do not travel to India due to COVID-19. Exercise increased caution due to crime and terrorism,\" the State Department said on Wednesday in its latest travel advisory that looked identical to the one issued on April 28.\n\nBoth the travel advisory has been marked 'Level 4' which is the highest warning level.\n\nOn April 28, the Department approved the voluntary departure of family members of US government employees.\n\nOn May 5, the Department approved the voluntary departure of non-emergency US government employees.\n\n“US citizens who wish to depart India should take advantage of available commercial transportation options,\" it said.\n\nLast week, the Centers for Disease Control and Prevention (CDC) issued a Level 4 Travel Health Notice for India due to COVID-19, indicating a very high level of COVID-19 in the country.\n\nA record 3,780 fresh COVID-19 fatalities were registered in a single day in India taking the death toll to 2,26,188, while 3,82,315 new coronavirus infections were recorded, according to the Union Health Ministry data updated on Wednesday. With the fresh cases, the total tally of COVID-19 cases in the country climbed to 2,06,65,148.\n\nThis story has been published from a wire agency feed without modifications to the text. Only the headline has been changed.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter.",
    "Title": "'Do not travel to India due to Covid-19': US reissues travel advisory"
  },
  {
    "Date": "Thu, 06 May 2021 08:42:43+5:30 ",
    "Description": "While the petrol rate was increased by 25 paise in Delhi, diesel rate increased by 20 paise. As a result, petrol is retailing at  ₹90.99 per litre in the national capital and diesel at 81.42",
    "Image": "https://images.livemint.com/img/2021/05/06/600x338/371510305_0-12_1620270520392_1620270698401.jpg",
    "Link": "https://www.livemint.com/news/india/petrol-diesel-prices-raised-again-check-latest-rates-in-metro-cities-11620269386249.html",
    "Text": "The prices of petrol and diesel were hiked for the third day in a row on Thursday as state-owned fuel retailers resumed daily rate revision after a more than two-week-long hiatus.\n\nWhile the petrol rate was increased by 25 paise in Delhi, diesel rate increased by 20 paise. As a result, petrol is retailing at ₹90.99 per litre in the national capital and diesel at 81.42.\n\nIn Mumbai, the prices of petrol and diesel have reached ₹97.34 and ₹88.49, respectively. Chennai residents on Thursday will be able to get petrol at ₹92.90 and diesel at ₹86.35. Kolkata is seeing the fuels priced at ₹91.14 and ₹84.26.\n\nRates have been increased across the country and vary from state to state depending on the local incidence of taxation (VAT).\n\nOil companies had on Tuesday resumed daily price revision in line with cost after ending an 18-day hiatus. Prices were on Tuesday hiked by 15 paise per litre for petrol and 18 paise on diesel.\n\nIn two days, more than half of the 67 paise a litre reduction in petrol and 74 paise per litre cut in diesel prices effected between 24 March and 15 April, was wiped out.\n\nOil companies that have in recent months resorted to an unexplained freeze in rate revision, had hit a pause button after cutting prices marginally on 15 April. This coincided with electioneering hitting a peak to elect new governments in five states, including West Bengal.\n\nNo sooner had voting ended, the oil companies indicated an impending increase in retail prices in view of the firming trend in international oil markets.\n\nDespite the concerns about rising Covid-19 cases in India denting demand, crude oil prices in the international market have risen primarily on account of strong US demand recovery and a weak dollar.\n\nState-owned fuel retailers, IOC, BPCL and HPCL that are supposed to revise rates daily based on input cost, had raised petrol price by ₹21.58 per litre and diesel by ₹19.18 a litre since the government raised excise duty in March last year.\n\nCentral and state taxes make up for 60% of the retail selling price of petrol and over 54% of diesel. The union government levies ₹32.90 per litre of excise duty on petrol and ₹31.80 on diesel.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter.",
    "Title": "Petrol, diesel prices raised again. Check latest rates in metro cities"
  },
  {
    "Date": "Thu, 06 May 2021 00:17:28+5:30 ",
    "Description": "Apex court deals a blow to the authority of state governments in identifying backward classes",
    "Image": "https://images.livemint.com/img/2021/05/05/600x338/ed596266-adc3-11eb-84cc-e50dee918442_1620240332062_1620240377705.jpg",
    "Link": "https://www.livemint.com/news/india/sc-nixes-maratha-quota-law-says-no-to-review-of-50-cap-11620240333407.html",
    "Text": "Reservation beyond 50% will create a society “based on caste rule\", the Supreme Court held on Wednesday as it quashed a 2018 Maharashtra law for reservation to Marathas in jobs and educational institutions, while also refusing to consider scrapping of the 50% ceiling.\n\nThe SC also dealt a severe blow to the authority of state governments in identifying backward classes by ruling that after the 2018 amendment in the Constitution, only the central government could notify socially and educationally backward classes (SEBCs).\n\nThe interpretation of the 102nd constitutional amendment may impinge severely on the power of states to provide reservation benefits after separately identifying backward classes.\n\nThe judgment was delivered on a clutch of petitions on the validity of the Maratha quota law, which had breached the 50% limit for reservations.\n\nThe bench, comprising justices Ashok Bhushan, L. Nageswara Rao, S. Abdul Nazeer, Hemant Gupta and S. Ravindra Bhat, was unanimous in declaring the Maratha quota law “unsustainable\" and in affirming that the 50% ceiling on the total reservation was inviolable.\n\nHowever, the ruling on depriving states of the power to identify SEBCs was on a majority of 3-2, with justices Bhushan and Nazeer saying that states could still have their own list of SEBCs.\n\nThe bench underlined that the 50% upper limit as fixed by a nine-judge bench in the Indra Sawhney case (known as the Mandal Commission case) in 1992 follows principles of reasonability and equality and unanimously said “to change the 50% limit is to have a society which is not founded on equality but based on caste rule\".\n\n“If the reservation goes above the 50% limit, which is reasonable, it will be a slippery slope. The cap is to achieve the principle of equality and with the object to strike a balance which cannot be said to be arbitrary or unreasonable,\" asserted the court.\n\nIt rejected a plea made jointly by several states such as Maharashtra, Karnataka, Bihar, Tamil Nadu, Punjab, Rajasthan and Andhra Pradesh that opposed any upper limit on the reservation and sought a reconsideration of the 1992 verdict to enable them to extend the quota beyond 50% in view of the change in times.\n\n“There can be no quarrel that society changes, law changes, people change. But that does not mean that something which is good and proven to be beneficial in maintaining equality in the society should also be changed in the name of change alone,\" said the bench, rejecting the requests by the state governments to refer the case to a larger bench for reviewing the 1992 verdict.\n\nThe SC highlighted that India has been independent for 73 years, during which quota benefits were granted as affirmative measures to bring equality in the society and maintained that reservation in public services was not the only means and method for improving the welfare of backward classes.\n\n“The state ought to bring other measures, including providing educational facilities to the members of the backward class free of cost, giving concession in fee, providing opportunities for skill development to enable the candidates from the backward class to be self-reliant,\" it told the states.\n\nAbout the 2018 law for reservation to Marathas, the apex court bench lamented that the state government opted to give reservation to a class that was “socially dominant\", “politically dominant\" and “in the mainstream of national life\" and, thus, there was no justification to breach the 50% ceiling for a class that also had adequate representation in public employment.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter.",
    "Title": "SC nixes Maratha quota law; says no to review of 50% cap"
  },
  {
    "Date": "Thu, 06 May 2021 10:37:30+5:30 ",
    "Description": "Petrol and diesel were retailing at Rs90.99 per litre and Rs81.42 per litre respectively on Thursday in Delhi at state run Indian Oil Corporation Ltd’s outlets",
    "Image": "https://images.livemint.com/img/2021/05/06/600x338/petrol_diesel_price_today-kBTF--621x414@LiveMint_1620277413782.JPG",
    "Link": "https://www.livemint.com/news/india/petrol-and-diesel-prices-raised-for-third-consecutive-day-11620276551915.html",
    "Text": "NEW DELHI : State-owned oil marketing companies (OMCs) raised petrol and diesel prices on Thursday. The transportation fuel prices were increased third day in a row, after the results were declared for the assembly elections in West Bengal, Assam, Kerala, Tamil Nadu, and Puducherry.\n\nPetrol and diesel prices were raised by 25 paise per litre and 30 paise per litre respectively in the national capital. As a result, petrol and diesel were retailing at Rs90.99 per litre and Rs81.42 per litre respectively on Thursday in Delhi at state run Indian Oil Corporation Ltd’s outlets.\n\nThis comes against the backdrop of a second wave of covid-19 pandemic raging across India, a major energy consumer.\n\n“Firmer fundamentals are expected beginning in May with sequential demand increases. Oil supply growth is expected to lag demand growth with ongoing Opec restraint (on 27 April, Opec+ decided to maintain its production plan from 1 April). That will require stock draws to cover which are expected to be substantial in May through August,\" said Richard Joswick, global head of oil pricing, operations and trade flow analytics, S&P Global Platts in a statement.\n\n“Platts has tempered its price forecasts accordingly but still expects the next drive for higher prices will likely lead the fundamentals with peaks around mid-year over $70/b,\" he added in the statement.\n\nThe cost of the Indian basket of crude, which comprises Oman, Dubai and Brent crude, was at $68.35 a barrel on 5 May. Following the covid outbreak, crude prices for Indian basket of crude had plunged to $19.90 in April last year before recovering to $63.40 a barrel in April, data from the Petroleum Planning and Analysis Cell showed.\n\nInterestingly, the diesel and petrol retail prices in India have remained subdued during the elections, with three government-run oil marketing companies—Indian Oil Corp. Ltd (IOCL), Bharat Petroleum Corp. Ltd (BPCL) and Hindustan Petroleum Corp. Ltd (HPCL)—refraining from raising prices.\n\nThe state-run OMCs and the government have maintained that there is no correlation between elections and transportation fuel price freeze. The government’s stand has been that it has got no role in pricing since India’s three government-run OMCs introduced dynamic fuel pricing, joining countries such as the US and Australia, where fuel prices change daily depending on global oil price fluctuations.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter.",
    "Title": "Petrol and diesel prices raised for third consecutive day"
  },
  {
    "Date": "Thu, 06 May 2021 06:12:26+5:30 ",
    "Description": "Each practice cruise — they'll run two to seven days — must have enough passengers to meet at least 10% of the ship's capacity. Volunteers must be 18 or older and either fully vaccinated or free of medical conditions",
    "Image": "https://images.livemint.com/img/2021/05/06/600x338/c48ee913728a4a519ed414600d3a6578-c48ee913728a4a519ed414600d3a6578-0_1620261621507_1620261636465.jpg",
    "Link": "https://www.livemint.com/news/world/cdc-sets-rules-for-trial-cruises-with-volunteer-passengers-11620258242828.html",
    "Text": "Cruise lines can soon begin trial voyages in US waters with volunteer passengers helping test whether the ships can sail safely during a pandemic.\n\nThe Centers for Disease Control and Prevention gave ship operators final technical guidelines Wednesday for the trial runs. The CDC action is a step toward resuming cruises in US waters, possibly by July, for the first time since March 2020.\n\nA spokeswoman for the cruise industry's tour group said the group was reviewing the CDC instructions.\n\nEach practice cruise — they'll run two to seven days — must have enough passengers to meet at least 10% of the ship's capacity. Volunteers must be 18 or older and either fully vaccinated or free of medical conditions that would put them at high risk for severe Covid-19.\n\nThe ship operator must tell passengers that they are simulating untested safety measures \"and that sailing during a pandemic is an inherently risky activity,\" the CDC guidelines state.\n\nPassengers must be examined for Covid-19 symptoms before and after the trip, and at least 75% must be tested at the end.\n\nRestrictions on board will include face masks and social distancing. The CDC will allow guided shore excursions — no wandering about on their own — if tour operators follow certain standards.\n\nShips must make at least one practice run before resuming regular cruises in US waters, although operators will be able to avoid the requirement if they vouch that 98% of crew and 95% of passengers are vaccinated.\n\nThis story has been published from a wire agency feed without modifications to the text.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter.",
    "Title": "CDC sets rules for trial cruises with volunteer passengers"
  },
  {
    "Date": "Thu, 06 May 2021 06:25:27+5:30 ",
    "Description": "While almost a third of Americans have been fully vaccinated, Canada has inoculated only 3% of its almost 38 million people, though more than 34% have received a first dose",
    "Image": "https://images.livemint.com/img/2021/05/06/600x338/2021-05-05T181808Z_30910212_RC2U9N9BQDTI_RTRMADP_3_HEALTH-CORONAVIRUS-CANADA_1620261298371_1620262420233.JPG",
    "Link": "https://www.livemint.com/news/world/covid-vaccine-tourism-canadians-fly-south-for-shot-as-us-demand-falls-11620259232512.html",
    "Text": "With COVID-19 vaccine demand declining in the United States, some Canadians facing third-wave lockdowns are flying south to get inoculated, perhaps months earlier than they would be able to at home.\n\nJimmy Simmons, 37, saw friends in their 40s struggling to get a shot in the hard-hit Canadian province of Ontario. The Toronto businessman decided to spend a few weeks in New York City to meet clients and get vaccinated. He got his first of two shots on Tuesday.\n\nSimmons, who works in real estate, is not yet eligible for a vaccine in Ontario. His girlfriend, a medical student who treats COVID-19 patients at Toronto's Hospital for Sick Children, has still only received one dose, he said.\n\n\"I want this (pandemic) to end, and in order for this end I need to get vaccinated,\" Simmons said. \"Just sitting at home in Ontario isn't going to change anything.\"\n\nWhile almost a third of Americans have been fully vaccinated, Canada has inoculated only 3% of its almost 38 million people, though more than 34% have received a first dose.\n\nCanada is allowing for a four-month gap between doses, while Americans are getting their second shots three or four weeks after the first to reach optimal protection much sooner.\n\nThe U.S vaccination campaign has reached a tipping point, with supply outstripping demand due to a combination of factors including skepticism about the vaccines. The number of Americans seeking vaccines dropped by a third in recent weeks, according to the U.S. Centers for Disease Control and Prevention.\n\nThat is encouraging Canadians to cross the border and tap into this oversupply without paying any fee, which means the U.S. government is paying for foreign travelers to get their COVID-19 shots. The White House declined to comment.\n\nSimmons and others had little trouble getting vaccinated at no charge in the United States, where the government is now practically begging people to get the shots and several states do not require proof of residency.\n\nThe trick was to fly because land crossing has been closed to non-essential traffic since March of 2020.\n\nU.S. President Joe Biden on Tuesday urged those who are hesitant to get a COVID-19 vaccine, saying it was a matter of \"life or death.\"\n\nEveryone age 16 or older can get vaccinated in the United States, while in Ontario, most adults 18 and up will not be eligible for a first dose until May 24.\n\n'REALLY EASY'\n\nCanadian Prime Minister Justin Trudeau has said everyone who wants to can be fully vaccinated by the end of September. Andrew D'Amours, 31, of Quebec City, said that could mean \"another half pandemic\" without getting inoculated.\n\nHe flew to Dallas and got vaccinated on April 10. With his business partner at the Flytrippers https://flytrippers.com travel website, D'Amours booked an appointment for the one-dose Johnson & Johnson vaccine online.\n\n\"It took a couple clicks. We got an appointment in a grocery store pharmacy and we booked flights for the next day, Friday, and on Saturday morning we were vaccinated,\" D'Amours said.\n\nWhile D'Amours used hotel and flight points, he estimated a weekend trip to Dallas - if two people share costs - could be as low as C$750 ($611) each. He flew directly from Montreal.\n\nDavid, 37, an executive from Ontario, said he and his girlfriend got vaccinated without appointments at the Ellis Davis Field House site in Dallas, after showing a Texas hotel address.\n\nWhen the couple went back for their second shot, \"there was no one there,\" he said. \"It's immoral that they may be throwing shots out while people are dying of COVID,\" he said.\n\nAmericans have been sharing vaccines with Canadians in other ways. Truck drivers from Manitoba and Saskatchewan are receiving jabs in North Dakota, while Alaska's governor has offered surplus shots to a neighboring Canadian town to help reopen the border sooner.\n\nWhile it is not known how many Canadians are traveling for U.S. vaccines, several people on Simmons' packed flight to New York told him they would get inoculated, and D'Amours has fielded several queries from others interested in doing so.\n\nCanada still discourages foreign travel and requires a 14-day quarantine and testing upon re-entry. D'Amours said it still may be worth it.\n\n\"If you want to travel, if you want to be fully vaccinated, and you're able to go and you're going to do it safely, it is really easy,\" he said.\n\nThis story has been published from a wire agency feed without modifications to the text. Only the headline has been changed.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter.",
    "Title": "Covid vaccine tourism: Canadians fly south for shot as US demand falls"
  },
  {
    "Date": "Thu, 06 May 2021 06:32:02+5:30 ",
    "Description": "With active cases climbing to 34.87 lakh in India, the top scientific officer said it was not expected that the second wave would hit the country with such ferocity",
    "Image": "https://images.livemint.com/img/2021/05/06/600x338/20210505_MUM-SB-MN_Lockdown_002_1620262842779_1620262857192.jpg",
    "Link": "https://www.livemint.com/news/india/third-covidwave-inevitable-should-be-prepared-govt-s-scientific-advisor-11620259609728.html",
    "Text": "As the virus mutates further, a third wave of Covid infection is inevitable and it is necessary to be prepared for new waves, the government's Principal Scientific Advisor K VijayRaghavan cautioned on Wednesday.\n\nWith active cases climbing to 34.87 lakh in India, the top scientific officer said it was not expected that the second wave would hit the country with such ferocity.\n\n\"Phase three is inevitable given the higher levels of circulating virus, but it is not clear on what time-scale this phase three will occur. We should be prepared for new waves,\" he said.\n\nVijayRaghavan said although vaccines are efficacious against new mutations like the UK one and the double mutant, surveillance and vaccine updates are needed as the virus mutates further.\n\nThe virus has now adopted a “hit and run lifestyle\". Also, a combination of less cautionary measures and low immunity in the population from the first wave is driving the second wave, which has killed thousands and infected lakhs of people across the country.\n\nMany factors contributed to this second wave and variants are one of the factors, he said.\n\nThe first wave peaked in September last year and cases started falling substantially. The first wave declined because of two factors, he said.\n\n\"As infections rose, so did immunity among those infected. A combination of the standing level of immunity in the population and cautionary steps halted the spread of the first wave,\" he said.\n\nBut as the cautionary steps declined, new opportunities for infection arose and the level of immunity among the population is often not enough to stop the infection spread.\n\n\"Many people get infected until they reach a new immunity threshold. Such a second wave is typically smaller than the first. Such a second wave was expected. However, multiple parameters can change and add up to the second wave, much larger than the first.\n\n\"(But) Such a larger second wave with the ferocity we are seeing was not predicted,\" he said.\n\nA study conducted by the Institute of Genomics and Integrative Biology (IGIB) suggested that the recurrence of the coronavirus outbreak in March could have been due to the lack of \"meaningful antibodies\" in seropositive people after a peak in September last year.\n\nElaborating on the evolution of SARS-CoV2 and its increasing lethality, VijayRaghavan said the virus emerged in 2019 in Wuhan and at that time it was a generalist that could infect many mammal species.\n\nThe first phase saw two mutations every month, he said.\n\nHowever, the second phase which started in October 2020 saw dramatic changes and new variants like the UK variant coming to the fore.\n\n\"In early 2021, a very large number of people all over the world had been infected. As the immunity increases, the virus does not have the opportunity to grow,\" he said.\n\n\"But it sees that there are pockets it can go through and therefore it evolves for better transmission,\" he added\n\nEarlier, the virus-infected people were largely asymptomatic and many symptomatic and it had a certain profile of progression.\n\n“Now it has adopted, due to fewer people available, a hit and run lifestyle. And this is what is happening with the new variants coming,\" he said.\n\nVijayRaghavan said that distancing can exponentially bring down the spread.\n\n\"The virus can only go from human to human,\" he said, stressing on following Covid- appropriate behaviour.\n\nDuring the briefing, Lav Agarwal, the joint secretary in the Health Ministry, said 12 states, including Maharashtra, Karnataka, Kerala and Uttar Pradesh, have more than one lakh active Covid cases.\n\nKarnataka, Kerala, Tamil Nadu, West Bengal, Rajasthan and Bihar are among the states that show an increasing trend in daily cases, he said.\n\nAgarwal added that 24 states and UTs have more than 15 percent Covid positivity rate. Thirty districts are showing a continued rise in coronavirus cases since the last two weeks of which 10 are in Kerala, seven in Andhra Pradesh, three in Karnataka and one in Tamil Nadu, he added.\n\nA record 3,780 fresh Covid-19 fatalities were registered in a single day in India taking the death toll to 2,26,188, while 3,82,315 new coronavirus infections were recorded, according to the Union Health Ministry data updated on Wednesday.\n\nWith the fresh cases, the total tally of Covid-19 cases in the country climbed to 2,06,65,148.\n\nRegistering a steady increase, the active cases have increased to 34,87,229 comprising 16.87 per cent of the total infections, while the national Covid-19 recovery rate was recorded at 82.03 per cent, the data updated at 8 am showed.\n\nVK Paul, Member (Health) NITI Aayog, appealed to the \"physicians' fraternity'' to come forward and provide teleconsultations to people and families at home who are infected with the coronavirus.\n\n\"The response to the changing virus remains the same. We need to follow Covid-appropriate behaviour such as masking, distancing, hygiene, no unnecessary meetings and staying at home,\" he said.\n\nHe said personal behaviour (masks, distancing and hygiene), vaccination and tracking, and containment are three pillars that stop the chain of virus transmission.\n\n“They are the same for the Wuhan virus and they are the same for the B.1.1.7 or B.1.617,\" Paul said.\n\nIn a reply to a question, Paul said the disease is not spreading through animals and it's human to human transmission.\n\nOn vaccination, Agarwal said the total doses administered till now was 16.05 crore.\n\nWhile 12.31 crore people above the age of 45 years have been vaccinated, the number is at 1.58 crore among healthcare workers.\n\nAround 2.09 crore frontline workers have also been vaccinated, while 6.71 lakh people between 18 years to 44 years have got their jabs so far, he added.\n\nIn response to another question, Agarwal said that foreign aid is being monitored by a group of senior officials.\n\n\"Our technical wing has made guidelines to see what hospital the equipment would be suitable for. The equipment is being sent to hospitals where an immediate need has been felt,\" he said.\n\nThis story has been published from a wire agency feed without modifications to the text. Only the headline has been changed.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter.\n\nNever miss a story! Stay connected and informed with Mint. Download our App Now!!",
    "Title": "Third Covidwave inevitable, should be prepared: Govt's scientific advisor"
  },
  {
    "Date": "Thu, 06 May 2021 10:39:51+5:30 ",
    "Description": "Those requiring oxygen can apply with a valid photo id, Aadhar card details, Covid positive report and other documents like CT scan report if available on delhi.gov.in",
    "Image": "https://images.livemint.com/img/2021/05/06/600x338/AFP_99D2XR_1620277679107_1620277697718.jpg",
    "Link": "https://www.livemint.com/news/india/delhi-covid-19-patients-in-home-isolation-can-now-apply-online-to-get-oxygen-11620277116515.html",
    "Text": "As caretakers of patients scramble to get oxygen in the national capital, the Delhi government has set up a web portal to supply life-saving gas to those in home isolation after being infected with the coronavirus.\n\nThe portal -- delhi.gov.in -- will go live on Thursday. Those requiring oxygen can apply with a valid photo id, Aadhar card details, Covid positive report and other documents like CT scan report if available, an order by the Delhi government read.\n\nView Full Image Delhi govt order\n\nDistrict magistrates have been given the responsibility to identify \"dedicated dealers/depots to distribute such cylinders to individuals who shall not be redirected to refilling plants under any circumstances\".\n\n\"The district magistrates shall ensure that adequate number of office personnel are assigned to scrutinise all incoming applications and issue e-passes quickly as time is of essence in such cases,\" the order read.\n\n“This may be accorded top priority. The DMs shall ensure that the dealers regularly get their cylinders refilled from the designated refilling plants,\" it added.\n\nBased on the stock availability, the district magistrates will issue a pass having the date, time and address of the dealer/depot from where the oxygen cylinder can be issued/exchanged.\n\nThe order said a provision of lump-sum allocation of oxygen (to be given through cylinders) for individuals, non-Covid hospitals, nursing homes , ambulances and SOS cylinders of Covid hospitals running on LMO had already been made against re-fillers with each district being assigned a re-filler.\n\n\"However, reports are being received of long queues at cylinder refilling plants also leading to public safety and public health hazard issues,\" it said.\n\nThis portal has been created \"to streamline the entire system of distribution of the lump-sum allocation under the supervision of district magistrates and also in order to facilitate the public to access these cylinders with certainty\", the order said.\n\nOxygen pool\n\nAmid an uproar, the administration in the national capital is taking several steps to ensure oxygen supply to those in need.\n\nA common pool of oxygen cylinders is being created in every district for patients in home isolation and to meet the emergency needs of the city’s hospitals.\n\nIn each district, a bus depot of Delhi Transport Corporation (DTC) will serve as the hub that will be initially stocked with 20 oxygen cylinders, said a transport department order.\n\nConcerned district magistrates will be responsible for the judicious use of the cylinders through distribution among Covid patients in home isolation and hospitals having urgent requirement of oxygen.\n\nThe DTC has deployed its buses to ferry oxygen cylinders to hospitals having emergency requirements.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter.",
    "Title": "Delhi Covid-19 patients in home isolation can now apply online to get oxygen"
  },
  {
    "Date": "Thu, 06 May 2021 00:01:38+5:30 ",
    "Description": "The bench of justices Dhananjaya Y. Chandrachud and M.R. Shah also stayed the contempt proceedings initiated by the Delhi high court against the Centre on Tuesday over the shortage in oxygen supply",
    "Image": "https://images.livemint.com/img/2021/05/05/600x338/7d90dce8-adc8-11eb-84cc-e50dee918442_1620239371627_1620239416357.jpg",
    "Link": "https://www.livemint.com/news/india/sc-orders-centre-to-present-oxygen-plan-11620239372315.html",
    "Text": "Describing the situation in the national capital as “really critical\", the Supreme Court on Wednesday directed the central government to ensure that Delhi receives 700 tonnes of medical oxygen supplies every day and asked for a detailed plan on how it intends to do so.\n\nThe bench of justices Dhananjaya Y. Chandrachud and M.R. Shah also stayed the contempt proceedings initiated by the Delhi high court against the Centre on Tuesday over the shortage in oxygen supply. But the apex court clarified that it is conditioned on the Union government’s admission that the court order of 2 May required the Centre to supply 700 metric tonnes of oxygen to Delhi until further orders.\n\nIntroducing a personal element to the hearing, the court said even judges feel “helpless\" as people plead for help due to the shortage of oxygen, hospital beds and essential medicines in the national capital.\n\n“We are not only judges but also citizens of this country. Justice Shah and I have been continuously on the phone trying to come up with some solution by using our good offices. But we are also helpless. So, we can understand what a common man and citizens feel. We are ultimately answerable to the people,\" the bench told solicitor general Tushar Mehta, who represented the Centre.\n\nThe court shot down a suggestion by Mehta to not insist on 700 tonnes for Delhi while the Centre tries to supply as much as possible.\n\n“We can’t accept this as an institutional response. The situation of Delhi is really critical. We are answerable to the citizens, and we know with 550 tonnes (the amount that reached Delhi on Tuesday) what is happening on the ground. Our friendships are limited because of our positions, but our offices are getting numerous calls, and the lawyers and others are crying. They plead, ‘please do something’. When 550 tonnes is not solving the problem of Delhi, we cannot review our orders... there is tremendous anxiety on the part of the citizens to run from pillar to post for oxygen and cylinders,\" the court told Mehta.\n\nMehta, on his part, pressed for an audit to figure out Delhi’s real requirement and optimal utilization of medical oxygen before determining the final number. The bench accepted the suggestion for an audit and asked the Centre and Delhi government to suggest some names by Thursday morning for a panel that would examine this. But it made it clear that the 2 May order for 700 tonnes shall remain in force unless it is modified.\n\nThe oxygen crisis in the Capital has been ascribed to a lower allocation by the Centre despite demands from the Delhi government for an increased oxygen quota and the Delhi government’s failure to arrange for cryogenic tankers and trucks to transport the allocated oxygen.\n\n“Nobody can dispute it is a national disaster. Nobody can dispute there is a deficit of oxygen. Nobody can dispute some people have lost lives due to a shortage of oxygen. So, now let us ensure lives are saved. We want you to ensure 700 tonnes is given between today and Monday (when the special bench takes up the matter initiated on its own) so that it takes the sting off the immediate humanitarian crisis in Delhi,\" it said.\n\nThe bench asked Mehta to submit a tabulated statement by 10.30am on Thursday, indicating the manner in which its order is complied with and the details on sources of supply, transportation and other logistical arrangements. “This plan will remain in operation till further orders of the court,\" it ordered.\n\nAbout the contempt proceedings initiated by the Delhi high court on Tuesday, the bench expressed displeasure with the Centre’s law officers trying to misinterpret the Supreme Court’s order on 700 tonnes to wriggle out of the liability.\n\n“Why did your additional solicitors general (ASG) tell the high court we didn’t order for 700 tonnes? The problem is when your law officers argue like this, and then you get into a crossfire. Tell your ASGs not to misinterpret orders...Hauling up anyone in contempt will not get anybody oxygen in the country. We want the oxygen to come,\" it told Mehta.\n\nThe court also asked the officials of the Centre and Delhi government to have a meeting on Wednesday evening for deliberation on the supply and distribution of oxygen and examine the “Mumbai model\" of optimal utilization of oxygen.\n\nThe solicitor general cited the “Mumbai model\", pointing out that despite having a caseload of 92,000 as of 10 April, Mumbai made do with just 275 tonnes of oxygen. The city also made arrangements for buffer storage for imminent requirements. The court said that the Delhi government should consider replicating this model for the national capital.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter.",
    "Title": "SC orders Centre to present  oxygen  plan"
  },
  {
    "Date": "Thu, 06 May 2021 07:45:35+5:30 ",
    "Description": "Out of the 151 Nepalese doctors training at AIIMS in New Delhi, PGI in Chandigarh and JIPMER Puducherry, 65 working at AIIMS are yet to receive their salaries",
    "Image": "https://images.livemint.com/img/2021/05/06/600x338/AIIMS5-kPNB--621x414@LiveMint_1620267247567.jpg",
    "Link": "https://www.livemint.com/news/india/not-a-single-penny-aiims-rda-says-65-foreign-national-doctors-unpaid-for-a-year-11620264559076.html",
    "Text": "As many as 65 foreign nationals, including those from Nepal, training at the All India Institute of Medical Sciences (AIIMS) have not received their salaries since last year, said the Resident Doctors Association (RDA) of the institute.\n\n\"All of these 65 foreign national Doctors in AIIMS New Delhi, over and above their regular clinical duties are also performing COVID duties since March 2020. They are performing such duties even by putting their own life,\" the RDA wrote to Prime Minister Narendra Modi.\n\n\"They are not being paid a single penny towards a stipend, despite explicit and clear directions in July 2018,\" they added.\n\nThe RDA was recalling a letter written in May of 2018 when PM Modi had assured the PM of Nepal that the matter regarding the release of stipend to Nepalese foreign national doctors would be looked into expeditiously by the Indian government.\n\nThey stated that the Ministry of External Affairs had inter-alia informed the MOHFW \"to ensure concrete progress with the directive of the Prime Minister by mid-September 2018\".\n\nOut of the 151 Nepalese doctors training at AIIMS in New Delhi, PGI in Chandigarh and JIPMER Puducherry, 65 working at AIIMS are yet to receive their salaries.\n\nThe letter also stated that not a single doctor, out of 65 working at AIIMS were distinguishable or severable in the eyes of law with the Nepalese doctors working in PGI Chandigarh and JIPMER.\n\n\"...Even undergraduate and intern Doctors are also being allowed honorarium. Whereas throughout the civilised world, it is not permissible to draw a distinction between the duties and responsibilities of a professionally trained doctor undergoing postgraduate training and interns,\" it added.\n\nThe RDA requested that the health minister or the Director of AIIMS be asked to release emoluments of the 65 doctors immediately.\n\nGovt responds to human resource dearth\n\nThis comes in the backdrop of the Union government postponing the National Eligibility-Cum-Entrance Test (postgraduate) while allowing central and state authorities to deploy candidates for Covid-19 duty.\n\nThis will make available a large number of qualified MBBS doctors for Covid duties, the government said. More than 1,60,000 MBBS doctors last year had taken the exam, seeking admission to various MD (Doctor of Medicine), MS (Master's in Surgery) and PG Diploma courses.\n\nThe government also decided to allow the deployment of Medical Interns in Covid Management duties under the supervision of their faculty, as part of the Internship rotation.\n\n\"The individuals providing services in Covid management will be given priority in forthcoming regular Government recruitments after they complete minimum of 100 days of Covid duty,\" the central government said.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter.",
    "Title": "'Not a single penny': AIIMS RDA says 65 foreign national doctors unpaid for a year"
  },
  {
    "Date": "Thu, 06 May 2021 08:46:57+5:30 ",
    "Description": "The World Health Organization (WHO) has said the B.1.617 variant of Covid-19, which was first found in India, has now been reported in more than a dozen countries",
    "Image": "https://images.livemint.com/img/2021/05/06/600x338/2021-05-04T090017Z_597121953_RC2X8N9I8TOW_RTRMADP_3_HEALTH-CORONAVIRUS-AFRICA-VACCINE_1620270983752_1620270996580.JPG",
    "Link": "https://www.livemint.com/news/world/indian-variant-of-coronavirus-detected-in-kenya-health-ministry-11620270585602.html",
    "Text": "A case of the Indian variant of the coronavirus has been detected in Kenya, the country's health ministry said Wednesday, a few days after it was also confirmed in neighbouring Uganda.\n\n\"This variant has been picked (up) in Kenya and because of global connectivity, it is just a question of time. You cannot be able to put barriers ... to prevent a virus from accessing your territory,\" said the ministry's director general, Dr Patrick Amoth.\n\nThe case was detected among samples taken from Indian travellers who were working in Kisumu, a city in western Kenya, he added. No further details were provided.\n\nThe World Health Organization (WHO) has said the B.1.617 variant of Covid-19, which was first found in India, has now been reported in more than a dozen countries.\n\nThe variant is feared to be contributing to a Covid catastrophe on the sub-continent, where more than 380,000 infections were reported on Wednesday as well as a record 3,780 deaths.\n\nBut the WHO has stopped short of saying the variant is more transmissible, deadlier or able to dodge vaccines.\n\nThe variant has also been detected in Uganda, where one case was found in a recent traveller from India.\n\nKenya, Uganda, Tanzania and Rwanda have all suspended flights to India.\n\nKenya has already confirmed the presence of the Covid-19 variants first detected in the UK and South Africa.\n\nUganda meanwhile says it has detected five Covid variants including those first identified in India, South Africa and Britain.\n\nKenya has recorded nearly 161,400 cases of coronavirus, of which 2,825 have been fatal, according to the latest government data, while Uganda has reported about 42,100 cases and 343 deaths.\n\n\n\n\n\nThis story has been published from a wire agency feed without modifications to the text. Only the headline has been changed.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter.",
    "Title": "Indian variant of coronavirus detected in Kenya: Health Ministry"
  },
  {
    "Date": "Thu, 06 May 2021 08:02:29+5:30 ",
    "Description": "In the past few months, the Indian Embassy had made a focused outreach on the need for equitable access to Covid-19 vaccines in the developing world",
    "Image": "https://images.livemint.com/img/2021/05/06/600x338/371534294_0-12_1620268124402_1620268149811.jpg",
    "Link": "https://www.livemint.com/news/india/india-appreciates-biden-admin-s-decision-to-back-trips-waiver-for-covid-vaccines-trips-11620267403564.html",
    "Text": "India has appreciated the Biden administration's decision to support a proposal moved by it and South Africa to temporarily waive some Trade-Related Aspects of Intellectual Property Rights (TRIPS) rules amid the coronavirus pandemic.\n\nFor the past several weeks, India's Ambassador to the US Taranjit Singh Sandhu, along with the diplomats from South Africa, had been meeting US lawmakers and officials regarding the proposal.\n\n\"We appreciate the US administration’s announcement today of its support for waiver of IPR for Covid-19 vaccines,\" Sandhu told PTI on Wednesday.\n\nMaking the announcement, US Trade Representative Katherine Tai said this is a global health crisis, and the extraordinary circumstances of the Covid-19 pandemic call for extraordinary measures.\n\n\"The (Biden) administration believes strongly in intellectual property protections, but in service of ending this pandemic, supports the waiver of those protections for Covid-19 vaccines,\" Tai said in a major policy announcement.\n\nA majority of Democratic Congressmen had written to President Joe Biden urging him to back the proposal so that vaccines can be made accessible and affordable.\n\n\"We also thank the large number of US Senators and Congresspersons who expressed their support. We will continue to work with all stakeholders in the US to collectively fight the global pandemic including through equitable distribution of affordable vaccines for global public health at this critical juncture,\" Sandhu said in response to a question.\n\nIn the past few months, the Indian Embassy had made a focused outreach on the need for equitable access to Covid-19 vaccines in the developing world.\n\nThe embassy methodically reached out to the members of the House and Senate. This was reflected in the series of letters that the US lawmakers wrote to President Biden in support.\n\nIn recent months, Sandhu has spoken on this issue to Senators Ed Markey and Raphael Warnock; Congresswoman Katherine Clark, Assistant Speaker; Congressman Gregory Meeks, Chair of House Foreign Affairs Committee; Congresswoman Pramila Jayapal, Chair of the Progressive Caucus; Congresswoman Jan Schakowsky and Congressman Ro Khanna.\n\nA joint outreach was also undertaken with the South African Embassy in Washington DC and together, the two envoys had underscored the importance of the issue with Congresswoman Karen Bass, Chair House Foreign Affairs Subcommittee on Africa and Global Health.\n\nThis story has been published from a wire agency feed without modifications to the text.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter.",
    "Title": "India appreciates Biden admin's decision to back TRIPS waiver for Covid vaccines"
  },
  {
    "Date": "Thu, 06 May 2021 11:25:15+5:30 ",
    "Description": "Kerala Chief Minister Pinarayi Vijayan on Wednesday cautioned that the state is facing a very serious situation as the Covid is spreading rapidly",
    "Image": "https://images.livemint.com/img/2021/05/06/600x338/20210502304L_1620280396485_1620280405332.jpg",
    "Link": "https://www.livemint.com/news/india/kerala-to-impose-lockdown-from-may-8-amid-rise-in-covid-cases-details-here-11620280192098.html",
    "Text": "Amid the rise in Covid-19 cases, Kerala will impose a lockdown in the state from 6 am on May 8 to May 16. News agency ANI reported quoting Kerala Chief Minister Pinarayi Vijayan.\n\nLockdown to be imposed in the state from 6 am on May 8 to May 16, in wake of the surge in COVID-19 cases in the second wave: Kerala CM Pinarayi Vijayan\n\n\n\n(file photo) pic.twitter.com/16N1wY47It — ANI (@ANI) May 6, 2021\n\nKerala Chief Minister Pinarayi Vijayan on Wednesday cautioned that the state is facing a very serious situation as the Covid is spreading rapidly.\n\n\"Kerala is going through a serious situation with COVID spreading rapidly in the state. The test positivity rate is not coming down. The situation calls for imposing more restrictions in the state\": said Vijayan.\n\nThe state recorded its highest single day rise of 41,953 new cases of Covid-19 on Wednesday from 1,63,321 sample tested.\n\nJoint Secretary in the Health Ministry Lav Agarwal said in Kerala, Kozhikode, Kottayam, Ernakulam, Thrissur, Malappuram, Alappuzha, Palakkad, Thiruvananthapuram, Kannur and Kollam districts have recorded a continued rise in the number of cases for the last two weeks.\n\nMeanwhile, India reported 4,12,262 new coronavirus cases in the last 24 hours, the highest single-day spike in Covid-19 cases since the pandemic began. With this, the cumulative count of COVID-19 cases in the country has gone up to 2,10,77,410, according to the Union Health Ministry. As many as 3,980 patients succumbed to the infection during the last 24 hours, taking the total COVID-related death toll to 2,30,168. At present, India has 35,66,398 active coronavirus cases\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter.",
    "Title": "Kerala to impose lockdown from May 8 amid rise in Covid cases. Details here"
  },
  {
    "Date": "Thu, 06 May 2021 06:19:55+5:30 ",
    "Description": "Britain is hosting the three-day foreign ministers' meeting - the first such G7 event in two years.India, currently undergoing the world's worst surge in Covid-19 cases, is attending the G7 as a guest",
    "Image": "https://images.livemint.com/img/2021/05/06/600x338/PTI05_05_2021_000230B_1620262043637_1620262084087.jpg",
    "Link": "https://www.livemint.com/news/world/covid19-scare-at-g7-meeting-after-two-indian-delegates-test-positive-11620259652534.html",
    "Text": "The Group of Seven meeting in London was hit by a Covid-19 scare on Wednesday when India's foreign minister and his entire team said they were self-isolating after two delegation members tested positive.\n\nBritain is hosting the three-day foreign ministers' meeting - the first such G7 event in two years - which has been billed as a chance to restart face-to-face diplomacy and a opportunity for the West to show a united front against threats from China and Russia.\n\nIndia, currently undergoing the world's worst surge in Covid-19 cases, is attending the G7 as a guest and had been due to take part in meetings on Tuesday evening and throughout Wednesday.\n\n\"Was made aware yesterday evening of exposure to possible Covid positive cases,\" Indian Foreign Minister Subrahmanyam Jaishankar said on Twitter.\n\n\"As a measure of abundant caution and also out of consideration for others, I decided to conduct my engagements in the virtual mode. That will be the case with the G7 Meeting today as well.\"\n\nThe meeting is a precursor to a G7 summit due to take place at a rural English resort in June, with US President Joe Biden and other world leaders set to attend.\n\nA British official confirmed the two positive tests and said the entire Indian delegation was self-isolating. British rules require a 10-day self-isolation period.\n\nThe Indian delegation had not yet attended the main summit venue at Lancaster House, and so meetings scheduled for Wednesday went ahead as planned.\n\nAsked if, in light of the positive tests, it had been a mistake to hold the summit in person, Prime Minister Boris Johnson said: \"I think it's very important to try to continue as much business as you can as a government.\"\n\nJohnson said he would speak with Jaishankar later on Wednesday by Zoom.\n\nBritish foreign minister Dominic Raab said rules had been meticulously applied and had worked effectively and it remained important for the summit in June to go ahead.\n\n\"We know these systems work, we will be able to plan even more, and even more carefully,\" he told reporters.\n\nA final communique from the meeting scolded China and Russia, but provided few concrete measures.\n\nFIST BUMPING\n\nEarlier, Raab was seen greeting and fist-bumping other G7 members as they arrived at the venue.\n\n\"We deeply regret that Jaishankar will be unable to attend the meeting today in person,\" a senior UK diplomat said. \"This is exactly why we have put in place strict Covid protocols and daily testing.\"\n\nOn Tuesday, pictures from inside the grand Lancaster House conference venue showed the reality of diplomacy in the coronavirus age - delegates separated by plastic screens, and a \"family photo\" of ministers carefully spaced two metres apart.\n\nJaishankar was pictured meeting British interior minister Priti Patel on Tuesday, although Patel did not have to self-isolate because the meeting had been held in line with existing rules. Both were wearing masks in the photograph.\n\nIndia is not a G7 member but was invited by Britain to this week's meeting, along with Australia, South Africa and South Korea.\n\nThe Indian High Commission in London did not respond to requests for comment.\n\n\n\n\n\nThis story has been published from a wire agency feed without modifications to the text. Only the headline has been changed.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter.",
    "Title": "Covid-19 scare at G7 meeting after two Indian delegates test positive"
  },
  {
    "Date": "Thu, 06 May 2021 10:27:46+5:30 ",
    "Description": "Nurses in the US on the other hand applauded the decision.The Biden administration's decision will make it easier for the WTO's General Council to approve the proposal",
    "Image": "https://images.livemint.com/img/2021/05/06/600x338/2021-05-05T181808Z_30910212_RC2U9N9BQDTI_RTRMADP_3_HEALTH-CORONAVIRUS-CANADA_1620276827855_1620276853317.JPG",
    "Link": "https://www.livemint.com/news/world/us-pharma-body-disappointed-over-support-for-covid-19-vaccine-patent-waiver-trips-11620276438508.html",
    "Text": "A US pharmaceutical trade body has expressed disappointment over the decision of the Biden administration to support India and South Africa's proposal before the WTO to temporarily waive anti-Covid vaccine patents to boost its supply.\n\nPhRMA which represents America’s leading innovative biopharmaceutical research companies has said that the \"decision will sow confusion between public and private partners, further weaken already strained supply chains and foster the proliferation of counterfeit vaccines.\"\n\nPhRMA companies are devoted to discovering and developing medicines that enable patients to live longer, healthier and more productive lives. Since 2000, PhRMA member companies have invested nearly USD1 trillion in the search for new treatments and cures, including an estimated USD83 billion in 2019 alone.\n\n(PhRMA) president and CEO Stephen J Ubl said this change in longstanding American policy will not save lives.\n\n“It also flies in the face of President (Joe) Biden’s stated policy of building up American infrastructure and creating jobs by handing over American innovations to countries looking to undermine our leadership in biomedical discovery,\" he said.\n\n“This decision does nothing to address the real challenges to getting more shots in arms, including last-mile distribution and limited availability of raw materials. These are the real challenges we face that this empty promise ignores,\" Ubl said.\n\n“In the past few days alone, we’ve seen more American vaccine exports, increased production targets from manufacturers, new commitments to COVAX and unprecedented aid for India during its devastating Covid-19 surge,\" he said.\n\n“Biopharmaceutical manufacturers are fully committed to providing global access to Covid-19 vaccines, and they are collaborating at a scale that was previously unimaginable, including more than 200 manufacturing and other partnerships to date.\n\nThe biopharmaceutical industry shares the goal to get as many people vaccinated as quickly as possible, and we hope we can all re-focus on that shared objective,\" he added.\n\nHouse Ways and Means Committee Republican leader Kevin Brady said that the world needs Covid vaccines now, but it shouldn’t be done by damaging the pathway to new vaccines and cures the world will need in the future.\n\n“Looking ahead to the next pandemic, it is dangerous for America to consent to strip away patents on lifesaving Covid vaccines now that cost businesses billions of dollars to develop at a historic pace - and to reward China with access to US innovation for a world pandemic China created,\" he said.\n\n“The better solution to help our global neighbours is to solve the very real logistical hurdles slowing access to these vaccines, not undermine the incentives to develop them,\" Brady said.\n\nNurses in the US on the other hand applauded the decision.\n\n“The welcome statement by President Biden’s US Trade Representative Katherine Tai joining this effort is a landmark decision that is also a tribute to healthcare and human rights activists, and nurses in particular, around the world who have been pressing for this humanitarian step,\" said National Nurses United (NNU) president Jean Ross.\n\n“As nurses on the front lines, we can tell you with absolute certainty: People are dying and will continue to die because of strict IP laws that are preventing the generic production of Covid-19 vaccines,\" said NNU executive director Bonnie Castillo.\n\n“There is no time to waste; we need to urgently scale up the manufacturing of vaccines, and to do that, the WTO must grant this waiver,\" he said.\n\nIn a statement, KEI, a civil society organisation that is on the forefront of IP waiver demand, applauded the decision by Tai to “actively participate in text-based negotiations at the World Trade Organisation (WTO)\" for a waiver of intellectual property protections for Covid-19 vaccines.\n\nThis decision isolates the European Union and other countries that have been blocking the waiver, a media release said.\n\nThe Biden administration's decision will make it easier for the WTO's General Council to approve the proposal.\n\nThis story has been published from a wire agency feed without modifications to the text. Only the headline has been changed.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter.",
    "Title": "US pharma body disappointed over support for Covid-19 vaccine patent waiver"
  },
  {
    "Date": "Thu, 06 May 2021 00:29:23+5:30 ",
    "Description": "Large numbers of BJP’s followers remain loyal regardless of how the party is handling the pandemic, but its social media forums are buzzing with diehard supporters questioning the decisions to hold election rallies, export vaccines, and invite millions at Kumbh Mela well into India’s second wave.",
    "Image": "https://images.livemint.com/img/2021/05/05/600x338/14b7723c-adae-11eb-84cc-e50dee918442_1620240887533_1620241114048.jpg",
    "Link": "https://www.livemint.com/news/india/bjp-workers-question-party-pm-as-covid-takes-a-severe-toll-11620240888210.html",
    "Text": "Anshu Thakur is a member of the Bharatiya Janata Party’s (BJP’s) IT cell, but the target of his latest Facebook outrage is the party itself. “This is no time for free food. Give us vaccines,\" he posted on Bihar BJP’s Facebook page in response to a post announcing 5kg of free foodgrain in May and June for the beneficiaries of the public distribution system of the state’s coalition government, where his party partners with Janata Dal (United).\n\nIn Jhanjharpur, a town in Mahbubani district where Thakur serves as a coordinator of the IT cell, he said “every second person is covid positive.\" He said health facilities are stretched, the member of Parliament has not been seen, and all people have is each other. Never before has he had a reason to question the party’s course of action. “Today, I have many questions. Questions for the government from the perspective of a common citizen. Questions for the party as a member. Questions for the leader as a supporter.\" As of today, Bihar has more than 100,000 active cases and 2,821 total deaths, but the dispatches from its remote corners hint at a manic spread of the virus.\n\nThakur said he is helping as many people as he can, but the resulting goodwill will no longer flow from the worker to the party: “Log samajhdar hote ja rahe hain, madam (people are becoming smarter).\" He claimed that if the BJP did not come to its voters’ rescue now, it would face the consequences in future elections. “People put their trust in (Narendra) Modi ji last time (In Bihar). All of India went along with him. But if they are facing problems right now, naturally, they will go with the opposition the next time. There will be a 100% effect of this. It is already showing. You can even say the (West) Bengal election results showed that. You and I may not be facing problems, but it doesn’t mean people aren’t. Problem is there. Big problem is there.\"\n\nThakur’s frustration resonates with a growing number of workers, voters and followers of the BJP, cutting a wide swathe through the party’s support base. They include rural and urban residents, truck drivers and businessmen, first-time voters and lifelong supporters. Many of them have publicly blamed the party and the prime minister over the past few weeks as covid-19 threatens themselves and their families. To be sure, large numbers of BJP’s followers remain staunchly loyal regardless of how the party is handling the pandemic, but its social media forums are buzzing with diehard supporters questioning the decisions to hold election rallies, export vaccines, and invite millions of people to gather at Kumbh Mela well into India’s second wave. Some of them say similar discussions are taking place in the long queues at hospitals, pharmacies, oxygen vendors and crematoriums in the cities overtaken by the virus.\n\n“One of my colleague’s mom died the other day. His token number said 80 at the crematorium. I have never seen tokens being handed out at a crematorium. I have only seen it at game parlours,\" said Sameer Mayank, a businessman from Lucknow who calls himself a “blind follower\" of the BJP. “We are experiencing bizarre things here. My colleague got a token number for 80 while the city’s daily death figures stand below 40. If you ask me, Lucknow’s official numbers are 1/10th of the actual toll. Every second home in Lucknow according to me, has a covid patient. In 38 years of my life, I have never seen so many dead bodies.\" Mayank has been lashing out against the state government, which he accuses of delaying test results and denying hospital admissions: “I am only showing my anger against Mr Yogi (Adityanath). He is doing nothing. At least PM Modi is getting in foreign aid.\" His anger is personal. “My wife got infected; my three-and-a-half-year-old daughter got infected; my in-laws got infected. We tested them on 17 April. Their antigen tests were positive. But their RT-PCR results are pending as of 1 May. We treated ourselves at home. According to the government, they still don’t have covid. People are not getting beds, oxygen, even hospital admission, whether government or private, without RT-PCR results. If anyone died in my family, it would be a non-covid death.\"\n\nAs someone who has voted for BJP in every central and state election since he turned 18, Mayank says his expectations were much higher. “In this city, we are hardcore BJP supporters. Atal Bihari Vajpayee used to fight elections from here. Besides admiration for him, there is the caste factor. Pandits and Thakurs vote BJP only. The average voting time is 2-3 seconds over here. The first person comes out of the booth and tells everyone which number shows lotus. We don’t care who the candidate is. If a dog stands on a BJP ticket, he will also win from here.\"\n\nHe said the same people are “extremely frustrated\" with BJP’s priorities. Even religion isn’t working as glue. “People are dying, and you are organizing Kumbh. Saints have died because of the congregation. I am a hardcore worshipper, but I can’t support this decision. How many oxygen plants could they have installed with the money that is being spent to build Ram mandir in Ayodhya?\"\n\nThe party has a lot to lose if voters like him feel abandoned at this time, he argued.\n\n“To be very honest, only in this pandemic, the government is non-performing. Lucknow is a sea of BJP supporters, but a tsunami of dissatisfaction is sweeping through us. At the Centre, BJP will return but not in this state. As far as my vote is concerned, it will go to NOTA (None of The Above).\"\n\nSome of BJP’s current critics were only drawn to the party because of PM Modi. Just months ago, they believed there was nothing he couldn’t do for the nation; today, they doubt everything he says.\n\nAditya Choudhary, a 27-year-old unemployed man from Bihar’s Sitamarhi, is one of them. “Bihar is in an awfully bad shape. Sitamarhi’s official website is showing 2,000 cases. But I don’t think there are 2,000 cases only. Test results are being delayed here. Those who are serious are not getting ICU beds or oxygen. They are bound to die, right? I get 200 calls every day. I connect people with local resources. But some people die before I can help them.\"\n\nChoudhary argues that Bihar’s covid-19 crisis needs political intervention. “It’s beyond the control of administrative officials. They are helpless because they don’t have access to the resources they need.\" But he no longer trusts his chosen leader. “Before corona, I saw Modi ji in a different light. I saw him as a man who went abroad, met important people, raised India’s stature in the world. But being a world leader is pointless if you can’t stand up to the local needs. How can you send vaccine abroad when people are dying in your country? If you are not doing what the public chose you for, what is the point of making grand speeches?\"\n\nThis is the first time his political instincts are defined by the ground realities. “These are hard times for people. If they aren’t sick, they are broke. What is he our Pradhan Sevak for? Modi ji’s image has been vitiated. This calamity will affect the upcoming elections, whether the party acknowledges this or not.\"\n\nIf Choudhary ever steps into a polling booth again, he said it would be to vote for himself.\n\n“I will make my own party and lead the country one day, whether it’s today or tomorrow. Write it down.\"\n\nView Full Image Some of BJP’s current critics were drawn to the party because of Modi. Just months ago, they believed there was nothing he couldn’t do for India ; today, they doubt everything he says.ap\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter.",
    "Title": "BJP workers question party, PM as covid takes a severe toll"
  },
  {
    "Date": "Thu, 06 May 2021 06:54:13+5:30 ",
    "Description": "The curfew will remain in place from 6 am of May 7 to 6 am of May 17",
    "Image": "https://images.livemint.com/img/2021/05/06/600x338/20210502-MND-BS-MN_Mandi_during_lockdown-02_1620264211330_1620264222380.jpg",
    "Link": "https://www.livemint.com/news/india/himachal-under-10-day-corona-curfew-from-tomorrow-as-covid-19-infections-surge-11620258940452.html",
    "Text": "Shimla: The Himachal Pradesh government has announced a 10-day curfew across the state in light of the rapidly increasing COVID-19 cases. The curfew will remain in place from 6 am of May 7 to 6 am of May 17.\n\n\"There shall be a 'corona curfew' from 6 am of 7th May 2021 to 6 am of 17th May 2021. The curfew is primarily aimed at containing the spread of COVID-19 disease,\" the state government said.\n\nAll offices, except those of essential services, will remain closed.\n\nEntry to the state will be restricted and no one from outside will be permitted to enter without a negative RT-PCR report.\n\nAdditionally, the state also canceled the Class 10 exams and said that all students would be promoted.\n\nAs many as 3,842 fresh COVID-19 cases and 32 deaths were reported in Himachal Pradesh on Wednesday, the state health department informed. The total active cases in the state now stand at 25,902.\n\nThe country is currently witnessing a devastating wave of the COVID-19 pandemic. As many as 3,82,315 new COVID-19 cases were reported across the country, taking the total active cases to 34,87,229.\n\n\n\n\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter.",
    "Title": "Himachal under 10-day 'corona curfew' from tomorrow as Covid-19 infections surge"
  },
  {
    "Date": "Thu, 06 May 2021 07:02:53+5:30 ",
    "Description": "US President Joe Biden's administration on Wednesday (local time) announced its support for a global waiver on patent protections for Covid-19 vaccines and said it will negotiate the terms at the World Trade Organisation",
    "Image": "https://images.livemint.com/img/2021/05/06/600x338/1316506827_1620264313517_1620264328465.jpg",
    "Link": "https://www.livemint.com/news/world/monumental-moment-who-after-us-support-for-covid-19-vaccine-patent-waiver-trips-11620264073145.html",
    "Text": "Lauding the United States for extending support to waiving patent protections for Covid-19 vaccines amid the global health crisis, Director-General of the World Health Organisation (WHO) Tedros Adhanom Ghebreyesus termed the Biden administration's decision as \"powerful example of US leadership to address global health challenges\".\n\n\"This is a monumental moment in the fight against #COVID19. The commitment by @POTUS Joe Biden and @USTradeRep @AmbassadorTai to support the waiver of IP protections on vaccines is a powerful example of US leadership to address global health challenges,\" the WHO chief tweeted.\n\nCommending the US for this historic decision for vaccine equity, prioritising the well-being of all people everywhere at a critical time, he said: \"Now let's all move together swiftly, in solidarity, building on the ingenuity and commitment of scientists who produced life-saving #COVID19 vaccines.\"\n\nHe added that the White House support for the temporary waiving IP on Covid-19 vaccines \"reflects the wisdom and moral leadership of US to support vaccine equity and work to end this pandemic\".\n\nUS President Joe Biden's administration on Wednesday (local time) announced its support for a global waiver on patent protections for Covid-19 vaccines and said it will negotiate the terms at the World Trade Organisation (WTO).\n\n\"These extraordinary times and circumstances of call for extraordinary measures. The US supports the waiver of IP protections on COVID-19 vaccines to help end the pandemic and we will actively participate in @WTO negotiations to make that happen,\" US Trade Representative Katherine Tai said in a statement.\n\nThis comes as India, South Africa, and other nations had requested to waive certain portions of the Agreement on Trade-Related Aspects of Intellectual Property Rights (TRIPS) for all members of the WTO.\n\nThe requested waiver was to provide many people with possible access to vaccines and treatments for Covid-19, including in developing countries.\n\nThis story has been published from a wire agency feed without modifications to the text. Only the headline has been changed.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter.",
    "Title": "'Monumental moment': WHO after US support for Covid-19 vaccine patent waiver"
  },
  {
    "Date": "Thu, 06 May 2021 09:01:28+5:30 ",
    "Description": "India is in the midst of a raging second wave of Covid-19 and is recording over 300,000 daily coronavirus infections and over 3,000 deaths.The country accounted for 46 per cent of global cases and 25 per cent of global deaths reported in the past week",
    "Image": "https://images.livemint.com/img/2021/05/06/600x338/20210505241L_1620271587312_1620271608144.jpg",
    "Link": "https://www.livemint.com/news/india/tragic-covid-situation-in-india-should-raise-alarm-bells-for-all-of-us-unicef-11620271294712.html",
    "Text": "The “tragic\" Covid-19 situation in India should raise the alarm bells for “all of us\" and there will be reverberations across the region and the world in terms of virus-related deaths, virus mutations and supply delays unless the world steps up and helps the country now, the head of the UN children’s agency has said.\n\nUnited Nations Children’s Fund (UNICEF) has sent additional critical lifesaving supplies to India, including 2 million face shields and 200,000 surgical masks.\n\n“The tragic situation in India should raise alarm bells for all of us,\" UNICEF Executive Director Henrietta Fore said on Tuesday.\n\n“Unless the world steps up and helps India now, there will be reverberations across the region and the world in terms of virus-related deaths, virus mutations and supply delays.\"\n\nIndia is in the midst of a raging second wave of Covid-19 and is recording over 300,000 daily coronavirus infections and over 3,000 deaths. According to the World Health Organization (WHO), India has a total of 20.6 million confirmed Covid-19 cases and over 226,000 deaths.\n\nCountries across the South Asia region are witnessing rises in infections, with India accounting for over 90 per cent of both cases and deaths in the region, according to the World Health Organisation.\n\nIndia also accounted for 46 per cent of global cases and 25 per cent of global deaths reported in the past week, WHO added.\n\nUNICEF Regional Director for South Asia George Laryea-Adjei said in a statement that urgent action and steadfast leadership are indispensable to stop the catastrophe.\n\n“Governments must do everything within their power to stop the devastation, and partners that can send assistance must do so immediately. The international community must step up without delay,\" Laryea-Adjei said.\n\n“This is not just a moral imperative. The deadly new surge in South Asia threatens us all. It has the potential to reverse hard-earned global gains against the pandemic if not halted as soon as possible,\" Laryea-Adjei added.\n\nUNICEF said the “scenes we are witnessing in South Asia\" are unlike anything the region has seen before.\n\n“Family members of patients are pleading for help as the region reels under an acute shortage of medical-grade oxygen. Exhausted health workers are being pushed to the brink of collapse. We are faced with a real possibility that our health systems will be strained to a breaking point - leading to even more loss of life.\"\n\nLaryea-Adjei said the very low levels of vaccination in South Asia magnify the likelihood of the virus spiralling even further out of control. In almost all countries in the region, except for the Maldives and Bhutan, fewer than 1 in 10 people have been vaccinated.\n\n“Now more than ever, we must ensure vaccines equitably reach all populations. Manufacturing must be ramped up, technology transferred, and doses equitably shared. None of us is safe until all of us are safe,\" Laryea-Adjei said.\n\nLaryea-Adjei said the first wave of the pandemic caused drastic cuts in the availability and use of essential public health services in South Asia, costing the lives of an estimated 228,000 children and 11,000 mothers.\n\n“We simply cannot let this happen again. We must do everything within our power to keep essential health, immunization and nutrition services running - and make sure women and children everywhere feel safe to use them. Viruses know no borders. We must come together now as a global community to stop the devastation and protect our children.\"\n\nThe UN agency said it has provided oxygen concentrators and other critically needed emergency equipment to support the immediate response in the country, while also supporting resilience-building against recurrent shocks and stresses to the health system that leave children and their families at risk.\n\nUNICEF has supplied 85 Covid-19 testing machines, which form a crucial part of the Government of India’s response to the pandemic.\n\nAdditionally, UNICEF is supporting the procurement and installation of 25 oxygen plants for hospitals in the Northeast and Maharashtra, and the installation of more than 70 thermal scanners at various ports of entry countrywide.\n\nSince the start of the pandemic, UNICEF has also been working with the government and partners in India to help stop the spread of Covid-19, sharing information with more than 660 million people on how to stay safe from the coronavirus.\n\nIt has consistently worked to counter misinformation and promote Covid-19 protective practices, including wearing masks, physical distancing, and handwashing.\n\nUNICEF said it needs USD 21 million for the urgent delivery of additional testing equipment, supplies and oxygen products in India, and more than USD 50 million for lifesaving Covid-19 interventions across sectors.\n\nUNICEF said end-to-end logistics support from DP World helped the equipment was dispatched from UNICEF’s warehouse in Dubai to New Delhi to help India battle the deadly wave of Covid-19.\n\nDP World Group Chairman and CEO Sultan Ahmed bin Sulayem said the company partnered with UNICEF because dealing with the Covid-19 pandemic is “humanity’s biggest logistics challenge in living memory.\"\n\n\"This emergency shipment of medical supplies is just one of many operations DP World will be supporting worldwide. The UAE and India have strong ties, and we stand by India through this devastating pandemic,\" he said.\n\nThis story has been published from a wire agency feed without modifications to the text.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter.\n\nNever miss a story! Stay connected and informed with Mint. Download our App Now!!",
    "Title": "Tragic Covid situation in India should raise alarm bells for all of us: UNICEF"
  },
  {
    "Date": "Thu, 06 May 2021 01:14:48+5:30 ",
    "Description": "However, the country will surpass crisis with a focus on public healthcare",
    "Image": "https://images.livemint.com/img/2021/05/05/600x338/1724a08e-adc3-11eb-a936-0e5204611abd_1620243642665_1620243737713.jpg",
    "Link": "https://www.livemint.com/news/india/indias-nascent-revival-hit-by-second-wave-fm-11620243643142.html",
    "Text": "Union finance minister Nirmala Sitharaman on Wednesday said the resurgence of the pandemic has adversely impacted the nascent recovery process in India, but maintained that the country will sail through the storm with the focus of the government on robust public health measures, timely treatment of infected persons, sound macro-economic management, and strong macro fundamentals.\n\nThe country is under the grip of the second wave and this has caused suffering for a large number of people and put a huge strain on the healthcare system, Sitharaman said at the virtual 54th annual meeting of the Asian Development Bank (ADB).\n\n“We are thankful to the international community for their support in this hour of need. The vaccine production capacity in the country is being ramped up and more candidates are on verge of entering the commercial chain. We are confident that with expected access to critical raw materials, we would not only be able to meet our needs but also soon be back to meet critical vaccine needs of the world,\" she said.\n\nThe world is facing an unprecedented global crisis with the world economy contracting last year, threatening a severe development setback and hindering progress of developing member countries towards achieving 2030 Sustainable Development Goals, Sitharaman said. “Poverty has been reduced over the years, but in 2020, an estimated 78 million people were pushed back into extreme poverty and inequality aggravated,\" the minister said.\n\nAccording to a Pew Research Centre report released in March, the pandemic may have shrunk India’s middle-class population by 32 million and driven 75 million below the poverty line in 2020, as a severe recession walloped Asia’s third-largest economy. The World Bank has cautioned that the pandemic is pushing millions of Indians into poverty and eroding the hard-fought gains made in the past two decades.\n\nThe finance minister thanked ADB for rising to the occasion by delivering early and rapid support to the region, first through a comprehensive covid response programme to help counter the severe macroeconomic and health impact, and coming up with a vaccine support package.\n\nHowever, Sitharaman urged ADB to increase its capital base and lending to India. “India has the absorptive capacity to receive about $4 billion a year from sovereign operations and about $1.5 billion annually from the private sector financing window. This should be viewed against the backdrop that on average in the last 5 years the net sovereign inflows, excluding CPRO (Covid-19 Pandemic Response Option) loan, into India have been less than $700 million and the net non-sovereign lending has been negative,\" she said.\n\nSitharaman also urged ADB to increase private sector financing with the debt burden on sovereigns rising. “Such financing would also help leverage the capital of ADB much better. However, the non-sovereign lending of ADB came down substantially in 2020 and is projected to stay at sub-2019 level at least for another six years. The ADB’s Work Programme 2021-23 projects a reduction in non-sovereign commitments by $32 billion over 2020-35. While we welcome the strategy to increase sector and geographical diversification in private sector lending, this rather calls for more and not less absolute lending,\" she said.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter.",
    "Title": "India’s nascent revival hit by second wave: FM"
  },
  {
    "Date": "Thu, 06 May 2021 11:04:54+5:30 ",
    "Description": "Ten meetings in seven months have failed to move WTO members toward consensus on the original waiver proposal.The initial IP waiver proposal by India and South Africa last October included vaccines, treatments, diagnostic kits, ventilators and protective gear",
    "Image": "https://images.livemint.com/img/2021/05/06/600x338/2021-05-06T052132Z_2_LYNXMPEH4505J_RTROPTP_3_HEALTH-CORONAVIRUS-USA_1620279166304_1620279184496.JPG",
    "Link": "https://www.livemint.com/news/world/vaccine-ip-waiver-could-take-months-for-wto-to-negotiate-experts-trips-11620278073469.html",
    "Text": "Now that US President Joe Biden has backed a proposed waiver for Covid-19 vaccine intellectual property rights, the next stop is for the World Trade Organization to hammer out a deal - a process that could take months.\n\nNot only are the negotiations expected to be lengthy, they are also likely to result in a waiver that is significantly narrower in scope and shorter in duration than the one initially proposed by India and South Africa, trade experts said.\n\nPrior to Biden's announcement, the two countries confirmed their intention to draft a new proposal at a WTO General Council meeting on Wednesday, prompting the body's new Director-General, Ngozi Okonjo-Iweala, to express hope for \"a pragmatic solution.\"\n\nTen meetings in seven months have failed to move WTO members toward consensus on the original waiver proposal.\n\n\"At a minimum, it's going to be a month or two,\" Clete Willems, a former Trump White House trade official who previously worked at the US trade mission to the WTO in Geneva, said of any possible agreement.\n\n\"Right now, there is no proposal on the table that would waive the TRIPS agreement simply for vaccines,\" he said, referring to the WTO's agreement on 'Trade-Related Aspects of Intellectual Property Rights' that governs the transfer of property like movie rights or vaccine-manufacturing specifics.\n\nA more realistic goal may be completion of the agreement in time for the WTO's next ministerial conference, scheduled for Nov. 30 through Dec. 3, said Willems, now a trade partner at the Akin Gump law firm in Washington. That would give vaccine producers more time to boost global supplies which could help contain the virus and ease pressure for the waiver.\n\nThe initial IP waiver proposal by India and South Africa last October included vaccines, treatments, diagnostic kits, ventilators, protective gear and other products related to the Covid-19 pandemic.\n\nHAGGLING OVER WORDS\n\nUS Trade Representative Katherine Tai said on Wednesday that she will pursue \"text-based negotiations\" on the WTO waiver, the standard but tedious process for trade deal talks. Negotiators trade texts with their preferred wording, then try to find common ground, sometimes leaving blank spaces for thorny differences to be settled by politicians.\n\nAll 164 WTO member countries must reach consent on such decisions, with any one member able to veto them, so there could be a lot of red pencils out. Negotiations are likely to be held in a mixture of virtual and in-person meetings.\n\n\"Those negotiations will take time given the consensus-based nature of the institution and the complexity of the issues involved,\" Tai said in a statement that tamped down expectations for a quick deal.\n\nUS companies, which strive to influence the USTR's trade negotiations, are already mobilizing to try to ensure the WTO talks lead to a waiver that's as narrowly targeted as possible.\n\n\"This is a mitigation effort. We're aiming to make it less bad than it otherwise would be,\" one industry source said.\n\nSome Republican lawmakers are pushing the argument that the decision will hand American technology to China.\n\n\"What this decision will do, if it goes forward, is benefit countries like China that are aggressively trying to obtain US technology to bolster their own domestic champions,\" Republican Senator Mike Crapo said in a statement.\n\nWhile Biden's backing adds political impetus to get a deal done, other countries with big pharmaceuticals sectors, including Britain, Japan, Switzerland and in the European Union, were opposed to the waiver and have the ability to block a deal.\n\nOn the plus side, a successful waiver negotiation would \"improve the atmospherics\" at the WTO, which has been marked by failure to reach agreement on substantive new trade policy since its inception in 1995, said Harry Broadman, a former Clinton administration trade official who helped negotiate the trade body's creation.\n\n\"It's good that the WTO hopefully can actually think about a consensus,\" Broadman said, adding that he sees slim prospects that a vaccine deal could revive prospects for broader WTO negotiations.\n\nThis story has been published from a wire agency feed without modifications to the text.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter.",
    "Title": "Vaccine IP waiver could take months for WTO to negotiate-experts"
  },
  {
    "Date": "Thu, 06 May 2021 00:12:50+5:30 ",
    "Description": "As such, some states stopped short of using the word lockdown even as they stopped most commercial activity and movement. Rajasthan called its curbs a public discipline fortnight, MP coined the term corona curfew, and Karnataka chief minister B.S. Yediyurappa picked the phrase close-down.",
    "Image": "https://images.livemint.com/img/2021/05/05/600x338/PTI07-05-2020_000219B_1588862472148_1620240148110.jpg",
    "Link": "https://www.livemint.com/news/india/curbs-cover-most-parts-of-india-as-covid-holds-sway-11620239899665.html",
    "Text": "Even as calls grow for a nationwide lockdown to stop the pandemic, a series of state-level curfews and lockdowns over the past week has already taken the number of states under significant curbs to 21. Ten days ago, just five states had statewide lockdowns.\n\nStates that have imposed such curbs now account for 81% of India’s population.\n\nThe rest of India has night curfews, as in Telangana, or strict curfews in only select cities, as in Gujarat and Madhya Pradesh.\n\nView Full Image States that have imposed such curbs now account for 81% of India’s population.\n\nOn a lockdown stringency index run by the University of Oxford, India is now at its highest level of strictness since October 2020, just after the first wave peak.\n\nThe curbs, as well as growing public fear of covid-19, have led to a sharp drop in public movement, from 89% of normal at March-end to 62% as of 1 May, shows Google data.\n\nWary of an adverse economic impact, Prime Minister Narendra Modi had on 20 April urged states to use lockdowns only as a last resort.\n\nAs such, some states stopped short of using the word “lockdown\" even as they stopped most commercial activity and movement. Rajasthan called its curbs a “public discipline fortnight\", Madhya Pradesh coined the term “corona curfew\", and Karnataka chief minister B.S. Yediyurappa picked the phrase “close-down\".\n\nJharkhand went under a “health safety week\" on 22 April.\n\nIn much of India, weddings and funerals have caps on the number of participants, while retail shops have timing restrictions.\n\nCongress leader Rahul Gandhi on Tuesday said a lockdown was “now the only option\" left. Dr Anthony Fauci, a top US public health official, has also made a similar suggestion.\n\nPrabhat Jha, director of Toronto-based Centre for Global Health Research, said that instead of a nationwide lockdown, “a coordinated set of short breaks in major cities might help slow the surge\". “There is so little economic activity anyway, so I’m not sure how much better it would be with a lockdown,\" he said. “A lockdown would be a bad idea if it distracted from other steps that would be more effective, such as increasing emergency oxygen and releasing anonymized data on every tested case, deaths and vaccination.\"\n\nView Full Image Curbs cover most parts of India as covid holds sway\n\nK. Sujatha Rao, a former Union health secretary, also expressed the need for transparent data and a solution to the oxygen crisis. She said a nationwide lockdown like the one imposed in 2020 would only hurt the poor. Instead, only the districts reporting more than 100 daily cases could be subjected to a lockdown, while other districts of concern—those with 50-100 daily cases—could be targeted with stringent localized containment zones, she said.\n\nEven without a nationwide lockdown, public movement has shrunk below June 2020 levels in 11 major states. June 2020 was the last month of the nationwide lockdown last year. Relative to the pre-pandemic times, mobility is the lowest in Delhi (34%) followed by Chhattisgarh (39%). This has also begun to hit economic activity across India, high-frequency indicators have shown.\n\nIn the two weeks since Modi’s address, India has reported 5 million new covid-19 infections and nearly 44,000 deaths.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter.",
    "Title": "Curbs cover most parts of India as covid holds sway"
  },
  {
    "Date": "Thu, 06 May 2021 06:06:45+5:30 ",
    "Description": "India and South Africa had approached WTO in October, calling on it to waive parts of the agreement on TRIPS.The decision may lead to the speeding of inoculation drives worldwide",
    "Image": "https://images.livemint.com/img/2021/05/06/600x338/2021-05-05T181808Z_30910212_RC2U9N9BQDTI_RTRMADP_3_HEALTH-CORONAVIRUS-CANADA_1620261298371_1620261316199.JPG",
    "Link": "https://www.livemint.com/news/world/us-approves-temporary-waiver-of-patent-protection-rules-on-covid-19-vaccines-trips-waiver-11620258516816.html",
    "Text": "The Joe Biden-led administration in United Stated has come out in support of waiving the Trade-Related Aspects of Intellectual Property Rights (TRIPS) on Covid-19 vaccines.\n\nThe decision may lead to the speeding of inoculation drives worldwide.\n\nThe US government's position was announced by the country's trade representative Katherine Tai on Wednesday amid World Trade Organisation talks over easing global trade rules to enable more countries to produce more of the life-saving vaccines.\n\n“The administration believes strongly in intellectual property protections, but in service of ending this pandemic, supports the waiver of those protections for Covid-19 vaccines,\" Tai said in the statement.\n\nBut she cautioned that it would take time to reach the required global “consensus\" to waive the protections under WTO rules, and US officials said it would not have an immediate effect on the global supply of Covid-19 shots.\n\nTai had earlier held meetings with CEOs of several vaccine manufacturing companies, including Moderna and Pfizer, on the TRIPS waiver issue.\n\nAmid mounting pressure, the White House had earlier stated it will do whatever is best to end the pandemic.\n\n\"We are going to do what is in the best interest of ending the pandemic. We are already engaged in steps to increase vaccine production,\" said White House deputy press secretary Karine Jean-Pierre.\n\nThe previous Trump administration had opposed such a move.\n\nRich countries against waiver\n\nWealthy countries like the US and Britain as well as the European Union were against the proposal to waive TRIPS.\n\nThey said that a ban would stifle innovation at pharmaceutical companies by robbing them of the incentive to make huge investments in research and development.\n\nThis would be especially counterproductive during the current pandemic which needs the drugmakers to remain on their toes to deal with a mutating virus, they argued.\n\nWhy does India want the waiver?\n\nIf India succeeds in getting the proposed waiver of the agreement on TRIPS, it will reduce the cost of vaccines substantially and enable free flow of medicines, easy technology transfer across the world.\n\nIndia and South Africa had approached the global trade body in October, calling on it to waive parts of the agreement on TRIPS.\n\n\n\n\n\n\n\n\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter.",
    "Title": " US approves temporary waiver of patent protection rules on Covid vaccines proposed by India"
  },
  {
    "Date": "Thu, 06 May 2021 06:42:56+5:30 ",
    "Description": "Some other states, including Bihar, Uttar Pradesh, Odisha, West Bengal, Tamil Nadu, Punjab and Madhya Pradesh have already said that priority will be given to journalists in the Covid-19 vaccination drive",
    "Image": "https://images.livemint.com/img/2021/05/06/600x338/AFP_9988GF_1620263489268_1620263502756.jpg",
    "Link": "https://www.livemint.com/news/india/manipur-declares-journalists-as-frontline-workers-will-vaccinate-on-priority-11620258344860.html",
    "Text": "Amid a raging second wave of coronavirus infections, the Manipur government has decided to declare all accredited working journalists as frontline workers. The state will now vaccinate the scribes against Covid-19 on priority.\n\n\"We recognise the effort of our journalists to disseminate news and risk they are exposed to, is no less than other frontline workers. In recognition of all accredited working journalist as frontline warriors, the state government will now vaccinate all the journalists on priority,\" state Chief Minister N Biren Singh wrote on Twitter.\n\nEarlier, the CM had informed that four more Covid care centres, with a capacity of over 1,000 beds, have started functioning in the state.\n\n\"250 bedded Covid Care Centre at Bal Bhawan, Khuman Lampak and 70 bedded CCC at Bishnupur have started functioning,\" the CM had tweeted.\n\nApart from Manipur, Goa too on Wednesday said that journalists have been included in the group of frontline workers and will be vaccinated on priority.\n\nIn a statement, the Chief Minister's Office said the Council of Ministers resolved to recognise accredited journalists and other media personnel as certified by DIP or any officer authorised to certify by him/her as 'frontline workers'.\n\nPrior to this, Jharkhand Chief Minister Hemant Soren on Wednesday said journalists in the state will be vaccinated on priority.\n\n\"All journalists will be vaccinated on priority in the state. I have instructed the Additional Chief Secretary (Health) in this regard. We will fight together and win this battle against Corona. Corona will lose again, Jharkhand will win again!\" Soren said in a tweet.\n\nSome other states, including Bihar, Uttar Pradesh, Odisha, West Bengal, Tamil Nadu, Punjab, Karnataka and Madhya Pradesh have already said that priority will be given to journalists in the Covid-19 vaccination drive.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter.",
    "Title": "Manipur declares journalists as frontline workers, will vaccinate on priority"
  },
  {
    "Date": "Thu, 06 May 2021 09:29:22+5:30 ",
    "Description": "With the number of infections spiking, 21 states have imposed curfews and lockdowns over the past week. Ten days ago, just five states had statewide lockdowns",
    "Image": "https://images.livemint.com/img/2021/05/06/600x338/PTI05_05_2021_000105B_1620272743634_1620272791330.jpg",
    "Link": "https://www.livemint.com/news/india/covid-update-india-reports-over-4-lakh-new-cases-again-fatalities-close-to-4000-11620271992967.html",
    "Text": "As many as 4,12,262 more people tested positive for Covid-19 in the last 24 hours, taking the cumulative caseload in the country to 2,10,77,410, said the Union health ministry on Thursday morning.\n\nThis is the biggest spike in daily new cases India has seen so far. The country had last reported over 4 lakh new cases on Saturday.\n\nThe daily fatality due to the disease is seeing an upward spike too with 3,980 more people succumbing to the disease in the last 24 hours. With this, the cumulative death toll in the country has crossed the 23 lakh mark to reach 23,01,68.\n\nSome research models recently predicted that the death toll in India could more than double from current levels.\n\nA team at the Indian Institute of Science in Bangalore used a mathematical model to predict about 404,000 deaths will occur by 11 June if current trends continue.\n\nHowever, at the same time, the number of discharges from various Covid hospitals across the country is also increasing. As many as 3,29,113 more people were discharged in the last 24 hours, taking the number of recoveries to 1,72,80,844.\n\nAs a result, there are 35,66,398 active cases in India currently. The active tally has been on a steady rise since February this year.\n\nTests conducted so far\n\nIndia has tested 29,67,75,209 samples from Covid-19 until now, said the Indian Council of Medical Research (ICMR).\n\nOut of these, 19,23,131 samples were tested on Wednesday. Daily testing increased considerably as the number stood at 15,41,299 on Tuesday.\n\nVaccination in India\n\nThe country has so far inoculated 16,25,13,339 people.\n\nThe nationwide vaccination drive was rolled out on 16 January with healthcare workers getting the jabs first. The drive for frontline workers started on 2 February.\n\nThe next phase of Covid-19 vaccination commenced on 1 March for those over 60 years of age and those aged 45 and above with specified co-morbid conditions.\n\nThe country launched vaccination for those aged above 45 from 1 April.\n\nThe implementation of the Liberalised and Accelerated Phase 3 Strategy for inoculating those in the age group of 18-44 years started from 1 May amid many states flagging a shortage of vaccines.\n\nGovt on Covid tests\n\nThe central said on Wednesday that the Rapid Antigen Test (RAT) complements the RT-PCR test and is highly useful in Covid surveillance and containment activities.\n\nThis was informed by the government a day after the Indian Council for Medical Research (ICMR) recommended against RT-PCR tests for healthy individuals undertaking inter-state travel to reduce the load on laboratories.\n\n\"The Rapid Antigen Test has its own place. It complements RT-PCR and conversely, RT-PCR can complement Rapid Antigen Test, wherever available,\" said Niti Aayog member (Health) VK Paul.\n\n\"RAT is highly useful in surveillance and containment activities, in screening people where this is a likelihood of transmission. This is a tool available to us for mounting effective surveillance activity and that still stands,\" he added.\n\nContainment measures\n\nWith the number of infections spiking, 21 states have imposed curfews and lockdowns over the past week. Ten days ago, just five states had statewide lockdowns.\n\nStates that have imposed such curbs now account for 81% of India’s population.\n\nThe curbs, as well as growing public fear of Covid-19, have led to a sharp drop in public movement, from 89% of normal at March-end to 62% as of 1 May.\n\nEven without a nationwide lockdown, the public movement has shrunk below June 2020 levels in 11 major states. June 2020 was the last month of the nationwide lockdown last year.\n\nIn most of India, weddings and funerals have caps on the number of participants, while retail shops have timing restrictions.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter.",
    "Title": "Covid update: India reports over 4 lakh new cases again, fatalities close to 4,000"
  },
  {
    "Date": "Thu, 06 May 2021 11:03:44 +0530",
    "Description": "Up to 3,980 people died of Covid in India the past 24 hours, the highest in a day so far, pushing total fatalities to 2,30,168.The country also set a new grim record in its daily Covid numbers with...",
    "Image": "https://c.ndtvimg.com/2021-05/d4o138m8_coronavirus-india-afp-650_650x400_06_May_21.jpg",
    "Link": "https://www.ndtv.com/india-news/coronavirus-4-12-lakh-covid-19-cases-3-980-deaths-in-india-highest-so-far-in-24-hours-2433589",
    "Text": "Assam, West Bengal, Odisha, Bihar, and Jharkhand have seen a rise in both the number of daily cases and mortality, indicating the \"pandemic is moving eastwards\", the Union Health Ministry said after a review meeting on Wednesday.\n\nTwelve states, including Maharashtra, Karnataka, Kerala, and Uttar Pradesh, have more than a lakh active COVID-19 cases each, according to the government. Thirty districts are showing a continued rise in the number of cases for the past two weeks. Ten of these are in Kerala, seven in Andhra Pradesh, three in Karnataka, and one in Tamil Nadu, it said.\n\nMaharashtra, the worst-hit state since last year, on Wednesday reported a record 920 new Covid deaths and over 57,000 new cases. Capital Mumbai reported 3,879 new cases and 77 deaths while Pune logged 9,084 cases and 93 deaths. The state currently has 6.41 lakh active cases.\n\nKarnataka on Wednesday reported in its single-largest spike (more than 50,000 cases) since the start of the pandemic -- nearly half of them in capital Bengaluru.\n\nIndia accounted for 46% of global cases and 25% of global deaths reported in the past week, the World Health Organization said on Wednesday.\n\n\"Unless the world steps up and helps India now, there will be reverberations across the region and the world in terms of virus-related deaths, virus mutations and supply delays,\" UNICEF Executive Director Henrietta Fore said on Tuesday.\n\nExperts have warned India must prepare for a third wave. \"Phase 3 is inevitable given the high levels of circulating virus. But it is not clear on what timescale this phase 3 will occur. We should prepare for new waves,\" K Vijay Raghavan, the government's principal scientific advisor, told a news conference on Wednesday.\n\nOver 16.24 crore COVID-19 vaccine doses have been administered in the country so far. More than 2.3 lakh beneficiaries of age group 18-44 Vaccinated in the last 24 hours.\n\nUS President Joe Biden's administration has announced support for a global waiver plan on patent protections for COVID-19 vaccines moved by India within the World Trade Organization.",
    "Title": "4.12 Lakh Fresh Cases, 3,980 Deaths: India's Worst Covid Numbers Yet"
  },
  {
    "Date": "Thu, 06 May 2021 09:38:36 +0530",
    "Description": "The US has reissued its travel advisory on India, urging its citizens not to travel to the country due to an unprecedented surge in the COVID-19 cases there.",
    "Image": "https://i.ndtvimg.com/i/2018-03/flight-generic_650x400_51520238094.jpg",
    "Link": "https://www.ndtv.com/india-news/covid-crime-terrorism-us-reissues-travel-advisory-on-india-2433778",
    "Text": "Both travel advisory has been marked ''Level 4'' which is the highest warning level. (Representational)\n\nThe US has reissued its travel advisory on India, urging its citizens not to travel to the country due to an unprecedented surge in the COVID-19 cases there.\n\nIndia is struggling with a second wave of the pandemic with more than 3,00,000 daily new coronavirus cases being reported in the past few days, and hospitals are reeling under a shortage of medical oxygen and beds.\n\n\"Do not travel to India due to COVID-19. Exercise increased caution due to crime and terrorism,\" the State Department said on Wednesday in its latest travel advisory that looked identical to the one issued on April 28.\n\nBoth the travel advisory has been marked ''Level 4'' which is the highest warning level.\n\nOn April 28, the Department approved the voluntary departure of family members of US government employees.\n\nOn May 5, the Department approved the voluntary departure of non-emergency US government employees.\n\n\"US citizens who wish to depart India should take advantage of available commercial transportation options,\" it said.\n\nLast week, the Centers for Disease Control and Prevention (CDC) issued a Level 4 Travel Health Notice for India due to COVID-19, indicating a very high level of COVID-19 in the country.\n\nA record 3,780 fresh COVID-19 fatalities were registered in a single day in India taking the death count to 2,26,188, while 3,82,315 new coronavirus infections were recorded, according to the Union Health Ministry data updated on Wednesday.\n\nWith the fresh cases, the total tally of COVID-19 cases in the country climbed to 2,06,65,148.",
    "Title": "Covid, Crime, Terrorism: US Reissues Travel Advisory On India"
  },
  {
    "Date": "Thu, 06 May 2021 06:53:11 +0530",
    "Description": "Top US lawmakers have applauded India's decision to not allow Chinese telecom companies to conduct 5G trials in the country.",
    "Image": "https://c.ndtvimg.com/2018-09/q35u6gic_india-us-flags-reuters_625x300_18_September_18.jpg",
    "Link": "https://www.ndtv.com/india-news/us-lawmakers-applaud-indias-decision-to-not-allow-chinese-firms-to-conduct-5g-trials-2431977",
    "Text": "US lawmakers thanked India for not allowing Chinese companies conduct 5G trials (Representational)\n\nTop US lawmakers have applauded India's decision to not allow Chinese telecom companies to conduct 5G trials in the country.\n\nThe Department of Telecom in India on Tuesday had approved applications of telecom companies Reliance Jio, Bharti Airtel, Vodafone Idea and MTNL to conduct 5G trials but none of them would be using technologies of Chinese entities.\n\n\"India's decision to exclude Huawei and ZTE from its 5G trials is good news for the people of India and the world,\" House Foreign Affairs Committee Lead Republican and China Task Force Chairman Michael McCaul said in a statement on Wednesday.\n\n\"People's Republic of China law requires any Chinese company - including Huawei and ZTE - to work for the Chinese Communist Party if asked,\" Mr McCaul said.\n\nThe previous Trump administration had designated Chinese tech companies as posing a national security risk.\n\nThe US is also asking its friends and allies not to opt for a technology that is controlled by the Communist Party of China.\n\n\"It's a risk that can't be mitigated unless these companies are excluded from our networks, and I'm glad that India has recognized this threat. India has once again proven why it is a global leader in the fight against security threats posed by CCP-controlled technology,\" Mr McCaul said.\n\nCongressman Mike Waltz also thanked India for its decision.\n\n\"Thank you to India for denying the inclusion of CCP-run Huawei in their telecommunications,\" he said.\n\n\"As the world's largest democracy, India will be a critical ally in confronting China and securing our supply chains,\" Mr Waltz said.\n\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
    "Title": "US Hails India's Decision To Not Allow Chinese Firms To Conduct 5G Trials"
  },
  {
    "Date": "Thu, 06 May 2021 10:12:28 +0530",
    "Description": "China said on Thursday it had suspended an economic agreement with Australia, in an apparent tit-for-tat response to Canberra's scrapping of a Belt and Road infrastructure pact and threat to undo a...",
    "Image": "https://c.ndtvimg.com/2021-04/8dr21b0o_belt-and-road_625x300_21_April_21.jpg",
    "Link": "https://www.ndtv.com/world-news/china-suspends-economic-accord-based-on-current-attitude-of-australia-2433127",
    "Text": "Last month, Prime Minister Scott Morrison's government scrapped a Belt and Road deal. (File)\n\nChina said on Thursday it had suspended an economic agreement with Australia, in an apparent tit-for-tat response to Canberra's scrapping of a Belt and Road infrastructure pact and threat to undo a deal leasing Darwin Port to a Chinese company.\n\nRelations between the two sides have collapsed into acrimony after Canberra called for an independent probe into the origins of the coronavirus pandemic and banned telecoms giant Huawei from building Australia's 5G network.\n\nChina -- Australia's biggest trading partner -- has already imposed tariffs on more than a dozen key industries, including wine, barley and coal, decimating exports.\n\nIn the latest recrimination, the China-Australia Strategic Economic Dialogue was pulled \"based on the current attitude\" of the Australian government, China's National Development and Reform Commission said in a statement Thursday, blaming some officials of a \"Cold War mindset\" and \"ideological discrimination\".\n\nBeijing will \"indefinitely suspend all activities under the framework\" of the agreement, the statement added.\n\nThe Australian dollar sank 0.6 percent soon after the news.\n\nCanberra has previously described the accord -- designed to boost trade between both sides and introduce large Chinese investors -- as one of the \"premier bilateral economic meetings with China\".\n\nThe first meeting in 2014 was called a chance for \"closer economic ties\" by Canberra.\n\nBut relations between the two have sunk into the deep freeze.\n\nLast month, Prime Minister Scott Morrison's government scrapped a Belt and Road deal between Beijing and the state of Victoria.\n\nChinese President Xi Jinping's signature Belt and Road Initiative is a vast, trillion-dollar plan for a network of investments and infrastructure across Asia and the world.\n\nBeijing reacted with anger to the Victoria state announcement, warning that taking the axe to the deal would cause \"serious harm\" to relations.\n\nBut critics have claimed the stand-off between the two sides is cover for Beijing to create geopolitical and financial leverage.\n\nThis week Australia doubled-down by saying a Chinese company's controversial 99-year-lease on Darwin Port was also under review and could be scrapped.\n\nDarwin is the most important port on Australia's north coast, the closest to Asia and a base for US Marines who rotate in and out of the country.\n\nDefence minister Peter Dutton told the Sydney Morning Herald his department had been asked to \"come back with some advice\" about the 2015 deal and refused to rule out forcing Chinese firm Landbridge to divest on national security grounds.\n\nThe deal -- brokered by local authorities in Australia's Northern Territory -- had raised serious concern in Canberra and Washington, where it was seen as a strategic liability.\n\nIt was not immediately clear if the row would impact on a free trade agreement between China and Australia that came into effect in 2015.\n\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
    "Title": "China Suspends Economic Accord With Australia, Cites \"Cold War Mindset\""
  },
  {
    "Date": "Thu, 06 May 2021 09:28:33 +0530",
    "Description": "Cascade Investment, the holding company created by Bill Gates, transferred stock in two of Mexico's largest companies to Melinda French Gates, bringing the total amount she's received in the past few...",
    "Image": "https://c.ndtvimg.com/2021-05/a5h4702k_melinda-gates_625x300_06_May_21.jpg",
    "Link": "https://www.ndtv.com/world-news/melinda-gates-receives-billions-from-cascade-bill-gatess-biggest-asset-2433633",
    "Text": "Separation is expected to involve a wealth transfer that's only been seen in few other divorces. (File)\n\nCascade Investment, the holding company created by Bill Gates, transferred stock in two of Mexico's largest companies to Melinda French Gates, bringing the total amount she's received in the past few days to more than $2 billion.\n\nCascade moved stock in Coca-Cola FEMSA and Grupo Televisa to her control, according to regulatory filings dated May 3, the same day the Gateses announced they were ending their 27-year marriage. Cascade shifted about $1.8 billion of shares in Canadian National Railway Co. and AutoNation Inc. this week to French Gates, Bloomberg reported Tuesday.\n\nTheir separation is expected to involve a wealth transfer on a scale that's only been seen in a few other divorces, though few details have yet emerged. It could also have ramifications for one of the most important philanthropic organizations on the planet. The Bill & Melinda Gates Foundation has given away in excess of $50 billion to support healthcare, education, gender equality and efforts to combat climate change.\n\nGates, the 65-year-old co-founder of Microsoft Corp. is worth $144.2 billion, according to the Bloomberg Billionaires Index. French Gates, 56, is a former Microsoft manager who's gained international prominence co-running the foundation, and more recently for starting Pivotal Ventures, an investment and incubation company to advance 'social progress' in the U.S.\n\nBill Gates's biggest asset is Cascade Investment, which he created with the proceeds of Microsoft stock sales and dividends. Cascade oversees a vast portfolio comprising real estate, energy and hospitality as well as stakes in dozens of public companies.\n\nThe biggest public position is agricultural-machinery maker Deere & Co., with Cascade holding more than 10% of the stock valued at about $12 billion, followed by an $11.8 billion stake in waste-collection company Republic Services Inc., Bloomberg data show. That's followed by Canadian National and Ecolab Inc.\n\nMost of the portfolio, overseen by money manager Michael Larson, is comprised of North American companies, but it also owns stock in Diageo Plc, the world's largest distiller, and London-based private-jet services firm Signature Aviation Plc.\n\nThe Gateses are also among the largest landowners in America and have homes including their 66,000 square-foot mansion in Medina, Washington.\n\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
    "Title": "Melinda Gates Receives Billions From Cascade, Bill Gates's Biggest Asset"
  },
  {
    "Date": "Thu, 06 May 2021 10:31:26 +0530",
    "Description": "Australian officials reinstated social distancing measures across greater Sydney on Thursday, as they scrambled to find missing tranmission links in a COVID-19 case connected to an Indian variant of...",
    "Image": "https://c.ndtvimg.com/2021-05/u3ikkkj8_australia-covid_625x300_06_May_21.jpg",
    "Link": "https://www.ndtv.com/world-news/australia-curbs-in-sydney-as-officials-trace-mystery-case-of-indian-covid-variant-2434080",
    "Text": "Speedy tracing systems, movement curbs have largely reined in the spread of COVID-19 in Australia.\n\nAustralian officials reinstated social distancing measures across greater Sydney on Thursday, as they scrambled to find missing tranmission links in a COVID-19 case connected to an Indian variant of the virus.\n\nWith many people expected to gather over the weekend for annual Mother's Day celebrations, the New South Wales state government restricted household gatherings to 20 guests and limited aged care facility visitors to two people per resident.\n\nMasks will be mandatory on public transport and at indoor venues. All the restrictions, which cover around 5.3 million people in the country's biggest metropolitan area, take effect at 5 p.m. local time and are scheduled to last until Monday morning.\n\n\"We believe this is a proportionate response to the risk we have ahead of us,\" NSW Premier Gladys Berejiklian told reporters.\n\nThe measures, which also cover Sydney's neighbouring regions of Wollongong, the Central Coast and Blue Mountains, were spurred by the detection of COVID-19 in a 50-year-old man, who passed the infection to his wife.\n\nThe case, the first local transmission in NSW in more than a month, baffled health officials given the man had no known links to high-risk jobs or people.\n\nTesting has determined the man was infected with a variant first detected in India and genomic sequencing had linked the case to a returned traveller from the United States, NSW Chief Health Officer Kerry Chant said on Thursday, but there was no clear transmission path between the two people.\n\n\"We can't find any direct link between our case, so what we're concerned about is there is another person that is as yet unidentified that infected our case,\" Mr Chant said.\n\nIt appeared to be the first time officials had reported the local transmission of an India virus variant in Australia.\n\nTests on the infected man had showed a higher viral load than typically seen in infected people, potentially increasing the chance that the man has spread the disease, officials said.\n\nNSW Treasurer Dominic Perrottet entered self-isolation on Thursday after he visited a restaurant at the same time as the infected person, classifying him as a close contact, his office said. Perrottet, who attended a sitting of state parliament on Wednesday, has tested negative.\n\nAuthorities also asked thousands of residents in the city's inner west to seek testing for any mild flu symptoms after fragments of the coronavirus that causes COVID-19 were detected in the sewerage network used by several suburbs.\n\nSpeedy tracing systems, movement curbs and border restrictions have largely reined in the spread of COVID-19 in Australia, which has recorded 29,865 cases and 910 deaths since the pandemic began.\n\nINDIA BAN\n\nThe federal government is currently under pressure to overturn a temporary travel ban on travellers, including its own citizens, from COVID-ravaged India. Australia has blocked all direct flights from the country until May 15.\n\nA report in the Sydney Morning Herald newspaper on Thursday, citing unidentified sources, said at least two repatriation flights will be dispatched to India every week from the middle of this month to bring home around 9,000 Australians.\n\nPrime Minister Scott Morrison, however, said the situation would be constantly reviewed.\n\n\"We are not going to commit to that at this point,\" Mr Morrison told radio station 3AW on Thursday.\n\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
    "Title": "'Mystery Case' Of Indian Covid Variant Leads To Curbs In Sydney"
  },
  {
    "Date": "Thu, 06 May 2021 05:40:14 +0530",
    "Description": "SpaceX managed to land its prototype Starship rocket at its Texas base without blowing it up on Wednesday, the first time it has succeeded in doing so in five attempts.",
    "Image": "https://c.ndtvimg.com/2021-03/veddhv5o_spacex-starship-rocket650_625x300_04_March_21.jpg",
    "Link": "https://www.ndtv.com/world-news/spacex-successfully-lands-starship-rocket-at-texas-base-on-fifth-attempt-2431344",
    "Text": "A small fire engulfed the base of the space vessel shortly after landing (File)\n\nSpaceX managed to land its prototype Starship rocket at its Texas base without blowing it up on Wednesday, the first time it has succeeded in doing so in five attempts.\n\nThe test flight represents a major win for the hard-charging company, which eventually wants to carry crew inside Starship for missions to Mars.\n\n\"Starship landing nominal!\" tweeted founder Elon Musk triumphantly, after the last four tries ended in big explosions.\n\n\"Nominal\" means normal in the context of spaceflight.\n\nThe execution wasn't quite perfect, with a small fire engulfing the base of the 50 meter- (160 feet-) high rocket, dubbed SN15, shortly after landing.\n\nSpaceX webcaster John Insprucker explained this was \"not unusual with the methane fuel we're using,\" adding engineers were still working out design issues.\n\nThe flames were quickly put out with water cannons, footage showed.\n\nEarlier, the rocket took off at around 5:25 pm local time (2225 GMT) from the Starbase in Boca Chica in southern Texas, reached an altitude of 10 kilometers (6 miles) and performed a series of maneuvers, including a horizontal descent called a \"belly flop.\"\n\nSpaceX was facing added pressure to succeed with Wednesday's flight after NASA last month announced a version of Starship will be used as a lunar lander when the space agency returns humans to the Moon.\n\nBut the $2.9 billion contract is currently suspended after two rival companies, Jeff Bezos' Blue Origin and Dynetics, lodged a protest.\n\nNevertheless, if the award is eventually confirmed, it will transform Starship from Musk's pet project to a major tax payer-funded venture, with all the scrutiny that entails.\n\nThe first two flight tests of Starship, SN8 and SN9, both crash landed and exploded when they launched in December and February, respectively.\n\nThe next, SN10, successfully landed then blew up a few minutes later on March 3.\n\nThe video feed cut out during the test flight of the fourth, SN11, with Musk later confirming it too had exploded, this time in mid-flight.\n\nEventually, SpaceX plans to combine the Starship spaceship with a Super Heavy rocket, creating a fully reusable system to explore deep into our solar system.\n\nThis final version will stand 394 feet (120 meters) tall and will be able to carry 100 metric tonnes into Earth orbit -- the most powerful launch vehicle ever developed.\n\nMusk wants to use this to help realize his goal of transforming humanity into a multiplanetary species with a colony on Mars.\n\nThe planned lunar version of Starship would however serve a more modest goal -- docking with a future lunar orbital station, collecting astronauts, then setting them down on the Moon.\n\nTo get the astronauts to the lunar station in the first place, NASA has a more traditional plan in mind: using its own giant SLS rocket with a crew capsule called Orion affixed on top.\n\nBut the SLS rocket has suffered severe delays and cost overruns, and observers have mused if Starship succeeds, it could one day make SLS obsolete.\n\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
    "Title": "SpaceX Starship Finally Nails First Landing Without Exploding"
  },
  {
    "Date": "Thu, 06 May 2021 10:38:24 +0530",
    "Description": "The Union Ministry of Home Affairs shot off another letter to the West Bengal government asking why it had not written back about measures taken to stop the violence after Sunday's election result.",
    "Image": "https://c.ndtvimg.com/2021-04/c28so2is_amit-shah-bengal-elections-pti_625x300_11_April_21.jpg",
    "Link": "https://www.ndtv.com/india-news/bengal-warned-of-stern-action-in-2nd-home-ministry-letter-over-violence-2429827",
    "Text": "The Home Ministry, under Amit Shah, has pulled up the Bengal government. (File)\n\nOn a day West Bengal Chief Minister Mamata Banerjee was sworn in for a third term after a decisive win against the BJP, the Union Ministry of Home Affairs shot off another letter to the state government asking why it had not written back about measures taken to stop the violence after Sunday's election result.\n\n\"I remind you that no report has been submitted despite my asking for details on post-poll violence on May 3rd. Non-compliance of this second letter would be taken seriously,\" Union Home Secretary Ajay Bhalla said in the second letter dispatched to state government two days after he wrote the first letter.\n\nMr Bhalla also asked the West Bengal Chief Secretary why adequate measures to stop the violence have not been taken so far. \"There are fresh reports which suggest that post-poll violence has not stopped. Immediate measures should be taken to stop violence and report regarding the same should be sent immediately,\" he wrote.\n\nA four-member team of the Home Ministry, headed by an Additional Secretary, has been sent to West Bengal to assess the ground situation, government officials said.\n\nThe National Human Rights Commission (NHRC) on Wednesday also took note of the post-poll violence that erupted in West Bengal after assembly election results were announced on May 2. The human rights body had requested its Deputy Inspector General (Investigation) to constitute a team to look into the matter. The team has been asked to conduct an on-the-spot fact-finding investigation and submit it in two weeks.\n\n\"Considering as a fit case of an alleged violation of Right to Life of the innocent citizens, the Commission has today taken suo-moto cognizance of the matter and has requested its DIG (Investigation) to constitute a team of the officers of the Investigation Division of the Commission to conduct an on the spot fact-finding investigation and to submit a report at the earliest, preferably within two weeks,\" the NHRC said.\n\nSeveral other human rights bodies such as the National Commission for Protection of Child Rights (NCPCR) and the National Commission for Women (NCW) have also raised concerns over reports of violence and sought an inquiry.\n\nBoth the BJP and the Left have slammed the Trinamool Congress and accused it of attacking their workers amid victory celebrations after the May 2 results.\n\nThe Trinamool Congress and the West Bengal Police have rebuffed most of the charges saying a large number of fake videos and images from older incidents were being spread on social media.\n\nOn Tuesday, BJP National President JP Nadda visited Bengal to meet the families of the victims assuring that justice will be served democratically. \"Mamata ji, what your party has done after victory, shows how much you and your party workers believe in democracy. The TMC workers and the politician are claiming that the clips of these incidents doing the rounds on social media are nothing but fake news. I would like to request the media to tell the truth to the nation,\" said Mr Nadda.\n\nTrinamool Congress leaders said they had nothing to do with any such incidents and urged people to maintain peace and follow COVID-19 protocols.",
    "Title": "Hours After Mamata Banerjee Takes Charge, A Home Ministry Warning"
  },
  {
    "Date": "Thu, 06 May 2021 10:58:24 +0530",
    "Description": "Two-time Olympic medallist Sushil Kumar's role is under scanner after his name emerged in connection with a brawl that led to the death of a wrestler inside the Chhatrasal Stadium complex in north...",
    "Image": "https://c.ndtvimg.com/2021-04/tsib9se_sushil-kumar-afp_625x300_22_April_21.jpg",
    "Link": "https://www.ndtv.com/india-news/olympian-wrestler-sushil-kumar-named-in-fir-over-murder-at-delhi-stadium-2434973",
    "Text": "Sushil Kumar did not answer his phone when contacted to comment on the issue.\n\nTwo-time Olympic medallist Sushil Kumar's role is under scanner after his name emerged in connection with a brawl that led to the death of a wrestler inside the Chhatrasal Stadium complex in north Delhi, police said on Wednesday.\n\nSushil Kumar, the county's only athlete to have won two individual Olympic medals, was named in the FIR, they said.\n\nAccording to police, a 23-year-old wrestler died and his two friends got injured after they were allegedly brutally assaulted by other wrestlers inside Chhatrasal Stadium in northern part of city.\n\nPolice said that on the intervening night of Tuesday and Wednesday, an information regarding firing inside the Chhatrasal Stadium was received at Model Town police station.\n\nPolice reached the spot and found five cars parked in the parking area of the stadium.\n\nDuring enquiry, it was found that a quarrel had taken place allegedly between Sushil Kumar, Ajay, Prince, Sonu, Sagar, Amit, and others in the parking area. Thereafter, police registered a case under relevant sections of the Indian Penal Code (IPC) and Arms Act at Model Town police station in this regard, they said in a statement.\n\nThe injured were shifted to BJRM Hospital for treatment. They were identified as Sagar, a resident of Model Town, Amit Kumar, 27, a resident of Rohtak in Haryana, and Sonu, 35, a resident of Sonipat in Haryana, they said.\n\n\"The crime scene as well as all the five vehicles were inspected. During inspection, one double barrel loaded gun with five live cartridges were found in one Scorpio and two wooden sticks were also recovered from the spot.\n\n\"All the five vehicles and weapons of offence were seized. The crime scene was further inspected by forensic experts of FSL, Rohini,\" Additional Deputy Commissioner of Police (northwest) Guriqbal Singh Sidhu said.\n\nDuring the investigation, information regarding the death of Sagar and injury to Sonu was received from Trauma Centre, Civil Lines, following which sections 302, 365, 120B of the IPC were registered, he said.\n\nSeveral teams have been formed to trace the alleged persons. Technical evidences relating to this incident have been obtained. The details of the recovered vehicles are also being obtained from the concerned authority, police said.\n\nOne Prince Dalal, 24, a resident of Jhajjar in Haryana, has been apprehended in this case, along with one double-barrel gun, they said. Police said they have recovered two double-barrel guns, seven live cartridges, two wooden sticks, and five cars.\n\nOfficial sources claimed that the incident took place due to a property dispute in the Model Town area.\n\n\"It was not a case of trespassing. The accused took the victims inside the stadium where they assaulted them in the parking area. Sushil Kumar was present at the spot when the incident happened, however, police are investigating his role in the assault,\" an official source said.\n\nHowever, Sushil Kumar did not answer his phone when contacted to comment on the issue.",
    "Title": "Olympian Wrestler Sushil Kumar Named In FIR Over Murder At Delhi Stadium"
  },
  {
    "Date": "Thu, 06 May 2021 10:15:59 +0530",
    "Description": "The good news is that the vaccines work against a new virus strain circulating in India that's spread to several other countries.",
    "Image": "https://c.ndtvimg.com/2021-05/4gvjm9bs_covid-india_625x300_06_May_21.jpg",
    "Link": "https://www.ndtv.com/india-news/the-good-news-is-that-vaccines-work-against-india-strain-the-bad-news-2434326",
    "Text": "Indian strain is called a double mutant because of the presence of two changes in the virus's genome.\n\nThe good news is that the vaccines work against a new virus strain circulating in India that's spread to several other countries.\n\nThe bad news is it won't be only the new version of the pathogen to emerge from an outbreak of this scale, underscoring the urgency of mapping other possible variants that may be currently racing through India's tightly-packed population of 1.4 billion people.\n\nAs infections surge by more than 300,000 cases for 14 straight days, pushing India's tally past 20 million, the country's limited ability to track new mutations emerging from its outbreak is a growing concern for scientists.\n\nSecond- or even third-generation versions of the variant known as B.1.617 could already be circulating in India and some may be more dangerous, said William Haseltine, a former Harvard Medical School professor who now chairs think tank Access Health International.\n\n\"India has the necessary genome sequencing capabilities but it needs to have a mass surveillance program,\" Haseltine said. \"I'll be on the lookout for more and newer variants, given the opportunity the virus has had with such a massive outbreak.\"\n\nVariants are already outracing vaccination progress in many parts of the world, fueling bigger outbreaks that spread faster. While some rich nations that secured effective vaccines early have seen their epidemics wane, the virus is still spreading like wildfire in developing economies, prolonging the pandemic.\n\nSuper Mutant Debunked\n\nMutations occur when the virus replicates, and India's unprecedented surge is driving new cases to global records, even as richer economies like the U.S. and Israel re-open quickly. Fearing an influx of infections and mindful of B.1.617, Singapore, the U.K. and Tanzania are among countries that have curbed travel to and from India.\n\nAustralia has banned its citizens from returning from India and imposed penalties of roughly $50,000 and five years imprisonment for violators.\n\nThe India strain has been called a double mutant because of the presence of two changes in the virus's genome, called E484Q and L452R. Both affect a portion of the spike protein, called the receptor binding domain, that's key to the virus entering cells.\n\nSome researchers estimate that the B.1.617 variant is as transmissible as the B.1.1.7 variant that emerged in the U.K., thought to be as much as 70% more transmissible than earlier versions of the virus.\n\nYet initial analyses indicate that the India version, now classified a variant of interest by the World Health Organization, poses a limited threat and doesn't appear to be more dangerous.\n\nCovaxin, the inactivated-virus vaccine being made by India's Bharat Biotech International Ltd., and AstraZeneca Plc's vaccine, called Covishield in India, are effective against the strain in preventing serious illness, said Rakesh Mishra, director of the Centre for Cellular and Molecular Biology in Hyderabad, one of the labs analyzing virus samples. Data is still being gathered about the response to Russia's Sputnik V vaccine, Mishra said, but it's likely to be effective.\n\nBioNTech SE Chief Executive Officer Ugur Sahin said he was confident the mRNA shot it's making with partner Pfizer Inc. would work against the India mutant though testing is still ongoing. \"The Indian variant has the same mutation that we've already investigated and against which our vaccine was also effective,\" he said last week.\n\nSingapore, which tightened social distancing restrictions this week after findings cases linked to the India variant, has also seen vaccines hold up well to prevent serious illness, said Kenneth Mak, director of medical services in city-state's health ministry. But \"vaccination does not prevent you from getting infected 100%,\" he said in a Tuesday briefing.\n\nRavindra Gupta's team at the University of Cambridge recently studied the two mutations that appear on the receptor binding domain of the India variant's spike protein. The team tested viruses made to simulate the variant against serum from nine people who had already received a single dose of the BioNTech-Pfizer vaccine.\n\n\"We wanted to know whether this double mutant really is a double whammy,\" said Gupta, a professor of clinical microbiology at Cambridge's Institute for Therapeutic Immunology and Infectious Diseases. What they found was that while each of the mutations could partly evade neutralizing antibodies, the two mutations didn't combine to create an even greater ability to evade immune protection.\n\n\"They don't combine to make a super mutant,\" Gupta said. \"It kind of debunks this view that this double mutant is doubly evading neutralizing antibodies.\"\n\nHere is the REALLY IMPORTANT part. The combination of the two mutations gives a value of 4, in other words the two mutations DO NOT confer substantial antibody evasion and we can stop using the term 'Double Mutant'. — Gupta Lab, Cambridge (@GuptaR_lab) May 1, 2021\n\nWhile the findings ease concerns around B.1.617, researchers are turning to the next set of variants as India's outbreak continues to rage. Genomic surveillance can provide crucial information on the new forms of this shape-shifting virus -- critical in preventing subsequent waves and developing the next generation of vaccines.\n\nIn the U.S., recent studies published by the Centers for Disease Control and Prevention show that a variant that caused concern when it emerged in New York isn't more dangerous than earlier strains, while a pair of mutants that surfaced in southern California \"might more frequently cause discernible and severe illness than do nationally circulating lineages overall.\"\n\nThe WHO has been monitoring variants through a global working group of laboratories, said Maria Van Kerkhove, the agency's technical lead officer. Information about new variants is coming in \"fast and furious,\" she said.\n\nBut as its health system is stretched to breaking point and Prime Minister Narendra Modi resists calls for a lockdown, the country's labs are ill-equipped to keep up with the necessary monitoring. Genomic sequencing that can identify new strains and track their progress is still relatively sparse in India, where only about 11,000 viruses have been analyzed, according to Mishra.\n\nWhile countries like the U.K. monitor about 5% to 10% of cases, in India far fewer are sequenced. To do so would require analyzing tens of thousands of samples daily, and failing to leaves a huge blind spot, according to Ashish Jha, dean of Brown University's School of Public Health in Rhode Island.\n\n\"What genomic surveillance does,\" he said, \"is it helps you really track where infections are going and how things are spreading in a way India was pretty blind to.\"\n\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
    "Title": "The Good News Is That Vaccines Work Against India Strain. The Bad News..."
  },
  {
    "Date": "Thu, 06 May 2021 09:24:08 +0530",
    "Description": "Ajit Singh, Union Minister in several governments and one of India's senior most politicians, died on Thursday at 82. The Rashtriya Lok Dal (RLD) chief had been battling Covid, his son Jayant...",
    "Image": "https://c.ndtvimg.com/2021-05/58tf4d5_ajit-singh-650_625x300_06_May_21.jpeg",
    "Link": "https://www.ndtv.com/india-news/ajit-singh-former-union-minister-dies-of-covid-19-2433439",
    "Text": "Ajit Singh Dies of Covid-19 : He was diagnosed with Covid, his son said in tweets.\n\nAjit Singh, Union Minister in several governments and one of India's senior most politicians, died on Thursday at 82. The Rashtriya Lok Dal (RLD) chief had been battling Covid, his son Jayant Chaudhary tweeted.\n\nAjit Singh was diagnosed with Covid on April 20, his son said in tweets. “He battled his condition till the very end and breathed his last today morning,” he said.\n\nPrime Minister Narendra Modi was among those who paid tribute to the politician, known to be a prominent voice of farmers.\n\n“He was always dedicated to the cause of farmers. He ably fulfilled many responsibilities at the centre,” PM Modi wrote.\n\nAjit Singh, an alum of IIT Kharagpur and the Illinois Institute of Technology,. was a seven-time MP and Union Minister in the governments of VP Singh, PV Narasimha Rao, Atal Bihari Vajpayee and Manmohan Singh. He enjoyed an immense following in politically vital Uttar Pradesh, especially its western parts dominated by Jats.\n\nThe son of former Prime Minister Chaudhary Charan Singh, Ajit Singh quit the computer industry to return to India and join politics when his father fell ill.\n\nHe became a Rajya Sabha member in 1986. When his father died the next year, he was asked to take over as chief of the Lok Dal, but amid internal tussles, the party split. Ajit Singh then formed his own party.\n\nHe went on to win many Lok Sabha elections from Baghpat in western Uttar Pradesh, his father's constituency. He only lost twice from Baghpat, once in 1998 and then in 2014. In 2019, he shifted to Muzaffarpur in UP but lost to the BJP.\n\nThroughout his political career, he was known to stitch up sharp alliances that mostly landed him on the ruling side.\n\nHe was the President of Lok Dal (A) and Janata Party in 1987 and 1988. In 1989, he joined the Janata Dal when many parties decided to merge under the leadership of VP Singh to fight the Congress.When VP Singh was Prime Minister, Ajit Singh took over as Industries Minister.\n\nLater, he joined the Congress and became Food Minister in the Narasimha Rao government. He won the 1996 election as a Congress candidate but quit the party the same year and formed the Rashtriya Lok Dal.\n\nHe was Minister of Agriculture in the Vajpayee-led BJP government from 2001 to 2003. In 2011, his party joined the Congress-led UPA and he became Civil Aviation Minister.",
    "Title": "Ajit Singh, Former Union Minister And RLD Chief, Dies Of COVID-19"
  },
  {
    "Date": "Thu, 06 May 2021 10:08:24 +0530",
    "Description": "When Shardul Kadam said that he would wear a mangalsutra on his wedding day, his decision to turn an old ritual on its head raised many eyebrows.",
    "Image": "https://c.ndtvimg.com/2021-05/18ghs6r_groom-wears-mangalsutra-shardul-kadam_625x300_06_May_21.jpg",
    "Link": "https://www.ndtv.com/offbeat/this-bride-and-groom-exchanged-mangalsutras-what-happened-next-2434144",
    "Text": "Shardul and Tanuja exchanged mangalsutras on their wedding day.\n\nWhen Shardul Kadam said that he would wear a mangalsutra on his wedding day, his decision to turn an old ritual on its head raised many eyebrows. The mangalsutra is a sacred thread which is traditionally tied by the groom around the bride's neck on their wedding day. \"After the pheras when Tanuja and I tied the mangalsutra around each other's neck, I was so happy,\" recalls Shardul, who spoke to Humans of Bombay about why he chose to wear a mangalsutra and how that one decision made the couple a target of Internet trolls.\n\nShardul and Tanuja met in college, although their love story began four years after they graduated. \"We reconnected in the most unexpected way. She'd shared a Himesh Reshammiya song on Instagram and captioned it as 'torture'-I replied back saying 'maha torture'...that's how we started talking,\" says Shardul.\n\nWhen they met for tea after a few weeks and started talking about feminism, Shardul declared himself to be a \"hardcore feminist\".\n\n\"She looked at me as if she hadn't expected me to say that!\" he says.\n\nShardul and Tanuja dated for a year before they informed their parents, who were thrilled. In September 2020, as the first wave of the coronavirus pandemic subsided, they started planning their wedding.\n\n\"That's when I told Tanuja, 'Why is it that only a girl has to wear a mangalsutra? It makes no sense!' We were both equals, so I announced, 'Even I'll wear a mangalsutra on our wedding day!'\" Shardul tells Humans of Bombay.\n\nHis parents were surprised and relatives questioned his decision, but Shardul refused to budge, saying that wearing a mangalsutra to him represented equality.\n\n\"For some reason, the girl's family is 'supposed' to bear the cost of the wedding, but I went to Tanuja's parents and told them that we'd split all costs,\" he said further.\n\nThe day before their wedding, Tanuja asked him if he would wear the mangalsutra after the wedding as well - and Shardul said he would. Their wedding went off smoothly. \"Even though a few male relatives weren't happy about it, they didn't say anything to us,\" says Shardul, referring to the exchange of mangalsutras.\n\nHowever, the next day, the newlyweds woke up to \"terrible backlash\" on social media. \"A digital newspaper had picked up our story,\" says Shardul.\n\n\"People started commenting- 'Now wear a saree also', 'Do you bleed once a month?' Even liberals started trolling me, 'This is not the way to support gender equality,' they said.\"\n\nShardul says he expected some trolling to come his way, but the extent of it surprised him. \"At first, Tanuja was affected by it, but it's been 4 months now and we're just done with the trolls,\" he says.\n\n\"Because Tanuja and I can define our relationship better than anyone else; we support each other's work, believe in each other's dreams, and are in this journey together. So, who cares what the world thinks?\" Shardul concludes.\n\nYou can read his post below:\n\nShardul and Tanuja's story has struck a chord with the Internet, racking up more than 82,000 'likes' on Instagram and thousands more on Facebook.\n\n\"Proud of your decision and God bless you both with lots of strength and happiness,\" wrote one Facebook user.\n\n\"I respect groom's feelings. I don't think he has done anything wrong. He has worn mangalsutra as a symbol of equality and portrayed his thinking,\" said another.\n\nIn 2019, another wedding with a difference had gone viral on social media. At that wedding, the bride's father refused to do kanyadaan or give away the bride, saying that his daughter is \"not property to give away\".\n\nClick for more trending news",
    "Title": "This Bride And Groom Exchanged Mangalsutras. What Happened Next"
  },
  {
    "Date": "Thu, 06 May 2021 10:26:43 +0530",
    "Description": "Both, Radhika and Pulkit, shared images of themselves getting vaccinated on their respective Instagram accounts.",
    "Image": "https://c.ndtvimg.com/2021-05/v16mbji_radhika-madan-pulkit-samrat_625x300_06_May_21.jpg",
    "Link": "https://www.ndtv.com/entertainment/radhika-madan-pulkit-samrat-get-vaccinated-urge-fans-to-take-covid-19-jab-2434286",
    "Text": "Radhika, Pulkit get vaccinated. Image (L) courtesy @radhikamadan) and (R) courtesy @pulkitsamrat)\n\nAt a time when COVID-19 cases in Indian are increasing by the day, the government has reiterated that vaccination is the way forward. Many of our favourite actors and actresses, too, have shared this message, urging people to take the jab as soon as possible. Once the government allowed all those above the age of 18 to get vaccinated, many young celebrities led by example and got their shots recently. For instance, actress Radhika Madan shared a photo of herself getting vaccinated on Wednesday. In the image, the 'Angrezi Medium' actress can be seen in a pair of shorts and a comfortable T-shirt. She has taken care to wear a double mask and a face shield as well.\n\nUrging fans to get vaccinated, she wrote in the caption, \"One step at a time #vaccinated... I urge everyone to get themselves registered and get their shot and please take full precautions at the vaccination centres. Wear a double mask, sanitize your hands, maintain distance and don't panic. Don't forget to get a good night's sleep the day before and stay well hydrated.\"\n\nRadhika was congratulated by her fans and photographer Atul Kasbekar also left happy emoticons in the comment section.\n\nLike Radhika, actor Pulkit Samrat shared a photo of himself getting vaccinated on Instagram. Pulkit, who is seen in a mask and face shield in the photo, wrote, \"#Jab We Met. This is our best form of defence. Be safe.\" Fashion designer Manish Malhotra and celebrity hairstylist Aalim Hakim congratulated Pulkit on taking the first step towards protecting himself from coronavirus.\n\nPreviously, actors such as Anil Kapoor and Madhuri Dixit had shared images of having received both COVID-19 vaccination shots. Sharing an image of herself getting the second dose of vaccination, Madhuri urged her fans and social media followers to follow suit. The 53-year-old actress wrote, \"Got my second jab today. I urge everyone to get vaccinated as soon as it's available to you.\"\n\nHer co-star of many films, actor Anil Kapoor, 64, also kept his fans informed about his vaccination progress. Sharing an image of himself getting the shot, Anil said, \"Done with the second dose.\"\n\nOn Thursday, data showed that India had recorded over 4.12 lakh new cases, taking the caseload to 2.06 crore in the last 24 hours. Within the same timeframe, 3,980 people died of Covid in India, taking the total fatalities to 2,30,168.\n\nIf there was ever a time to emulate your favourite movie stars, it is now. Like them, register for the vaccine and protect yourself from COVID-19.",
    "Title": "Actors Radhika Madan And Pulkit Samrat Get Their First Vaccine Shots"
  }
]