[
  {
    "Date": "Mon, 10 May 2021 10:02:17+5:30 ",
    "Description": "At present, India has 37.45 lakh active coronavirus cases.",
    "Image": "https://images.livemint.com/img/2021/05/10/600x338/PTI05_08_2021_000214A_1620547060163_1620617170252.jpg",
    "Link": "https://www.livemint.com/news/india/covid19-india-reports-slight-dip-in-daily-infections-active-cases-go-up-11620616833123.html",
    "Text": "India on Monday reported 3,66,161 new COVID-19 cases in last 24 hours after reporting more than four lakh daily coronavirus infections for the fourth day on the trot.\n\nWith this, the cumulative national tally of the infection went up to 2,26,62,575, the union health ministry informed on Monday morning.\n\nThe country saw 3,53,818 fresh recoveries on Sunday, pushing the total number of discharges to 1,86,71,222.\n\nAt present, India has 37,45,237 active coronavirus cases.\n\n3,754 covid related deaths were also registered in the last 24 hours, taking the total COVID-related death toll to 2,46,116.\n\nAs many as 17,01,76,603 vaccination doses had been administered in the country up to May 7.\n\nThe vaccination process, which started on January 16, is currently underway in the country.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter.",
    "Title": "Covid-19: India reports slight dip in daily infections, active cases go up"
  },
  {
    "Date": "Mon, 10 May 2021 11:05:28+5:30 ",
    "Description": "Nepal PM Oli faces a confidence vote after alliance partner NCP (Nationalist Congress Party) withdrew support last month",
    "Image": "https://images.livemint.com/img/2021/05/10/600x338/AFP_93M3LX_1620624897778_1620624907045.jpg",
    "Link": "https://www.livemint.com/news/world/nepal-pm-kp-sharma-oli-set-to-face-vote-of-confidence-in-parliament-today-11620624739135.html",
    "Text": "Kathmandu: CPN-UML (Communist Party of Nepal- Unified Marxist Leninist) leader and Prime Minister of Nepal KP Sharma Oli is set to face a confidence vote in Parliament on Monday.\n\nA special Parliamentary session is set to take place where the fate of PM Oli will be decided, the session is scheduled to start from 1 PM (local time) on Monday afternoon.\n\nPM Oli faces a confidence vote after alliance partner NCP (Nationalist Congress Party) withdrew support last month.\n\nParliament secretariat has also made special arrangements for COVID positive MPs to participate in the vote.\n\nNepal's Parliament Secretariat has issued a probable schedule of Monday's meeting where senior leaders would make statements at the beginning of the meeting and then head for voting.\n\nEarlier this week Nepal's Federal Parliament members underwent RT-PCR COVID tests from Wednesday ahead of the special session.\n\n\"Over two dozen lawmakers who have tested positive for COVID-19 also would betaking part in the voting, arrangements have been made for them as well,\" Parliament Secretariat sources told ANI.\n\nCPN-UML (Communist Party of Nepal- Unified Marxist Leninist) has 121 seatsin Parliament.\n\nFormer PM Madhav Kumar is leading the rival faction. It had demanded that the government address their grievances earlier on Monday, also adding he would cast his vote against Oli if the government failed to address his demands.\n\nThe rival faction has been demanding to scrap of earlier decisions of Oli to form a General Convention Committee, \"cancel all the decisions made after party unification attempts and work together on existing problems that are surfacing inside the party\".\n\nAlong with the demands, the rival faction of the ruling party also has threatened to resign en-masse which would further endanger Oli to continue as Prime Minister.\n\nAhead of Monday's voting, the ruling CPN-UML also has issued a whip to all lawmakers belonging to a party to cast their votes in favor of the Prime Minister and party's parliamentary leader KP Sharma Oli.\n\n\"The whip was issued as per the Political Party Act-2017 and UML's Parliamentary Party Statue-2021. It has been made mandatory for all the lawmakers to attend the special session and vote in favor of Prime Minister Oli,\" Bishal Bhattarai, Chief Whip of the party confirmed.\n\nOli would require 136 votes to claim control over the floor of Parliament and continue his Prime Ministership but the prevailing situation in parliament would not help Oli to garner majority as he falls sort of 15 votes in the parliament.\n\nThe Opposition Nepali Congress has decided to vote against Oli. It has 61 seats in Parliament. While Maoist Center having 49 seats and later withdrew its support to the government has also decided to vote against Oli.\n\nJanata Samajbadi Party has a decisive role in the parliament with 32 lawmakershas decided to let its Parliamentary members let decide on their own whether to supportor go against Oli.\n\nThis story has been published from a wire agency feed without modifications to the text. Only the headline has been changed.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter.",
    "Title": "Nepal PM KP Sharma Oli set to face vote of confidence in Parliament today"
  },
  {
    "Date": "Mon, 10 May 2021 09:24:15+5:30 ",
    "Description": "Petrol in Mumbai retailed at  ₹97.86 per litre while diesel at  ₹89.17 per litre.",
    "Image": "https://images.livemint.com/img/2021/05/10/600x338/petrol_diesel_price_today-kBTF--621x414@LiveMint_1620618515255.JPG",
    "Link": "https://www.livemint.com/news/india/petrol-diesel-prices-rise-again-check-fuel-rates-in-your-city-11620618316649.html",
    "Text": "Petrol and diesel prices were up again in the national capital and stood at ₹91.53 and ₹82.06 per litre, respectively on Monday.\n\nAs compared to Sunday, petrol has become costlier by 26 paise while the price of diesel has increased by 33 paise.\n\nPetrol in Mumbai retailed at ₹97.86 per litre while diesel at ₹89.17 per litre.\n\nIn Kolkata, petrol stood at ₹91.66 per litre and diesel at ₹84.90 per litre and in Chennai, petrol stood at ₹93.38 per litre and diesel at ₹86.96 per litre.\n\nEarlier on Saturday and Sunday, the price of petrol and diesel remains unchanged.\n\nMaharashtra joined Rajasthan and Madhya Pradesh in the league of states where petrol rates breached the ₹100-a-litre mark.\n\nDelhi\n\nPrice of petrol in Delhi: ₹91.53 per litre\n\nPrice of diesel in Delhi: ₹82.06 per litre\n\nMumbai\n\nPrice of petrol in Mumbai: ₹97.86 per litre\n\nPrice of diesel in Mumbai: ₹89.17 per litre\n\nChennai\n\nPrice of petrol in Chennai: ₹93.38 per litre\n\nPrice of diesel in Chennai: ₹86.96 per litre\n\nKolkata\n\nPrice of petrol in Kolkata: ₹91.66 per litre\n\nPrice of diesel in Kolkata: ₹84.90 per litre\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter.",
    "Title": "Petrol, diesel prices rise again. Check fuel rates in your city"
  },
  {
    "Date": "Mon, 10 May 2021 11:04:04+5:30 ",
    "Description": "Had govt done its job, it would not have come to this: Rahul on foreign aid",
    "Image": "https://images.livemint.com/img/2021/05/10/600x338/f5a92faa-9dc4-11eb-aa67-d1e615859831_1619337483362_1620624548787.jpg",
    "Link": "https://www.livemint.com/news/india/had-govt-done-its-job-it-would-not-have-come-to-this-rahul-on-foreign-aid-11620623964088.html",
    "Text": "Hitting out at the Centre, Congress leader Rahul Gandhi on Monday said the government's \"repeated chest-thumping\" at receiving foreign aid to tackle the COVID-19 crisis in the country is pathetic and had it done its job, it would not have come to this.\n\nThe Congress had last week demanded transparency and urged Prime Minister Narendra Modi to make public the details of all the relief material received by India from different countries.\n\n\"GOI's repeated chest-thumping at receiving foreign aid is pathetic. Had GOI done its job, it wouldn't have come to this,\" Gandhi said in a tweet.\n\nGOI’s repeated chest-thumping at receiving foreign aid is pathetic.\n\n\n\nHad GOI done its job, it wouldn’t have come to this. — Rahul Gandhi (@RahulGandhi) May 10, 2021\n\n\n\n\n\nAs India reels under a calamitous second wave of the coronavirus infection, it has received large amounts of medical supplies from a significant number of countries, including the US, Russia, France, Germany, the UK, Ireland, Belgium, Romania, Singapore, Sweden and Kuwait.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter.",
    "Title": "Had govt done its job, it would not have come to this: Rahul on foreign aid"
  },
  {
    "Date": "Mon, 10 May 2021 05:56:09+5:30 ",
    "Description": "The ban was put in place after 11 crew members tested positive for Covid-19 in late-April, according to the shipyard official.",
    "Image": "https://images.livemint.com/img/2021/05/10/600x338/1000x-1_1620606222084_1620606228235.jpg",
    "Link": "https://www.livemint.com/news/world/shipyards-in-china-s-vessel-repair-hub-ban-arrivals-from-india-11620604665990.html",
    "Text": "Shipyards in the Chinese coastal city of Zhoushan have banned vessels that called at or changed crews in India in the last three months, citing concerns over rising infections in the South Asian nation.\n\nRestrictions on vessels from India as well as Bangladesh are now in place, prohibiting their arrival for maintenance and repair work, said a spokesperson from shipping and logistics firm Wilhelmsen Group.\n\nThe company was informed of the ban by a shipyard operating in the city, the spokesperson said. Details were confirmed by an official from Zhoushan Xinya Shipyard Co.\n\nSeveral shipyards in Zhoushan ranked among the world’s top 10 repairers in terms of 2019 business volume, according to state-owned China Daily. The city is also home to some of the country’s largest oil terminals and storage tank farms. The same restrictions do not extend to ships transporting cargoes from India, according to an official from Zhoushan port and oil traders who asked not to be identified.\n\nThe ban was put in place after 11 crew members tested positive for Covid-19 in late-April, according to the shipyard official. The infected people were onboard a vessel that had docked at a local shipyard.\n\nAn official of Euronav BV, one of the world’s largest independent crude ship owners, said in an interview Thursday that thousands of seafarers risk being stuck at sea beyond the expiry of their contracts because of India’s rising cases. Crew members from the Asian nation make up about 15% of the world’s total.\n\n\n\n\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter.",
    "Title": "Shipyards in China’s vessel-repair hub ban arrivals from India"
  },
  {
    "Date": "Mon, 10 May 2021 10:49:49 +0530",
    "Description": "Melinda French Gates began working with divorce lawyers well over a year before her split with Bill Gates was announced last week, partly over concerns about her husband's dealings with convicted sex...",
    "Image": "https://c.ndtvimg.com/2021-05/suo2jv5o_bill-gates-melinda-gates-bloomberg_625x300_10_May_21.jpg",
    "Link": "https://www.ndtv.com/world-news/bill-gates-divorce-talks-started-in-2019-due-to-jeffrey-epstein-report-2438580",
    "Text": "The couple said that they plan on remaining co-chairs and trustees of Bill & Melinda Gates Foundation.\n\nMelinda French Gates began working with divorce lawyers well over a year before her split with Bill Gates was announced last week, partly over concerns about her husband's dealings with convicted sex offender Jeffrey Epstein, according to the Wall Street Journal.\n\nThe 56-year-old spoke with attorneys from several firms as early as October 2019, saying the marriage was \"irretrievably broken,\" the Journal reported Sunday, citing documents and people familiar with the matter. Her unease about her ex-husband's ties to Epstein dates back to at least 2013, the paper said.\n\nThe New York Times reported in October 2019 that the billionaire had met with Epstein several times, and once stayed late at his New York townhouse. A spokeswoman for Microsoft Corp. co-founder said at the time that the meetings had centered on philanthropy. Epstein had died in jail two months prior while awaiting trial on federal charges related to sex trafficking.\n\nThe divorce was negotiated during the pandemic, involving legal teams working with a mediator to divide their fortune, which the Bloomberg Billionaires Index pegs at $145 billion.\n\nThe couple said that they plan on remaining co-chairs and trustees of the Bill & Melinda Gates Foundation. Billionaire Warren Buffett serves as the foundation's third trustee. All three have vowed to give away the vast majority of their wealth.\n\nIn the days after the split was announced, a holding company that Bill Gates created transferred equity stakes in four different companies, worth more than $2 billion in aggregate, to Melinda French Gates, Bloomberg News has reported. The bulk of it is from about 14.1 million shares in Canadian National Railway Co.\n\nDays before he died in a New York jail, Epstein named a little-known biotech venture capitalist named Boris Nikolic as backup executor of his will. Nikolic had worked as a science adviser to Bill Gates and more recently funded more than a dozen firms in gene editing and other health technologies.\n\nIn an emailed statement at the time, Nikolic told Bloomberg that Epstein had not consulted him about the will and that he had no intention to fulfill the duties.\n\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
    "Title": "Gates' Marriage \"Irretrievably Broken\" Since 2019 Over Epstein: Report"
  },
  {
    "Date": "Mon, 10 May 2021 01:34:03+5:30 ",
    "Description": "The EU is under pressure to ink an investment deal with India after tax disputes",
    "Image": "https://images.livemint.com/img/2021/05/09/600x338/4d4aae62-b0c8-11eb-a936-0e5204611abd_1620590461531_1620590525959.jpg",
    "Link": "https://www.livemint.com/news/india/eu-may-gain-from-negotiating-separate-trade-and-investment-pacts-with-india-11620590461896.html",
    "Text": "The decision by India and the EU to recast the stalled bilateral trade and investment agreement (BTIA) into three separate deals could favour the latter with its focus to have an investment pact with India after inking a similar deal with China.\n\nIn the first India-EU leaders’ meeting on Saturday, the two sides agreed to resume talks separately on trade, investment and geographical indications (GIs), which were earlier part of the BTIA before talks collapsed in 2013 after six years of negotiations.\n\n“We agreed to resume negotiations for a balanced, ambitious, comprehensive and mutually beneficial trade agreement that would respond to the current challenges. We agreed that to create the required positive dynamic for negotiations, it is imperative to find solutions to long-standing market access issues. We also agreed to the launch of negotiations on a standalone investment protection agreement. We also agreed to start negotiations on a separate agreement on geographical indications, which could be concluded separately or integrated into the trade agreement, depending on the pace of negotiations,\" according to a joint statement by India and the EU.\n\n“After the Cairn and Vodafone tax disputes, the EU is under severe pressure from member countries to conclude a high-quality investment agreement with India that protects their investments in India and includes a strong investor-state dispute settlement mechanism to which India is opposed to,\" a trade official associated with a government-run think tank said under condition of anonymity.\n\nThe EU had raised strong objection after India unilaterally terminated its 57 bilateral investment treaties (BITs), including those with EU members. India brought out a new model BIT in December 2015, intending to replace its existing BITs and future investment treaties, after foreign investors opted for international arbitration alleging discrimination and citing commitments made by India to others in bilateral treaties.\n\n“GI should have been part of an intellectual property chapter. EU has been demanding automatic recognition for their GIs such as liquor products and cheese. Most of India’s GIs are textiles and handicraft products, which EU may not recognize. EU will recognize only agricultural GIs. If the deal is along the line of mutually recognizing each other’s agricultural GIs, it is difficult to see India benefiting. Our law does not have any provision of automatic recognition of GIs from other countries. One has to go through the process of applying to the patent authority,\" he said.\n\nHowever, one comprehensive deal is difficult as negotiations can get stuck in many areas such as e-commerce, said Arpita Mukherjee, professor at Indian Council for Research on International Economic Relations.\n\n“In this manner, at least we can close some deals, which can be implemented on conclusion,\" she said.\n\nTrade is now a more vexed issue than in 2013 when negotiations broke down, said Biswajit Dhar, professor of economics at JNU. “Earlier, there was no political commitment on part of the government to protect the industry. Right now, there is a political commitment through initiatives such as Atmanirbhar Bharat and production-linked incentive (PLI) schemes,\" he said.\n\nThe focus seems to be more on process than substance, said a former trade secretary on condition of anonymity.\n\n“At present, this appears to be a political plank to be seen to move away from inertia in trade deals,\" he said.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter.",
    "Title": "EU may gain from negotiating separate trade and investment pacts with India"
  },
  {
    "Date": "Mon, 10 May 2021 11:13:42 +0530",
    "Description": "Coronavirus: The centre has defended its Covid vaccination policy - criticised for differential pricing, shortage of doses, and slow rollout - in an affidavit submitted to the Supreme Court late...",
    "Image": "https://c.ndtvimg.com/2021-04/kufejci_coronavirus-india-vaccine-afp_650x400_29_April_21.jpg",
    "Link": "https://www.ndtv.com/india-news/coronavirus-on-vaccine-policy-centre-tells-supreme-court-no-judicial-interference-called-for-leave-decision-to-executive-2438533",
    "Text": "India began the vaccine drive in January, with focus on healthcare and frontline workers (File)\n\nThe centre has defended its Covid vaccination policy - criticised for differential pricing, shortage of doses, and slow rollout - in an affidavit submitted to the Supreme Court late Sunday night.\n\nThe court began hearing the matter this morning.\n\nThe affidavit urged against \"judicial interference\" and warned that \"overzealous, though well-meaning, intervention may lead to unforeseen and unintended consequences\".\n\n\"In the context of a global pandemic, where response and strategy of the nation is completely driven by expert medical and scientific opinion, there is little room for judicial interference. Any overzealous, though well-meaning, judicial intervention may lead to unforeseen and unintended consequences... in absence of any expert advice or administrative experience, leaving doctors, scientists, experts and executive very little room to find innovative solutions on the go,\" the centre said.\n\n\"Pricing of vaccines is not only reasonable but uniform across the country (after) government persuasion with two vaccine companies,\" the centre added, noting that several states had announced plans to vaccinate the 18-45 age group for free.\n\nThe Supreme Court last week directed the centre to reconsider prices - \"to ensure it withstands scrutiny of Articles 14 (equality before law) and Article 21 (protection of life and personal liberty)\".\n\nThat was after manufacturers Serum Institute and Bharat Biotech announced vastly different prices for the centre, states and private hospitals.\n\nWhile the centre continues to spend only Rs 150 per dose for either Serum Institute's Covishield or Bharat Biotech's Covaxin, states must pay Rs 400 per dose for Covaxin and private hospitals Rs 1,200. Covishield costs Rs 300 per dose for states and Rs 600 for private hospitals.\n\nShortage of vaccine doses has forced vaccination centres in several states to shut down (File)\n\nPrices for states and private hospitals were originally higher and were reduced only after outrage.\n\nThe vast difference in prices also triggered a political storm, with the Congress accusing the centre of \"vaccine profiteering\" and sarcastically reminding it of the \"one nation, one price\" war cry.\n\nThe centre pointed out it would get 50 per cent of vaccine supply and that this would be supplied to states for free. However, it made no comment on the higher prices of the remaining 50 per cent.\n\nLast week the Supreme Court said compelling states to negotiate with manufacturers, on grounds of promoting competition and making it attractive for new manufacturers, would adversely affect those in the 18-44 age group, whose vaccination has only just begun.\n\nIndia began vaccination in January and has administered over 17 crore doses so far but the pace has been questioned, with states running out of stock and shutting down centres.\n\nSeveral, including national capital Delhi, Madhya Pradesh, Karnataka and Rajasthan, deferred the start of the third phase over a lack of doses.\n\nSo far two vaccine options are available, with a third - Russia's Sputnik V - having been cleared for emergency use and expected to be rolled out soon. In its affidavit the centre also said it is in consultation with manufacturers like Pfizer, Moderna and Johnson & Johnson to bring in their products.\n\nThe vaccination policy has been criticised by international medical journal The Lancet, which called it \"botched\" and said the government had vaccinated less than two per cent of the population so far.\n\nThe Supreme Court is hearing issues surrounding vaccination and the availability of medical resources - hospital beds and oxygen - as the country battles a huge wave of daily Covid cases.",
    "Title": "\"No Judicial Interference\": Centre To Supreme Court On Vaccine Policy"
  },
  {
    "Date": "Mon, 10 May 2021 09:49:57 +0530",
    "Description": "Indian drugmaker Cipla Ltd said on Monday it has entered into a licensing agreement with U.S. company Eli Lilly and Co to make and sell Lilly's arthritis drug baricitinib for the treatment of COVID-19...",
    "Image": "https://i.ndtvimg.com/i/2016-08/cipla_650x400_41471001022.jpg",
    "Link": "https://www.ndtv.com/india-news/cipla-enters-into-licensing-agreement-with-uss-eli-lilly-for-baricitinib-drug-to-treat-covid-19-2438555",
    "Text": "Indian drugmaker Cipla Ltd said on Monday it had entered into a licensing agreement with U.S. company Eli Lilly and Co to make and sell Lilly's arthritis drug baricitinib for the treatment of COVID-19 patients.\n\nThe agreement comes at a time when India is struggling with a catastrophic second wave of the pandemic, leading to an acute shortage of coronavirus medicines such as remdesivir and tocilizumab.\n\nBaricitinib has been given restricted emergency use approval by India's drug regulator for use in combination with remdesivir for the treatment of hospitalised COVID-19 adult patients requiring supplemental oxygen, Cipla said in a filing to stock exchanges.\n\nIn November, the U.S. Food and Drug Administration initially gave Eli Lilly an emergency use approval for baricitinib in combination with remdesivir to treat COVID-19 patients.\n\nCipla's deal with Lilly expands the Indian drugmaker's portfolio of COVID-19 drugs. Aside from remdesivir and tocilizumab, the company also offers antiviral drug favipiravir, used to treat patients with moderate to mild COVID-19.\n\nLast week, Cipla said it would be the local distribution partner for a COVID-19 antibody drug cocktail developed by Roche and Regeneron, after the therapy got emergency use approval from India's drug regulator.\n\nIndia has posted more than 400,000 daily coronavirus cases for the past four days, and its total infections have reached nearly 22.30 million, the second highest number of cases in the world after the United States.\n\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
    "Title": "Cipla To Make, Sell US's Eli Lilly's Baricitinib Drug For Covid Treatment"
  },
  {
    "Date": "Mon, 10 May 2021 09:06:51 +0530",
    "Description": "China will set up a \"separation line\" on the peak of Mount Everest to avoid possible Covid-19 infections by climbers from virus-hit Nepal, state media reported, after dozens were taken ill from the...",
    "Image": "https://c.ndtvimg.com/2020-12/bpqktojk_mount-everest_625x300_08_December_20.jpg",
    "Link": "https://www.ndtv.com/world-news/coronavirus-news-china-to-set-up-separation-line-on-mount-everest-to-avoid-infections-from-climbers-from-covid-19-hit-nepal-2438542",
    "Text": "Mount Everest straddles the China-Nepal border, with the north slope belonging to China.\n\nChina will set up a \"separation line\" on the peak of Mount Everest to avoid possible Covid-19 infections by climbers from virus-hit Nepal, state media reported, after dozens were taken ill from the summit's base camp.\n\nWhile the virus first emerged in China in late 2019, it has largely been brought under control in the country through a series of strict lockdowns and border closures.\n\nOver 30 sick climbers were evacuated from base camp on the Nepalese side of the world's highest peak in recent weeks as Nepal faces a deadly second wave, raising fears that the virus might ruin a bumper climbing season.\n\nMount Everest straddles the China-Nepal border, with the north slope belonging to China.\n\nTibetan authorities told reporters at a press conference they would take the \"most stringent epidemic prevention measures\" to avoid contact between climbers on the north and south slopes or at the top, reported the official Xinhua news agency on Sunday.\n\nMountain guides will set up dividing lines on the summit of the mountain before allowing mountaineers to start the gruelling climb up, the head of the Tibet Mountaineering Association was quoted as saying by Xinhua.\n\nThe official did not provide details on what the dividing lines would be made of.\n\nTwenty-one Chinese climbers have been approved to climb to the summit of Everest this year after having quarantined in Tibet since early April, the official added.\n\nThe Chinese side will also step up virus control measures at the Chinese base camp on the northern side of the mountain, with non-climber tourists in the Everest scenic area forbidden to enter.\n\nChina has banned foreign nationals from climbing Everest since last year due to the virus outbreak.\n\nBut this year Nepal has issued a record number of climbing permits to try and boost visitors after its tourism industry suffered a devastating blow through 2020 from the pandemic.\n\nAn Everest permit alone from Nepal costs $11,000 and climbers pay upward of $40,000 for an expedition.\n\nMore than a thousand people are typically camped at the bustling tent city at the foot of Everest on the Nepalese side at any one time, including foreign climbers and the teams of Nepali guides that escort them to the peak.\n\nIn the last three weeks, Nepal's daily case trajectory has shot up with two out of five people tested now returning positive as infections spill over from neighbouring India's deadly second wave.\n\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
    "Title": "China To Set Up \"Separation Line\" On Mount Everest Over Covid Fears"
  },
  {
    "Date": "Mon, 10 May 2021 01:19:09 +0530",
    "Description": "Seven people have been arrested in Baghpat in western Uttar Pradesh for stealing clothes of the dead from crematoria and burial grounds, said police on Sunday.",
    "Image": "https://c.ndtvimg.com/2021-05/nqobonvg_baghpat-stealing-650_625x300_09_May_21.jpg",
    "Link": "https://www.ndtv.com/india-news/520-bedsheets-127-kurtas-stolen-from-funeral-sites-in-up-7-arrested-2438332",
    "Text": "Putting the articles to a good wash, ironing them, they would sell it again, said police\n\nSeven people have been arrested in Baghpat in western Uttar Pradesh for stealing clothes of the dead from crematoria and burial grounds, said police on Sunday. The arrests come at a time when social media and the national dailies have been cataloguing an ever growing number of dead bodies amid a deepening coronavirus crisis in the country.\n\nThe accused used to steal the shroud used to cover the dead, their clothes, sarees, among other things, said police.\n\n\"Seven people have been arrested. During interrogation it was revealed that they used to steal bedsheets, sarees, clothes of the dead. Among the items recovered are: 520 bedsheets, 127 kurtas, 52 white sarees and other articles of clothing,\" Circle Officer Alok Singh told a posse of reporters.\n\nPutting the articles to a good wash and post ironing them, the men would again sell it using a Gwalior company's label, said the officer.\n\nThe police also found that some clothing merchants from the area had cut a deal with these men and paid them Rs 300 for a day's loot, he said.\n\n\"Of the seven arrested three are from the same family. These people have been stealing for last 10 years. Since, they have been arrested during coronavirus crisis, other than stealing they will also be charged under the Epidemic Act,\" said Mr Singh.\n\nEarlier on Sunday, the Uttar Pradesh government further extended the statewide curfew till May 17 to cut the chain of transmission.",
    "Title": "7 Men Went Around UP Crematoriums To Steal Clothes From Bodies, Arrested"
  },
  {
    "Date": "Mon, 10 May 2021 10:32:40 +0530",
    "Description": "Anger over the scale of devastation in the fierce second wave of Covid and its impact on Prime Minister Narendra Modi's government has caused deep disquiet in the ranks of the ruling BJP and its...",
    "Image": "https://c.ndtvimg.com/2021-05/1at2vlig_india-covid-generic_625x300_09_May_21.jpg",
    "Link": "https://www.ndtv.com/india-news/coronavirus-worry-within-bjp-rss-over-covid-handling-electoral-impact-sources-2438545",
    "Text": "India has recorded over 2.66 crore Covid cases since the pandemic broke.\n\nAnger over the scale of devastation in the fierce second wave of Covid and its impact on Prime Minister Narendra Modi's government has caused deep disquiet in the ranks of the ruling BJP and its ideological mentor Rashtriya Swayamsevak Sangh (RSS), sources say. In seven years of PM Modi in power, public perception and election results have never spooked the powerful \"Sangh Parivar\" this much.\n\nSources say the BJP and RSS are concerned with the perception that the government dropped the ball on Covid, given that almost everyone in the ruling party's core support base is affected by the deadly pandemic. The middle class are the worst-hit -- and now the virus is spreading to the villages, especially in Uttar Pradesh and Bihar.\n\n\"If you lose someone, the grief and anger remains for a long period and it can be expressed in any form,\" a leader told NDTV, implying that there is a big worry in the ranks about the pandemic costing the BJP in elections.\n\nWhile there are still three years to the next Lok Sabha polls (2024), when PM Modi will seek a third term, states like Uttar Pradesh are due to vote next year.\n\nIf the results of the UP Panchayat polls are any indication, the BJP has reason to worry.\n\nThe discontent has floated to the surface. Union Minister Santosh Gangwar's letter to UP Chief Minister Yogi Adityanath flagging oxygen shortage, \"black-marketing\" of medical equipment and delays in admitting Covid patients in his constituency Bareilly went viral.\n\nLeaders say there is a strong belief that any damage control will require a shuffle in which some ministers must go and make way for new faces.\n\nThe Covid emergency has exposed the poor health infrastructure and unpreparedness of the government, leaders admit.\n\nHealth is a state subject but that argument does not wash, they believe, since it is the Centre that had been leading the fight against Covid since last year. \"People are disappointed with the central leadership and they blame lack of action on their part for the current situation, which has gone out of our hands,\" sources said.\n\nPM Modi's campaign in West Bengal while Covid cases were spiraling in the country has sent a \"wrong message\", senior leaders fear. Top BJP leaders were campaigning in West Bengal and attending huge rallies and roadshows without masks, prioritizing votes over public safety, and the imagery across global media could not have been worse.\n\nThese leaders also blame lack of communication within the government. \"The Principal Scientific Adviser K Vijay Raghavan warns us about the third wave but he never talked about the second wave,\" a leader lashed out.\n\nThere is an unsettling perception that the BJP's famed machinery is invisible on the ground, and so are its leaders. They are not seen extending help to people this time, unlike last year when the party organization arranged food packets and other relief during the lockdown.\n\nThe government's mismanagement is also evident in what leaders call a \"botched-up vaccination drive\" tangled in rules and regulations.\n\nVaccine production capacity should have been enhanced when there was time, the leaders point out.\n\nThose in the government have strongly defended the Centre's Covid response. They say the perceived ill-preparedness was mainly because of zero warning about the magnitude of the second wave. \"It is a fact that the government was not prepared for the second wave but now all hands are on the deck,\" a minister said.\n\n\"The oxygen supply is being strengthened. Vaccination drive will be smoother. Our vaccine basket has been increased and we will get more vaccines in the coming months,\" he said, adding that the Prime Minister was personally monitoring the efforts.\n\nPM Modi \"cut short his Bengal campaign as soon as it was brought to his notice\", leaders say, and persuaded seers to wind down the mega Kumbh Mela - a religious gathering on the banks of river Ganga that heightened super-spreader fears.\n\n\"It is understood that people are angry and in pain, but the government is trying its best to extend all possible help. BJP-rules states are in the forefront,\" they say. The Yogi Adityanath-led Uttar Pradesh government, for instance, has launched a special drive in the villages to trace, test and treat on a large scale.\n\nThe leaders accuse opposition-ruled states of \"playing politics\" at this hour of crisis and putting their failure at the door steps of the Centre - they name Delhi and Maharashtra.\n\n\"Despite public health being state subject, the Central government has been proactive in Covid management as a pandemic requires national level coordination and substantial resources,\" Union Minister Prakash Javadekar has written in a column in The Indian Express.",
    "Title": "Worry Within BJP, RSS Over Covid Mismanagement, Electoral Impact: Sources"
  },
  {
    "Date": "Mon, 10 May 2021 11:03:57 +0530",
    "Description": "West Bengal Governor Jagdeep Dhankhar - known for his frequent collision with Chief Minister Mamata Banerjee - has given his nod to the CBI to prosecute four erstwhile ministers of her government in...",
    "Image": "https://c.ndtvimg.com/2020-12/febs9qug_bengal-governor-jagdeep-dhankhar-december-2020_650x400_11_December_20.jpg",
    "Link": "https://www.ndtv.com/india-news/as-bengal-ministers-prep-oath-governor-jagdeep-dhankhar-okays-prosecution-in-narada-case-2438450",
    "Text": "The Governor has said he has the authority to sanction prosecution of the four leaders. (FILE)\n\nWest Bengal Governor Jagdeep Dhankhar - known for his frequent collision with Chief Minister Mamata Banerjee - has given his nod to the CBI to prosecute four erstwhile ministers of her government in the Narada tapes scandal.\n\nTwo of the former ministers, now facing CBI prosecution, were sworn in on Monday by the Governor himself. Subrata Mukherjee and Firhad Hakim were named in a list of 43 ministers released on Sunday.\n\nThe sanction and its timing is raising eyebrows, coming as it does just after Mamata Banerjee's resounding victory in the assembly elections that had turned into a direct fight between her and Prime Minister Narendra Modi, and also because Lok Sabha Speaker Om Birla is yet to sanction the prosecution of Suvendu Adhikari, a former Trinamool Congress minister who is now a BJP MLA from Nandigram.\n\nMr Adhikari was a Trinamool MP in Lok Sabha at the time of the commission of the crime. He beat Mamata Banerjee at Nandigram by less than 2,000 votes.\n\nIn 2014, a journalist from Delhi came to Kolkata, posed as a businessman planning to invest in Bengal, gave wads of cash to seven Trinamool MPs, four ministers, one MLA and a police officer as bribe and taped the entire operation. The tapes were released just before the 2016 assembly elections in the state.\n\nThe two other former ministers whom the Governor has now cleared for prosecution are Madan Mitra, a Trinamool MLA not named minister in the new government, and Sovan Chatterjee who left Trinamool in August 2019, joined the BJP but quit in March. He did not contest the just-concluded polls.\n\n\"Governor accorded sanction for prosecution... being the appointing authority of ministers @MamataOfficial under article 164 and thus competent authority,\" the Governor tweeted on Sunday evening.\n\nGovernor accorded sanction for prosecution of Firhad Hakim, Subrata Mukherjee, Madan Mitra & Sovan Chatterjee being appointing authority of Ministers ⁦@MamataOfficial⁩ under Article 164 & thus competent authority\n\n\n\nMedia reports that sanction was for being MLA is incorrect. pic.twitter.com/vqEg7Cv6OW — Governor West Bengal Jagdeep Dhankhar (@jdhankhar1) May 9, 2021\n\nHe was responding, a press release by Raj Bhavan said, to some media reports that he had given his sanction for prosecution because all four where members of the legislative assembly at the time of commission of crime.\n\nJust as the Speaker of Lok Sabha has to sanction prosecution of any MP, the Speaker of the state assembly should sanction prosecution of MLAs. But in the Narada scam, the CBI did not ask the Bengal assembly Speaker for sanction but approached the Governor instead.\n\nThe Governor has said he has the authority to sanction prosecution not because the four leaders named were MLAs but because they were ministers sworn in by him in 2011.\n\nOf the seven Trinamool MPs named in the Narada case, six were from Lok Sabha and Mukul Roy from Rajya Sabha. Mukul Roy is now with BJP and just elected MLA. There has been no action against him. In the sting tapes, he was not actually seen taking cash.\n\nOf six Lok Sabha MPs, Sultan Ahmed has died. The CBI has sought to prosecute Suvendu Adhikari, Sougata Roy, Kakoli Ghosh Dastidar, Prasun Banerjee and Aparupa Poddar. The Lok Sabha Speaker has not granted sanction.\n\nThe four former ministers taped taking bribes were Subrata Mukherjee, Firhad Hakim, Sovan Chatterjee and Madan Mitra.\n\nThe MLA involved was Iqbal Ahmed. The police officer was SMH Mirza.",
    "Title": "Bengal Governor Okays Narada Bribe Case Prosecution Before Ministers Oath"
  },
  {
    "Date": "Mon, 10 May 2021 06:27:01+5:30 ",
    "Description": "In many other states, journalists and lawyers are being vaccinated as front line workers",
    "Image": "https://images.livemint.com/img/2021/05/10/600x338/PTI05_08_2021_000214A_1620547060163_1620608068081.jpg",
    "Link": "https://www.livemint.com/news/india/covid19-chhattisgarh-to-vaccinate-journalists-lawyers-and-their-families-on-priority-11620607923394.html",
    "Text": "Amid surge in COVID-19 infections across the country, Chhattisgarh Chief Minister Bhupesh Baghel has announced to vaccinate journalists and lawyers of the state and their families on priority as front line workers.\n\n\"The decision has been made to vaccinate people belonging to different categories as front line workers. Along with this, Chief Minister Bhupesh Baghel has announced to vaccinate journalists and lawyers of the state and their families in the same way as front line workers,\" said an official statement.\n\nIn many other states, journalists and lawyers are being vaccinated as front line workers, but Baghel, going one step further, has announced to give priority to journalists and lawyers of the state as well as their families as front line workers.\n\nAs per the earlier instructions issued by Baghel and on the recommendation of the committee of secretaries headed by the Chief Secretary regarding vaccination, the categories included by the state government in the list of front line workers include people with comorbidities as defined by the Department of Health, food providers and vegetable sellers, bus drivers and conductors, Anganwadi workers, Mitanins, Panchayat secretaries/workers, vendors, women living in institutional care, state government employees, state public sector undertaking employees and their immediate family members.\n\nSimilarly, people working in old age homes, people working in women care centers and child care, people working in crematoriums and cemeteries, persons with disabilities, semi government institutions providing essential services are also included in the list.\n\nAccording to the state government, detailed guidelines regarding identification of front line workers will be issued by the Health Department. \"If a person in the frontline worker category brings a ration card other than APL, then he or she will also be considered in the category of that ration card and if he does not bring the ration card then he or she will be considered in the category of front line worker.\"\n\nMoreover, inmates who are in jail will also be given the same priority in vaccination as will be given to the frontline workers because they cannot protect themselves, it said.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter.",
    "Title": "COVID-19: Chhattisgarh to vaccinate journalists, lawyers and their families on priority"
  },
  {
    "Date": "Mon, 10 May 2021 06:15:55+5:30 ",
    "Description": "Policy makers need to get serious about setting a minimum — and rising — standard of care for everyone.",
    "Image": "https://images.livemint.com/img/2021/05/10/600x338/iStock-1012323872_1606371199989_1606371208326_1620607424001.jpg",
    "Link": "https://www.livemint.com/news/india/covid-rips-india-s-safety-net-stitch-it-anew-11620605071638.html",
    "Text": "Covid-19 related deaths in India are expected to double in the coming weeks. People across socioeconomic classes are being cremated en masse in large holes in the ground. The ordeal doesn’t even end with death. Medical bills are piling up, a burden large enough to tip working-class families into multi-generational poverty. Younger adults desperate for vaccines are effectively being forced to pay for them, while those most at risk aren’t adequately insured. The state’s threadbare safety net has all but collapsed.\n\nIn normal times, most Indians use savings, borrow and call on friends and family to pay for health care, assuming it’s accessible. Out-of-pocket expenses are among the highest in the world. More than 60% of the population isn’t covered by insurance. Government workers can get some protection under a few different plans, but most others, including the self-employed, pay for their own treatment. Costs are rising because of a growing dependence on private hospitals and clinics.\n\nTwo years ago, after several failed attempts at universal coverage, Prime Minister Narendra Modi’s administration unveiled what it called the world’s largest health insurance plan, targeting over 107 million people — the poorest 40% of the population. It was meant to be a better version of a decade-old policy that fell short in terms of the amount reimbursed and its cap on the number of people enrolled from one household. Under the new plan, families are covered for up to 500,000 rupees ($6,670) for medical procedures. Eligibility was widened and is based on several “deprivation\" criteria in rural and urban areas.\n\nYet the new policy hasn't “effectively improved\" access to health care, according to a working paper by Duke University researchers. To begin with, the eligibility criteria rely on a 10-year-old census, and exclude many potential participants because of inconsistent data. What’s more, outpatient services, which account for 60% of out-of-pocket expenditure, aren’t included. Another area of concern is the program’s dependence on private hospitals. Finally, if the insurance did fully cover its intended beneficiaries, the cost would far exceed budget allocations.\n\nFor a country battling the most severe surge of the pandemic the world has seen, it's hard to start thinking about long-term changes. India is now considering setting up a fund worth at least 1 trillion rupees to support the uninsured, the Hindustan Times reported last week. Helping the population through a third wave is the obvious priority. But now is the time for policy makers to get serious about a minimum — and rising — standard of care for everyone.\n\nAs an alternative model, Taiwan stands out, and not just because of its globally acknowledged success in fighting the Covid-19 pandemic. Although its population of 23 million isn’t comparable to India’s 1.4 billion, Taiwan’s fundamentally strong health care holds valuable lessons.\n\nAll long-term residents are covered under a comprehensive national insurance. Co-payments on prescriptions as well as physician visits are reasonable, and capped at about $7 and $14, respectively. Hospital stays, too, have cost limits.\n\nIt wasn’t always like this. Before 1995, four out of 10 people in Taiwan didn’t have any medical insurance. For all its export-powered boom in the preceding decades, the capitalist society's score in treating preventable deaths was worse than countries behind the Iron Curtain. Now, Taiwan is doing almost as well as the U.S. on this measure, and isn’t too too far behind Japan.\n\nTaiwan’s transformation was triggered by its decision — on the recommendation of Princeton University economist Uwe Reinhardt — to move to a single-payer system. Effective insurance didn’t come with a massive price tag. Taipei used technology, such as electronic health cards that store patient and treatment data, to drive efficiencies and limit spending to 6% of gross domestic product. That’s far lower than other rich countries. The Taiwanese system isn’t immune to cost pressures, but that’s a price of its popularity: Some patients seek just too many consultations.\n\nIn India, public health expenditure is just 1.2% of GDP. Yet targeting a higher number won't automatically make things better. The right care, as Reinhardt emphasized, is about not pricing anyone out. But in India’s heavily informal economy, only 90 million people earn regular salaries. Among them, 80% make less than $270 a month. Can this narrow base of taxpayers prop up a good standard of care at prices that don’t exclude the poor?\n\nThe best means toward that end is making the government a single buyer of everything — from generic drugs (in which India is a world leader) to medical equipment — to prune expenditure. The country’s natural wage advantage can be harnessed in providing labor-intensive services cheaply — not by impoverishing medical professionals but by stepping up hiring in the public sector and expanding state-funded training.\n\nAssume that superior cost management crunches the 2.4% of GDP that Indians spend out of pocket to 2%. Provide an equal amount for infrastructure investment for at least 10 years and throw in 1.2% of GDP of current public spending. The 5.2% of GDP in required funding can come, like in Taiwan, from payroll and sin taxes, as well as levies on interest, dividends and rents.\n\nThe financing will get centralized, not the service delivery. Private hospitals won’t wither away, but they will have to accept government-mandated prices. The primary responsibility for clinical care will reside with India’s 28 states. They will be free to offer add-ons. Maybe the national program won’t be able to immediately cover chronic mental illness, for example. But richer western and southern states ought to be able to include it. In Tamil Nadu, for instance, the recently elected chief minister announced that his government will reimburse private hospitals’ Covid-19 treatment bills. Additionally, private insurance plans will exist as a top-up for those who want specialized procedures or long-term rehabilitation.\n\nThe pandemic will eventually recede, but scarred citizens won’t want to face such despair again. People are scrambling for resources on social media and elsewhere. Individuals have turned to importing oxygen concentrators, cutting deals with suppliers across the globe. Anecdotally, some are combining more widely available smaller-capacity breathing devices to create larger ones that are in short supply. Indian style jugaad, or quick, self-administered workarounds, can’t fix a broken system, though. It’s time to build health care anew.\n\nAnjani Trivedi is a Bloomberg Opinion columnist covering industrial companies in Asia. She previously worked for the Wall Street Journal.\n\nAndy Mukherjee is a Bloomberg Opinion columnist covering industrial companies and financial services. He previously was a columnist for Reuters Breakingviews. He has also worked for the Straits Times, ET NOW and Bloomberg News.\n\nThis story has been published from a wire agency feed without modifications to the text. Only the headline has been changed.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter.",
    "Title": "Covid rips India's safety net. Stitch it anew"
  },
  {
    "Date": "Mon, 10 May 2021 09:52:24 +0530",
    "Description": "A French air force pilot has filed a criminal complaint alleging that as part of a hazing ritual he was tied to a target on a firing range while fighter planes flew overhead and fired off munitions,...",
    "Image": "https://c.ndtvimg.com/2021-05/aonl17k_french-pilot-tied-in-hazing-ritualmay-10reuters_625x300_10_May_21.jpg",
    "Link": "https://www.ndtv.com/world-news/french-air-force-pilot-says-he-was-tied-to-firing-target-in-hazing-ritual-2438562",
    "Text": "The complaint did not identify any of the people alleged to have carried out the hazing.\n\nA French air force pilot has filed a criminal complaint alleging that as part of a hazing ritual he was tied to a target on a firing range while fighter planes flew overhead and fired off munitions, his lawyer told Reuters on Saturday.\n\nThe complaint did not identify any of the people alleged to have carried out the hazing, or say how many of them were involved. Reuters was not able to independently establish the identities of those responsible for the incident.\n\nColonel Stephane Spet, a spokesman for the French air force, said an internal inquiry had been ordered by air force command and those responsible had been punished.\n\nThe most severe punishment was restriction to barracks, Spet said. He did not say how many people had received this punishment, or for how many days.\n\nSpet said that the pilot's safety was never in danger.\n\nThe pilot said in the complaint, which was seen by Reuters, that the hazing occurred in March 2019, soon after he arrived at a combat fighter unit at the Solenzara air base on the French Mediterranean island of Corsica.\n\nThe pilot had a hood put over his head, and was forced into the back of a pick-up truck by several colleagues who drove him to the firing range, according to the complaint.\n\nPhotos, which were included in the complaint, showed a man in military fatigues with his legs and hands bound, attached to the firing range target with heavy-duty nylon straps.\n\nVideo footage, which is cited in the complaint and was provided to Reuters by the pilot's lawyer, Frederic Berna, also showed combat jets making several low passes nearby.\n\nThe complaint alleges that, during some of these passes, the pilot tied to the target could hear the sound of live munitions being fired from the aircraft.\n\nSpet did not dispute the authenticity of the images, but he said they created the mistaken impression that the aircraft were directing fire at the pilot who was tied to the target.\n\nHe said that the firing the pilot heard was from aircraft that were on a training exercise at a different location, and that the closest any munition round came to him was about one kilometre (0.6 miles).\n\nBerna said his client did not want his name disclosed publicly because of privacy concerns. Reuters has seen the pilot's name in the complaint.\n\nBerna said the photos and video footage cited in the complaint were filmed by service members who were present, and the images later shared in a WhatsApp group chat. Members of the group chat then shared the images with the pilot filing the complaint, the lawyer said.\n\nAsked why his client waited until now to file the complaint, Berna said the pilot had initially been in denial about the gravity of what he experienced, and did not want to challenge the military authorities.\n\nHe raised the issue with his superiors at the end of 2020, the lawyer said, and decided to file the criminal complaint when he felt the military was not responding adequately.\n\nSpet said the air force command was informed of the incident in January this year, and ordered an internal inquiry.\n\n\"The pilots responsible for staging this were severely punished in April 2021, with measures that went as far as restriction to barracks,\" Spet said.\n\nBerna said neither he nor his client had any knowledge of any punishment imposed on service personnel over the incident.\n\nIn a separate statement, the air force said it condemned any actions that harm the physical or mental wellbeing of its personnel, and that it would cooperate with any criminal investigation.\n\nA spokeswoman for the Solenzara base referred Reuters to the air force statement.\n\nThe complaint was filed with the state prosecutor's office in the city of Marseille on May 5, according to Berna. The lawyer said his client is still in the air force and serving as a pilot but is no longer a combat pilot.\n\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
    "Title": "French Pilot Says He Was Tied To Firing Target In Hazing Ritual"
  },
  {
    "Date": "Mon, 10 May 2021 06:41:44+5:30 ",
    "Description": "The number of unlinked virus cases in the local community has risen to 13 cases in the past week from 10 the week before, the government said Sunday.",
    "Image": "https://images.livemint.com/img/2021/05/10/600x338/2020-09-25T031828Z_553390047_RC2F5J9H1W8X_RTRMADP_3_HEALTH-CORONAVIRUS-SINGAPORE-POPULATION_1601098335662_1601098374759_1620608982702.JPG",
    "Link": "https://www.livemint.com/news/world/singapore-tests-thousands-as-unlinked-covid-19-cases-persist-11620607637326.html",
    "Text": "Singapore will test thousands of people for Covid-19 as the number of infections unlinked to current virus clusters continued to rise over the weekend.\n\nAn additional 10 Covid-19 cases were reported by the country’s health ministry late on Sunday, including a private-hire driver with Grab Holdings Inc., an employee at Lendlease Pte and a landscaper at government agency National Parks Board, none of whom are linked to previous virus cases. Separately, four individuals are connected to an earlier cluster at Changi Airport and three are related to the cluster at Tan Tock Seng Hospital.\n\nThe number of unlinked virus cases in the local community has risen to 13 cases in the past week from 10 the week before, the government said Sunday.\n\nThe Southeast Asian country will expand virus testing to about 9,000 workers at two of the airport’s terminals and the connected Jewel shopping mall in a bid to stem the spread. Close to 4,000 port workers will also undergo testing after four people at the city-state’s seaport facilities were detected to have Covid-19 over the past 10 days.\n\nThe Maritime and Port Authority said Sunday that 2,750 people have so far tested negative for coronavirus.\n\nThe mass testing strategy will also include about 2,200 students, staff and visitors at Victoria Junior College after a student registered positive for the virus in recent days, the Ministry of Education said on Saturday. Just over 100 people who are close contacts of the infected individual will be quarantined as well.\n\nThe threat had been easing for Singapore until a few weeks ago when new clusters started to emerge, including cases with the variant of Covid-19 first detected in India. Tighter social-distancing measures kicked in for the country on Saturday with officials saying they were necessary to prevent a harsher lockdown similar to one last year.\n\nA rise in unlinked cases in Singapore could jeopardize a planned travel bubble with Hong Kong, scheduled to begin on May 26. According to the terms of the agreement, the air-travel corridor will be closed for two weeks if the seven-day moving average of the daily number of unlinked local cases is more than five in either city.\n\n\n\n\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter.",
    "Title": "Singapore tests thousands as unlinked Covid-19 cases persist"
  },
  {
    "Date": "Mon, 10 May 2021 07:15:33+5:30 ",
    "Description": "The prospect of stricter curbs is reviving memories of last year when similar measures dragged India’s economy into its worst contraction in four decades.",
    "Image": "https://images.livemint.com/img/2021/05/10/600x338/2021-02-26T084514Z_1_LYNXMPEH1P0HI_RTROPTP_3_BUSINESS-CURRENCY_1614597201825_1614597214340_1620610265027.JPG",
    "Link": "https://www.livemint.com/news/india/rupee-gains-under-siege-as-health-crisis-fuels-lockdown-fears-11620608728148.html",
    "Text": "The Indian rupee’s recent gains could be short-lived as pressure grows on Prime Minister Narendra Modi’s administration to announce a nationwide lockdown to curb a deadly wave of coronavirus infections.\n\nThe prospect of stricter curbs is reviving memories of last year when similar measures dragged India’s economy into its worst contraction in four decades. It’s also threatening to weaken the rupee, which is among Asia’s top three performers this month, thanks to heavy foreign inflows for initial public offerings, a dovish Federal Reserve and a glut of dollars at state-run banks.\n\n“The recovery in the rupee in recent weeks reflects the softer dollar and weaker import demand as restrictions were imposed,\" Khoon Goh, head of Asia research at Australia & New Zealand Banking Group Ltd. “If a nationwide lockdown were to be implemented, we could see some near-term weakness in the rupee.\"\n\nA technical gauge is also signaling that the rupee’s advance maybe losing momentum. The dollar-rupee’s slow stochastics, a momentum indicator, shows that the currency pair is in oversold territory. The rupee rose 0.8% last week to 73.51 per dollar.\n\nGoh forecasts the rupee to fall to 76 per dollar in the second quarter but expects further declines to be limited by a reduction in imports.\n\nIndia’s capital extended its lockdown for another week while the nation reported 403,736 new virus cases on Sunday, and more than 4,000 Covid-19 deaths for a second day. Modi’s political allies, top business leaders and even U.S. President Joe Biden’s chief medical adviser have said lockdowns could be the only way to stem the world’s worst virus outbreak.\n\nAnalysts have already trimmed India’s growth forecasts as individual states tightened restrictions, but a nationwide curb could deal a much larger blow to the economy. The Reserve Bank of India stepped in last week to provide loan relief and pledged to inject 500 billion rupees ($6.8 billion) of liquidity to support growth.\n\nInflation data on Wednesday is expected to provide more economic cues. Consumer prices are forecast to have climbed 4.1% in April from a year earlier, the slowest pace since January, to stay within the RBI’s 2%-6% target range, which would provide room for more support measures. However, signs of more quantitative easing would be bad news for the rupee.\n\nThe currency could remain supported as expectations of a surge in IPOs this year keeps inflows coming, although its near-term trend points to a downside as virus cases show no sign of slowing.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter.",
    "Title": "Rupee gains under siege as health crisis fuels lockdown fears"
  },
  {
    "Date": "Mon, 10 May 2021 01:53:12+5:30 ",
    "Description": "Drugs, equipment donated by foreign countries are yet to reach us, say state health ministers",
    "Image": "https://images.livemint.com/img/2021/05/09/600x338/2d9e89bc-b0d2-11eb-a936-0e5204611abd_1620591724808_1620591773753.jpg",
    "Link": "https://www.livemint.com/news/india/chhattisgarh-maha-waiting-for-their-share-of-foreign-aid-11620591410135.html",
    "Text": "The health ministers of Chhattisgarh and Maharashtra say no ventilator or oxygen concentrator donated by foreign countries have been delivered yet to their states, and that the Centre isn’t telling them if they will get any of the aid.\n\nThe two states are among the worst hit by the second wave of covid.\n\nChhattisgarh health minister T.S. Singh Deo told Mint on Sunday that he has not been told anything about distribution of oxygen plants and ventilators they had sought. “I had enquired last evening but till then nothing had come... We have no intimation. Maybe All India Institute of Medical Sciences (AIIMS) in (Raipur) Chhattisgarh may have got something, but nothing has come to us. We had asked for 280 ventilators and non-invasive ventilators, nasal cannula, oxygen plants and vaccines. Maybe if something was coming in the aid, they could be included,\" Deo said.\n\nSo far, the Centre had not shared “anything substantial\" with the Chhattisgarh government from the foreign aid it has received, he said. The worst-hit state, Maharashtra, has received only about 53,000 vials of remdesivir, but none of the other foreign aid it had requested.\n\nMaharashtra health minister Rajesh Tope on Friday said his government had written letters to the Centre asking for substantial aid in view of the surge in covid-19 cases. “We are hopeful that if such a large amount of aid has been coming in, it is the right of the state to get the assistance. I hope the Centre will not ignore us, and we will get the required aid which we have been demanding for a long time,\" he added.\n\nMaharashtra has more than 628,000 active cases and reports around 800-900 deaths daily. “We will get at least 1 lakh remdesivir vials from about 13 suppliers from various countries that responded to global tenders,\" Tope said.\n\nIndia has received 6,738 oxygen concentrators, 3,856 oxygen cylinders, 16 oxygen generation plants, 4,668 ventilators, BiPAP and C-PAP machines and over 300,000 vials of remdesivir, which, the health ministry said, has been dispatched or delivered to various states.\n\nAnother 2,404 oxygen concentrators, 25,000 remdesivir vials, 218 ventilators and nearly 700,000 testing kits were received by India on Sunday.\n\nRecent data and tweets by the Union health ministry show that most of the oxygen concentrators have gone to central government hospitals.\n\nQueries sent to the spokesperson of the ministry, seeking an updated list of hospitals that have received the aid so far, did not elicit replies.\n\nThe health ministry on Sunday quoted comments from senior officials of AIIMS in New Delhi, Bhopal, Patna, Raipur, Raebareli and Bibinagar in Telangana about delivery of foreign aid.\n\nNITI Aayog chief executive officer Amitabh Kant denied the allegations, saying that “everything is moving on the field\". “This is all false, all lies. We are distributing the assistance in a transparent manner as soon as it arrives, with no delays. There is a well-laid-out procedure for this. The channels are smooth,\" said Kant.\n\n“We are getting requests from districts for a wide range of things—digital thermometers, oxygen concentrators and cylinders, BiPAP machines, masks, PPE kits, disinfectants. I am getting demands from state officials and district hospitals. Whatever assistance is coming is not enough,\" an official from an NGO said, on condition of anonymity. The official works directly with the state disaster management authorities in Chhattisgarh, Bihar, Odisha, Uttar Pradesh and Maharashtra.\n\nleroy.d@livemint.com\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter.\n\nNever miss a story! Stay connected and informed with Mint. Download our App Now!!",
    "Title": "Chhattisgarh, Maha waiting for their share of foreign aid"
  },
  {
    "Date": "Mon, 10 May 2021 07:02:50+5:30 ",
    "Description": "Pune-based Serum Institute of India is supplying Covishield to the Centre for  ₹150 a dose while to states for  ₹300 a dose. ",
    "Image": "https://images.livemint.com/img/2021/05/10/600x338/PTI03_24_2021_000023A_1620473559576_1620609682690.jpg",
    "Link": "https://www.livemint.com/news/india/covid19-17-56-cr-free-vaccine-doses-provided-to-states-says-mos-anurag-thakur-11620609558638.html",
    "Text": "Minister of State for Finance Anurag Singh Thakur on Sunday said the government has provided 17.56 crore COVID-19 vaccine doses so far to states and union territories for inoculation of people of all age groups and 46 lakh doses will be supplied to them in the next three days.\n\nThakur's remarks came in response to senior Congress leader Mallikarjun Kharge's letter to Prime Minister Narendra Modi urging him to use ₹35,000 crore allocated in the Union Budget to ensure free vaccine for all citizens instead of the current system of multiple pricing for various users.\n\nCalling for free inoculation, leader of Opposition in Rajya Sabha Kharge in his letter said the Parliament had allocated ₹35,000 crore in the Union budget to ensure free vaccines for all.\n\nHe also urged the prime minister to immediately convene an all-party meeting to collectively forge a holistic blueprint to tackle the COVID-19 pandemic\n\nDispelling claims of vaccine shortage in states, Thakur said 72 lakh doses are still available with states and union territories.\n\nOn further supply of vaccines, he said that \"1.5 lakh doses of Sputnik V have already reached India and RDIF has also tied up with local Indian companies for bulk production.\"\n\nWorlds Fastest & largest vaccine drive: 15 cr vaccinated - 103 days\n\n\n\n17.56 cr vaccine doses provided to States/UTs Free of Cost\n\n72 Lk doses still available w/ States/UTs to be administerd\n\n46 Lk+ doses in addition will be receivd by States/UTs in nxt 3 dayshttps://t.co/nBf6QCZKoi — Anurag Thakur (@ianuragthakur) May 9, 2021\n\nIn a series of tweets, the minister highlighted various measures taken by the government to increase supply of medicine and liquid medical oxygen, add more beds and distribute foreign aid to various states to fight the pandemic.\n\nThe minister stressed that India is running the world's fastest and largest vaccination drive and 15 crore people have been administered doses in the past three months.\n\n\"COVID vaccines are being provided free of cost by the government of India to those who are 45 years of age and above and to all frontline workers,\" Thakur said.\n\n1.5 Lk doses of Sputnik V have already reached India and RDIF has also tied up with local Indian companies for bulk production. — Anurag Thakur (@ianuragthakur) May 9, 2021\n\nOn exempting vaccines from the Goods and Services Tax (GST), the minister said a nominal five per cent GST is in interest of the domestic manufacturer of vaccine and in the interest of citizens.\n\nIf full exemption from GST is given, vaccine manufacturers would not be able to offset their input taxes and would pass them on to the end consumer or citizen by increasing the price, he added.\n\n\"Five per cent GST rate ensures that the manufacturer is able to utilise ITC and in case of overflow of ITC, claim refund. Exemption to vaccine from GST would be counterproductive without benefiting the consumer,\" a tweet by Thakur said.\n\nHe also said the government has provided full exemption from Customs duties, including integrated GST, is already available to all COVID relief material imported by the Indian Red Cross Society for free distribution in the country to help contain the spread.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter.",
    "Title": "Covid-19: 17.56 cr free vaccine doses provided to states, says MoS Anurag Thakur"
  },
  {
    "Date": "Mon, 10 May 2021 05:32:07+5:30 ",
    "Description": "Uttar Pradesh Medical Education Minister Suresh Khanna on said that people who test Covid positive are spreading fear of the disease and that is also causing many deaths",
    "Image": "https://images.livemint.com/img/2021/05/10/600x338/20210508187L_1620604882252_1620604905363.jpg",
    "Link": "https://www.livemint.com/news/india/people-also-dying-due-to-fear-of-covid-19-up-minister-11620604460990.html",
    "Text": "Shahjahanpur: Uttar Pradesh Medical Education Minister Suresh Khanna on Sunday said that people who test positive for COVID-19 are spreading fear of the disease and that is also causing many deaths.\n\nIt is everyone's responsibility not to spread fear, he told reporters after visiting the medical college here.\n\nKhanna also visited the hospital's ICU ward.\n\n\"After testing positive for COVID-19, people are spreading fear of the disease from inside their homes to outside. Deaths are also taking place due to this fear. In such a scenario, it is our responsibility not to spread fear of COVID,\" Khanna said.\n\nFor days now, Uttar Pradesh has figured among the biggest contributors to India's COVID-19 tally, according to Union health ministry data.\n\nAccording to an official statement, the state recorded 23,333 fresh COVID-19 cases on Sunday that pushed its tally to 15,03,490 while 296 more fatalities took the death toll to 15,464.\n\nOn his visit to the medical college, Khanna said COVID-19 patients admitted in the hospital are satisfied with the treatment being given to them.\n\nHe claimed that there has been a decline in the number of patients due to the government's proactiveness. The number of patients has dropped to 78,000 from 3.10 lakh on April 30.\n\nKhanna also claimed that there is no shortage of oxygen or hospitals beds in Shahjahanpur.\n\n\"You can bring your patients, we will admit them,\" he said.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter.",
    "Title": "People also dying due to fear of Covid-19: UP minister"
  },
  {
    "Date": "Mon, 10 May 2021 08:37:59+5:30 ",
    "Description": "According to Railways, the train has the highest volumes of Liquid Medical Oxygen (LMO) which is being transported on a single train.",
    "Image": "https://images.livemint.com/img/2021/05/10/600x338/20210508154L_1620484710504_1620615831320.jpg",
    "Link": "https://www.livemint.com/news/india/oxygen-express-with-highest-volumes-of-lmo-to-arrive-delhi-from-gujarat-s-hapa-11620615610285.html",
    "Text": "Indian Railways on Monday informed that Oxygen Express carrying around 225 MT of oxygen from Gujarat's Hapa will be offloaded in Delhi Cantt today.\n\nAccording to Railways, the train has the highest volumes of Liquid Medical Oxygen (LMO) which is being transported on a single train.\n\nMinistry of Railways tweeted and informed about its departure of the train on Sunday night.\n\n\"Another Oxygen Express carrying 11 tankers with 224.67 tonnes of Liquid Medical Oxygen (LMO) has departed from Hapa, Gujarat to Delhi Cantt. This train has highest volumes of LMO being transported on a single train,\" Ministry tweeted.\n\nAnother #OxygenExpress carrying 11 tankers with 224.67 Tons of Liquid Medical Oxygen (LMO) has departed from Hapa, Gujarat to Delhi Cantt.\n\n\n\nThis train has highest volumes of LMO being transported on a single train. pic.twitter.com/CpnY9iBBn3 — Ministry of Railways (@RailMinIndia) May 9, 2021\n\n\n\n\n\nThe Indian Railways has so far delivered nearly 4,200 metric tonnes (MT) of liquid medical oxygen in 268 tankers across the country.\n\nAccording to a statement issued by the Ministry of Railways, as many as 68 Oxygen Expresses have completed their journey so far. \"Till now, 293 MT has been offloaded in Maharashtra, 1230 MT in Uttar Pradesh, 271 MT in Madhya Pradesh, 555 MT in Haryana, 123 MT in Telangana, 40 MT in Rajasthan, and 1,679 MT in Delhi,\" the Ministry said.\n\n\"More loaded Oxygen Expresses are expected to start their journeys later in the night,\" it added.\n\nThe country is currently witnessing a devastating second wave of the COVID-19 pandemic, with over 4,03,738 fresh cases and 4,092 deaths in the last 24 hours. The cumulative caseload reached 2,22,96,414, including 37,36,648 active cases, 1,83,17,404 discharges and 2,42,362 deaths.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter.",
    "Title": "Oxygen Express with highest volumes of LMO to arrive Delhi from Gujarat's Hapa"
  },
  {
    "Date": "Mon, 10 May 2021 10:30:31 +0530",
    "Description": "Markand Mehta had been Hema Malini's secretary for over 40 years",
    "Image": "https://c.ndtvimg.com/2021-05/aoblcia_hema-malini_625x300_10_May_21.jpg",
    "Link": "https://www.ndtv.com/entertainment/hema-malinis-emotional-farewell-to-secretary-who-died-of-covid-2438587",
    "Text": "Hema Malini with her secretary Markand Mehta (Image courtesy: @dreamgirlhema)\n\nHighlights -He was more a part of my family,- Hema Malini tweeted\n\n-He will be missed a lot by all of us,- wrote her daughter Esha\n\nRaveena Tandon and Pankaj Udhas offered condolences\n\nActor-politician Hema Malini wrote an emotional note on Sunday announcing the death of Markand Mehta, her secretary of over 40 years. Mr Mehta died of COVID, she said, describing him as \"more a part of my family\" and \"irreplaceable.\" Hema Malini's daughter Esha Deol offered support and condolences in the comments thread as did Raveena Tandon and singer Pankaj Udhas. India is battling a devastating second COVID wave as well as an oxygen crisis and shortage of other medical resources; Maharashtra is the worst-hit state. On Saturday, Mumbai recorded 2,664 new COVID-19 infections and 62 deaths, according to a health department official, reported news agency PTI.\n\nIn her farewell note shared on Twitter, Hema Malini wrote: With heavy heart I bid farewell to my associate of 40 years. My secretary, dedicated, hard-working, tireless Mehta ji. He was more a part of my family. We lost him to COVID. He is irreplaceable and leaves a void that cannot be filled, ever.\"\n\nHema Malini's daughter Esha Deol wrote in the comments: \"He will be missed a lot by all of us. He was a member of our family and he is irreplaceable. He was the best for you mamma. What a dedicated human. Will miss you our dearest Mehta uncle. May his soul rest in peace.\"\n\n\"Hearfelt condolences, Om shanti,\" wrote Raveena Tandon. \"Our heartfelt condolences to you and his family, may his soul rest in eternal peace. Om shanti,\" Pankaj Udhas wrote.\n\nSee Hema Malini's tweet here:\n\nWith heavy heart I bid farewell to my associate of 40 yrs, my secretary, dedicated, hard working, tireless Mehta ji. He was more a part of my family We lost him to covid. He is irreplaceable & leaves a void that cannot be filled, ever???? pic.twitter.com/QtGixciP3S — Hema Malini (@dreamgirlhema) May 8, 2021\n\nHema Malini is the star of some of Indian cinema's most beloved films, among them Sholay and Seeta Aur Geeta; much of her work co-stars her husband Dharmendra. Hema Malini is also the Member of Parliament from Mathura, representing BJP.",
    "Title": "Hema Malini's Emotional Farewell To Secretary Who Died Of COVID"
  },
  {
    "Date": "Mon, 10 May 2021 09:17:21+5:30 ",
    "Description": "This is the first time since the lockdown came into force on April 19 that the government has suspended Metro services",
    "Image": "https://images.livemint.com/img/2021/05/10/600x338/Metro_1620618396698_1620618402877.jpg",
    "Link": "https://www.livemint.com/news/india/delhi-metro-services-to-be-shut-for-a-week-starting-today-11620617037425.html",
    "Text": "Delhi Metro rail services will remain temporarily suspended till 5 am on 17th May, due to the lockdown in Delhi which has been further extended.\n\nThe ongoing lockdown in Delhi was on Sunday extended up to May 17 morning with Chief Minister Arvind Kejriwal announcing stricter measures like suspension of Metro train services.\n\n\"We must remember 'Jaan Hai Toh, Jahan Hai'... this time the lockdown will be stricter and the Delhi Metro will not ply from tomorrow,\" he said in an online briefing.\n\nThis is the first time since the lockdown came into force on April 19 that the government has suspended Metro services.\n\n\"In the wake of revised guidelines issued today by the Govt. of NCT of Delhi, on extension of Curfew in Delhi for the containment of Covid-19, the Delhi Metro services on all its Lines shall also remain suspended for passenger/essential services from 10 May till 5:00 AM of 17 May,\" DMRC said in a tweet.\n\n\n\n\n\nIn the wake of revised guidelines issued today by the Govt. of NCT of Delhi, on extension of Curfew in Delhi for the containment of Covid-19, the Delhi Metro services on all its Lines shall also remain suspended for passenger/essential services from 10 May till 5:00 AM of 17 May. pic.twitter.com/NqrOA176Fb — Delhi Metro Rail Corporation I कृपया मास्क पहनें😷 (@OfficialDMRC) May 9, 2021\n\nLast year the metro services were suspended in March when the Centre announced a complete lockdown in the country to control the explosion of Covid-19 cases. The services were resumed from September 7 in a phased opening under the central government’s Unlock 4 guidelines.\n\n\n\n\n\nOn Sunday, Delhi recorded 273 more coronavirus deaths, the lowest since April 21, and 13,336 new infections. The positivity rate stood at 21.67 per cent, the lowest since April 16 when it was 19.7 per cent, according to the health department.\n\n\n\n\n\n\n\n\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter.",
    "Title": "Delhi Metro services to be shut for a week, starting today"
  },
  {
    "Date": "Mon, 10 May 2021 08:55:51 +0530",
    "Description": "In an Instagram story, Kangana Ranaut wrote that her post was deleted because she \"threatened to demolish COVID\"",
    "Image": "https://c.ndtvimg.com/2021-05/1jht40a8_kangana-ranaut_625x300_10_May_21.jpg",
    "Link": "https://www.ndtv.com/entertainment/kangana-ranauts-post-calling-covid-small-time-flu-deleted-by-instagram-2438538",
    "Text": "Kangana Ranaut said that her post had been deleted in an unrepentant way (Image courtesy: @kanganaranaut)\n\nHighlights Kangana's now-deleted post was strongly criticized\n\nShe was permanently suspended from Twitter last week\n\nShe doesn't think she will last on Instagram \"more than a week\"\n\nKangana Ranaut's post announcing she had tested positive for COVID-19 has been deleted by Instagram, the actress revealed in an Instagram story. On Saturday, Kangana shared a tone-deaf post in which she not only announced that she has been infected with the virus but also wrote dismissively of it as a \"small time flu which got too much press.\" She was strongly criticized in the comments thread for her insensitivity and for spreading misinformation - India is battling a brutal second COVID wave with over 4,000 deaths a day, compounded by a severe shortage of oxygen and other medical resources.\n\nKangana Ranaut's typically unrepentant Instagram story claims Instagram deleted her post because she \"threatened to demolish COVID\"; she also takes a jibe at what she calls a \"COVID fan club.\"\n\nLast week, Twitter took away the actress' megaphone; her Instagram and Facebook accounts are still active but, as she notes in her Instagram story, perhaps not for much longer - \"don't think will last here for more than a week,\" she wrote.\n\nSee Kangana Ranaut's story here:\n\nKangana Ranaut joined social media only last year, taking over the official accounts managed by her team to tweet and post personally in August 2020. Her sister Rangoli Chandel had been permanently suspended from Twitter for hate speech some months before.\n\nLast week, Kangana Ranaut was also suspended permanently by Twitter after controversial tweets on the West Bengal election results and post-election violence. She had also been widely criticized and ridiculed for her tweets on the oxygen crisis.\n\nKangana Ranaut, who's new film Thalaivi has been postponed because of the spike in COVID cases, said in her deleted Instagram post that she had been feeling weak and tired and had taken a COVID test ahead of travelling from Mumbai to her hometown in Himachal Pradesh. The film industry has been badly hit by the Coronavirus surge - actress Shilpa Shetty's family is currently battling the virus; Aamir Khan, Alia Bhatt and Ranbir Kapoor recovered from COVID in the last couple of months; Akshay Kumar was briefly hospitalized with it and over 40 crew members working on his new film Ram Setu tested positive.",
    "Title": "Kangana Ranaut's Post Calling COVID \"Small Time Flu\" Deleted By Instagram"
  },
  {
    "Date": "Mon, 10 May 2021 10:39:36 +0530",
    "Description": "A mathematical model prepared by advisers to Prime Minister Narendra Modi suggests India's coronavirus outbreak could peak in the coming days, but the group's projections have been changing and were...",
    "Image": "https://c.ndtvimg.com/2021-05/67hljbt8_india-coronavirusbloomberg-_625x300_10_May_21.jpg",
    "Link": "https://www.ndtv.com/india-news/india-coronavirus-tens-of-millions-plunge-into-poverty-in-covid-hit-india-2438590",
    "Text": "People sit outside Pune railway station during lockdown restrictions imposed by the state government.\n\nAfter dipping into his savings to weather India's snap pandemic lockdown last March, Manoj Kumar was just getting his head above water again earning 600 rupees ($8) a day as a construction worker in the tourist hotspot of Goa.\n\nHe'd squirreled away enough for a trip last month to his native village in Bihar some 1,490 miles away for a wedding. He's still there, stuck in one of the nation's least developed states, as a fierce second Covid-19 wave triggers the world's worst health crisis and prevents his return. On a lucky day, he'll land some odd jobs that fetch him as much as 300 rupees. But there aren't too many of those chores left. So he's taking loans to feed and clothe his wife and three kids.\n\n\"It is all in God's hands now,\" said Kumar, who's told his wife to curtail spending on items such as lentils, cooking oil and clothes. \"I don't know when I will return. My family is worried and doesn't want me to go back as the cases are also rising in Goa.\"\n\nKumar, 40, is one of the millions of migrant workers who form part of India's vast unreported informal sector, which accounts for half of its $2.9 trillion, domestic demand-driven economy. A protracted Covid wave is shrinking incomes and wiping out savings of people like Kumar, posing the risk of a double whammy for Asia's third-largest economy that's still struggling to recover from last year's pandemic-induced recession.\n\nThe government estimates India's gross domestic product shrank 8% in the year ended March, its biggest contraction since 1952. Many economists are cutting their forecasts for the current fiscal year as rising unemployment and dwindling savings dim the chances of a double-digit growth. Shaun Roache, chief economist for Asia Pacific at S&P Global Ratings, slashed his prediction to 9.8% from 11% earlier. Fitch Solutions sees the economy expanding by 9.5%, a projection that's below the Bloomberg consensus of around 11%.\n\n\"A drawn-out Covid-19 outbreak will impede India's economic recovery,\" Singapore-based Roache said. \"The country already faces a permanent loss of output versus its pre-pandemic path, suggesting a long-term production deficit equivalent to about 10% of GDP.\"\n\nWith the latest surge caused by a new coronavirus strain, total infections in India have risen to 21.89 million, a third of which were added just in the past three weeks alone. Daily death count hit a record at 4,187 on Saturday. Experts have warned the crisis has the potential to worsen in the coming weeks, with one model predicting as many as 1,018,879 deaths by the end of July, quadrupling from the current official count of 238,270.\n\nHarsh and Sudden\n\nAs new travel restrictions are put in place in some of the nation's biggest economic centers to contain the outbreak, India's poor are likely to bear the brunt again, just as they did in 2020. They have yet to recover from the lockdown ordered by Prime Minister Narendra Modi in late March last year. The harsh and sudden measure sparked an exodus of migrant workers from cities such as Mumbai and New Delhi, as they trekked hundreds of miles to reach home.\n\nPeople like Kumar typically work without contracts and often for a pittance. The so-called informal economy in India employs approximately 411 million workers, according to calculations by Jeemol Unni, a professor of economics at Ahmedabad University, who relied on surveys by the government's National Statistical Office to arrive at the number. While the low-paying farm sector employs the bulk of them, construction comes second with about 56 million.\n\nUnprotected by unions and politicians, these laborers often miss out on handouts from governments. After meeting daily expenses, they are left with little to pay for health care and medicines -- a risky situation especially when a pathogen is taking lives and sending thousands to intensive care at overcrowded hospitals running short of beds.\n\nDip in Savings\n\nEconomists warn depleting household savings and falling incomes will have an impact on domestic consumption, which accounts for almost 60% of GDP. A study by Nikhil Gupta, an economist at Mumbai-based brokerage Motilal Oswal Financial Services Ltd., found that India's household savings dropped to 22.1% of GDP in the quarter through December, from 28.1% in the three months ended June last year. Full-year numbers show India's savings growth lagged behind the likes of the U.S., the U.K. and Japan, he said.\n\n\"A slower rise in household savings, coupled with similar or slower decline in consumption, confirms weak income growth in India,\" Gupta said. \"If so, the contribution of pent-up demand in growth recovery would also be limited in India compared with other nations.\"\n\nData showed April jobless rate increased to nearly 8% from 6.5% in March, with more than seven million exiting the workforce last month, according to data from Center for Monitoring Indian Economy Pvt., a private research firm.\n\nAs a result of all the turmoil that started last year, income inequality is deepening in India. A study by Pew Research Center has shown an estimated 75 million people slipped into poverty since the pandemic began. The second wave is set to crush some more. For the study, Pew considered daily incomes of 150 rupees or less as poor, 151 to 750 rupees as low income and 3,750 rupees and above as high income.\n\nA study by the Azim Premji University in Bangalore showed even more alarming numbers. About 230 million individuals slid below the national daily minimum wage threshold of 375 rupees during the pandemic, it said.\n\nThough India could still emerge as one of the fastest growing economies in the world, it will also be one of the most unequal countries, Oxfam, a non-profit organization said.\n\nStephen Schwarzman, chairman of Blackstone Group Inc., said in an interview last month that he's \"confident\" of the long-term prospects of India. The private-equity firm, which has plowed billions of dollars into the country and owns many of the nation's big office towers, said it would be accelerating its activities in the country. \"We will be investing more in the next 10 years than we have invested in the previous period,\" he said.\n\nDuvvuri Subbarao, a former governor of India's central bank, said the strife faced by the informal-economy workers could hurt India's long-term growth prospects. \"Inequalities have intensified because the formal sector has nearly normalized while the informal sector remains distressed,\" he said.\n\nSlower growth would be bad news for workers like A.K. Singh, who was a cook for a monthly salary of about 20,000 rupees in a restaurant in Mumbai. He fled recently to his home town of Gorakhpur in northern India to start a tire business, for which he's waiting for a loan.\n\n\"I used some of my savings and money I received from my last salary,\" he said. \"But there's a lockdown here too for the past week. My shop was hardly open for two days during the week. What will we earn out of that?",
    "Title": "\"In God's Hands\": Tens Of Millions Plunge Into Poverty In Covid-Hit India"
  },
  {
    "Date": "Mon, 10 May 2021 08:28:04+5:30 ",
    "Description": "Uttarakhand Covid curfew: People have been advised to defer marriages if they can",
    "Image": "https://images.livemint.com/img/2021/05/10/600x338/3502e634-ab88-11eb-9c60-e2bf44fd80f1_1620615420256_1620615451641.jpg",
    "Link": "https://www.livemint.com/news/india/uttarakhand-covid-19-curfew-what-is-allowed-and-what-s-not-11620613913753.html",
    "Text": "In a bid to check the coronavirus spread, the Uttarakhand government has imposed Covid curfew starting 6 am tomorrow (May 11) to May18, new agency ANI reported. Cabinet Minister Subodh Uniyal said the decision has been taken to break the transmission chain of Covid-19.\n\n'COVID curfew to be imposed in Uttarakhand from 6am on May 11 till 6am on May 18; shops selling fruits, vegetables, dairy items to remain open from 7am-10am, shopping malls, market complexes, gyms, theatres, assembly halls, bars, liquor shops to remain closed until further orders pic.twitter.com/nRC9GdRQmo — ANI (@ANI) May 10, 2021\n\n\n\n\n\nUttarakhand Covid curfew: Let's take a look at what's allowed and what's not\n\nShops selling essential items like milk, vegetables, fruits and meat will be allowed to open from 7 am to 10 am daily. Till now, these shops opened from 7 am to 12 am daily.\n\nGrocery shops will be permitted to open on May 13 only.\n\nShopping malls, market complexes, gyms, theatres, assembly halls to remain closed until further orders.\n\nBars, liquor shops to remain closed until further orders\n\nMediapersons will have the permission to move around during the curfew if they have their IDs with them.\n\nInterstate travellers will now have to produce negative RT-PCR results not older than 72 hours and will have to register themselves on the Dehradun administration's portal.\n\nPeople of Uttarakhand coming from outside will have to undergo 7-day isolation.\n\nDepartments providing essential services will open with attendance of only 50 per cent of their staff during the period.\n\nPeople have been advised to defer marriages if they can.\n\nNot more than 20 persons will be allowed to gather for marriages or funerals during the period.\n\nAll those travelling to get vaccinated will be exempted from the ban for but they will have to show registration.\n\nIn Uttarakhand, a total of 5,890 new Covid-19 cases, 180 deaths and 2,731 recoveries were reported in the last 24 hours, the state health department informed on Sunday.\n\nShare Via\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter.",
    "Title": "Uttarakhand Covid-19 curfew: What is allowed and what's not"
  },
  {
    "Date": "Mon, 10 May 2021 08:11:56 +0530",
    "Description": "SpaceX will launch the \"DOGE-1 Mission to the Moon\" in the first quarter of next year, with Elon Musk's commercial rocket company accepting the meme-inspired cryptocurrency dogecoin as payment.",
    "Image": "https://c.ndtvimg.com/2021-04/sa9uoa88_dogecoin-reuters_625x300_21_April_21.jpg",
    "Link": "https://www.ndtv.com/world-news/spacex-accepts-dogecoin-as-payment-to-launch-a-lunar-mission-next-year-2438467",
    "Text": "Musk said in April that SpaceX was going to put a \"literal Dogecoin on the literal moon\".(FILE)\n\nSpaceX will launch the \"DOGE-1 Mission to the Moon\" in the first quarter of next year, with Elon Musk's commercial rocket company accepting the meme-inspired cryptocurrency dogecoin as payment.\n\nGeometric Energy Corporation announced the dogecoin-funded mission on Sunday, with the statement not disclosing the mission's financial value.\n\n\"We're excited to launch DOGE-1 to the Moon!\", SpaceX Vice President of Commercial Sales Tom Ochinero was quoted as saying in the statement released by Geometric Energy. \"This mission will demonstrate the application of cryptocurrency beyond Earthorbit and set the foundation for interplanetary commerce\".\n\nSpaceX launching satellite Doge-1 to the moon next year\n\n\n\n– Mission paid for in Doge\n\n– 1st crypto in space\n\n– 1st meme in space\n\n\n\nTo the mooooonnn!!https://t.co/xXfjGZVeUW — Elon Musk (@elonmusk) May 9, 2021\n\nMusk said on Twitter in April that SpaceX was going to put a \"literal Dogecoin on the literal moon\".\n\nDogecoin lost more than a third of its price on Sunday, after Musk called it a 'hustle' during his guest-host spot on the \"Saturday Night Live\" comedy sketch TV show.\n\nMusk's tweets this year turned the once-obscure digital currency, which began as a social media joke, into a speculator's dream.\n\nElectric carmaker Tesla Inc, where Musk is CEO, said in February it bought $1.5 billion worth of bitcoin and would soon accept it as a form of payment for its electric cars, a large stride toward mainstream acceptance that sent bitcoin soaring to a record high of nearly $62,000.\n\n(This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)",
    "Title": "\"Mission To Moon\": SpaceX Accepts Cryptocurrency For Satellite Launch"
  },
  {
    "Date": "Mon, 10 May 2021 10:18:38 +0530",
    "Description": "From billionaire entrepreneurs like Mark Zuckerberg and Jeff Bezos to Bollywood stars like Kareena Kapoor and Priyanka Chopra, several celebrities shared Mother's Day tributes on Instagram.",
    "Image": "https://c.ndtvimg.com/2021-05/vara96l8_tina-ambani-with-sons_625x300_10_May_21.jpg",
    "Link": "https://www.ndtv.com/offbeat/mark-zuckerberg-to-tina-ambani-what-celebs-shared-on-mothers-day-2438578",
    "Text": "Tina Ambani with her sons in a picture shared on the occasion of Mother's Day.\n\nAs people across the world celebrated Mother's Day yesterday, social media was flooded with the sweetest posts. Several celebrities and noted personalities also took to social media to express their gratitude to mothers and mother figures in their life. From billionaire entrepreneurs like Mark Zuckerberg and Jeff Bezos to Bollywood stars like Kareena Kapoor and Priyanka Chopra, several celebs shared Mother's Day tributes on Instagram. Take a look:\n\nFacebook founder Mark Zuckerberg shared a picture of wife Priscilla Chan and their two daughters on Mother's Day. The picture shows Priscilla being kissed by the two girls as she smiles for the camera. \"Happy Mother's Day to Priscilla, to my wonderful mom, and to all the moms out there!\" Mark Zuckerberg captioned the picture.\n\nAmazon's Jeff Bezos took a trip down memory lane on Sunday. He shared a throwback photo of himself and his siblings with their mother, Jacklyn Bezos, next to a more recent one of the family together. \"To a mom who always had her hands full. Thank you for absolutely everything. We love you, Mom!\" wrote Jeff Bezos.\n\nMelinda Gates also shared a Mother's Day post on Sunday - a few days after she and her husband, Bill Gates, announced they were splitting up. Melinda Gates shared a picture with their three children and wrote: \"I love being their mother. To anyone celebrating a mom or a mother figure, honoring a memory of someone you loved, or reflecting on your own resilience today, I hope your day is a meaningful one.\"\n\nTesla and SpaceX chief Elon Musk did not share a Mother's Day tribute on social media - he did one better. Elon Musk invited his mother Maye Musk to join him as he hosted 'Saturday Night Live' - and promised her a dogecoin as a Mother's Day gift. Maye Musk later shared a pic from their SNL appearance on Instagram and wrote: \"Happy Mother's Day to mothers all over the world.\n\nStill smiling from the fun time I had on stage with Elon.\"\n\nCloser home, Tina Ambani shared a Mother's Day post for her mother-in-law as well as her mother. \"The warmest place in the world is a mother's embrace; a source of incredible comfort and the purest, most elemental love,\" she wrote, sharing three pictures on Instagram. The first one shows her with her sons, Anmol and Anshul, and the other two feature her mother and her mother-in-law, Kokilaben Ambani. \"Gratitude and love to my two mothers today - and every day,\" said Tina Ambani.\n\nMeanwhile, Priyanka Chopra's Mother's Day post came with a hilarious quote.\n\n\"I do what I want, where I want, when I want.... if my mom says it's ok,\" the actress wrote. She shared a picture of mom Madhu Chopra alongside a picture of her mother-in-law Denise Jonas and added: \"I'm so blessed to look up to two incredible women who lead by example everyday. Love you.\"\n\n\n\nClick for more trending news",
    "Title": "Mark Zuckerberg To Tina Ambani: What Celebs Shared On Mother's Day"
  }
]