[
  {
    "Date": "Thu, 06 May 2021 07:53:55 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/india/us-supplies-of-vaccine-components-to-india-to-enable-manufacturing-of-two-crore-doses-of-covishield/articleshow/82423264.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82423264.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>The US on Wednesday said the vaccine components it has supplied to India this week will enable the manufacturing of two crore doses of the Covishield vaccine even as the sixth shipment of American medical aid arrived as part of the Biden administration's assistance to the country's response to a rising number of Covid-19 cases.",
    "Image": "https://static.toiimg.com/thumb/msid-82423254,width-1070,height-580,imgsize-100026,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/india/us-supplies-of-vaccine-components-to-india-to-enable-manufacturing-of-two-crore-doses-of-covishield/articleshow/82423264.cms",
    "Text": "The United States also sent a separate shipment of over 81,000 vials of Remdesivir injections that was delivered in Mumbai.\n\nNEW DELHI: The US on Wednesday said the vaccine components it has supplied to India this week will enable the manufacturing of two crore doses of the Covishield vaccine even as the sixth shipment of American medical aid arrived as part of the Biden administration's assistance to the country's response to a rising number of Covid-19 cases.\n\nThe United States also sent a separate shipment of over 81,000 vials of Remdesivir injections that was delivered in Mumbai.\n\nAs India continues to reel under a record-breaking wave of the coronavirus infection, the European Union (EU) announced an initial Euro 2.2 million (approximately Rs 19 crore) in emergency funding to support the World Health Organization 's (WHO) measures to curb the spread of the coronavirus in the country.\n\nThe 27-nation grouping said the funding announced by the European Commission is in addition to the medical assistance being provided to India by the EU member states.\n\n\"Today, the commission has announced that it will allocate an initial Euro 2.2 million in emergency funding to respond to the drastic surge in Covid-19 cases in India,\" the EU said.\n\n\"The funding will support the World Health Organization (WHO) for a six-month case management of Covid-19 patients as well as for strengthening the laboratory capacity for Covid-19 testing,\" it said.\n\nIn line with its announcement to support India in its fight against the pandemic, the US delivered the sixth shipment of its aid on Wednesday.\n\n\"The American people continue to deliver life-saving assistance to India, with the 6th flight of emergency relief in 6 days! This shipment includes a climate-friendly oxygen generation unit which can turn air into oxygen. Thanks to the people of California!\" the US embassy said in a tweet.\n\nSeparately, US Chargé D'Affaires in India Daniel B Smith said both the countries will together defeat the pandemic.\n\n\"The #USIndia partnership involves all aspects of the relationship: government, business, and people. This week, vaccine components arrived in India from the U.S. that will enable the manufacturing of 20 million doses of the Covishield vaccine. Together we will defeat Covid-19!\" he said in a tweet.\n\nProviding raw materials for the production of anti-coronavirus vaccines was a major component of the Biden administration's announcement on medical aid to India.\n\nThe Covishield vaccine is produced in India by the Serum Institute of India (SII), based in Maharashtra 's Pune.\n\nLast month, SII CEO Adar Poonawalla appealed to US President Joe Biden to lift the embargo on the export of raw materials needed to manufacture the vaccines.\n\nMinistry of External Affairs (MEA) Spokesperson Arindam Bagchi said a shipment of over 81,000 vials of Remdesivir from the US arrived in Mumbai on Wednesday morning.\n\n\"Further elevating the India and the United States Strategic Partnership! Appreciate the shipment of over 81000 vials of Remdesivir from the US that arrived early this morning in Mumbai,\" he tweeted.\n\nMeanwhile, Israel delivered its first consignment of medical supplies comprising oxygen concentrators to India on Wednesday. The consignment was brought to the country in a special flight.\n\nThe Israeli embassy said more such flights will bring emergency medical aid, including thousands of group and individual oxygen generators, respirators, medications and additional medical equipment.\n\n\"In this hour of need, our two democracies stand solidly side by side. The State of Israel is happy to lend a helping hand to our friend India in this complicated and difficult time,\" Israeli ambassador Ron Malka said.\n\n\"Our friendship is strong and collaboration during the Covid-19 crisis will only make it stronger. I see great importance in the cooperation with India in this joint fight against the global pandemic,\" he added.\n\n",
    "Title": "US supplies of vaccine components to India to enable manufacturing of two crore doses of Covishield"
  },
  {
    "Date": "Thu, 06 May 2021 09:58:07 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/world/us/us-vp-kamala-harris-to-deliver-message-of-solidarity-with-people-of-india-on-friday/articleshow/82424472.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82424472.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>Vice President Kamala Harris on Friday will deliver a message of solidarity with the people of India, as the US partners with the country to save lives and hasten the end of the coronavirus pandemic, the State Department has said. Harris is slated to deliver her address at the top of an online event “Bolstering US CovidRelief Efforts in India: Perspectives from the Diaspora” organised by the State Department.",
    "Image": "https://static.toiimg.com/thumb/msid-82424515,width-1070,height-580,imgsize-68720,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/world/us/us-vp-kamala-harris-to-deliver-message-of-solidarity-with-people-of-india-on-friday/articleshow/82424472.cms",
    "Text": "Harris is slated to deliver her address at the top of an online event “Bolstering US Covid Relief Efforts in India: Perspectives from the Diaspora” organised by the State Department.\n\nWASHINGTON: Vice President Kamala Harris on Friday will deliver a message of solidarity with the people of India, as the US partners with the country to save lives and hasten the end of the coronavirus pandemic, the State Department has said.\n\nHarris is slated to deliver her address at the top of an online event “Bolstering US CovidRelief Efforts in India: Perspectives from the Diaspora” organised by the State Department.\n\nHarris, 56, is the first woman, the first Black American, and the first South Asian American to be elected US Vice President.\n\n“Kamala Harris will provide an opening message on US solidarity with the people of India as we partner to save lives & hasten the end of the pandemic,” the South and Central Asia Bureau of the State Department announced on Wednesday.\n\nThe event on Friday noon local time will be hosted by Ervin Massinga, senior advisor in the South and Central Asia Bureau of the State Department.\n\nMassinga will provide an overview of the US government's relief efforts and panelists will discuss commercial and civil society-led efforts to address the current emergency, what support will be needed to re-open India after the second wave, and how they can align efforts to bring the two countries closer together moving forward.\n\nHarris's remarks would be followed by a panel discussion featuring diaspora leaders including Virginia State Senator Ghazala Hashmi; Lata Krishnan from American Indian Foundation; Indiaspora founder M R Rangaswami and Gunisha Kaur, Assistant Professor at Weill Cornell Medicine , Medical Director, Weill Cornell Center for Human Rights.\n\n",
    "Title": "Harris to deliver message of solidarity with people of India on Friday"
  },
  {
    "Date": "Thu, 06 May 2021 03:54:42 GMT",
    "Description": "Corruption charges against the secretary-general trigger a power struggle within the ruling party.",
    "Image": "https://ichef.bbci.co.uk/news/1024/branded_news/7FE2/production/_118383723_mediaitem118383722.jpg",
    "Link": "https://www.bbc.co.uk/news/world-africa-57004308",
    "Text": "On 30 March, Mr Magashule was given a 30-day ultimatum to step down after being charged with embezzling public funds while he was premier of the Free State province. He refused to resign voluntarily, which resulted in the ANC suspending him.",
    "Title": "South Africa: ANC in power struggle over corruption allegations"
  },
  {
    "Date": "Thu, 06 May 2021 02:31:06 +0000",
    "Description": "The United States is also urging its citizens to leave the country.",
    "Image": "https://static01.nyt.com/images/2021/05/05/world/05virus-brief-state-dept-india/merlin_187259409_e9c5ba07-6272-41b2-b300-54da577a9a1d-facebookJumbo.jpg",
    "Link": "https://www.nytimes.com/2021/05/05/world/state-department-india-covid.html",
    "Text": "The State Department announced on Wednesday that it would approve the voluntary departure of nonemergency U.S. government employees in India as the country battles a second wave of coronavirus infections.\n\nAccording to a travel advisory posted on the State Department’s website, the agency is urging U.S. citizens to take advantage of commercial flights out of India and has also approved the voluntary departure of family members of U.S. government employees.\n\nAccording to a travel advisory posted on the State Department’s website, the agency is urging U.S. citizens to take advantage of commercial flights out of India.\n\nIndia’s surge in Covid-19 cases has prompted other countries to take precautions concerning who is allowed within their borders. Earlier this week Australia began a travel ban, making it a criminal offense for its citizens in India to return home — a move some have condemned as overly harsh.",
    "Title": "State Department Approves Departure of Nonemergency Government Officials From India"
  },
  {
    "Date": "Thu, 06 May 2021 03:56:26 GMT",
    "Description": "The Tiananmen vigil commemorated the deaths of up to thousands of pro-democracy protesters in China.",
    "Image": "https://ichef.bbci.co.uk/news/1024/branded_news/EEDC/production/_118384116_gettyimages-1150363858.jpg",
    "Link": "https://www.bbc.co.uk/news/world-asia-china-57005120",
    "Text": "However, there have been questions over whether or not the vigil will be allowed in Hong Kong again, after Beijing imposed the national security law last year which targets dissent in the city.",
    "Title": "Hong Kong: Joshua Wong jailed over banned Tiananmen vigil"
  },
  {
    "Date": "Thu, 06 May 2021 00:02:21 GMT",
    "Description": "A spate of deaths reignites a debate about domestic violence in a country praised for gender equality.",
    "Image": "https://ichef.bbci.co.uk/news/1024/branded_news/5629/production/_118375022_flemingsberg3.jpg",
    "Link": "https://www.bbc.co.uk/news/world-europe-56977771",
    "Text": "Sweden's Gender Equality Minister, Marta Stenevi, says she is \"both appalled and upset\" by the latest violence, but not surprised. \"We have in many ways come quite far in gender equality in Sweden, but we still live with the structures in society that suppress women,\" she says.",
    "Title": "Safe Sweden faces up to wave of women's killings"
  },
  {
    "Date": "Thu, 06 May 2021 04:44:41 GMT",
    "Description": "He also asked China to take back 1,000 Sinopharm vaccines that it had donated to the country",
    "Image": "https://ichef.bbci.co.uk/news/1024/branded_news/A828/production/_118384034_hi067133186.jpg",
    "Link": "https://www.bbc.co.uk/news/world-asia-57004924",
    "Text": "By comparison the Moderna and Pfizer vaccines being developed in the West are mRNA vaccines. This means part of the coronavirus' genetic code is injected into the body, triggering the body to begin making viral proteins, but not the whole virus, which is enough to train the immune system to attack.",
    "Title": "Philippines' Duterte apologises for taking unapproved China jab"
  },
  {
    "Date": "Thu, 06 May 2021 09:21:22 +0530",
    "Description": "It appears to be the first time on record that a woman had given birth to nine surviving babies at once.",
    "Image": "https://th.thgim.com/news/international/phen8l/article34495547.ece/ALTERNATES/FREE_960/thnakCORRECTIONMoroccoMaliNonupletBirths70873jpg-b498fjpg",
    "Link": "https://www.thehindu.com/news/international/woman-from-mali-gives-birth-to-9-babies-in-morocco/article34495463.ece",
    "Text": "It appears to be the first time on record that a woman had given birth to nine surviving babies at once.\n\nA Malian woman has given birth to nine babies at once — after expecting seven, according to Mali's Minister of Health and the Moroccan clinic where the nonuplets were born.\n\nIt appeared to be the first time on record that a woman had given birth to nine surviving babies at once.\n\nThe five girls and four boys, and their mother, “are all doing well,” Mali's health minister said in a statement.\n\nThe mother, 25-year-old Halima Cisse, gave birth to the babies by cesarean section on Tuesday in Morocco after being sent there for special care, Mali's top health official announced.\n\nAssociated Press reporters saw some of the babies wiggling their hands and feet inside incubators on Wednesday in the private Ain Borja clinic in Casablanca. Medical staff checked their status regularly in the neonatal ward wallpapered with cartoon characters.\n\nMs. Cisse had been expecting seven babies. Malian doctors, under government orders, sent her to Morocco for the births because hospitals in Mali are ill-equipped to provide adequate care for this exceptional multiple pregnancy.\n\nThe Casablanca clinic's director Youssef Alaoui told Moroccan state TV that they had been contacted by Malian doctors about the case a month and a half ago. They were not expecting nine babies, he said.\n\nMs. Cisse gave birth prematurely at 30 weeks and is now in stable condition after heavy bleeding for which she was given a blood transfusion, he said.\n\nThe cesarean was ordered after Ms. Cisse had “birth pains,”Mr. Alaoui, the clinic director, said. The babies weigh between 500 grams and one kilogram.\n\nThe Guinness Book of World Records said in an email to The AP on Wednesday that its current record for most living births at once is eight, and that it is verifying the Morocco birth.\n\nThe current holder of the Guinness record is American Nadya Suleman, who gave birth to eight premature but otherwise healthy children in 2009.\n\nMr. Alaoui, the clinic director, told The AP that as far as he was aware Ms. Cisse had not used fertility treatments. The Malian health ministry did not provide any other information about the pregnancy or births.\n\nYacoub Khalaf, a professor of reproductive medicine at King's College London, said that such births would be extraordinarily unlikely without fertility treatment, and noted the dangers involved with such multiple births.\n\nThe mother “was at severe risk of losing her uterus or losing her life,” he said. The babies “could suffer physical and mental handicaps. The risk of cerebral palsy is astronomically higher.” He urged more awareness worldwide about monitoring fertility treatments and about the risks and costs of having so many premature babies at one time.",
    "Title": "Woman from Mali gives birth to 9 babies in Morocco"
  },
  {
    "Date": "Thu, 06 May 2021 06:06:11 GMT",
    "Description": "The latest prototype, Serial Number 15 (SN15), completes a successful high-altitude ascent and landing.",
    "Image": "https://ichef.bbci.co.uk/images/ic/400xn/p09gsfyf.jpg",
    "Link": "https://www.bbc.co.uk/news/science-environment-57004934",
    "Text": "The latest prototype of SpaceX's Starship rocket, Serial Number 15 (SN15), has completed a successful high-altitude ascent and landing.\n\nThe four previous test artefacts all ran into trouble as they went through their touchdown manoeuvres, ultimately destroying themselves in the process.\n\nBut SN15 had no such difficulty, making a tidy, controlled return to the ground at SpaceX's R&D facility in Texas.\n\nRead more: SpaceX Starship prototype makes clean landing",
    "Title": "SpaceX Starship prototype makes clean landing"
  },
  {
    "Date": "Thu, 06 May 2021 10:15:26 +0530",
    "Description": "The news will support the increased production of vaccines globally as countries, including India, continue to reel under the impact of the pandemic.",
    "Image": "https://th.thgim.com/news/international/qg4rge/article34423867.ece/ALTERNATES/FREE_960/KatherineTai",
    "Link": "https://www.thehindu.com/news/international/us-to-support-intellectual-property-waiver-for-covid-19-vaccines/article34494164.ece",
    "Text": "The news will support the increased production of vaccines globally as countries, including India, continue to reel under the impact of the pandemic.\n\nThe United States will support an initiative at the World Trade Organisation (WTO) to waive Trade Related Intellectual Property Rights (TRIPS) protection for COVID-19 vaccines, the Biden administration said on Wednesday. The news will support the increased production of vaccines globally as countries, including India, continue to reel under the impact of the pandemic. The initiative was first floated by India and South Africa last October.\n\n\"The administration believes strongly in intellectual property protections, but in service of ending this pandemic, supports the waiver of those protections for Covid-19 vaccines,\" United States Trade Representative Katherine Tai announced, adding that the \"extraordinary circumstances\" called for \"extraordinary measures.\"\n\nMs. Tai also said that the negotiations to effect the IP waiver would take time.\n\n\"We will actively participate in text-based negotiations at the World Trade Organisation (WTO) needed to make that happen. Those negotiations will take time given the consensus-based nature of the institution and the complexity of the issues involved,\" she said.\n\nEarlier on Wednesday, WTO Director General Ngozi Okonjo-Iweala held discussions in with ambassadors from developed and developing countries to discuss access to COVID-19 vaccines and therapeutics, based on an Indian and South African initiative first launched in October 2020.\n\nOver a 100 countries have supported the proposal, according to the Associated Press. U.S. President Joe Biden has also been under growing pressure, domestically, to support a waiver, with 110 Democratic Members of Congress writing to him last week on the issue. Earlier in April, Bernie Sanders and nine Democratic Senators, including Elizabeth Warren, had also written to the President in support of a waiver.\n\nOpposition galore\n\nThere has been opposition to the waiver from some quarters of Capitol Hill. Twelve GOP Members of Congress wrote to Mr. Biden on Tuesday urging him to consider other means to increase vaccine access that did not involve weaking IP protections, which, they argued, were not a manufacturing bottleneck. Weakening protections would hamper American competitiveness and innovation, they said. Some in industry have also opposed the plan.\n\n\"In the midst of a deadly pandemic, the Biden Administration has taken an unprecedented step that will undermine our global response to the pandemic and compromise safety,\" said Stephen Ubl, head of the Pharmaceutical Research and Manufacturers of America, according to the Associated Press.\n\nOn Tuesday, Mr. Biden said that the U.S. would produce as many vaccines as possible and export them. At present, three vaccines are approved for use in the U.S. — from Pfizer-BioNTech, Moderna and Johnson & Johnson. The U.S. plans to send 60 million doses of AstraZeneca’s COVID-19 vaccine to other countries over May and June.\n\nMs. Tai reiterated the plan to produce more vaccines. \"The Administration's aim is to get as many safe and effective vaccines to as many people as fast as possible,\" she said.\n\n\"As our vaccine supply for the American people is secured, the Administration will continue to ramp up its efforts – working with the private sector and all possible partners – to expand vaccine manufacturing and distribution. It will also work to increase the raw materials needed to produce those vaccines,\" she said.\n\nSeveral lawmakers applauded the news of the waiver.\n\n\"Let’s do insulin next,\" progressive Democratic Representative Alexandria Ocasio-Cortez tweeted, with a graph indicating that the share prices of some vaccine manufacturers had plunged following the announcement.",
    "Title": "U.S. to support intellectual property waiver for COVID-19 vaccines"
  },
  {
    "Date": "Thu, 06 May 2021 01:25:41 GMT",
    "Description": "New York's major theatres have been closed since March 2020 because of the coronavirus pandemic.",
    "Image": "https://ichef.bbci.co.uk/news/1024/branded_news/13F4A/production/_118383718_mediaitem118383475.jpg",
    "Link": "https://www.bbc.co.uk/news/world-us-canada-57004304",
    "Text": "Broadway supports more than 96,000 jobs in New York and contributed nearly $15bn (£11.2bn) to the city's economy in 2019, according to the Broadway League, a theatre union. That number does not just take into account ticket sales but also the investment to put on and run a show, and the money tourists spend when they come to New York to see a performance.",
    "Title": "Broadway tickets to go on sale for September reopening"
  },
  {
    "Date": "Thu, 06 May 2021 03:20:48 +0000",
    "Description": "Yair Lapid has four weeks to cobble together a coalition, after Prime Minister Benjamin Netanyahu failed in his attempt. But the process could end in another election.",
    "Image": "https://static01.nyt.com/images/2021/05/05/world/05Israel-Lapid01/05Israel-Lapid01-facebookJumbo.jpg",
    "Link": "https://www.nytimes.com/2021/05/05/world/middleeast/israel-election-yair-lapid.html",
    "Text": "Mr. Lapid’s entry to the spotlight is the latest twist in a two-year political stalemate that has seen Israelis trudge to the polls four times since 2019, each time electing a Parliament whose lawmakers are roughly evenly split between supporters and opponents of Mr. Netanyahu.\n\nThe impasse has left political leaders repeatedly unable to form a stable majority, a stalemate that has left the country without a national budget and with several key leadership positions in the Civil Service unfilled.\n\nIt has also forced leaders to search for ever more unlikely alliances.\n\nTo secure a coalition, Mr. Lapid has previously said he would be willing to share power with an ultranationalist rival, Naftali Bennett, a former settler leader who opposes Palestinian statehood and seeks to annex large parts of the occupied West Bank. The divisions and complexities of Israeli politics currently make it impossible for Mr. Lapid to win office without reaching a compromise with parts of the far right.\n\nIn a statement on Wednesday, Mr. Lapid again hinted he would be willing to work across ideological lines.",
    "Title": "Israeli President Taps the Opposition Leader Lapid to Form Government"
  },
  {
    "Date": "Thu, 06 May 2021 10:14:51 +0530",
    "Description": "It has been marked ‘Level 4’ which is the highest warning level.",
    "Image": "https://th.thgim.com/news/international/wsayo8/article34495718.ece/ALTERNATES/FREE_960/traveladvisory-usjpg",
    "Link": "https://www.thehindu.com/news/international/us-reissues-travel-advisory-urges-americans-not-to-travel-to-india/article34495712.ece",
    "Text": "It has been marked ‘Level 4’ which is the highest warning level.\n\nThe U.S. has reissued its travel advisory on India, urging its citizens not to travel to the country due to an unprecedented surge in the COVID-19 cases there.\n\nIndia is struggling with a second wave of the pandemic with more than 3,00,000 daily new coronavirus cases being reported in the past few days, and hospitals are reeling under a shortage of medical oxygen and beds.\n\n“Do not travel to India due to COVID-19. Exercise increased caution due to crime and terrorism,” the State Department said on Wednesday in its latest travel advisory that looked identical to the one issued on April 28.\n\nBoth the travel advisory has been marked ‘Level 4’ which is the highest warning level.\n\nOn April 28, the Department approved the voluntary departure of family members of U.S. government employees.\n\nOn May 5, the Department approved the voluntary departure of non-emergency U.S. government employees.\n\n“U.S. citizens who wish to depart India should take advantage of available commercial transportation options,” it said.\n\nLast week, the Centers for Disease Control and Prevention (CDC) issued a Level 4 Travel Health Notice for India due to COVID-19, indicating a very high level of COVID-19 in the country.\n\nA record 3,780 fresh COVID-19 fatalities were registered in a single day in India taking the death toll to 2,26,188, while 3,82,315 new coronavirus infections were recorded, according to the Union Health Ministry data updated on Wednesday.\n\nWith the fresh cases, the total tally of COVID-19 cases in the country climbed to 2,06,65,148.",
    "Title": "U.S. reissues travel advisory, urges Americans not to travel to India"
  },
  {
    "Date": "Thu, 06 May 2021 03:17:15 +0000",
    "Description": "Strained by the pandemic and economic hardship, the country has exploded in anger. At least 24 people have died as the government cracks down.",
    "Image": "https://static01.nyt.com/images/2021/05/05/world/05colombia-top-new/05colombia-top-new-facebookJumbo-v2.jpg",
    "Link": "https://www.nytimes.com/2021/05/05/world/americas/colombia-covid-protests-duque.html",
    "Text": "BOGOTÁ, Colombia — A teenager shot to death after kicking a police officer. A young man bleeding out on the street as protesters shout for help. Police firing on unarmed demonstrators. Helicopters swarming overhead, tanks rolling through neighborhoods, explosions echoing in the streets. A mother crying for her son.\n\n“We are destroyed,” said Milena Meneses, 39, whose only son Santiago, 19, was killed in a protest over the weekend.\n\nColombians demonstrating over the past week against the poverty and inequality that have worsened the lives of millions since the Covid-19 pandemic began have been met with a powerful crackdown by their government, which has responded to the protests with the same militarized police force it often uses against rebel fighters and organized crime.\n\nThis explosion of frustration in Colombia, experts say, could presage unrest across Latin America, where several countries face the same combustible mix of an unrelenting pandemic, growing hardship and plummeting government revenue.",
    "Title": "Protests Explode in Colombia, Leaving At Least 24 Dead"
  },
  {
    "Date": "Thu, 06 May 2021 05:01:56 GMT",
    "Description": "The US would prefer a more stable and predictable relationship with Russia, Antony Blinken tells the BBC.",
    "Image": "https://ichef.bbci.co.uk/news/1024/branded_news/179D8/production/_118382769_0b510bf6-36df-4463-823b-955ffc1867a5.jpg",
    "Link": "https://www.bbc.co.uk/news/world-us-canada-57002792",
    "Text": "The secretary of state said that for President Biden it was important that \"whatever is done, whatever we do, the gains of the Good Friday Agreement are sustained and we have the political and economic well-being of Northern Ireland in mind\".",
    "Title": "Antony Blinken: US will respond to reckless Russian acts"
  },
  {
    "Date": "Thu, 06 May 2021 03:03:22 +0000",
    "Description": "For the first time, researchers have identified the remains of a sailor from the doomed 1845 Franklin expedition of the fabled Northwest Passage.",
    "Image": "https://static01.nyt.com/images/2021/05/05/multimedia/05xp-franklin-2/05xp-franklin-2-facebookJumbo.jpg",
    "Link": "https://www.nytimes.com/2021/05/05/science/hms-erebus-sailor.html",
    "Text": "On July 9, 1845, two months after departing from Greenhithe, England, Warrant Officer John Gregory wrote a letter to his wife from Greenland in which he described seeing whales and icebergs for the first time.\n\nGregory, who had never been to sea before, was aboard the H.M.S. Erebus, one of two ships to sail in Sir John Franklin’s 1845 expedition to find the fabled Northwest Passage, a sea route through the Canadian Arctic that would serve as a trade route to Asia.\n\nDisaster struck. The Erebus and the H.M.S. Terror became stuck in ice in Victoria Strait, off King William Island in what is now the Canadian territory of Nunavut. In April 1848, the survivors — Franklin and nearly two dozen others had already died — set out on foot for a trading post on the Canadian mainland.\n\nAll 129 explorers ultimately perished, succumbing to brutal blizzard conditions and subzero temperatures. The doomed expedition endured in the public imagination — inspiring fiction by Mark Twain and Jules Verne, and, more recently, the 2018 AMC series “The Terror” — driven in part by rumors that the crew resorted to cannibalism. The wreckage lay quiet until 2014, when a remotely controlled underwater vehicle picked up the silhouette of the Erebus near King William Island. Two years later, a tip from a local Inuit hunter led to the discovery of the Terror in the ice-cold water of Terror Bay.",
    "Title": "His Ship Vanished in the Arctic 176 Years Ago. DNA Has Offered a Clue."
  },
  {
    "Date": "Thu, 06 May 2021 04:38:43 GMT",
    "Description": "The current surge of the virus has already overwhelmed India's healthcare system.",
    "Image": "https://ichef.bbci.co.uk/news/1024/branded_news/C312/production/_118383994_hi066415505.jpg",
    "Link": "https://www.bbc.co.uk/news/world-asia-india-57004764",
    "Text": "India is sequencing just over 1% of all samples at the moment. \"In comparison, the UK was sequencing at 5-6% at the peak of the pandemic. But you can't build such capacity overnight,\" he said.",
    "Title": "India Covid: Government says 'double mutant' linked to surge"
  },
  {
    "Date": "Thu, 06 May 2021 06:00:42 GMT",
    "Description": "The PM says he supports Jersey as French fishing boats are set to protest against new post-Brexit rules.",
    "Image": "https://ichef.bbci.co.uk/news/1024/branded_news/E9A0/production/_118380895_gettyimages-1212194442.jpg",
    "Link": "https://www.bbc.co.uk/news/uk-57003069",
    "Text": "He said: \"I see it as very much an insult to them and they are extremely upset. The criteria that they were given was to prove they have fished in Jersey waters for 10 days. Nothing about what species were caught, nothing about if you've fished for 20 days or 30 days [and having to] prove that.\"",
    "Title": "UK sends Royal Navy ships to patrol Jersey amid fishing row with France"
  },
  {
    "Date": "Thu, 06 May 2021 00:04:34 +0000",
    "Description": "The two American men were teenagers in July 2019 when an early-morning scuffle with two plainclothes police officers in Rome turned deadly.",
    "Image": "https://static01.nyt.com/images/2021/05/05/world/05italy-trial/05italy-trial-facebookJumbo.jpg",
    "Link": "https://www.nytimes.com/2021/05/05/world/europe/americans-murder-italian-police-officer.html",
    "Text": "ROME — Two American men were found guilty of murder on Wednesday and sentenced to life in prison for the street-corner killing of an Italian military police officer on an early summer morning, when the two young San Francisco natives were vacationing in Rome.\n\nAfter deliberating for about 11 hours, a jury found Finnegan Elder, 21, and Gabriel Natale Hjorth, 20, guilty of the murder of Deputy Brig. Mario Cerciello Rega.\n\nGasps were heard across the courtroom as the verdicts were announced. The officer’s widow leaned against her lawyer and sobbed. Mr. Elder’s mother collapsed against her husband, as the court imposed the harshest penalty possible under Italian law.\n\nAs Mr. Elder was being led from the courtroom, his father Ethan called out: “Finnegan, I love you.”\n\nThe two Americans were still teenagers on July 26, 2019, when they got into a scuffle on a deserted street corner with two plainclothes police officers, Brigadier Cerciello Rega and Andrea Varriale.",
    "Title": "2 Americans Sentenced to Life in Prison for Murder of Italian Police Officer"
  },
  {
    "Date": "Thu, 06 May 2021 07:38:57 +0530",
    "Description": "Japan last month declared a COVID-19 state of emergency for the major population centres of Tokyo and Osaka and two other areas set to last until May 11 to contain a fourth wave of infections",
    "Image": "https://th.thgim.com/news/international/riaoxu/article34462713.ece/ALTERNATES/FREE_960/olympics-reutersjfif",
    "Link": "https://www.thehindu.com/news/international/tokyo-olympic-torch-staffers-diagnosed-with-covid-19/article34462687.ece",
    "Text": "Japan last month declared a COVID-19 state of emergency for the major population centres of Tokyo and Osaka and two other areas set to last until May 11 to contain a fourth wave of infections\n\nSix people who helped with Japan's Olympic Torch relay were diagnosed with COVID-19, bringing the total number of participants in the event who got the coronavirus to eight, organisers said.\n\nThe six people, who included a man in his 20s and another man in his 30s, helped on the relay in the southern prefecture of Kagoshima on April 27, Tokyo 2020 said in a statement late on Saturday.\n\nAll of them assisted with traffic control and wore masks, with three of them doing so in the city of Amami and the other three in the city of Kirishima, said the organisers.\n\nEarlier last month, two other people who helped with the torch relay on the southern island of Shikoku were diagnosed with COVID-19, including a police officer in his 30s who guided traffic in Kagawa prefecture.\n\nThe Tokyo 2020 organisers urged people to comply with COVID-19 guidelines.\n\nAlso Read | This could be India’s best Olympics: Sharath Kamal\n\nJapanese authorities are determined to protect Games participants and a local population that opinion surveys have shown is largely opposed to the Olympics due to fears the event will lead to more COVID-19 infections.\n\nJapan last month declared a COVID-19 state of emergency for the major population centres of Tokyo and Osaka and two other areas set to last until May 11 to contain a fourth wave of infections.\n\nThe Games, delayed by a year because of the pandemic, are scheduled to open on July 23.",
    "Title": "Six Tokyo Olympic torch staffers diagnosed with COVID-19"
  },
  {
    "Date": "Thu, 06 May 2021 00:06:56 +0530",
    "Description": "Cannot have bloodshed on border and good relationship in other domains, says  Jaishankar",
    "Image": "https://th.thgim.com/news/international/nt895x/article34491370.ece/ALTERNATES/FREE_960/2021-04-27T153426Z302176208RC2F4N9XJ1CURTRMADP3SPAIN-TELECOMS-5GJPG",
    "Link": "https://www.thehindu.com/news/international/china-expresses-concern-regret-over-indias-5g-exclusion/article34491371.ece",
    "Text": "Cannot have bloodshed on border and good relationship in other domains, says Jaishankar\n\nChina on Wednesday expressed “concern and regret” at India’s move to not include Chinese telecommunication firms among the companies permitted this week to conduct trials for the use of 5G technology.\n\nExternal Affairs Minister S. Jaishankar, speaking at a Global Dialogue Series event in London, reiterated India’s view on Wednesday that it is “not realistic” to have good relations in other domains when there was tension on the border. Mr. Jaishankar did not specifically mention the 5G issue, but said broadly on India’s view on the relationship: “I can’t have friction, coercion, intimidation, and bloodshed on the border, and then say let us have a good relationship in other domains. It is not realistic.”\n\nOn Tuesday, the Department of Telecommunications (DoT) gave permission to several Telecom Service Providers (TSPs) to conduct 5G trials, and did not include Chinese companies Huawei and ZTE. “The applicant TSPs include Bharti Airtel Ltd., Reliance JioInfocomm Ltd., Vodafone Idea Ltd. and MTNL,” the announcement said, adding they had “tied up with original equipment manufacturers and technology providers which are Ericsson, Nokia, Samsung and C-DOT” while Reliance Jio Infocomm will conduct trials using its own indigenous technology.\n\nReacting to the move, the Chinese Embassy in New Delhi said in a statement it “express[es] concern and regret that Chinese telecommunications companies have not been permitted to conduct 5G trials with Indian Telecom Service Providers in India”.\n\n“Relevant Chinese companies have been operating in India for years, providing mass job opportunities and making contribution to India’s infrastructure construction in telecommunications,” spokesperson Wang Xiaojian said.\n\nHe said moves to “exclude Chinese telecommunications companies from the trials” would “harm their legitimate rights and interests”. “The Chinese side hopes that India could do more to enhance mutual trust and cooperation, and provide an open, fair, just, and non-discriminatory investment and business environment for market entities from all countries, including China, to operate and invest in India.”\n\nAt Wednesday’s dialogue, Mr. Jaishankar said the relationship was “going through a very difficult phase, because in violation of agreements and understandings of many, many years, the Chinese have deployed a very large part of their military on, and close to, the Line of Actual Control, without explanation, and they continue to be there”.\n\nMr. Jaishankar noted it had been one year since the LAC crisis began, on May 5, 2020 with reports of tensions then starting in the Galwan Valley and Pangong Lake.\n\nHe said China’s “actions have disturbed peace and tranquillity”, including leading to bloodshed in Galwan last June, and India “has been very clear that peace and tranquillity on the border areas is essential for the development of our relations”. The disengagement process was completed in some areas but one year on is still ongoing in others, and both sides had not yet come to the de-escalation part.\n\nOn Friday’s phone call with his Chinese counterpart Wang Yi, the External Affairs Minister said both sides had discussed their mutual interest in cooperating on tackling COVID-19 at a time when Indian companies have placed many orders to source supplies from China amid the current crisis.\n\nHe told Mr. Wang that “many of our companies are ordering stuff from China and we are encountering difficulties in logistics, so please take a look at it which is something which we would appreciate”.\n\n“After our conversation things did move,” he said. “Some of our airlines got quicker approvals, the logistics chain is flowing, and that is something which is very laudable.”",
    "Title": "China expresses ‘concern, regret’ over India’s 5G exclusion"
  },
  {
    "Date": "Thu, 06 May 2021 04:08:17 +0530",
    "Description": "'This is just part of the whole-of-government response to “our friends” in India'",
    "Image": "https://th.thgim.com/news/international/75bk91/article34436030.ece/ALTERNATES/FREE_960/Belgium-NATO-US",
    "Link": "https://www.thehindu.com/news/international/heroic-effort-from-all-involved-says-us-on-covid-19-assistance-to-india/article34494720.ece",
    "Text": "'This is just part of the whole-of-government response to “our friends” in India'\n\nAfter the fourth US military aircraft carrying much-needed life-saving supplies landed in India amid the COVID-19 pandemic, Defense Secretary Lloyd Austin on Wednesday described it as a heroic effort from all those involved.\n\n\"So far, we've sent 4 gray tails to India, containing 1 million Rapid Diagnostic Tests, 545 Oxygen Concentrators, 1,600,300 N95 masks, 457 Oxygen cylinders, 440 regulators, 220 pulse oximeters and 1 Deployable Oxygen Concentration System,\" Mr. Austin tweeted with three pictures of the US military aircraft in India.\n\n\"It's been a heroic effort from all involved,” said the Defense Secretary.\n\nPentagon Press Secretary John Kirby told reporters that this is just part of the whole-of-government response to “our friends” in India.\n\n\"We remain in communication with them to see if there are other ways we can help them defeat COVID as we all move forward,” he said.\n\nMost of these supplies are being procured by the Defense Logistics Agency (DLA) at the request of USAID and the US Embassy in India, which are coordinating with the Indian government on the requirement related to life-saving medical supplies.\n\nAccording to the Pentagon, the agency has been tasked to provide 15 million N95 masks, one million test kits and 704 oxygen concentrators in support of the US Agency for International Development-led effort.\n\n\"We remain closely integrated with the White House, National Security Council, the Joint Chiefs of Staff and USAID to help clarify ways DLA can assist,\" Dave Kless, the agency's executive director of operations, said.\n\nThe DLA is also standing by to provide other supplies to India if directed. It has 14 field hospitals pending shipment to US Southern Command that could be redirected to India if requested, the Pentagon said.",
    "Title": "Heroic effort from all involved, says U.S. on COVID-19 assistance to India"
  },
  {
    "Date": "Thu, 06 May 2021 04:15:19 +0000",
    "Description": "If the pro-independence vote surges in Thursday’s elections for the Scottish Parliament, momentum for an another referendum on independence may become unstoppable.",
    "Image": "https://static01.nyt.com/images/2021/05/06/world/06Scotland-Photos/06Scotland-Photos-facebookJumbo.jpg",
    "Link": "https://www.nytimes.com/2021/05/06/world/scotland-election-brexit-independence.html",
    "Text": "If the pro-independence vote surges in Thursday’s elections for the Scottish Parliament, momentum for an another referendum on independence may become unstoppable.\n\nIt has weathered the conquest and loss of an empire, survived two world wars and witnessed more than one deadly pandemic. But now Scotland’s ancient alliance with England is itself in poor health and on Thursday it could take a serious turn for the worse.\n\nWhen Scottish voters go to the polls to elect 129 members of Scotland’s Parliament , strictly speaking the question of independence will not be on the ballot.\n\nYet, as these photos vividly illustrate, Scotland is grappling with an uncertain future. Pressure is growing for a second referendum on whether to leave the United Kingdom, breaking up a 314-year-old union. If Scots vote in sufficient numbers for pro-independence parties in Thursday’s election, the momentum for another plebiscite could become unstoppable.",
    "Title": "Scottish Election Could Boost Independence Movement"
  },
  {
    "Date": "Thu, 06 May 2021 06:10:07 +0000",
    "Description": "A breakthrough announcement on vaccine patents.",
    "Image": "https://static01.nyt.com/images/2021/05/06/multimedia/06am-briefingf-europe-vacine-patent2/merlin_187056444_0eaf5d5b-231a-4801-909d-308327bd004e-facebookJumbo.jpg",
    "Link": "https://www.nytimes.com/2021/05/05/briefing/your-thursday-briefing.html",
    "Text": "Biden administration backs lifting vaccine patents\n\nThe Biden administration said yesterday that it would support lifting patent protections on Covid vaccines, a breakthrough for efforts to produce more doses globally. “The extraordinary circumstances of the Covid-19 pandemic call for extraordinary measures,” Katherine Tai, the U.S. trade representative, said in a statement.\n\nThe U.S. had opposed a proposal at the World Trade Organization to suspend intellectual property protections in an effort to ramp up vaccine production. But its new support, made under growing pressure as the pandemic rages in India and South America, is no guarantee that a waiver will be adopted. The E.U. has also been standing in the way.\n\nResponse: The pharmaceutical industry responded to the decision with anger. The president of the Pharmaceutical Research and Manufacturers of America called the announcement “an unprecedented step that will undermine our global response to the pandemic and compromise safety.”\n\nGood news: The German company CureVac’s new RNA vaccine, which could be ready next month, does not require that doses be kept in a deep freezer, like the Pfizer and Moderna vaccines. That means it could more easily deliver the power of RNA vaccines to hard-hit parts of the world.",
    "Title": "Your Thursday Briefing"
  },
  {
    "Date": "Thu, 06 May 2021 09:28:33 +0530",
    "Description": "Cascade Investment, the holding company created by Bill Gates, transferred stock in two of Mexico's largest companies to Melinda French Gates, bringing the total amount she's received in the past few...",
    "Image": "https://c.ndtvimg.com/2021-05/a5h4702k_melinda-gates_625x300_06_May_21.jpg",
    "Link": "https://www.ndtv.com/world-news/melinda-gates-receives-billions-from-cascade-bill-gatess-biggest-asset-2433633",
    "Text": "Separation is expected to involve a wealth transfer that's only been seen in few other divorces. (File)\n\nCascade Investment, the holding company created by Bill Gates, transferred stock in two of Mexico's largest companies to Melinda French Gates, bringing the total amount she's received in the past few days to more than $2 billion.\n\nCascade moved stock in Coca-Cola FEMSA and Grupo Televisa to her control, according to regulatory filings dated May 3, the same day the Gateses announced they were ending their 27-year marriage. Cascade shifted about $1.8 billion of shares in Canadian National Railway Co. and AutoNation Inc. this week to French Gates, Bloomberg reported Tuesday.\n\nTheir separation is expected to involve a wealth transfer on a scale that's only been seen in a few other divorces, though few details have yet emerged. It could also have ramifications for one of the most important philanthropic organizations on the planet. The Bill & Melinda Gates Foundation has given away in excess of $50 billion to support healthcare, education, gender equality and efforts to combat climate change.\n\nGates, the 65-year-old co-founder of Microsoft Corp. is worth $144.2 billion, according to the Bloomberg Billionaires Index. French Gates, 56, is a former Microsoft manager who's gained international prominence co-running the foundation, and more recently for starting Pivotal Ventures, an investment and incubation company to advance 'social progress' in the U.S.\n\nBill Gates's biggest asset is Cascade Investment, which he created with the proceeds of Microsoft stock sales and dividends. Cascade oversees a vast portfolio comprising real estate, energy and hospitality as well as stakes in dozens of public companies.\n\nThe biggest public position is agricultural-machinery maker Deere & Co., with Cascade holding more than 10% of the stock valued at about $12 billion, followed by an $11.8 billion stake in waste-collection company Republic Services Inc., Bloomberg data show. That's followed by Canadian National and Ecolab Inc.\n\nMost of the portfolio, overseen by money manager Michael Larson, is comprised of North American companies, but it also owns stock in Diageo Plc, the world's largest distiller, and London-based private-jet services firm Signature Aviation Plc.\n\nThe Gateses are also among the largest landowners in America and have homes including their 66,000 square-foot mansion in Medina, Washington.\n\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
    "Title": "Melinda Gates Receives Billions From Cascade, Bill Gates's Biggest Asset"
  },
  {
    "Date": "Thu, 06 May 2021 08:47:53 +0530",
    "Description": "China said on Thursday it had suspended an economic agreement with Australia, in an apparent tit-for-tat response to Canberra's scrapping of a Belt and Road infrastructure pact and threat to undo a...",
    "Image": "https://c.ndtvimg.com/2021-04/8dr21b0o_belt-and-road_625x300_21_April_21.jpg",
    "Link": "https://www.ndtv.com/world-news/china-suspends-economic-accord-based-on-current-attitude-of-australia-2433127",
    "Text": "Last month, Prime Minister Scott Morrison's government scrapped a Belt and Road deal. (File)\n\nChina said on Thursday it had suspended an economic agreement with Australia, in an apparent tit-for-tat response to Canberra's scrapping of a Belt and Road infrastructure pact and threat to undo a deal leasing Darwin Port to a Chinese company.\n\nRelations between the two sides have collapsed into acrimony after Canberra called for an independent probe into the origins of the coronavirus pandemic and banned telecoms giant Huawei from building Australia's 5G network.\n\nChina -- Australia's biggest trading partner -- has already imposed tariffs on more than a dozen key industries, including wine, barley and coal, decimating exports.\n\nIn the latest recrimination, the China-Australia Strategic Economic Dialogue was pulled \"based on the current attitude\" of the Australian government, China's National Development and Reform Commission said in a statement Thursday, blaming some officials of a \"Cold War mindset\" and \"ideological discrimination\".\n\nBeijing will \"indefinitely suspend all activities under the framework\" of the agreement, the statement added.\n\nThe Australian dollar sank 0.6 percent soon after the news.\n\nCanberra has previously described the accord -- designed to boost trade between both sides and introduce large Chinese investors -- as one of the \"premier bilateral economic meetings with China\".\n\nThe first meeting in 2014 was called a chance for \"closer economic ties\" by Canberra.\n\nBut relations between the two have sunk into the deep freeze.\n\nLast month, Prime Minister Scott Morrison's government scrapped a Belt and Road deal between Beijing and the state of Victoria.\n\nChinese President Xi Jinping's signature Belt and Road Initiative is a vast, trillion-dollar plan for a network of investments and infrastructure across Asia and the world.\n\nBeijing reacted with anger to the Victoria state announcement, warning that taking the axe to the deal would cause \"serious harm\" to relations.\n\nBut critics have claimed the stand-off between the two sides is cover for Beijing to create geopolitical and financial leverage.\n\nThis week Australia doubled-down by saying a Chinese company's controversial 99-year-lease on Darwin Port was also under review and could be scrapped.\n\nDarwin is the most important port on Australia's north coast, the closest to Asia and a base for US Marines who rotate in and out of the country.\n\nDefence minister Peter Dutton told the Sydney Morning Herald his department had been asked to \"come back with some advice\" about the 2015 deal and refused to rule out forcing Chinese firm Landbridge to divest on national security grounds.\n\nThe deal -- brokered by local authorities in Australia's Northern Territory -- had raised serious concern in Canberra and Washington, where it was seen as a strategic liability.\n\nIt was not immediately clear if the row would impact on a free trade agreement between China and Australia that came into effect in 2015.\n\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
    "Title": "China Suspends Economic Accord With Australia, Cites \"Cold War Mindset\""
  },
  {
    "Date": "Thu, 06 May 2021 11:11:46 +0530",
    "Description": "Australia on Thursday described China's decision to freeze regular bilateral trade talks as \"disappointing,\" but insisted Canberra was still willing to talk despite ties reaching a new low.",
    "Image": "https://c.ndtvimg.com/2021-05/5nver8qk_australia-china-generic_625x300_06_May_21.jpg",
    "Link": "https://www.ndtv.com/world-news/chinas-freezing-of-economic-talks-disappointing-says-australia-2435182",
    "Text": "China said on Thursday it had suspended an economic agreement with Australia.\n\nAustralia on Thursday described China's decision to freeze regular bilateral trade talks as \"disappointing,\" but insisted Canberra was still willing to talk despite ties reaching a new low.\n\nTrade Minister Dan Tehan said the now-suspended China-Australia Strategic Economic Dialogue provided an \"important forum\" for the two countries \"to work through issues\", but noted no such talks had taken place since 2017. China earlier said it had suspended the agreement as relations between the two sides have collapsed into acrimony.\n\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
    "Title": "China's Freezing Of Economic Talks \"Disappointing\", Says Australia"
  },
  {
    "Date": "Thu, 06 May 2021 05:50:07 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/02/Kamala-Harris-pearls_1200Instagram.jpg",
    "Link": "https://indianexpress.com/article/world/kamala-harris-message-solidarity-india-friday-7304055/",
    "Text": "Vice President Kamala Harris on Friday will deliver a message of solidarity with the people of India, as the US partners with the country to save lives and hasten the end of the coronavirus pandemic, the State Department has said.\n\nHarris is slated to deliver her address at the top of an online event “Bolstering US COVID Relief Efforts in India: Perspectives from the Diaspora” organised by the State Department.\n\nHarris, 56, is the first woman, the first Black American, and the first South Asian American to be elected US Vice President.\n\n“Kamala Harris will provide an opening message on US solidarity with the people of India as we partner to save lives & hasten the end of the pandemic,” the South and Central Asia Bureau of the State Department announced on Wednesday.\n\nThe event on Friday noon local time will be hosted by Ervin Massinga, senior advisor in the South and Central Asia Bureau of the State Department.\n\nMassinga will provide an overview of the US government’s relief efforts and panelists will discuss commercial and civil society-led efforts to address the current emergency, what support will be needed to re-open India after the second wave, and how they can align efforts to bring the two countries closer together moving forward.\n\nHarris’s remarks would be followed by a panel discussion featuring diaspora leaders including Virginia State Senator Ghazala Hashmi; Lata Krishnan from American Indian Foundation; Indiaspora founder M R Rangaswami and Gunisha Kaur, Assistant Professor at Weill Cornell Medicine, Medical Director, Weill Cornell Center for Human Rights.",
    "Title": "US VP Kamala Harris to deliver message of solidarity with people of India on Friday"
  },
  {
    "Date": "Thu, 06 May 2021 06:08:27 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/05/2021-05-06T002335Z_97529084_RC20AN98JHK8_RTRMADP_3_HEALTH-CORONAVIRUS-AUSTRALIA.jpg",
    "Link": "https://indianexpress.com/article/world/covid-curbs-reinstated-in-sydney-as-australian-officials-trace-mystery-case-7304071/",
    "Text": "A medical worker swabs a member of the public at the Bondi Beach drive-through coronavirus disease (COVID-19) testing centre as the city experiences an outbreak in Sydney, Australia, December 21, 2020. (REUTERS)\n\nAustralian officials reinstated social distancing measures across greater Sydney on Thursday, as they scrambled to find missing transmission links in a COVID-19 case connected to an Indian variant of the virus.\n\nWith many people expected to gather over the weekend for annual Mother’s Day celebrations, the New South Wales state\n\ngovernment restricted household gatherings to 20 guests and limited aged care facility visitors to two people per resident.\n\nMasks will be mandatory on public transport and at indoor venues. All the restrictions, which cover around 5.3 million people in the country’s biggest metropolitan area, take effect at 5 p.m. local time and are scheduled to last until Monday morning.\n\n“We believe this is a proportionate response to the risk we have ahead of us,” NSW Premier Gladys Berejiklian told reporters.The measures, which also cover Sydney’s neighbouring regions of Wollongong, the Central Coast and Blue Mountains, were spurred by the detection of COVID-19 in a 50-year-old man, who passed the infection to his wife.The case, the first local transmission in NSW in more than a month, baffled health officials given the man had no known links to high-risk jobs or people.\n\nTesting has determined the man was infected with a variant first detected in India and genomic sequencing had linked the case to a returned traveller from the United States, NSW Chief Health Officer Kerry Chant said on Thursday, but there was no clear transmission path between the two people.\n\n“We can’t find any direct link between our case, so what we’re concerned about is there is another person that is as yet unidentified that infected our case,” Chant said.\n\nIt appeared to be the first time officials had reported the local transmission of an India virus variant in Australia.Tests on the infected man had showed a higher viral load than typically seen in infected people, potentially increasing the chance that the man has spread the disease, officials said.NSW Treasurer Dominic Perrottet entered self-isolation on Thursday after he visited a restaurant at the same time as the infected person, classifying him as a close contact, his office said.\n\nPerrottet, who attended a sitting of state parliament on Wednesday, has tested negative.\n\nAuthorities also asked thousands of residents in the city’s inner west to seek testing for any mild flu symptoms after fragments of the coronavirus that causes COVID-19 were detected in the sewerage network used by several suburbs.Speedy tracing systems, movement curbs and border restrictions have largely reined in the spread of COVID-19 in Australia, which has recorded 29,865 cases and 910 deaths since the pandemic began.\n\nThe federal government is currently under pressure to overturn a temporary travel ban on travellers, including its own citizens, from COVID-ravaged India. Australia has blocked all direct flights from the country until May 15.\n\nA report in the Sydney Morning Herald newspaper on Thursday, citing unidentified sources, said at least two repatriation flights will be dispatched to India every week from the middle of this month to bring home around 9,000 Australians.\n\nPrime Minister Scott Morrison, however, said the situation would be constantly reviewed.”We are not going to commit to that at this point,” Morrison told radio station 3AW on Thursday.",
    "Title": "COVID curbs reinstated in Sydney as Australian officials trace mystery case"
  },
  {
    "Date": "Thu, 06 May 2021 04:46:40 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/04/AstraZeneca-Vaccine.jpg",
    "Link": "https://indianexpress.com/article/world/denmark-norway-study-finds-slightly-raised-blood-clot-rates-after-astra-covid-shot-7303963/",
    "Text": "A study in Denmark and Norway has found slightly increased rates of vein blood clots among people who have had a first dose of AstraZeneca’s COVID-19 vaccine, including clots in the brain, compared with expected rates in the general population.\n\nResearchers who conducted the study stressed, however, that such side effects are extremely rare, and the benefits of the vaccine still outweigh the risks in most situations.\n\n“The absolute risks of venous thromboembolic events described in this study are small, and the findings should be interpreted in the context of the benefits of COVID-19 vaccination at both the societal and the individual level,” they wrote in a summary of their findings published in the BMJ medical journal on Thursday.\n\nNorway suspended its rollout of the AstraZeneca vaccine on March 11 after a small number of cases of blood clots combined with bleeding and low platelet counts. Denmark has also withdrawn the shot from use.European and UK medicine regulators have said the vaccine is safe and effective, and that its benefits far outweigh any side effect risks, but several other countries have recommended using it only in certain age groups.\n\nThe BMJ study looked at 280,000 18-65 year-olds in Denmark and Norway who had a first dose of the AstraZeneca vaccine between the start of February and March 11.\n\nUsing national health records, the researchers identified rates of events such as heart attacks, strokes, deep vein blood clots and bleeding events within 28 days of receiving a first vaccine dose, and compared them with expected rates in the general populations of Denmark and Norway.\n\nResults showed 59 blood clots in the veins, compared with 30 expected, equating to 11 excess events for every 100,000 vaccinations. The researchers said this included a higher-than-expected rate of rare brain blood clots, known as cerebral venous thrombosis, at 2.5 cases per 100,000 vaccinations.\n\nCommenting on the findings, Paul Hunter, a professor of medicine at Britain’s University of East Anglia, said they added to understanding of the risk of thrombosis after COVID-19 vaccination, but should not alter regulators’ conclusions.\n\n“Those countries that delayed their own vaccination programmes at a time of high transmission rates by declining to use available (AstraZeneca) vaccines should know that their decision will have contributed to an increase in the number of avoidable deaths from COVID-19,” he said.",
    "Title": "Denmark, Norway study finds slightly raised blood clot rates after Astra COVID shot"
  },
  {
    "Date": "Thu, 06 May 2021 04:41:14 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/05/2021-05-06T012345Z_749838326_RC21AN9UAW0L_RTRMADP_3_SPACE-EXPLORATION-CHINA-USA.jpg",
    "Link": "https://indianexpress.com/article/world/debris-from-out-of-control-china-space-rocket-likely-to-fall-in-international-waters-7303955/",
    "Text": "The Long March-5B Y2 rocket, carrying the core module of China's space station Tianhe, takes off from Wenchang Space Launch Center in Hainan province, China April 29, 2021. (Reuters)\n\nDebris from a Chinese rocket that sent part of a planned space station into orbit last week is likely to fall in international waters, China’s Global Times reported on Wednesday, amid concerns it could cause damage on re-entry to\n\nEarth.\n\nThe Long March 5B blasted off from Hainan island on April 29 carrying the “Tianhe” module that contains what will become living quarters for three crew on a permanent Chinese space station. Its point of re-entry remains unclear but the Global Times, a tabloid published by the official People’s Daily, described reports that the rocket is “out of control” and could cause damage as “Western hype.”\n\nThe situation is “not worth panicking about”, it said, citing industry insiders.”Most of the debris will burn up during re-entry … leaving only a very small portion that may fall to the ground, which will potentially land on areas away from human activities or in the ocean,” Wang Yanan, chief editor of Aerospace Knowledge magazine, was quoted as saying by the newspaper.\n\nThe Defense Department said U.S. Space Command was tracking the rocket’s location and that re-entry was expected to be around May 8.”All debris can be potential threats to spaceflight safety and the space domain,” the Pentagon said, adding that the 18th Space Control Squadron in California would be offering daily updates on the rocket body’s location from May 4.\n\nThe White House said the United States was committed to addressing the risks of congestion due to space debris and wants to work with the international community “to promote leadership and responsible space behaviors.”\n\nThe Global Times also cited aerospace expert Song Zhongping as saying China’s own space monitoring network will keep a close watch on areas under the rocket’s flight course and take measures to avoid damage to passing ships.The environmentally friendly fuel used by the Long March 5B would not pollute the ocean, he added.\n\n“In all, it is another hyping of the so-called ‘China spacethreat’ adopted by some Western forces,” Song said.",
    "Title": "Debris from ‘out-of-control’ China space rocket likely to fall in international waters"
  },
  {
    "Date": "Thu, 06 May 2021 04:40:58 +0530",
    "Description": "Joe Biden believes social media platforms have a responsibility to \"stop amplifying untrustworthy content,\" the White House said, even as it declined to comment on a decision by Facebook's oversight...",
    "Image": "https://c.ndtvimg.com/2020-04/s2lekegg_social-media-apps_625x300_18_April_20.jpg",
    "Link": "https://www.ndtv.com/world-news/social-media-platforms-should-not-amplify-untrustworthy-content-white-house-2431101",
    "Text": "Major platforms must not amplify disinformation, misinformation, the White House said (Representational)\n\nU.S. President Joe Biden believes social media platforms have a responsibility to \"stop amplifying untrustworthy content,\" the White House said on Wednesday, even as it declined to comment directly on a decision by Facebook Inc's oversight board to keep a suspension in place for former President Donald Trump.\n\n\"The president's view is that the major platforms have a responsibility related to the health and safety of all Americans to stop amplifying untrustworthy content, disinformation and misinformation, especially related to COVID-19, vaccinations and elections,\" White House spokeswoman Jen Psaki told reporters.\n\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
    "Title": "Social Media Platforms Mustn't Amplify Untrustworthy Content: White House"
  },
  {
    "Date": "Thu, 06 May 2021 04:07:40 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/05/2021-05-05T173511Z_121085605_RC2T9N9TT8QO_RTRMADP_2_GLOBAL-RACE-USA-POLICE.jpg",
    "Link": "https://indianexpress.com/article/world/atlanta-forced-to-reinstate-policeman-charged-with-killing-black-man-7303916/",
    "Text": "Former Atlanta Police Department officer Garrett Rolfe, who was fired after the shooting death of 27-year-old Rayshard Brooks, poses in an undated photograph released in Atlanta, Georgia, U.S. June 14, 2020. (Reuters)\n\nThe city of Atlanta on Wednesday reinstated a police officer fired over the fatal shooting of a Black man last year after an oversight board ruled that he was terminated without due process.\n\nThe Atlanta Civil Service Board said the city failed to follow its own procedures when Mayor Keisha Lance Bottoms dismissed Garrett Rolfe, who is white, without a hearing. He shot Rayshard Brooks, 27, in the back in June outside a Wendy’s restaurant.\n\nRolfe is charged with felony murder, aggravated assault and other crimes in the case. A trial date has not been set.The city said in a statement that he would remain on administrative duty. Representatives for the city and the board were not available for further comment.\n\nThe mayor defended her initial decision to fire Rolfe. “Given the volatile state of our city and nation last summer, the decision to terminate this officer, after he fatally shot Mr. Brooks in the back, was the right thing to do,” she said in a statement.\n\nThe June 12 shooting, which came two weeks after the killing of George Floyd in Minneapolis, heightened tensions across the United States over police brutality and racism in American policing and led to sometimes violent protests in Atlanta and other cities.\n\nPolice officers were responding to complaints that Brooks had fallen asleep while drunk behind the wheel of a car in the drive-through lane of the fast-food restaurant. After a struggle, he wrested away one officer’s Taser, fired it at police and then ran away, defying their orders to stop. He was shot twice in the back.\n\nThe Civil Service Board ruled that Rolfe was not offered the opportunity to respond to the allegations that led to his dismissal.\n\nHis lawyer, Lance LoRusso, said in a statement that Rolfe was innocent and “has now won the opportunity to explain what happened.”Gerald Griggs, vice president of the Atlanta chapter of the NAACP, the largest U.S. civil rights organization, said under no circumstances should Rolfe go back on street patrol.\n\n“He does not deserve a to be a police officer in this or any city, and we are going to protest,” Griggs said. “The community is upset and this will not stand.”\n\nMore than two dozen protesters gathered on the steps of Atlanta City Hall on Wednesday evening, with many of them holding signs with slogans such as “Stop Police Killing” “Justice for Rayshard Brooks” and “Jail Killer Cops Now.”\n\nSome protesters called for the city to fire Rolfe again.”Rayshard Brooks needed a ride home, what he wound up with was a bullet in his back,” said Devin Barrington-Ward, a local activist.",
    "Title": "Atlanta forced to reinstate policeman charged with killing Black man"
  },
  {
    "Date": "Thu, 06 May 2021 04:04:31 +0530",
    "Description": "US President Joe Biden's administration on Wednesday announced support for a global waiver on patent protections for Covid-19 vaccines, offering hope to poor nations that have struggled to access the...",
    "Image": "https://c.ndtvimg.com/2021-04/8f5gga1k_joe-biden_625x300_29_April_21.jpg",
    "Link": "https://www.ndtv.com/world-news/us-backs-covid-vaccine-patent-waiver-plan-proposed-by-india-south-africa-2430914",
    "Text": "Joe Biden on Tuesday said he wanted 70% of US adults to have received at least one shot by July 4 (File)\n\nUS President Joe Biden's administration on Wednesday announced support for a global waiver on patent protections for Covid-19 vaccines, offering hope to poor nations that have struggled to access the life-saving doses.\n\nIndia, where the death count hit a new daily record amid fears the peak is still to come, has been leading the fight within the World Trade Organization (WTO) to allow more drugmakers to manufacture the vaccines -- a move pharma giants oppose.\n\nUS Trade Representative Katherine Tai said that while intellectual property rights for businesses are important, Washington \"supports the waiver of those protections for Covid-19 vaccines\" in order to end the pandemic.\n\n\"This is a global health crisis, and the extraordinary circumstances of the Covid-19 pandemic call for extraordinary measures,\" she said in a statement.\n\nBiden had been under intense pressure to waive protections for vaccine manufacturers, especially amid criticism that rich nations were hoarding shots.\n\nTedros Adhanom Ghebreyesus, head of the World Health Organization (WHO), called the US decision \"historic\" and said it marked \"a monumental moment in the fight against COVID19.\"\n\nTai cautioned however that negotiations \"will take time given the consensus-based nature\" of the WTO.\n\nWith supplies for Americans secured, the Biden administration will continue efforts \"to expand vaccine manufacturing and distribution,\" and will work to \"increase the raw materials needed to produce those vaccines.\"\n\nFor months the WTO has been facing calls to temporarily remove the intellectual property protections on Covid-19 vaccines, known as a TRIPS waiver in reference to the agreement on Trade-Related Aspects of Intellectual Property.\n\nBut that notion has been fiercely opposed by pharmaceutical giants and their host countries, which insist the patents are not the main roadblocks to scaling up production, and warned the move could hamper innovation.\n\n\"A waiver is the simple but the wrong answer to what is a complex problem,\" the Geneva-based International Federation of Pharmaceutical Manufacturers and Associations lobby group said, describing the US move as \"disappointing.\"\n\nCountries such as New Zealand, however, welcomed the US announcement, while Australian Prime Minister Scott Morrison called the move \"tremendous news,\" adding that it would help his country manufacture mRNA vaccines locally.\n\nFrance, on the other hand, has said it is opposed to the waiver, stating it prefers instead a donation-based model to help poor countries overcome a lack of vaccines.\n\nDevastating surge\n\nWhile the United States has reached the point of offering donuts and beer to entice vaccine holdouts to get their shots, India reported 3,780 new pandemic deaths and not enough doses to inoculate its people.\n\nIndia has in recent weeks endured a devastating surge in coronavirus cases, with more than 380,000 infections reported on Wednesday.\n\nK Vijay Raghavan, the Indian government's principal scientific advisor, said the country of 1.3 billion people had to prepare for a new wave of infections even after beating down the current wave, which has taken the country's caseload above 20 million.\n\nIn an effort to boost the country's collapsing health system, India's reserve bank announced $6.7 billion in cheap financing for vaccine makers, hospitals and health firms.\n\nIndia's crisis has been partly fueled by a lack of vaccines. This has in turn exacerbated the global shortage as India is the world's biggest producer of Covid shots.\n\nIn London, foreign ministers from the Group of Seven wealthy democracies committed to financially support the vaccine-sharing program, Covax.\n\nBut there was no immediate announcement on fresh funding.\n\nOn the opposite end of the spectrum, Denmark, where the spread of the virus has been deemed under control, will open up cinemas and theaters plus gyms and fitness centers Thursday. And bars, cafes and restaurants, which have already reopened, will no longer require reservations.\n\nAll patrons, however, must present a \"corona pass\" certificate confirming they have either tested negative in the past 72 hours, been vaccinated or recently recovered from Covid-19.\n\nVaccine inequity\n\nThe pandemic has claimed more than 3.2 million lives worldwide since it first emerged in late 2019, but many wealthy nations have made progress in suppressing the virus as mass vaccination campaigns gather steam.\n\nMore than 1.2 billion doses have been administered globally, but fewer than one percent in the least developed countries.\n\nVaccine shortages are not an issue in the United States, which could soon be sitting on as many as 300 million extra doses -- nearly equivalent to its entire population.\n\nBiden on Tuesday said he wanted 70 percent of US adults to have received at least one shot by the July 4 Independence Day holiday.\n\nHe also said his administration was \"ready to move immediately\" if regulators authorize the Pfizer-BioNTech vaccine for 12- to 15-year-olds.\n\nBut some experts question the wisdom of devoting limited vaccine supplies to a low-risk group instead of sharing them with high-risk groups abroad.\n\nIn the Middle East, Egypt announced a partial shutdown of malls and restaurants and called off festivities for the Muslim holiday of Eid al-Fitr to curb rising coronavirus cases.\n\nAnd on Wednesday Argentina broke its record for Covid-19 deaths with 633 recorded fatalities in 24 hours, despite stepped-up measures to reduce movement of people across the country.",
    "Title": "US Backs Covid Vaccine Patent Waiver Plan Proposed By India, South Africa"
  },
  {
    "Date": "Thu, 06 May 2021 03:39:34 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/05/bill-melinda-gates-divorce-nyt-1200.jpg",
    "Link": "https://indianexpress.com/article/world/who-gets-xanadu-2-0-the-gates-family-mansion-7303888/",
    "Text": "Written by Valeriya Safronova\n\nAs experts in philanthropy, finance, technology and global health scramble to predict what the divorce of Melinda and Bill Gates could mean for their industries, others are wondering: Who will get their lakefront estate in the Seattle suburbs, which is valued at upward of $131 million? And will the public finally get a peek inside?\n\nThe couple, worth an estimated $124 billion according to Forbes, announced their split in a joint statement posted to their social media profiles Monday. The Bill and Melinda Gates Foundation, of which they are co-chairs, said that nothing will change in its organizational structure.\n\nBut their 66,000-square-foot home on the shore of Lake Washington is another matter. The sprawling complex — which, at the time of a 1995 New York Times story, included a spa, a 60-foot pool, a gym paneled with stone from a mountain peak in the Pacific Northwest, a trampoline room, and a stream for salmon, trout and other fish — got the nickname Xanadu 2.0 from Gates’ biographers.\n\n(Xanadu is the name of a large, lavish property that belongs to the tycoon at the heart of the film “Citizen Kane.” The 2.0 refers to Gates’ technological innovations.)\n\nThe details of the waterfront compound have been kept incredibly private by the Gates family — so much so that a tour of the property went for $35,000 at a charity auction in 2009, according to TechCrunch. The Gateses own multiple other parcels of land surrounding the main property, according to public records, so walking by to catch a glimpse is out of the question.\n\nBut an intern for Microsoft who made it inside in 2007 was allowed to write about the visit on the company’s blog. According to his account, the house is built out of “orangey wood” and the sand on the beach is imported from Hawaii. The wood is Douglas fir; the origin of the sand, unconfirmed. (“Going down Bill’s driveway is like arriving at Jurassic Park,” the intern wrote. “The landscaping is just insane.”)\n\nOther known details about the house are that it was divided into pavilions that were terraced into a 170-foot hill and that it was designed by architects James Cutler and Peter Bohlin. Bohlin’s firm later designed the famous Apple cube at the company’s store on Fifth Avenue in New York.\n\nAnd, Melinda Gates once said that the mansion caused her to have a “mini sort of personal crisis.”\n\nBill Gates was already working on his dream home before marrying Melinda Gates in 1994. But construction was halted when she arrived on the scene. The place was “a bachelor’s dream and a bride’s nightmare,” according to a 2008 profile of Melinda Gates in Fortune magazine, with “enough software and high-tech displays to make a newlywed feel as though she were living inside a video game.”\n\n(A decade later, Melinda Gates was similarly grim: “Just to be clear, the house was being built before I came on the scene,” she said in a 2019 New York Times interview. “But I take responsibility for it.”)\n\nAfter six months of discussions about whether the entire project should be scrapped, Melinda Gates decided to influence further construction by incorporating her preferences — and insisted on making the place a home for a family and not a lone tech wizard. To that end, she hired interior designer Thierry Despont, who has been the creative mind behind the restoration of famous interiors like the Palm Court at the Plaza Hotel in New York and the Ritz in Paris.\n\nStill, Bill Gates made big promises about the house’s technological powers in his 1995 book, “The Road Ahead.” He described his vision of a smart home where guests would be given badges that would communicate with sensors around the house. As they moved through the rooms, lights would dim or brighten, music would play and the temperature would automatically adjust to their preference. It’s not clear whether these plans panned out.\n\nAnother aspect of Bill Gates’ vision was to turn the walls into video screens where he would be able to display digitized works of art. As the house was being built, Gates began to purchase the electronic rights to world-famous pieces from museums like the National Gallery in London through a company called Interactive Home Systems.\n\nThese acquisitions were part of an entrepreneurial experiment: Gates imagined that in the future, other people would be able to decorate their homes with digitized artworks just like he was attempting to do. His vision didn’t come to fruition. (Interactive Home Systems became Corbis, a rich photography archive, which later sold its image and licensing division to a Chinese company.)\n\nPerhaps Gates may now recommit himself to designing and building a smart house (though that may not be a challenging project for him today, now that connected devices are everywhere).\n\nBecause despite the changes she made to the couple’s home, Melinda Gates recently expressed misgivings about continuing to live there.\n\n“We won’t have that house forever,” she told The Times in 2019. “I’m actually really looking forward to the day that Bill and I live in a 1,500-square foot house.”",
    "Title": "Who gets Xanadu 2.0, the Gates family mansion?"
  },
  {
    "Date": "Thu, 06 May 2021 03:55:06 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/05/BIDENS-CARTERS-1.jpg",
    "Link": "https://indianexpress.com/article/world/wide-angle-oddity-giant-bidens-meet-tiny-carters-7303895/",
    "Text": "A photo provided by Adam Schultz/The White House shows former President Jimmy Carter and former first lady Rosalynn Carter, both seated, posing for a photo with President Joe Biden and first lady Jill Biden at the Carter's home in Plains, Ga. (Adam Schultz/The White House via The New York Times)\n\nWritten by Heather Murphy\n\nIt was a pleasant 86 or so degrees in Plains, Georgia, when President Joe Biden and Jill Biden visited former President Jimmy Carter and his wife, Rosalynn Carter, at their home on April 29.\n\nJill Biden wore a dress covered in lemons and two delicate silver bracelets. Rosalynn Carter was dressed more casually in a white long-sleeved T-shirt, sneakers and a smartwatch. Joe Biden wore a royal-blue suit, and Jimmy Carter a sport coat over a T-shirt.\n\n“We just had a nice time,” the current president said later.\n\nReporters were not permitted inside, but a photo of the two couples that the Carter Center posted Monday on Twitter — with its toothy grins and teacups — seemed to back this up.\n\nExcept one thing was off: At some point during the visit, the Bidens appeared to have turned into giants.\n\nJill Biden is 5-foot-6. So far as the world knows. Jimmy Carter, 96, stood around 5-foot-10 at his tallest. But even kneeling, she appeared to dwarf him. And Joe Biden, who is 6 feet tall, seemed to hover above the man he had come to pay his respects to. It was as if the hosts had been turned into Hobbits.\n\n“Did they pull some Gandalf/Hobbit perspective trickery or are the Biden’s actually this gigantic?”, one man asked on Twitter. Another user asked if she was “the only one who thinks this looks like a tiny doll museum, and Joe and Jill are giants?”\n\nIn a thread on Reddit that was full of Hobbit jokes, others countered that perhaps age had shrunk the former president to 3 feet. Or maybe, some wondered, there was something going on with the lens.\n\nSo which is it?\n\nReached by phone, chief official White House photographer Adam Schultz confirmed that he took the photo but declined to explain. “It’s for people to figure out and think about,” he said.\n\nThe answer can be found in Jimmy Carter’s gigantic shoes, said Pete Souza, a former chief official White House photographer for President Barack Obama. Compared to the rest of him they look huge.\n\n“That to me is an indication that the foreground was distorted by a super-wide-angle lens,” he said.\n\nSuch lenses can be helpful when a photographer is trying to shoot several people in a small room and cannot get far back enough to get everyone in the same frame with another lens. But they are notorious for distorting proportions, Souza said.\n\nJaron Schneider, the editor-in-chief of PetaPixel, a photography and camera news website, had a similar theory.\n\n“It’s called perspective distortion,” he said.\n\nWide-angle lenses make objects closer to the camera appear to be much larger than objects that are even just a tiny bit farther away.\n\nBecause the Carters are leaning back, the wide-angle lens exaggerates the few inches between them and the Bidens, Schneider said. Had the Bidens and Carters been seated on exactly the same plane, this effect would not have been so striking. This is why the two men’s shoes seem to be on a similar scale.\n\nThe placement of the chairs also exacerbates the distortion, he said. The center of a wide-angle photo tends to look natural. But once you start moving toward the edge of the photo, the proportions get increasingly distorted. Had everyone been huddled around the lamp, the effect would not have been so noticeable.\n\n“Wide-angle lenses have this angle no matter how optically correct they,” Schneider said, adding that these sorts of optical distortions can be fixed in post production.\n\nBut while editing the photo may have made it look more realistic, that would be frowned upon, said Doug Mills, a photographer assigned to the Washington bureau of The New York Times.\n\nMills was outside the Carters’ home during the photo session and saw the flash go off inside. He agreed that it seemed likely that a wide-angle lens was used to solve the problem of capturing all four subjects in a small space\n\nSome asked why the Carter Center would release a distorted photo, or why it was not edited to remove the distortion.\n\n“That would be completely forbidden,” Mills said. Official White House photographers are supposed to abide by ethical rules similar to those followed by photojournalists, he said.\n\nThe picture, for all its amusing flaws, is history.",
    "Title": "Wide-angle oddity: Giant Bidens meet tiny Carters"
  },
  {
    "Date": "Thu, 06 May 2021 04:05:57 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/05/flight.jpg",
    "Link": "https://indianexpress.com/article/world/drugmakers-warn-china-flight-halt-in-india-could-snarl-supplies-7303913/",
    "Text": "On April 26, China’s state-run Sichuan Airlines suspended cargo flights to India for 15 days amid an alarming second Covid-19 outbreak there. (Representational)\n\nDrugmakers in India are warning that a halt on some cargo flights from China could imperil an important link in the global pharmaceutical supply chain. The U.S. relies heavily on India to stock its medicine cabinets, and any slowdown in output could leave pharmacies short of drugs used regularly by millions of Americans.\n\nOn April 26, China’s state-run Sichuan Airlines suspended cargo flights to India for 15 days amid an alarming second Covid-19 outbreak there. China supplies 60% to 70% of the raw materials used by India’s drugmakers, as well as ingredients for finished medicines sent to markets worldwide, according to Mahesh Doshi, national president for the Indian Drug Manufacturers’ Association.\n\nIf the flights remain on hold, the drug industry fears “cascading effects on its entire supply chain,” Doshi wrote in an April 29 letter to India’s external affairs minister. That could lead to domestic shortages of essential medicines and have a severe impact on exports, she said.\n\nSichuan Airlines didn’t respond to a request for comment made outside of normal business hours during a holiday in China.\n\nDrugmakers are normally secretive about where medicines are produced. However, the U.S. Pharmacopeia, which helps the industry maintain quality controls, has started a project to pinpoint as much manufacturing as possible. Its Medicine Supply Map has identified where 77% of finished generic drugs are made, said spokeswoman Anne Bell.\n\nThere are 62 generic drugs that are produced only in India, Bell said, including several antibacterial treatments and antivirals. India also is home to 31% of active ingredient manufacturing facilities named in applications approved by the U.S., according to the U.S. Food and Drug Administration.\n\nTo this point, there haven’t been any reported shortages due to the outbreak in India, but doctors and health experts have been bracing for impacts. Last year, the U.S. saw deficits of everything from sedatives to inhalers to a depression medication when the pandemic started and parts of China were locked down.\n\n“This is very reminiscent of where we were right when Covid hit and people were like ‘What’s happening in China?’” said Erin Fox, a drug-shortage expert with the University of Utah who works closely with the American Society of Health-System Pharmacists. “Because there’s so much opacity, we don’t know exactly how we could be impacted. There isn’t a lot we can do.”\n\nSireesha Yadlapalli, regional general manager for USP in South Asia, said she has been pleased to see the industry in India hasn’t yet been negatively impacted, but said that the effect of the pause on Sichuan flights could be severe.\n\nProtecting Workers\n\nMany drug companies in India have taken steps to try to protect their workers and keep assembly lines running, even as infections soar. On Tuesday, the country had 382,146 new coronavirus cases, according to Bloomberg data.\n\n“As of now there is no disruption in production,” said Sudarshan Jain, secretary general of the Indian Pharmaceutical Alliance. “We don’t know the future, how further it is stretched, but at this moment we are making all preparations, working on all contingencies, to make sure that the medicines are available.”\n\nThe U.S. Food and Drug Administration has contacted drugmakers in India as infections in the country soar.\n\n“It’s a dynamic situation,” Acting FDA Commissioner Janet Woodcock said in an interview Wednesday. “We’re going to work closely with manufacturers there. We are concerned in several ways: Will they be able to keep up production and continue to manage quality?”\n\nSome drugmakers with plants in India have struggled to meet U.S. quality standards even before the pandemic started. FDA inspectors over the last several years have cited them for ignoring quality failures and in some cases manipulating results from testing meant to ensure drugs’ safety and effectiveness.\n\nThe agency has uncovered similar deficiencies at factories in China and in the U.S. as well, though the generic-drug industry is largely focused around India.\n\nTeva Pharmaceutical Industries Ltd., one of the largest generic drug companies, said in a letter to customers Tuesday that the supply it originates from India hadn’t yet been interrupted and that it has contingency plans in place should shortfalls occur.\n\n“We are closely monitoring the evolving situation in India, and are accordingly adapting our business continuity plans,” Christine Baeder, senior vice president of U.S. generics, wrote in the letter.\n\nTeva’s factories in India aren’t among those the FDA has warned for failing to meet quality standards.\n\nUnpredictable Effects\n\nIf drug output in India slows, it could have unpredictable consequences globally. Companies in India such as Sun Pharmaceutical Industries Ltd. and Dr. Reddy’s Laboratories Ltd. make a significant share of generic medicines taken by Americans. At the same time, many U.S. and European drug giants have set up manufacturing in India, drawn by low wages and less-stringent regulation.\n\nSun Weidong, China’s ambassador to India, has tweeted support for India over the last week and said China is encouraging companies to help fulfill India’s need for medical supplies. On Saturday, Weidong said 61 cargo flights have operated between China and India in the previous two weeks.\n\nAbout 4 million people work in India’s pharmaceutical industry. Attendance at drug factories is down slightly but not enough to impact production, according to Jain of the Indian Pharmaceutical Alliance and Ashok Kumar Madan, executive director of the Indian Drug Manufacturers’ Association, but some states have imposed full or partial lockdowns.\n\nIf the crisis worsens, more workers could be kept away from factories. According to the U.S. Pharmacopeia, 32% of factories in India that produce active pharmaceutical ingredients are in cites currently under some kind of lockdown, representing about 6% of global output.\n\nCompanies are keeping factory workers distanced and meet weekly to discuss the supply chain, Jain and Madan said. They also said some companies have hired their own buses to transport workers rather than having them use public transportation.\n\nMany companies hope to be able to vaccinate workers at their plants, though low supply has caused immunization in India to slow. About 9% of India’s almost 1.4 billion people have received one vaccine shot and just 2% are fully vaccinated, according to the Bloomberg Vaccine Tracker.\n\nSome investors are betting that India’s drugmakers will falter, and that competitors elsewhere will benefit.\n\nShares of Chinese pharmaceutical companies climbed last week after Scarlett Shi, an analyst with Zhongtai International in Hong Kong, said that the situation has stoked speculation that Chinese drugmakers could gain if India’s production falters.",
    "Title": "Drugmakers warn China flight halt in India could snarl supplies"
  },
  {
    "Date": "Thu, 06 May 2021 03:54:27 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/05/Untitled-design-62.png",
    "Link": "https://indianexpress.com/article/world/pakistan-pm-expresses-displeasure-over-working-of-embassies-says-indian-counterparts-more-proactive-7303906/",
    "Text": "The disgruntled prime minister underlined that \"Indian embassies are more proactive in bringing investments\" to their country and they also provide \"better services to their citizens\". (Representational)\n\nUnderlining that their Indian counterparts are “more proactive” and provide “better services to their citizens”, Prime Minister Imran Khan on Wednesday expressed his displeasure over the working of Pakistani ambassadorial staff abroad.\n\nSpeaking to Pakistani envoys posted in capitals around the world virtually, Khan pulled them up for their “indifferent attitude and unnecessary delays in routine services”, particularly in the Middle East.\n\n“Feedback that I have received from Saudi Arabia shows as if the staff is not working. The staff in Kuwait’s NADRA (National Database and Registration Authority) office take bribes instead of guiding people and an official is involved in making wrong documents…I was shocked to learn all this,” he said.\n\nThe disgruntled prime minister underlined that “Indian embassies are more proactive in bringing investments” to their country and they also provide “better services to their citizens”.\n\nKhan said he received a lot of complaints on the Pakistan Citizen Portal, which his government launched for direct complaints by Pakistanis in the country or abroad, against various departments.\n\nHe said Pakistanis in the UAE and Saudi Arabia were sending the highest remittances, but the embassies in both the countries showed indifferent attitude towards them.\n\nKhan said instead of helping the poor workers, the ambassadors dealt with them the way British used to treat them during the colonial period.\n\nHe stressed that if Pakistan today had not gone bankrupt, it was because of the remittances sent home by overseas Pakistanis.\n\n“We cannot continue like this…Embassies’ foremost work is to service the diaspora and then they should work to bring investment into the country that is going through very bad financial conditions right now,” Khan said.\n\nHe also urged the envoys to help Pakistani prisoners in foreign jails.\n\nThe meeting came in the wake of Islamabad calling back its ambassador from Saudi Arabia last week along with six other officials on complaints of mistreatment towards the Pakistanis working in the kingdom.",
    "Title": "Pakistan PM expresses displeasure over working of embassies, says Indian counterparts ‘more proactive’"
  },
  {
    "Date": "Thu, 06 May 2021 05:48:24 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/01/Trump-social-media.jpg",
    "Link": "https://indianexpress.com/article/world/british-political-veteran-steers-facebooks-trump-decision-7304006/",
    "Text": "In this Thursday, June 18, 2020 file photo, Donald Trump looks at his phone during a roundtable with governors on the reopening of America's small businesses, in the State Dining Room of the White House in Washington. (AP/File)\n\nWritten by Adam Satariano and Cecilia Kang\n\nWhen Facebook barred President Donald Trump from its service in January, Mark Zuckerberg, the chief executive, defended the decision in a Facebook post the morning after the siege of the Capitol. But the first draft was written the night before by Nick Clegg, a former British deputy prime minister who leads the company’s public affairs.\n\nMore than a week later, Clegg urged Zuckerberg to let a new outside panel decide whether to let Trump back on Facebook, employees involved in the deliberations said. Handing over control of one of the most consequential free-speech decisions of the internet age was risky advice, and some in the company wondered if Zuckerberg would agree.\n\n“I defer to you, Nick,” Zuckerberg said, according to Tucker Bounds, a spokesman for Facebook who was at the meeting.\n\nOn Wednesday the panel, the Facebook Oversight Board, upheld the decision to suspend Trump’s account, preventing him from posting to Facebook or Instagram. But the board said Facebook had made a mistake imposing an “indefinite” ban, and it called on the company to revisit the ban within six months, to either make it permanent or set a timeline for reinstatement.\n\nClegg played perhaps the biggest behind-the-scenes role in decisions around Trump’s account, colleagues said, an unlikely position for a British political veteran in such an important moment for American free speech. He developed the main justification used by Zuckerberg for barring Trump, and he oversaw the creation of the board, including the selection of its members.\n\nThe board’s ruling on Trump tests the argument that Clegg championed inside Facebook: Instead of taking all the responsibility for moderation, the company should enlist a quasi-judicial board of outside experts to make the final decision. Many have questioned Facebook’s effort to create a global arbiter of speech, including some company employees, arguing in part that it lacks legitimacy because the board is Facebook-funded and stacked with hand-selected representatives.\n\nBut Clegg has said that absent rules from governments, Facebook had few good options other than creating a statelike institution of its own.\n\nClegg, 54, declined to comment for this article. But Facebook made executives available to discuss his role at the company, many on the condition that their names not be published. Clegg also connected The New York Times with several people outside Facebook to speak favorably of him. The Times also spoke with members of the oversight board, academics, political figures, civil society groups and others familiar with Clegg’s work.\n\nClegg joined Facebook in 2018 to oversee its policy and public relations team after his political star had faded. The leader of the left-leaning Liberal Democrats, he was voted out of office in 2017 after alienating supporters by joining Britain’s Conservative Party in forming a coalition government. After Britain increased college tuition, cutouts of Clegg were hanged in effigy by protesters in London.\n\nFacebook wanted Clegg to help repair its relationships with regulators, political leaders and the media after the Cambridge Analytica scandal, when data improperly pulled from Facebook was used by to create voter profiles. Clegg’s international experience and comfort in five languages — English, Spanish, French, German and Dutch — appealed to the American-centric company.\n\nFriends said Clegg had initially been reluctant to join Facebook, one of the world’s most polarizing corporations. But he wanted to be back at the center of important political and policy debates. In a memo outlining how he envisioned the role, he argued that it was unsustainable for a private company like Facebook, rather than democratically elected governments, to have so much power, especially on speech-related issues.\n\n“My advice was strongly to go for it,” said Tony Blair, the former British prime minister, whom Clegg spoke with before taking the job, “because you’re going to be part of one of the most powerful companies in the world at a moment of enormous change in the world, and when technology is at the heart of that change.”\n\nInside Facebook, where Zuckerberg leans on a group of friends and early employees for counsel, Clegg earned the trust of his new boss. At the company’s headquarters, where proximity to Zuckerberg is power, Clegg’s desk was placed nearby. He orchestrated a trip through Europe with Zuckerberg, meeting with European Union leaders in Brussels and President Emmanuel Macron of France in Paris.\n\nSince Clegg’s arrival, Facebook has shifted some of its policy positions. It now appears more accepting of regulation and higher taxes. He overcame reluctance from Zuckerberg and others in the company to ban political ads in the weeks before Election Day last year. And he was the main internal supporter for recently announced product changes that give users more control over what posts they see in their Facebook feeds.\n\n“He has a track record of knowing what it’s like to work inside a Cabinet that needs to make decisions quickly and move at the speed of a country, or in this case a platform,” said Chris Cox, Facebook’s chief product officer, who worked with Clegg on the user-control changes.\n\nCritics say Clegg’s role is an attempt by Facebook to use a respected global political figure to soften its image. Despite pledges to accept new government regulation, the company continues to fight strong oversight, policymakers said. Others said changes made by Clegg did not address core problems with the company’s privacy-invading business model, which is optimized to keep people scrolling their Facebook feeds, amplifying divisive and inflammatory content and exaggerating political divisions in society.\n\n“‘Are you sure you’re on the right side here?’ That is the question that will get thrown back at Clegg,” said Damian Collins, a Conservative member of the British Parliament who led an investigation of social media in politics. “He’s taken a lot of money to go work for a company that doesn’t meet the highest ethical standards.”\n\nOn Wednesday, the board’s decision frustrated some critics, who said it showed a level of bureaucracy that the former politician had brought to the company.\n\n“We did not need a ruling from an illegitimate Facebook board to understand that the corporation was not prepared to address governmental abuse of its platform,” said Jennifer Grygiel, an assistant professor at Syracuse University who researches social media.\n\nClegg had hoped Wednesday’s judgment would be the final word on Trump’s ban. Instead, the oversight board said Facebook must find a permanent solution on its own, effectively kicking a final decision back to Facebook’s executives.\n\nThe person who Facebook said would lead that decision-making process? Clegg.",
    "Title": "British political veteran steers Facebook’s Trump decision"
  },
  {
    "Date": "Thu, 06 May 2021 04:52:31 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/05/CALIF-ASIAN-MEMORIAL-11.jpg",
    "Link": "https://indianexpress.com/article/world/daylight-attack-asian-women-san-francisco-increases-fears-7303928/",
    "Text": "Buddhists from many cultures and communities gather for a ceremony to repair the nation’s racial karma at the Higashi Honganji Buddhist Temple in Los Angeles on May 4, 2021, a temple that had recently been vandalized in an arson attack. (Rozette Rago/The New York Times)\n\nFrom her flower stand on Market Street, Patricia Lee saw the glint of a large blade and then feathers from a winter jacket fly through the air. An older woman buckled to her knees.\n\nIn broad daylight, on one of the busiest streets in San Francisco, two unsuspecting Asian women, one of them 84, had just been attacked by a man with a large military-style knife, officials and witnesses said.\n\n“He walked right next to me — I could have been the one who got stabbed,” said Lee, who witnessed the attack Tuesday afternoon. Police arrested Patrick Thompson, 54, who they say carried out the attack, although the motive remained unknown.\n\nThompson was charged Wednesday with attempted murder. Both women were treated for their wounds at a San Francisco hospital and their conditions were described by the police as non-life-threatening.\n\nOver the past several months, Asian Americans in the San Francisco Bay Area have been shoved to the ground, punched and robbed — attacks that have come amid a rise in anti-Asian hate across the country and the scapegoating of Asian communities for the spread of the coronavirus.\n\nThe stabbing Tuesday has only added to the anxiety of a large segment of the city’s population. Community organizations and the San Francisco police recently introduced a Mandarin and Cantonese hotline to report crimes and attacks.\n\n“The community is reeling from the onslaught of brutality against defenseless and fragile people,” said David Lee, an activist in the city’s Chinese community who is in the same family association as the 84-year-old victim. “It speaks to the violence, the lawlessness, the lack of civic responsibility and order on the streets of San Francisco right now.”\n\nAfter a year of aggressive and effective measures against the coronavirus, San Francisco has been opening back up. There were about 15 people waiting Tuesday at the bus stop where the two women were stabbed, one sign that the city is coming back to life. Yet many say the pandemic has contributed to two other crises: a drug overdose epidemic that killed twice as many people in the city as the coronavirus did last year, and the string of violence against Asians.\n\nAsian American grandparents who spent months stuck inside during lockdowns are now afraid to go outdoors, said Carl Chan, the president of the Oakland Chinatown Chamber of Commerce.\n\nChan has been one of the most prominent voices in the Bay Area Chinese community raising concerns about the attacks. In a measure of how common they have become, Chan himself was assaulted on a street in Oakland last week. On his way to visit a 69-year-old Chinese man who was recuperating after being attacked with a cane on a public bus, Chan was punched in the head by a man who called him a racial slur.\n\n“I’m extremely concerned,” Chan said Wednesday of the continued violence against Asians. “We have to stand up no matter how many attacks and stop this craziness.”\n\nIn many cases, the police and prosecutors have struggled to establish a motive. A spokesperson for the San Francisco District Attorney’s Office, Rachel Marshall, said five people in the city have been charged with anti-Asian hate crimes this year. Others have been charged with elder abuse, including a 19-year-old man who was accused of fatally assaulting Vicha Ratanapakdee, a retired bank auditor from Thailand, on a chilly January morning.\n\nMany of the assaults have occurred in and around the Tenderloin, a district that struggles with some of the city’s most intractable social problems, including people suffering from mental illness and drug addiction who often live on the streets.\n\nTwo attacks in March carried out by a man the police identified as Steven Jenkins, 39, illustrate the hazy ambiguity that the street conditions can bring to some of these attacks.\n\nThe authorities said Jenkins attacked a 75-year-old Chinese grandmother and an 83-year-old Vietnamese man, assaults that gained national attention because the grandmother, Xiao Zhen Xie, fought Jenkins with a small plank. Jenkins was arrested and charged with assault, battery and elder abuse. He has pleaded not guilty.\n\nLawyers for Jenkins said he had been homeless for a decade and suffered from mental illness. The public defender’s office released security camera footage showing a chaotic set of circumstances leading up to the point where he attacked Xie. In the video, Jenkins is punched by several people before he turns to strike Xie.\n\n“There’s a lot of desperate people out there now,” said Danny Yu Chang, a travel agent from the Philippines, who was knocked unconscious by an attacker in March as he returned to his downtown San Francisco office after lunch.\n\n“I think it’s safer right now to stay at home,” Yu Chang said.\n\nA relative of Vicha, the retired bank auditor who was killed in January, said he saw a progression during the pandemic that began with Asians being spit upon and blamed for the virus but later escalated to physical attacks.\n\n“At the beginning of the pandemic, it was Trump-inspired, hate-filled verbal attacks,” said Vicha’s son-in-law, Eric Lawson. “Now it’s become violent.”\n\nLee, the community activist, said the constant barrage of videos and reports showing attacks on Asians has been particularly wearing.\n\n“Every time we see a story that is the worst, we’ve seen another one comes along,” he said. “There is this escalation of horrors that never seems to end.”",
    "Title": "Daylight attack on 2 Asian women in San Francisco increases fears"
  },
  {
    "Date": "Thu, 06 May 2021 03:33:17 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/05/VACCINE-13.jpg",
    "Link": "https://indianexpress.com/article/world/us-supplies-of-vaccine-components-to-india-to-enable-manufacturing-doses-of-covishield-7303876/",
    "Text": "Providing raw materials for the production of anti-coronavirus vaccines was a major component of the Biden administration's announcement on medical aid to India. (Representational)\n\nThe US on Wednesday said the vaccine components it has supplied to India this week will enable the manufacturing of two crore doses of the Covishield vaccine even as the sixth shipment of American medical aid arrived as part of the Biden administration’s assistance to the country’s response to a rising number of COVID-19 cases.\n\nThe United States also sent a separate shipment of over 81,000 vials of Remdesivir injections that was delivered in Mumbai.\n\nAs India continues to reel under a record-breaking wave of the coronavirus infection, the European Union (EU) announced an initial Euro 2.2 million (approximately Rs 19 crore) in emergency funding to support the World Health Organization’s (WHO) measures to curb the spread of the coronavirus in the country.\n\nThe 27-nation grouping said the funding announced by the European Commission is in addition to the medical assistance being provided to India by the EU member states.\n\n“Today, the commission has announced that it will allocate an initial Euro 2.2 million in emergency funding to respond to the drastic surge in COVID-19 cases in India,” the EU said.\n\n“The funding will support the World Health Organization (WHO) for a six-month case management of COVID-19 patients as well as for strengthening the laboratory capacity for COVID-19 testing,” it said.\n\nIn line with its announcement to support India in its fight against the pandemic, the US delivered the sixth shipment of its aid on Wednesday.\n\n“The American people continue to deliver life-saving assistance to India, with the 6th flight of emergency relief in 6 days! This shipment includes a climate-friendly oxygen generation unit which can turn air into oxygen. Thanks to the people of California!” the US embassy said in a tweet.\n\nSeparately, US Chargé D’Affaires in India Daniel B Smith said both the countries will together defeat the pandemic.\n\n“The #USIndia partnership involves all aspects of the relationship: government, business, and people. This week, vaccine components arrived in India from the U.S. that will enable the manufacturing of 20 million doses of the Covishield vaccine. Together we will defeat COVID-19!” he said in a tweet.\n\nProviding raw materials for the production of anti-coronavirus vaccines was a major component of the Biden administration’s announcement on medical aid to India.\n\nThe Covishield vaccine is produced in India by the Serum Institute of India (SII), based in Maharashtra’s Pune.\n\nLast month, SII CEO Adar Poonawalla appealed to US President Joe Biden to lift the embargo on the export of raw materials needed to manufacture the vaccines.\n\nMinistry of External Affairs (MEA) Spokesperson Arindam Bagchi said a shipment of over 81,000 vials of Remdesivir from the US arrived in Mumbai on Wednesday morning.\n\n“Further elevating the India and the United States Strategic Partnership! Appreciate the shipment of over 81000 vials of Remdesivir from the US that arrived early this morning in Mumbai,” he tweeted.\n\nMeanwhile, Israel delivered its first consignment of medical supplies comprising oxygen concentrators to India on Wednesday. The consignment was brought to the country in a special flight.\n\nThe Israeli embassy said more such flights will bring emergency medical aid, including thousands of group and individual oxygen generators, respirators, medications and additional medical equipment.\n\n“In this hour of need, our two democracies stand solidly side by side. The State of Israel is happy to lend a helping hand to our friend India in this complicated and difficult time,” Israeli ambassador Ron Malka said.\n\n“Our friendship is strong and collaboration during the COVID-19 crisis will only make it stronger. I see great importance in the cooperation with India in this joint fight against the global pandemic,” he added.",
    "Title": "US supplies of vaccine components to India to enable manufacturing of two crore doses of Covishield"
  },
  {
    "Date": "Thu, 06 May 2021 05:07:55 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/04/Indian-Express-logo-4.jpg",
    "Link": "https://indianexpress.com/article/world/gunmen-kill-15-soldiers-in-attack-in-southwest-niger-7303969/",
    "Text": "They were attacked on Tuesday afternoon by heavily armed men on motorcycles, who were described as \"terrorists\".\n\nUnidentified gunmen killed 15 soldiers and wounded four more on Tuesday in an attack on an army post in southwest Niger, the ministry of defence said on Wednesday.\n\nThe attack in north Tillabery region, which borders Mali and Burkina Faso, came two days after gunmen killed 16 soldiers in the nearby Tahoua region of the West African country. The soldiers were part of a special anti-jihadist force called Operation Almahaou, said Niger’s defence minister in a statement.\n\nThey were attacked on Tuesday afternoon by heavily armed men on motorcycles, whom he described as “terrorists”.\n\nSeveral of the assailants were also killed in combat, while others retreated toward the north and are being pursued, said the statement.\n\nThe area is overrun by jihadist groups with links to al Qaeda and Islamic State, who have killed hundreds of soldiers and civilians since 2018 when they began broadening their reach beyond bases in Mali.\n\nThe scale of the violence this year has called into question claims of progress in the fight against Islamist militants by governments in West Africa’s Sahel region and former colonial power France, which has 5,000 troops there to support them.",
    "Title": "Gunmen kill 15 soldiers in attack in southwest Niger"
  },
  {
    "Date": "Thu, 06 May 2021 03:28:53 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/05/TRUMP-FUNDRAISING.jpg",
    "Link": "https://indianexpress.com/article/world/facebook-ban-hits-trump-where-it-hurts-messaging-and-money-7303880/",
    "Text": "Written by Nick Corasaniti and Shane Goldmacher\n\nFacebook’s decision Wednesday to keep former President Donald Trump off its platform could have significant consequences for his political operation as he tries to remain the leader of the Republican Party, thwarting his ability to amplify his message to tens of millions of followers and hampering his fundraising ability.\n\nFacebook has increasingly become one of the most vital weapons in a political campaign’s arsenal, with its ability to juice small-dollar online-fundraising numbers into the millions, expand and acquire contact information, help build out data on a campaign’s voter file and provide the most sophisticated advertising platform available.\n\nFew campaigns had tapped into Facebook’s potential for advertising and fundraising as aggressively as Trump’s. His successful 2016 campaign said its prolific use of Facebook had allowed it to send millions of different, hypertargeted political ads to small slices of the population.\n\n“Facebook was the method,” Brad Parscale, Trump’s campaign manager in 2020 and digital director in 2016, told “60 Minutes” in 2017. “It was the highway which his car drove on.”\n\nThat continued in 2020, as his reelection operation devoted a nine-figure budget to Facebook advertising. And much as he did with his Twitter account, Trump often turned to Facebook’s advertising platform in times of political crisis.\n\nDuring Trump’s first impeachment trial, in September 2019, his campaign began flooding Facebook with ads criticizing the impeachment as a hoax and subversive effort by far-left Democrats.\n\nAlthough Trump is out of office and living at his resort in Florida, he retains broad influence over the Republican Party. But his platform for reaching Americans has diminished greatly without access to big social media sites such as Facebook and Twitter, which has permanently suspended him. Some Trump aides think that the absence of Facebook, which was crucial to his success in 2016, will hinder him if he decides to run again in 2024, which he has told several advisers is his plan.\n\nFacebook’s ruling was delivered by an oversight board, which also said the company’s indefinite suspension was “not appropriate’’ and gave Facebook six months to come up with a final decision on whether Trump would regain access.\n\nHis Facebook ads proved a useful tool to draw big crowds to his signature rallies. Days before the president was scheduled to arrive in a given city, Facebook users around the region would begin seeing ads about the rally, with a link to sign up for a free ticket.\n\nThe decision by Facebook does not immediately hamper Trump’s fundraising ability — he still maintains control of a large number of supporter email addresses and phone numbers. But fundraising lists must be continually refreshed, and Facebook has proved a crucial place for Trump to do so.\n\n“He has the best fundraising list, but that decays over time if you’re not adding back into it,” said Eric Wilson, a Republican digital strategist. “So because they don’t have the ability to run ads on Facebook, they’re losing out on petitions to grow their email list, surveys, things like that — the tactics that every campaign has to be doing 365 to really maintain their fundraising.”\n\nThroughout 2020, the Trump campaign would run ads asking users to “take this SOCIALISM poll” or “Wish Melania a Happy Birthday,” which would help keep lists current and occasionally expand or add new names to their lists — or even spur a direct donation.\n\nIn recent days, Trump’s operation has begun to more aggressively solicit supporters for cash via text message, including one reacting to the Facebook decision on Wednesday.\n\nOn Tuesday, Trump’s team announced he would begin posting his thoughts on political developments to his own website, trying to brand it as the “From the Desk of Donald J. Trump.” But the power of Trump’s pronouncements on social media had been their ability to ricochet quickly across the web and into the streams of his supporters — something far harder to achieve while being deplatformed.\n\nBut even without Facebook, some Republican strategists note that Trump still has one of the largest megaphones in the world, simply because of the public interest in his plans, which might lessen the impact of Facebook’s ban.\n\n“I compare it to somebody who has a sprained ankle,” said Tim Cameron, a Republican digital strategist. “It’s kind of hobbling for a little bit, and he’s not going to be at the strength that he would be with the ability to reach people on Facebook and other social platforms, but it’s certainly not something that’s going to stop him.”\n\nEven with the Facebook spigot turned off since January, Trump began the spring with more than $85 million in his various political committees, according to an adviser, after banking tens of millions of dollars that he raised after the election.\n\nBut perhaps most immediately, the ban against running any political ads hampers one of Trump’s most current prized roles: Republican primary kingmaker.\n\n“He’s really committed to settling scores and making sure his allies get boosted,” Wilson said. “They won’t have access to Facebook to help the candidates he wants to support in the primaries in 2022.”",
    "Title": "Facebook ban hits Trump where it hurts: Messaging and money"
  },
  {
    "Date": "Thu, 06 May 2021 10:10:19 +0530",
    "Description": "A top American lawmaker has proposed sending a mercy ship to India to help the country which is struggling to deal with a deadly second wave of the COVID-19 pandemic.",
    "Image": "https://c.ndtvimg.com/2021-05/4fe6gle_us-lawmaker-propose-travel-of-a-mercy-ship-to-india-to-help-address-covid19-challenge-650_625x300_06_May_21.jpeg",
    "Link": "https://www.ndtv.com/india-news/coronavirus-us-must-organise-and-collaborate-to-provide-aid-india-needs-congresswoman-sheila-jackson-lee-2434235",
    "Text": "US must collaborate to provide the aid India needs, Congresswoman said.\n\nA top American lawmaker has proposed sending a mercy ship to India to help the country which is struggling to deal with a deadly second wave of the COVID-19 pandemic.\n\nThe situation in India is so dire that the US must organise and collaborate to provide the aid India needs, Congresswoman Sheila Jackson Lee said after the United Memorial Medical Center in Houston announced sending COVID-19 assistance to India.\n\n\"Today, we announced humanitarian help to India and proposed travel of a mercy ship to India to help with the devastation of COVID-19,\" Jackson Lee said on Wednesday, as several lawmakers came forward appealing for more assistance to India.\n\nToday, we announced humanitarian help to India and proposed travel of a mercy ship to India to help with the devastation of Covid-19. The situation in India is dire so we must organize and collaborate to provide the aide India needs. Thank you @cgihou, @HoustonUmmc, and leaders! pic.twitter.com/cZUVyc6q8G — Sheila Jackson Lee (@JacksonLeeTX18) May 5, 2021\n\nCongresswoman Katherine Clark said that the United States must continue to do everything it can to end the crisis in India and other countries and protect people from infection and the deadly impact of COVID-19.\n\n\"Our work as a nation is not over until the pandemic has been stopped in all corners of the world,\" she said.\n\nIndian-American Congressman Raja Krishnamoorthi had a virtual meeting with India's Ambassador to the US, Taranjit Singh Sandhu, during which he extended full support to India in its fight against COVID-19.\n\n\"I thanked Congressman for his strong support for India during these challenging times,\" Taranjit Singh Sandhu said in a tweet.\n\nCongresswoman Lisa Blunt Rochester praised the Department of Defence for flying COVID-19 assistance to India.\n\n\"Wonderful to see this support making its way to #India. Sending my prayers to the entire country as they face down this wave of COVID19,\" she said.\n\nWonderful to see this support making its way to #India. Sending my prayers to the entire country as they face down this wave of #COVID19https://t.co/BX8waRLYZT — Rep. Lisa Blunt Rochester (@RepLBR) May 5, 2021\n\nIndia is struggling with a second wave of the pandemic with more than 3,00,000 daily new coronavirus cases being reported in the past few days, and hospitals are reeling under a shortage of medical oxygen and beds.\n\nA record 3,780 fresh COVID-19 fatalities were registered in a single day in India taking the death count to 2,26,188, while 3,82,315 new coronavirus infections were recorded, according to the Union Health Ministry data updated on Wednesday.\n\nWith the fresh cases, the total tally of COVID-19 cases in the country climbed to 2,06,65,148.\n\nOver 40 countries have committed to provide India urgently required medical supplies like oxygen-related equipment and critical medicines to help it deal with an unprecedented second wave of the coronavirus pandemic, foreign secretary Harsh Vardhan Shringla said in New Delhi last week.",
    "Title": "US Must Organise And Collaborate To Provide Aid To India: Congresswoman"
  },
  {
    "Date": "Thu, 06 May 2021 05:22:57 +0530",
    "Description": "SpaceX managed to land its prototype Starship rocket at its Texas base without blowing it up on Wednesday, the first time it has succeeded in doing so in five attempts.",
    "Image": "https://c.ndtvimg.com/2021-03/veddhv5o_spacex-starship-rocket650_625x300_04_March_21.jpg",
    "Link": "https://www.ndtv.com/world-news/spacex-successfully-lands-starship-rocket-at-texas-base-on-fifth-attempt-2431344",
    "Text": "A small fire engulfed the base of the space vessel shortly after landing (File)\n\nSpaceX managed to land its prototype Starship rocket at its Texas base without blowing it up on Wednesday, the first time it has succeeded in doing so in five attempts.\n\nThe test flight represents a major win for the hard-charging company, which eventually wants to carry crew inside Starship for missions to Mars.\n\n\"Starship landing nominal!\" tweeted founder Elon Musk triumphantly, after the last four tries ended in big explosions.\n\n\"Nominal\" means normal in the context of spaceflight.\n\nThe execution wasn't quite perfect, with a small fire engulfing the base of the 50 meter- (160 feet-) high rocket, dubbed SN15, shortly after landing.\n\nSpaceX webcaster John Insprucker explained this was \"not unusual with the methane fuel we're using,\" adding engineers were still working out design issues.\n\nThe flames were quickly put out with water cannons, footage showed.\n\nEarlier, the rocket took off at around 5:25 pm local time (2225 GMT) from the Starbase in Boca Chica in southern Texas, reached an altitude of 10 kilometers (6 miles) and performed a series of maneuvers, including a horizontal descent called a \"belly flop.\"\n\nSpaceX was facing added pressure to succeed with Wednesday's flight after NASA last month announced a version of Starship will be used as a lunar lander when the space agency returns humans to the Moon.\n\nBut the $2.9 billion contract is currently suspended after two rival companies, Jeff Bezos' Blue Origin and Dynetics, lodged a protest.\n\nNevertheless, if the award is eventually confirmed, it will transform Starship from Musk's pet project to a major tax payer-funded venture, with all the scrutiny that entails.\n\nThe first two flight tests of Starship, SN8 and SN9, both crash landed and exploded when they launched in December and February, respectively.\n\nThe next, SN10, successfully landed then blew up a few minutes later on March 3.\n\nThe video feed cut out during the test flight of the fourth, SN11, with Musk later confirming it too had exploded, this time in mid-flight.\n\nEventually, SpaceX plans to combine the Starship spaceship with a Super Heavy rocket, creating a fully reusable system to explore deep into our solar system.\n\nThis final version will stand 394 feet (120 meters) tall and will be able to carry 100 metric tonnes into Earth orbit -- the most powerful launch vehicle ever developed.\n\nMusk wants to use this to help realize his goal of transforming humanity into a multiplanetary species with a colony on Mars.\n\nThe planned lunar version of Starship would however serve a more modest goal -- docking with a future lunar orbital station, collecting astronauts, then setting them down on the Moon.\n\nTo get the astronauts to the lunar station in the first place, NASA has a more traditional plan in mind: using its own giant SLS rocket with a crew capsule called Orion affixed on top.\n\nBut the SLS rocket has suffered severe delays and cost overruns, and observers have mused if Starship succeeds, it could one day make SLS obsolete.\n\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
    "Title": "SpaceX Starship Finally Nails First Landing Without Exploding"
  },
  {
    "Date": "Thu, 06 May 2021 03:51:46 +0530",
    "Description": "Jeff Bezos' Blue Origin will send its first crew to space on July 20 and is offering one of the seats to the winner of an online auction, the company said Wednesday.",
    "Image": "https://c.ndtvimg.com/2021-05/e0i4ci2_blue-origin-reuters_625x300_06_May_21.jpeg",
    "Link": "https://www.ndtv.com/world-news/jeff-bezos-space-venture-blue-origin-will-fly-first-crew-to-space-in-july-2430848",
    "Text": "Blue Origin has not yet published its prices but its clientele is expected to be wealthy individuals\n\nJeff Bezos' Blue Origin will send its first crew to space on July 20 and is offering one of the seats to the winner of an online auction, the company said Wednesday.\n\nThe trip will last a total of ten minutes, four of which passengers will spend above the Karman line that marks the recognized boundary between Earth's atmosphere and space.\n\n\"We've been perfecting our ability to launch, land and repeat,\" a video accompanying the announcement said.\n\n\"Our next launch will be the first time astronauts will fly aboard New Shepard.\"\n\nThe reusable suborbital rocket system was named after Alan Shepard, who sixty years ago on Wednesday became the first American in space.\n\nNew Shepard has successfully carried out 15 uncrewed test runs launching from its facility in the Guadalupe Mountains of West Texas.\n\nAfter lift-off, the capsule, which carries up to six crew members, separates from its booster, then spends four minutes at an altitude exceeding 60 miles (100 kilometers), during which time those on board experience weightlessness and can observe the curvature of Earth from space.\n\nThe booster lands autonomously on a pad two miles from the launch site, and the capsule floats back to the surface with three large parachutes that slow it down to about a mile an hour when it lands.\n\nBlue Origin said the bidding will be unsealed on May 19 before a final-stage live online auction on July 12 when the winner is announced.\n\nThe proceeds will go to the company's foundation, Club for the Future, which aims to inspire future generations to pursue careers in STEM.\n\nBlue Origin has not yet published its prices but its clientele is expected to mainly be wealthy individuals.\n\nVirgin Galactic, the company founded by British billionaire Richard Branson, is also developing a spacecraft capable of sending clients on suborbital flights. Some 600 people have booked flights, costing $200,000 to $250,000.\n\nElon Musk's SpaceX is planning orbital flights that would cost millions of dollars and send people much further into space.\n\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
    "Title": "Jeff Bezos' Space Venture Blue Origin To Fly First Crew To Space In July"
  },
  {
    "Date": "Thu, 06 May 2021 05:29:46 +0530",
    "Description": "Kidnappers have released the remaining 29 students they were holding captive on Wednesday, nearly two months after abducting them from a forestry college in Nigeria's Kaduna state.",
    "Image": "https://i.ndtvimg.com/i/2016-01/nigerian-military_650x400_41452860224.jpg",
    "Link": "https://www.ndtv.com/world-news/weak-and-tattered-29-students-freed-by-kidnappers-in-nigerias-kaduna-2431395",
    "Text": "The police did not allow journalists to speak to the students (Representational)\n\nKidnappers have released the remaining 29 students they were holding captive on Wednesday, nearly two months after abducting them from a forestry college in Nigeria's Kaduna state.\n\nGunmen took 39 students from the Federal College of Forestry Mechanization in northwest Nigeria on March 11 and previously released 10 of them. The newly released students arrived at police headquarters in Kaduna city on Wednesday night looking weak, forlorn and wearing dirty, torn clothing.\n\nOne female student could not walk alone and was carried into the building, while another was rushed to the hospital.\n\nPolice did not allow journalists to speak to the students.\n\nMore than 700 people have been abducted from schools in northwest Nigeria since December in a rash of kidnappings for ransom in the volatile region.\n\nKaduna Governor Nasir El-Rufai has repeatedly said his state government will not negotiate with \"bandits\", as the criminal gangs are known, or pay ransoms.\n\nAbdullahi Usman, chairman of the parents' association, said a ransom was paid for the students' release, but refused to say who had paid or how much.\n\nFriday Sanni, father of two abducted girls, said police had not yet allowed parents to see them. As he waited, he fretted over the fate of his daughters Rejoice, 17, and Victory, 19.\n\n\"We pray it is all of them,\" he said.\n\nPresident Muhammadu Buhari released a statement that welcomed the release of 27 students. His office did not respond to questions regarding the discrepancy in the number.\n\nKaduna police spokesman Mohammed Jalige said all remaining students had been released and would undergo medical examination before their release on Thursday.\n\nSamuel Aruwan, the Kaduna state commissioner for internal security, said in a statement that the government rejoiced with the freed students, and called on them to \"put the past behind and work hard towards a happier and successful future ahead.\"\n\nHe did not comment on whether a ransom was paid.\n\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
    "Title": "Weak And Tattered, 29 Students Freed By Kidnappers In Nigeria's Kaduna"
  },
  {
    "Date": "Thu, 06 May 2021 08:32:16 +0530",
    "Description": "Three top US senators have urged the Biden administration to ramp up its COVID-19 assistance to India, saying the country is currently registering over 3,00,000 new cases every day and its health care...",
    "Image": "https://c.ndtvimg.com/2021-04/7hh5irlg_joe-biden-afp_625x300_07_April_21.jpg",
    "Link": "https://www.ndtv.com/india-news/3-us-senators-urge-joe-biden-administration-to-accelerate-covid-19-assistance-to-india-2432948",
    "Text": "Last week, John Cornyn and Mark Warner had written to President Joe Biden on sending aid to India.\n\nThree top US senators have urged the Biden administration to ramp up its COVID-19 assistance to India, saying the country is currently registering over 3,00,000 new cases every day and its health care system is struggling to keep up with the surge.\n\nCommending for recent actions to help India address the crisis, the three senators in a letter to Secretary of State Tony Blinken also urged the administration to continue its robust contribution to the WHO's COVAX plan and prepare a detailed strategy on how the US can distribute its surplus of vaccines.\n\nSenators Mark Warner, John Cornyn, and Ron Portman warned of \"disinformation campaigns surrounding the vaccines by countries such as China and Russia\", and urged the administration to do everything it can to combat these campaigns.\n\nMark Warner and John Cornyn are Co-Chairs of the Senate India Caucus. Mark Warner is from the Democratic Party, while John Cornyn and Portman are from the opposition Republican Party.\n\n\"As you know, India''s healthcare system and infrastructure are struggling to meet the challenges posed by the current and largely unchecked surge, with the country averaging more than 300,000 new infections every day,\" the letter said.\n\n\"We urge you to work with the Department of Defense and other US government agencies, as well as with our international partners and private sector partners to transfer more life-saving equipment, vaccines, and other support to India as quickly as possible,\" the three senators wrote.\n\nThe US must work with the Indian government on their response, as well as continue to lead the international efforts to stop the spread of variants and to deliver the assistance needed to the Indian people, they said.\n\nMark Warner, John Cornyn, and Portman said the US should also continue its robust contribution to COVAX's plan for the global acquisition and distribution of vaccines to low and medium-income countries.\n\nIn the coming months, the US will have a surplus of vaccines that can be made available for distribution around the world. A detailed public strategy on how the Department of State plans to distribute these excess vaccines would clarify the ambiguity surrounding future US policy and provide needed certainty to India, they said.\n\n\"Lastly, we urge the Global Engagement Center to combat the numerous disinformation messages from Russia, China, and others regarding the coronavirus pandemic, including the US global health response.\n\nSpecifically in India, disinformation has undermined the public health response, heightened already-tense religious tensions, and muddied the waters surrounding our support as they face an unprecedented surge in coronavirus infections,\" the senators wrote.\n\n\"As entities continue to manipulate narratives at the expense of US national security, regional security, and global health security, we urge you to place a greater emphasis on combating these disinformation and misinformation campaigns integrating that effort into America's global health response to this pandemic,\" they said.\n\nLast week, John Cornyn and Mark Warner had written to President Joe Biden on sending aid to India. They also had a conference call with officials from the White House.",
    "Title": "3 US Senators Urge Biden To Accelerate COVID-19 Assistance To India"
  },
  {
    "Date": "Thu, 06 May 2021 03:31:41 +0530",
    "Description": "An Italian court convicted two young Americans Wednesday for the murder of a police officer while they were on a summer holiday in Rome, with both handed life sentences.",
    "Image": "https://c.ndtvimg.com/court-generic_625x300_1527245477936.jpg",
    "Link": "https://www.ndtv.com/world-news/two-american-tourists-given-life-sentences-for-italy-cops-murder-2430756",
    "Text": "The Americans had claimed self-defence in court (Representational)\n\nAn Italian court convicted two young Americans Wednesday for the murder of a police officer while they were on a summer holiday in Rome, with both handed life sentences.\n\nFinnegan Lee Elder, 21, had admitted stabbing Mario Cerciello Rega during a late-night encounter in July 2019, while out with his friend Gabriel Natale-Hjorth, 20.\n\nProsecutors claimed it was a brutal, unprovoked attack in which Elder, then 19, stabbed Cerciello 11 times with a seven-inch camping knife.\n\nThe Americans had claimed self-defence, saying they were jumped from behind by men they thought were thugs following an earlier drug deal gone wrong.\n\nReading out the verdict, Judge Marina Finiti declared the Americans \"guilty of the offences ascribed to them jointly\" and sentenced them both to \"life imprisonment with solitary confinement for a period of two months, in addition to payment of the costs of the trial\".\n\nBoth were remanded in custody.\n\nThe policeman's widow, Rosa Maria Esilo, sobbed audibly and hugged his brother, an AFP reporter in court said.\n\nAs his lawyer whispered to him with his hand on his shoulder, Elder appeared close to fainting and was rushed out of the courtroom by police.\n\nNatale-Hjorth did not handle the murder weapon but helped to hide it and under Italian law faced the same homicide charge.\n\nThe case, which scandalised Italy while also raising doubts about police conduct, hinged on whether the men from California -- who have been in jail since their arrest almost two years ago -- knew the officers were police.\n\nThey said neither officer showed their badges nor identified themselves as police before the 32-second attack, an account refuted by the state's principal witness, Cerciello's partner Andrea Varriale, 27.\n\n\"We approached them from the front... we presented ourselves as belonging to the carabinieri (police),\" Varriale told the jury during his testimony last year.\n\n\"We approached and unfortunately they immediately assaulted us.\"\n\nPolice inconsistencies\n\nThe death of Cerciello, who had just returned from his honeymoon when he was killed, aroused an outpouring of public sympathy in Italy, and his funeral was broadcast live on television where he was hailed as a hero.\n\nBut the case similarly highlighted a series of inconsistent statements and blunders made by police, including Natale-Hjorth's blindfolding during his police interrogation, a falsified police report and Varriale's lie that he was armed at the time of the attack.\n\nDuring closing arguments, defence lawyers sought to show that the failure of police to follow protocol the night of the attack suggested that Varriale was an unreliable witness and was covering up how the attack unfolded.\n\nThe jury, said Elder attorney Roberto Capra, should consider \"if the system is ready to reject the authoritarian idea that law enforcement can be believed at any cost, that they can say whatsoever and be believed because they belong to the police\".\n\nThe case has sparked comparisons with the high-profile trial of Amanda Knox, a US student convicted and later acquitted of a 2007 murder in Italy.\n\n\"Shock and terror\"\n\nA confusing web of events led to the altercation in the early hours of the morning in a genteel neighbourhood near the Americans' four-star hotel, beginning with their search for cocaine.\n\nAfter an intermediary introduced them to a drug dealer who sold them aspirin instead, the teens stole the bag of the go-between in retaliation, later demanding money and drugs to return it.\n\nThe dealer was actually an informant, and after the bag's theft was reported to police, Cerciello and Varriale showed up at the designated exchange point -- where the attack happened.\n\nNatale-Hjorth, who scuffled with Varriale during the encounter, said he did not know his friend was carrying a knife before the attack, yet helped him hide it afterwards in their hotel room's ceiling panel.\n\nElder did not testify during the trial, but in statements made to the court, he apologised for taking Cerciello's life and said he would never forgive himself. Yet he reiterated his account of the events, describing \"shock and terror\" at being set upon by a stranger.\n\n\"I've realised it's difficult to believe a person in my position. But what I'm telling you today is the truth, just as I spoke the truth at the time,\" he said.\n\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
    "Title": "Two American Tourists Given Life Sentences For Italy Cop's Murder"
  },
  {
    "Date": "Thu, 06 May 2021 03:45:41 +0530",
    "Description": "World Health Organization (WHO) chief Tedros Adhanom Ghebreyesus on Wednesday hailed the United States' support for a global waiver on patent protections for Covid-19 vaccines, describing it as a...",
    "Image": "https://c.ndtvimg.com/2021-02/6cefo5tg_tedros-adhanom-ghebreyesus_625x300_06_February_21.jpg",
    "Link": "https://www.ndtv.com/world-news/monumental-moment-who-chief-tedros-adhanom-ghebreyesus-hails-us-support-for-vaccine-patent-waiver-2430822",
    "Text": "Tedros Adhanom Ghebreyesus has for months pleaded for such a patent waiver (File)\n\nWorld Health Organization (WHO) chief Tedros Adhanom Ghebreyesus on Wednesday hailed the United States' support for a global waiver on patent protections for Covid-19 vaccines, describing it as a \"historic decision\".\n\nThe WHO chief wrote on Twitter that the move was a step towards vaccine equity, \"prioritizing the well-being of all people everywhere at a critical time\".\n\n\"Now let's all move together swiftly, in solidarity, building on the ingenuity and commitment of scientists who produced life-saving Covid-19 vaccines,\" he added.\n\nTedros has for months pleaded for such a patent waiver -- an idea backed by India and South Africa -- arguing this would help to ramp up production and make Covid-19 vaccines much more accessible for poorer nations.\n\n\"If not now, when?\" has become a frequent refrain from the WHO chief, who has lashed out repeatedly against perceived vaccine-hoarding by richer nations.\n\nTedros clashed repeatedly with former US president Donald Trump, who began withdrawing his country from the WHO before President Joe Biden immediately rescinded the move upon taking office in January.\n\nA later tweet from the WHO chief on Tuesday appeared to confirm that things had got off to a better start with Biden.\n\n\"This is a monumental moment in the fight against #COVID19,\" he said of US support for the patent waiver, describing Biden's commitment as \"a powerful example of leadership to address global health challenges\".\n\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
    "Title": "\"Monumental Moment\": WHO Chief Hails US Support For Vaccine Patent Waiver"
  },
  {
    "Date": "Thu, 06 May 2021 09:59:39 +0530",
    "Description": "Australian officials reinstated social distancing measures across greater Sydney on Thursday, as they scrambled to find missing tranmission links in a COVID-19 case connected to an Indian variant of...",
    "Image": "https://c.ndtvimg.com/2021-05/u3ikkkj8_australia-covid_625x300_06_May_21.jpg",
    "Link": "https://www.ndtv.com/world-news/australia-curbs-in-sydney-as-officials-trace-mystery-case-of-indian-covid-variant-2434080",
    "Text": "Speedy tracing systems, movement curbs have largely reined in the spread of COVID-19 in Australia.\n\nAustralian officials reinstated social distancing measures across greater Sydney on Thursday, as they scrambled to find missing tranmission links in a COVID-19 case connected to an Indian variant of the virus.\n\nWith many people expected to gather over the weekend for annual Mother's Day celebrations, the New South Wales state government restricted household gatherings to 20 guests and limited aged care facility visitors to two people per resident.\n\nMasks will be mandatory on public transport and at indoor venues. All the restrictions, which cover around 5.3 million people in the country's biggest metropolitan area, take effect at 5 p.m. local time and are scheduled to last until Monday morning.\n\n\"We believe this is a proportionate response to the risk we have ahead of us,\" NSW Premier Gladys Berejiklian told reporters.\n\nThe measures, which also cover Sydney's neighbouring regions of Wollongong, the Central Coast and Blue Mountains, were spurred by the detection of COVID-19 in a 50-year-old man, who passed the infection to his wife.\n\nThe case, the first local transmission in NSW in more than a month, baffled health officials given the man had no known links to high-risk jobs or people.\n\nTesting has determined the man was infected with a variant first detected in India and genomic sequencing had linked the case to a returned traveller from the United States, NSW Chief Health Officer Kerry Chant said on Thursday, but there was no clear transmission path between the two people.\n\n\"We can't find any direct link between our case, so what we're concerned about is there is another person that is as yet unidentified that infected our case,\" Mr Chant said.\n\nIt appeared to be the first time officials had reported the local transmission of an India virus variant in Australia.\n\nTests on the infected man had showed a higher viral load than typically seen in infected people, potentially increasing the chance that the man has spread the disease, officials said.\n\nNSW Treasurer Dominic Perrottet entered self-isolation on Thursday after he visited a restaurant at the same time as the infected person, classifying him as a close contact, his office said. Perrottet, who attended a sitting of state parliament on Wednesday, has tested negative.\n\nAuthorities also asked thousands of residents in the city's inner west to seek testing for any mild flu symptoms after fragments of the coronavirus that causes COVID-19 were detected in the sewerage network used by several suburbs.\n\nSpeedy tracing systems, movement curbs and border restrictions have largely reined in the spread of COVID-19 in Australia, which has recorded 29,865 cases and 910 deaths since the pandemic began.\n\nINDIA BAN\n\nThe federal government is currently under pressure to overturn a temporary travel ban on travellers, including its own citizens, from COVID-ravaged India. Australia has blocked all direct flights from the country until May 15.\n\nA report in the Sydney Morning Herald newspaper on Thursday, citing unidentified sources, said at least two repatriation flights will be dispatched to India every week from the middle of this month to bring home around 9,000 Australians.\n\nPrime Minister Scott Morrison, however, said the situation would be constantly reviewed.\n\n\"We are not going to commit to that at this point,\" Mr Morrison told radio station 3AW on Thursday.\n\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
    "Title": "'Mystery Case' Of Indian Covid Variant Leads To Curbs In Sydney"
  },
  {
    "Date": "Thu, 06 May 2021 01:33:56 +0530",
    "Description": "The Group of Seven meeting in London was hit by a COVID-19 scare on Wednesday when India's foreign minister and his entire team said they were self-isolating after two delegation members tested...",
    "Image": "https://c.ndtvimg.com/2021-05/qb30p05o_g7-summit-2021-reuters_625x300_06_May_21.jpeg",
    "Link": "https://www.ndtv.com/world-news/covid-scare-at-g7-meeting-after-indian-delegates-test-positive-2430315",
    "Text": "India is not a G7 member but was invited by Britain to this week's meeting\n\nThe Group of Seven meeting in London was hit by a COVID-19 scare on Wednesday when India's foreign minister and his entire team said they were self-isolating after two delegation members tested positive.\n\nBritain is hosting the three-day foreign ministers' meeting - the first such G7 event in two years - which has been billed as a chance to restart face-to-face diplomacy and a opportunity for the West to show a united front against threats from China and Russia.\n\nIndia, currently undergoing the world's worst surge in COVID-19 cases, is attending the G7 as a guest and had been due to take part in meetings on Tuesday evening and throughout Wednesday.\n\n\"Was made aware yesterday evening of exposure to possible Covid positive cases,\" Indian Foreign Minister Subrahmanyam Jaishankar said on Twitter.\n\n\"As a measure of abundant caution and also out of consideration for others, I decided to conduct my engagements in the virtual mode. That will be the case with the G7 Meeting today as well.\"\n\nThe meeting is a precursor to a G7 summit due to take place at a rural English resort in June, with U.S. President Joe Biden and other world leaders set to attend.\n\nA British official confirmed the two positive tests and said the entire Indian delegation was self-isolating. British rules require a 10-day self-isolation period.\n\nThe Indian delegation had not yet attended the main summit venue at Lancaster House, and so meetings scheduled for Wednesday went ahead as planned.\n\nAsked if, in light of the positive tests, it had been a mistake to hold the summit in person, Prime Minister Boris Johnson said: \"I think it's very important to try to continue as much business as you can as a government.\"\n\nJohnson said he would speak with S Jaishankar later on Wednesday by Zoom.\n\nBritish foreign minister Dominic Raab said rules had been meticulously applied and had worked effectively and it remained important for the summit in June to go ahead.\n\n\"We know these systems work, we will be able to plan even more, and even more carefully,\" he told reporters.\n\nA final communique from the meeting scolded China and Russia, but provided few concrete measures.\n\nFIST BUMPING\n\nEarlier, Raab was seen greeting and fist-bumping other G7 members as they arrived at the venue.\n\n\"We deeply regret that S Jaishankar will be unable to attend the meeting today in person,\" a senior UK diplomat said. \"This is exactly why we have put in place strict COVID protocols and daily testing.\"\n\nOn Tuesday, pictures from inside the grand Lancaster House conference venue showed the reality of diplomacy in the coronavirus age - delegates separated by plastic screens, and a \"family photo\" of ministers carefully spaced two metres apart.\n\nS Jaishankar was pictured meeting British interior minister Priti Patel on Tuesday, although Patel did not have to self-isolate because the meeting had been held in line with existing rules. Both were wearing masks in the photograph.\n\nIndia is not a G7 member but was invited by Britain to this week's meeting, along with Australia, South Africa and South Korea.\n\nThe Indian High Commission in London did not respond to requests for comment.\n\n(This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)",
    "Title": "Covid Scare At G7 Meeting After Indian Delegates Test Positive"
  },
  {
    "Date": "Thu, 06 May 2021 01:43:20 +0530",
    "Description": "Facebook oversight board on Wednesday upheld the company's suspension of former US President Donald Trump but said the company was wrong to make the suspension indefinite and gave it six months to...",
    "Image": "https://c.ndtvimg.com/2020-10/j0bhfdbg_donald-trump-afp_625x300_13_October_20.jpg",
    "Link": "https://www.ndtv.com/world-news/facebook-has-six-months-to-determine-if-donald-trump-returns-2430341",
    "Text": "Facebook oversight board said company was right to ban Trump after the Jan 6 storming of the US Capitol\n\nFacebook oversight board on Wednesday upheld the company's suspension of former US President Donald Trump but said the company was wrong to make the suspension indefinite and gave it six months to determine a \"proportionate response.\"\n\nTrump called the decision and his banning across tech platforms \"a total disgrace\" and said the companies would \"pay a political price.\"\n\nThe much-awaited board verdict has been watched for signals on how the world's largest social media company will treat rule-breaking political leaders in the future, a key area of controversy for online platforms.\n\nThe board, created by Facebook to rule on a small slice of its content decisions, said the company was right to ban Trump following the Jan. 6 storming of the U.S. Capitol by pro-Trump supporters.\n\nFacebook indefinitely blocked Trump's access to his Facebook and Instagram accounts over concerns of further violent unrest following the Jan. 6 riot. It enacted the suspension after removing two of Trump's posts during the Capitol riot, including a video in which he said supporters should go home but reiterated his false claim of widespread voter fraud, saying \"I know your pain. I know you're hurt. We had an election that was stolen from us.\"\n\nBut the board said Facebook inappropriately imposed a suspension without clear standards and that the company should determine a response consistent with rules applied to other users. It said the company could determine that Trump's account could be restored, suspended temporarily or permanently banned.\n\n\"Indefinite penalties of this sort do not pass the international or American smell test for clarity, consistency, and transparency,\" said former federal judge Michael McConnell, co-chair of the Oversight Board, during a press conference after publishing its decision on Wednesday.\n\nIn an interview with Reuters, board co-chair and former Danish Prime Minister Helle Thorning-Schmidt said public figures should not be allowed to incite violence or create harm though their posts, but that Facebook \"can't just invent new sanctions as they go along.\"\n\nIn its decision, the board said Facebook refused to answer some of the 46 questions it posed, including those on how its news feed affected the visibility of Trump's posts, and whether the company planned to look into how its technology amplified content as it had done in the events leading to the Capitol siege.\n\nThe board said Facebook's existing policies, such as deciding when material is too newsworthy to remove, need to be more clearly communicated to users. It also called on Facebook to develop a policy that governs how it handles novel situations where its existing rules would be insufficient to prevent imminent harm.\n\nFacebook's business has thrived during the controversy and its main source of revenue, advertising, has boomed as COVID-19 pandemic restrictions begin to ease in the United States, but lawmakers across the political spectrum have raised concerns about the power of Facebook and other social media, many calling for new regulations and some calling for breakups of big tech.\n\nTrump called the move \"an embarrassment to our Country,\" and added that \"Free Speech has been taken away from the President of the United States because the Radical Left Lunatics are afraid of the truth, but the truth will come out anyway, bigger and stronger than ever before.\"\n\nAt a Financial Times conference after the verdict, Nick Clegg, Facebook's vice president of global affairs and communication, said the company would hope to resolve the matter \"considerably faster\" than six months.\n\nTech platforms have grappled in recent years with how to police world leaders and politicians that violate their guidelines. Facebook has come under fire both from those who think it should abandon its hands-off approach to political speech and those, including Republican lawmakers and some free-expression advocates who saw the Trump ban as a disturbing act of censorship.\n\nFacebook was one of a slew of social media sites that barred the former president, including Twitter Inc, which banned him permanently. Political leaders from German Chancellor Angela Merkel to U.S. Senator Bernie Sanders expressed concern that private companies could silence elected officials on their sites.\n\nAt the time of the suspension, Facebook Chief Executive Mark Zuckerberg said \"the risks of allowing the President to continue to use our service during this period are simply too great.\" The company later referred the case to its recently-established board, which includes academics, lawyers and rights activists.\n\nThe binding verdict means Trump will not for now be able to return to Facebook's platforms, where he had a combined 59 million followers across Facebook and Instagram, His campaign spent about $160 million on Facebook ads in 2020, according to Democratic digital firm Bully Pulpit Interactive's campaign tracker.\n\nOn Tuesday, Trump launched a new web page to share messages that readers can then re-post to their Facebook or Twitter accounts. A senior adviser has said Trump also plans to launch his own social media platform.\n\nWednesday's decision marks a milestone for the oversight board, which Facebook financed with $130 million. The body has been hailed as a novel experiment by some researchers but criticized by those who have been skeptical about its independence or view it as a PR stunt to deflect attention from the company's more systemic problems.\n\n\"This verdict is a desperate attempt to have it both ways, upholding the 'ban' of Donald Trump without actually banning him, while punting any real decisions back to Facebook,\" said a group of academics, experts and Facebook critics known as the \"Real Facebook Oversight Board.\"\n\n(This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)",
    "Title": "Facebook Has Six Months To Determine If Trump Returns"
  },
  {
    "Date": "Thu, 06 May 2021 00:11:17 +0530",
    "Description": "Free beer, free doughnuts, savings bonds -- government officials and businesses are teaming up to encourage Americans to get vaccinated against Covid-19.",
    "Image": "https://c.ndtvimg.com/2021-03/edbmiktg_us-covid-vaccination-generic-afp-650_625x300_12_March_21.jpg",
    "Link": "https://www.ndtv.com/world-news/free-beer-and-doughnuts-to-promote-vaccines-in-us-2430186",
    "Text": "Some 56% of American adults have received at least one dose of a Covid-19 vaccine.\n\nFree beer, free doughnuts, savings bonds -- government officials and businesses are teaming up to encourage Americans to get vaccinated against Covid-19.\n\nPresident Joe Biden wants 70 percent of adults to have received at least one shot by Independence Day on July 4 and overcoming vaccine hesitancy is key to reaching the goal.\n\n\"We know there are millions of Americans who need a little bit of encouragement to get the shot,\" Biden told reporters at the White House on Tuesday.\n\nSome 56 percent of American adults -- more than 145 million people -- have received at least one dose of a Covid-19 vaccine but the pace of vaccination has been declining lately.\n\nFederal, state and local officials are partnering with pharmacies, restaurants, breweries, supermarkets and sports teams to come up with incentives to get people to get their shots.\n\nIn New Jersey, Governor Phil Murphy launched a \"Shot and a Beer\" program to encourage vaccination.\n\n\"Any New Jerseyan who gets their first vaccine dose in the month of May and takes their vaccination card to a participating brewery will receive a free beer,\" Murphy tweeted.\n\nThe offer is only open, of course, to residents of the \"Garden State\" who are over the age of 21, the legal drinking age in the United States.\n\nGovernor Ned Lamont of the state of Connecticut unveiled a similar \"Free Drink\" promotion with participating restaurants last month.\n\nIn Washington, Mayor Muriel Bowser urged residents of the nation's capital to \"come get vaccinated and grab a beer, on us\" at the John F. Kennedy Center for the Performing Arts.\n\n\"Motivate them\"\n\nIn West Virginia, Governor Jim Justice announced that the state will offer $100 savings bonds to residents aged 16 to 35 who get vaccinated.\n\n\"Our kids today probably don't really realize just how important they are in shutting this thing down,\" Justice said. \"I'm trying to come up with a way that's truly going to motivate them -- and us -- to get over the hump.\"\n\n\"They're not taking vaccines as fast as we'd like them to take them,\" Justice said. \"If we really want to move the needle, we've got to get our younger people vaccinated.\"\n\nIn Maryland, Governor Larry Hogan said state employees who get vaccinated will receive $100.\n\nThey also must agree to receive any booster shots recommended by the US Centers for Disease Control and Prevention or they will have to reimburse the $100.\n\n\"Incentives like this are another way to reinforce the importance of getting vaccinated, and we strongly encourage businesses across the state to consider offering incentives to their workers as well,\" Hogan said.\n\nKrispy Kreme is offering a free glazed doughnut to anyone who presents their Covid-19 vaccination card at one of its stores.\n\nAccording to a survey conducted in March by the Kaiser Family Foundation, 25 percent of Americans aged 18 to 29 are adopting a \"wait and see\" attitude towards being vaccinated.\n\nAmong US adults, 61 percent said they had been vaccinated or intended to do so as soon as possible while 17 percent said they were adopting a \"wait and see\" approach and 13 percent said they will \"definitely not\" get vaccinated.\n\n(This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)",
    "Title": "Free Beer And Doughnuts To Promote Vaccines In US"
  }
]