[
  {
    "Date": "Mon, 10 May 2021 10:12:12 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/world/south-asia/at-least-11-killed-as-roadside-bomb-hits-bus-in-afghanistan/articleshow/82514762.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82514762.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>",
    "Image": "https://static.toiimg.com/thumb/msid-82514764,width-1070,height-580,imgsize-22374,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/world/south-asia/at-least-11-killed-as-roadside-bomb-hits-bus-in-afghanistan/articleshow/82514762.cms",
    "Text": "Mohammad Naeem, spokesman for the Taliban's political office, speaks during a joint news conference in Moscow, Russia (File photo)\n\nKABUL: A roadside bomb struck a bus in Afghanistan overnight killing at least 11 people just hours before the Taliban announced a three-day ceasefire to mark this week's Eid al-Fitr holiday, the interior ministry said Monday.\n\nThe attack in restive Zabul province left another 28 people wounded, interior ministry spokesman Tareq Arian told reporters.\n\n",
    "Title": "At least 11 killed as roadside bomb hits bus in Afghanistan"
  },
  {
    "Date": "Mon, 10 May 2021 08:36:40 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/world/rest-of-world/south-koreas-moon-says-looking-for-north-korea-response-for-peace-talks/articleshow/82513594.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82513594.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>Moon's comments, in a speech marking the fourth year of his presidency, come ahead of his first summit with U.S. President Joe Biden in Washington on May 21.",
    "Image": "https://static.toiimg.com/thumb/msid-82513585,width-1070,height-580,imgsize-52300,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/world/rest-of-world/south-koreas-moon-says-looking-for-north-korea-response-for-peace-talks/articleshow/82513594.cms",
    "Text": "Seoul:South Korean President Moon Jae-in\n\nSEOUL: South Korean President Moon Jae-in on Monday he was looking forward to North Korea's response to engagement efforts as he seeks to restore peace-building amid stalled talks over Pyongyang 's nuclear and missile programmes.\n\nMoon's comments, in a speech marking the fourth year of his presidency, come ahead of his first summit with U.S. President Joe Biden in Washington on May 21.\n\nThe South Korean president is expected to push the United States to seek engagement with North Korea, though Biden has shown little interest in making North Korea a top priority.\n\nBiden's administration says its overtures to Pyongyang have not been answered, and it recently completed a policy review that called for a \"practical\" approach of using diplomacy to find achievable goals toward eventually persuading North Korea to surrender its nuclear weapons.\n\nBut Biden has shown no sign of loosing sanctions, which have hampered Moon's efforts to launch economic and tourism projects with the North, and the White House has not appointed a special envoy to handle the issue.\n\nMoon has made engaging with North Korea a signature project and appeared to make progress in 2018 amid summits with leader Kim Jong Un , but as Moon enters his final year in office, Pyongyang shows few signs of interest in talking.\n\nIn his speech, Moon said that he wouldn't be impatient during his final year, but that he would do everything he could to return to the days of engagement.\n\n\"If there is an opportunity to turn back the clock of peace again and advance the peace process on the Korean peninsula, I will make all efforts,\" he said. \"We look forward to North Korea's response.\"\n\n",
    "Title": "Looking for NKorea response for peace talks: Moon"
  },
  {
    "Date": "Mon, 10 May 2021 09:20:23 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/world/rest-of-world/myanmar-coup-100-days-of-turmoil/articleshow/82514140.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82514140.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>The 100 days that have followed have seen mass street protests, bloody crackdowns by the junta, economic turmoil and growing international concern.",
    "Image": "https://static.toiimg.com/thumb/msid-82514134,width-1070,height-580,imgsize-68482,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/world/rest-of-world/myanmar-coup-100-days-of-turmoil/articleshow/82514140.cms",
    "Text": "YANGON: Myanmar's military seized power on February 1, ousting the civilian government and arresting its leader, Aung San Suu Kyi .\n\nThe 100 days that have followed have seen mass street protests, bloody crackdowns by the junta, economic turmoil and growing international concern.\n\nA recap of events:\n\nThe generals stage a coup on February 1, detaining Nobel peace laureate Suu Kyi and her top allies in pre-dawn raids.\n\nIt ends Myanmar's decade-long experiment with democracy after close to half a century of military rule.\n\nThe generals claim fraud in November's elections, which Suu Kyi's National League for Democracy (NLD) party won by a landslide.\n\nThe putsch draws global condemnation, from Pope Francis to US President Joe Biden .\n\nTwo days later 75-year-old Suu Kyi is charged with an obscure offence over unregistered walkie-talkies at her home.\n\nResistance to the coup begins with people banging pots and pans -- a practice traditionally associated with driving out evil spirits.\n\nThe junta tries to block social media platforms including Facebook, which is hugely popular in Myanmar. Nightly internet blackouts are later imposed.\n\nPopular dissent surges over the weekend of February 6 and 7, with tens of thousands of people gathering on the streets calling for the release of Suu Kyi.\n\nWorkers begin a nationwide strike on February 8.\n\nA young woman, Mya Thwate Thwate Khaing, is shot in the head and another person is wounded after police fire on crowds in Naypyidaw on February 9.\n\nThe next day Washington announces sanctions against several military officials, including Senior General Min Aung Hlaing, the army chief now in charge.\n\nMore rounds of sanctions follow in the subsequent weeks from the United States, Britain and the European Union .\n\nOn February 16 Suu Kyi's lawyer says she has been hit with a second charge, this time under the natural disaster management law.\n\nMya Thwate Thwate Khaing, the woman shot 10 days earlier, dies on February 19, becoming a symbol of opposition to the junta.\n\nSuu Kyi is hit with two new criminal charges on March 1. Her lawyer says she is now accused of inciting unrest and breaking telecommunications laws.\n\nTen days later the military accuses her of accepting illegal payments of cash and gold.\n\nOn March 11 rights group Amnesty International says it has documented atrocities by the junta including the use of battlefield weapons on unarmed protesters.\n\nA day later a UN rights expert on Myanmar accuses the military of crimes against humanity.\n\nThe junta defends seizing power on March 25 and says it will not tolerate \"anarchy\" wrought by protesters.\n\nArmed Forces Day on March 27, the military's annual show of strength, turns into a bloodbath with more than 100 civilians killed in protest crackdowns -- the deadliest single day since the coup.\n\nViolence escalates in border areas between the military and Myanmar's numerous ethnic rebel armies -- several of which have declared their support for the protest movement.\n\nOn March 31 a UN envoy calls for Security Council action to stop the country spiralling into civil war.\n\nOn April 2, Suu Kyi's lawyer announces the most serious charge laid against her -- of breaching the official secrets act.\n\nOusted civilian lawmakers, forced into hiding, announce the formation of a shadow \"National Unity Government\".\n\nLeaders from regional bloc ASEAN hold a summit on the Myanmar crisis in Jakarta, and invite junta leader Min Aung Hlaing.\n\nThey agree a five-point statement calling for dialogue, an end to violence and the appointment of an envoy.\n\nBut state media report days later the bloc's \"suggestions\" will only be considered \"when the situation returns to stability\" in Myanmar.\n\n\n\nFacebook Twitter Linkedin EMail",
    "Title": "Myanmar coup: 100 days of turmoil"
  },
  {
    "Date": "Mon, 10 May 2021 08:58:56 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/world/us/cyberattack-on-us-pipeline-is-linked-to-criminal-gang/articleshow/82513744.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82513744.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>",
    "Image": "https://static.toiimg.com/thumb/msid-82513744,width-1070,height-580,imgsize-384774,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/world/us/cyberattack-on-us-pipeline-is-linked-to-criminal-gang/articleshow/82513744.cms",
    "Text": "NEW YORK: The cyberextortion attempt that has forced the shutdown of a vital US pipeline was carried out by a criminal gang known as DarkSide that cultivates a Robin Hood image of stealing from corporations and giving a cut to charity, two people close to the investigation said Sunday.\n\nThe shutdown, meanwhile, stretched into its third day, with the Biden administration loosening regulations for the transport of petroleum products on highways as part of an ``all-hands-on-deck'' effort to avoid disruptions in the fuel supply.\n\nExperts said that gasoline prices are unlikely to be affected if the pipeline is back to normal in the next few days but that the incident - the worst cyberattack to date on critical U.S. infrastructure - should serve as a wake-up call to companies about the vulnerabilities they face.\n\nThe pipeline, operated by Georgia-based Colonial Pipeline, carries gasoline and other fuel from Texas to the Northeast. It delivers roughly 45% of fuel consumed on the East Coast, according to the company.\n\nIt was hit by what Colonial called a ransomware attack, in which hackers typically lock up computer systems by encrypting data, paralyzing networks, and then demand a large ransom to unscramble it.\n\nOn Sunday, Colonial Pipeline said it was actively in the process of restoring some of its IT systems. It says it remains in contact with law enforcement and other federal agencies, including the Department of Energy, which is leading the federal government response. The company has not said what was demanded or who made the demand.\n\nHowever, two people close to the investigation, speaking on condition of anonymity, identified the culprit as DarkSide. It is among ransomware gangs that have ``professionalized`` a criminal industry that has cost Western nations tens of billions of dollars in losses in the past three years.\n\nDarkSide claims that it does not attack hospitals and nursing homes, educational or government targets and that it donates a portion of its take to charity. It has been active since August and, typical of the most potent ransomware gangs, is known to avoid targeting organizations in former Soviet bloc nations.\n\nColonial did not say whether it has paid or was negotiating a ransom, and DarkSide neither announced the attack on its dark web site nor responded to an Associated Press reporter's queries. The lack of acknowledgment usually indicates a victim is either negotiating or has paid.\n\nOn Sunday, Colonial Pipeline said it is developing a \"system restart\" plan. It said its main pipeline remains offline but some smaller lines are now operational.\n\n``We are in the process of restoring service to other laterals and will bring our full system back online only when we believe it is safe to do so, and in full compliance with the approval of all federal regulations,\" the company said in a statement.\n\nCommerce Secretary Gina Raimondo said Sunday that ransomware attacks are ``what businesses now have to worry about,'' and that she will work ``very vigorously'' with the Department of Homeland Security to address the problem, calling it a top priority for the administration.\n\n``Unfortunately, these sorts of attacks are becoming more frequent,'' she said on CBS' \"Face the Nation.`` \"We have to work in partnership with business to secure networks to defend ourselves against these attacks.''\n\nShe said President Joe Biden was briefed on the attack.\n\n``It's an all-hands-on-deck effort right now,'' Raimondo said. ``And we are working closely with the company, state and local officials to make sure that they get back up to normal operations as quickly as possible and there aren't disruptions in supply.''\n\nThe Department of Transportation issued a regional emergency declaration Sunday, relaxing hours-of-service regulations for drivers carrying gasoline, diesel, jet fuel and other refined petroleum products in 17 states and the District of Columbia. It lets them work extra or more flexible hours to make up for any fuel shortage related to the pipeline outage.\n\nOne of the people close to the Colonial investigation said that the attackers also stole data from the company, presumably for extortion purposes. Sometimes stolen data is more valuable to ransomware criminals than the leverage they gain by crippling a network, because some victims are loath to see sensitive information of theirs dumped online.\n\nSecurity experts said the attack should be a warning for operators of critical infrastructure _ including electrical and water utilities and energy and transportation companies _ that not investing in updating their security puts them at risk of catastrophe.\n\nEd Amoroso, CEO of TAG Cyber, said Colonial was lucky its attacker was at least ostensibly motivated only by profit, not geopolitics. State-backed hackers bent on more serious destruction use the same intrusion methods as ransomware gangs.\n\n``For companies vulnerable to ransomware, it's a bad sign because they are probably more vulnerable to more serious attacks,'' he said. Russian cyberwarriors, for example, crippled the electrical grid in Ukraine during the winters of 2015 and 2016.\n\nCyberextortion attempts in the U.S. have become a death-by-a-thousand-cuts phenomenon in the past year, with attacks forcing delays in cancer treatment at hospitals, interrupting schooling and paralyzing police and city governments.\n\nTulsa, Oklahoma, this week became the 32nd state or local government in the U.S. to come under ransomware attack, said Brett Callow, a threat analyst with the cybersecurity firm Emsisoft.\n\nAverage ransoms paid in the US jumped nearly threefold to more than $310,000 last year. The average downtime for victims of ransomware attacks is 21 days, according to the firm Coveware, which helps victims respond.\n\nDavid Kennedy, founder and senior principal security consultant at TrustedSec, said that once a ransomware attack is discovered, companies have little recourse but to completely rebuild their infrastructure, or pay the ransom.\n\n``Ransomware is absolutely out of control and one of the biggest threats we face as a nation,'' Kennedy said. ``The problem we face is most companies are grossly underprepared to face these threats.''\n\nColonial transports gasoline, diesel, jet fuel and home heating oil from refineries on the Gulf Coast through pipelines running from Texas to New Jersey. Its pipeline system spans more than 5,500 miles (8,850 kilometers), transporting more than 100 million gallons (380 million liters) a day.\n\nDebnil Chowdhury at the research firm IHSMarkit said that if the outage stretches to one to three weeks, gas prices could begin to rise.\n\n``I wouldn't be surprised, if this ends up being an outage of that magnitude, if we see 15- to 20-cent rise in gas prices over next week or two,'' he said.\n\nThe Justice Department has a new task force dedicated to countering ransomware attacks.\n\nWhile the U.S. has not suffered any serious cyberattacks on its critical infrastructure, officials say Russian hackers in particular are known to have infiltrated some crucial sectors, positioning themselves to do damage if armed conflict were to break out. While there is no evidence the Kremlin benefits financially from ransomware, U.S. officials believe President Vladimir Putin savors the mayhem it wreaks in adversaries' economies.\n\nIranian hackers have also been aggressive in trying to gain access to utilities, factories and oil and gas facilities. In one case in 2013, they broke into the control system of a US dam.\n\n\n\nFacebook Twitter Linkedin EMail",
    "Title": "Cyberattack on US pipeline is linked to criminal gang"
  },
  {
    "Date": "Mon, 10 May 2021 08:25:33 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/world/us/gunman-kills-six-at-us-birthday-party-before-shooting-himself/articleshow/82513354.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82513354.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>A gunman opened fire at a birthday party in Colorado, killing six people in the early hours of Sunday before taking his own life, US police said. The suspect, a boyfriend of one of the female victims, drove to the venue and began shooting people at the party. \"We are still investigating to determine a motive,\" the Police said. None of the children were injured in the attack.",
    "Image": "https://static.toiimg.com/thumb/msid-82513354,width-1070,height-580,imgsize-117810,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/world/us/gunman-kills-six-at-us-birthday-party-before-shooting-himself/articleshow/82513354.cms",
    "Text": "A gunman opened fire at a birthday party in Colorado, killing six people in the early hours of Sunday before taking his own life, US police said. Preliminary investigations revealed that families had gathered for a birthday party inside one of the trailers when the shooting occurred.\n\nWASHINGTON: A gunman opened fire at a birthday party in Colorado, killing six people in the early hours of Sunday before taking his own life, US police said.\n\nColorado Springs police responded shortly after midnight to an emergency call at a mobile home park, where they found six adults shot dead and one adult male who was seriously injured.\n\nHe was transported to a local hospital, where he died from his injuries.\n\nPreliminary investigations revealed that families had gathered for a birthday party inside one of the trailers when the shooting occurred.\n\n\"The suspect, a boyfriend of one of the female victims, drove to the residence, walked inside and began shooting people at the party before taking his own life,\" the police said in a statement.\n\n\"We are still investigating to determine a motive.\"\n\nNone of the children at the party were injured in the attack, according to the police, and they were being cared for by family members. The victims have not been publicly identified.\n\n\"From the officers who responded to the shooting to the investigators still on scene, we are all left incredibly shaken,\" said Colorado Springs police chief Vince Niski. \"This is something you hope never happens in your own community.\"\n\nColorado Springs mayor John Suthers said the \"senseless act of violence\" had sent the community into mourning, and called for prayers for the victims, their families and the first responders.\n\nA woman who lived in the mobile home park told the Denver Post she was awakened by the sound of so many gunshots that she thought it was a thunderstorm.\n\nColorado Springs-based newspaper The Gazette reported that family and friends of the victims gathered Sunday afternoon outside the trailer to mourn the attack.\n\nIt was the third mass shooting in Colorado Springs since October 2015, including a random Halloween massacre and an attack on a Planned Parenthood clinic in November that same year, local media said.\n\nThe United States has suffered a spate of mass shootings in recent months, including at a FedEx facility in Indianapolis, an office building in California, a grocery store in Boulder, Colorado and at several spas in Atlanta.\n\nPresident Joe Biden last month branded US gun violence an \"epidemic\" and an \"international embarrassment.\"\n\nThere were more than 43,000 gun-related deaths in the United States last year, including suicides, according to the Gun Violence Archive.\n\n",
    "Title": "Gunman kills six at US birthday party before shooting self"
  },
  {
    "Date": "Mon, 10 May 2021 08:13:13 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/world/south-asia/taliban-declare-three-day-afghan-ceasefire-for-eid-holiday/articleshow/82513296.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82513296.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>The Taliban on Monday declared a three-day ceasefire across Afghanistan to mark this week's Eid al-Fitr holiday, just two days after being blamed for killing more than 50 people -- mostly young girls -- in a bomb attack outside a school in the capital.",
    "Image": "https://static.toiimg.com/thumb/msid-82513296,width-1070,height-580,imgsize-224252,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/world/south-asia/taliban-declare-three-day-afghan-ceasefire-for-eid-holiday/articleshow/82513296.cms",
    "Text": "The Taliban on Monday declared a three-day ceasefire across Afghanistan to mark this week's Eid al-Fitr holiday, just two days after being blamed for killing more than 50 people -- mostly young girls -- in a bomb attack outside a school in the capital.\n\nKABUL: The Taliban on Monday declared a three-day ceasefire across Afghanistan to mark this week's Eid al-Fitr holiday, just two days after being blamed for killing more than 50 people -- mostly young girls -- in a bomb attack outside a school in the capital.\n\nThe ceasefire offer comes as the United States continues to pull out its last 2,500 troops from the violence-wracked country despite faltering peace efforts between the Taliban and Afghan government to end a decades-long war.\n\n\"Mujahideen of the Islamic Emirate are instructed to halt all offensive operations against the enemy countrywide from the first till the third day of Eid,\" a statement released by the Taliban said.\n\n\"But if the enemy conducts any assault or attack against you during these days, stand ready to robustly protect and defend yourselves and your territory,\" it added.\n\nEid al-Fitr marks the end of the Muslim fasting month of Ramadan, and the holiday begins according to the sighting of the new moon. The Taliban declared similar ceasefires last year to mark Islamic holidays.\n\nThe government usually reciprocates with a truce. Fraidon Khawzon, spokesman for chief negotiator Abdullah Abdullah , said early Monday: \"We welcome the announcement....the Islamic republic is also ready and will announce soon.\"\n\nThe latest offer comes after the government blamed the Taliban for Saturday's attack outside a girls' school in Dasht-e-Barchi, a suburb of the capital largely populated by the Shiite Hazara community, which is often targeted by extremist Sunni Islamist militants.\n\nA series of blasts outside the school -- when residents were shopping ahead of the holiday -- killed more than 50 people and wounded over 100.\n\nIt was the deadliest attack in more than a year.\n\nThe Taliban, who denied responsibility, had earlier issued a statement saying the nation needed to \"safeguard and look after educational centres and institutions\".\n\nOn Sunday, relatives buried the dead at a hilltop site known as \"Martyrs Cemetery\", where victims of attacks against the Hazara community are laid to rest.\n\nHazaras are Shiite Muslims and considered heretics by extremist Sunnis. Sunni Muslims make up the majority of the Afghan population.\n\nBodies in wooden coffins were lowered into graves one by one by mourners still in a state of shock and fear, an AFP photographer said.\n\n\"I rushed to the scene (after the blasts) and found myself in the middle of bodies, their hands and heads cut off and bones smashed,\" said Mohammad Taqi, a resident of Dasht-e-Barchi, whose two daughters were students at the school but escaped the attack.\n\n\"All of them were girls. Their bodies piled on top of each other.\"\n\nBooks and school bags belonging to the victims still lay scattered at the site of the attack.\n\nThe Taliban insist they have not carried out attacks in Kabul since February last year, when they signed a deal with Washington that paved the way for peace talks and withdrawal of the remaining US troops.\n\nBut the group has clashed daily with Afghan forces in the rugged countryside even as the US military reduces its presence.\n\nThe United States was supposed to have pulled all forces out by May 1 as agreed with the Taliban last year, but Washington pushed back the date to September 11 -- a move that angered the insurgents.\n\nThe leader of the Taliban, Hibatullah Akhundzada , reiterated in a message released ahead of Eid that any delay in withdrawing the troops was a \"violation\" of that deal.\n\n\"If America again fails to live up to its commitments, then the world must bear witness and hold America accountable for all the consequences,\" Akhundzada warned in Sunday's message.\n\nAfghan President Ashraf Ghani has declared a day of national mourning for Tuesday.\n\n\"This savage group does not have the power to confront security forces on the battlefield, and instead targets with brutality and barbarism public facilities and the girls' school,\" he said in a statement.\n\nSaturday's blasts drew widespread global condemnation.\n\nPope Francis called it \"an inhumane action\", while Iran blamed the jihadist Islamic State.\n\nIndia, meanwhile, called for the dismantling of \"terrorist sanctuaries\" and a ceasefire to boost peace efforts.\n\n",
    "Title": "Taliban declare three-day Afghan ceasefire for Eid holiday"
  },
  {
    "Date": "Mon, 10 May 2021 04:43:48 +0000",
    "Description": "The son of Italy’s last king has tapped his teen granddaughter to eventually lead the House of Savoy, pretenders to Italy’s defunct throne. “Totally illegitimate,” says a rival clan.",
    "Image": "https://static01.nyt.com/images/2021/05/09/world/09italy-royals1/09italy-royals1-facebookJumbo.jpg",
    "Link": "https://www.nytimes.com/2021/05/09/world/europe/italy-house-of-savoy-royalty.html",
    "Text": "Like her great-grandfather’s great-grandfather, Vittorio Emanuele II, who united Italy, Vittoria is much more comfortable in French than Italian. When asked if she wanted to be Italy’s queen, she called the concept “abstract” and said she is just trying to figure out what she wants to do in life. She spends her days studying for finals, modeling midriff shirts on Instagram, dancing with friends and gossiping about Prince Harry and Meghan at school.\n\nBut mostly, she wants to design her own fashion brand.\n\n“I don’t want to seem different,” she said. “I’m Vittoria.”\n\nFor decades, the disgruntled branch of the family, called the Aosta, has argued that the Carignano Savoia are sullying the good family name. Some of them took issue with the marriage of Vittoria’s grandfather, the exiled son of the last king, to a former competitive water skier who wasn’t a noble.\n\nVittorio Emanuele IV, now 84, has a knack for insulting Italians. It didn’t help his reputation when he was accused of accidentally killing a German tourist with a rifle shot from his yacht off the coast of Corsica in 1978. A French court acquitted him of manslaughter.\n\nIn 2006, after Italy let him and his son, Vittoria’s father, back in the country, the patriarch served time in a Potenza jail on charges of involvement in illegal gambling and prostitution, and accepting envelopes full of cash, which he said was a contribution to a noble order. He was eventually acquitted.",
    "Title": "Paris Teenager’s New Gig: Would-Be Queen of Italy. A Nation Shrugs."
  },
  {
    "Date": "Mon, 10 May 2021 05:04:35 +0000",
    "Description": "The parched bottom of Sun Moon Lake, once a popular tourist spot, has become popular on Instagram as residents pray for rain.",
    "Image": "https://static01.nyt.com/images/2021/05/10/world/10taiwan-lake/10taiwan-lake-facebookJumbo.jpg",
    "Link": "https://www.nytimes.com/2021/05/10/world/asia/taiwan-sun-moon-lake-drought.html",
    "Text": "TAIPEI, Taiwan — Sun Moon Lake was once a popular tourist spot in Taiwan. But now the bottom of the lake is Instagram-famous for a grim reason: one of the worst droughts to hit the island in decades.\n\nThe parched lake bed — cracks snaking across the ground as far as the eye can see — has drawn the attention of influencers, who have trekked to the site to take visually arresting photos of the terrain and post them online.\n\nBut the situation is dire. Residents have prayed to the god Matsu for rain after a monthslong drought dried up the island’s reservoirs. Some parts of the lake have begun to grow grass, and jetties that normally float are sitting on dry mud. Tour boats sit idle.\n\n“Our business is 90 percent less than last year,” said Wang Ying-shen, chairman of a group for businesspeople who rent boats to visitors.",
    "Title": "Cracked Lake Bed Is a Stark Symbol of Taiwan’s Drought. Influencers Take Notice."
  },
  {
    "Date": "Mon, 10 May 2021 04:29:19 GMT",
    "Description": "There are fears of new clashes between Palestinians and Israelis during the annual Jerusalem Day march.",
    "Image": "https://ichef.bbci.co.uk/news/1024/branded_news/172C2/production/_118441949_6f8bb4a1-504f-4776-8c02-909cb5ade5bb.jpg",
    "Link": "https://www.bbc.co.uk/news/world-middle-east-57053074",
    "Text": "The fate of East Jerusalem goes to the heart of the Israel-Palestinian conflict, with both sides claiming the right to it. Israel effectively annexed East Jerusalem in 1980, in a move not recognised by the vast majority of the international community, and considers the entire city its capital.",
    "Title": "Violence-hit Jerusalem braces for Jewish nationalist march"
  },
  {
    "Date": "Mon, 10 May 2021 02:22:16 GMT",
    "Description": "The US acts to keep fuel flowing after its largest pipeline was hit by a ransomware cyber-attack.",
    "Image": "https://ichef.bbci.co.uk/news/1024/branded_news/47EE/production/_118441481_colonial-pipeline2.jpg",
    "Link": "https://www.bbc.co.uk/news/business-57050690",
    "Text": "He says it is possible for anyone to look up the login portals for computers connected to the internet on search engines like Shodan, and then \"have-a-go\" hackers just keep trying usernames and passwords until they get some to work.",
    "Title": "US passes emergency waiver over fuel pipeline cyber-attack"
  },
  {
    "Date": "Mon, 10 May 2021 07:22:21 +0530",
    "Description": "Helmut Jahn, a prominent German architect who designed an Illinois State government building and worked on the design of the FBI headquarters in Washi",
    "Image": "https://th.thgim.com/news/international/pr2jnd/article34523942.ece/ALTERNATES/FREE_960/ArchitectKilledBikeAccident",
    "Link": "https://www.thehindu.com/news/international/famed-german-architect-helmut-jahn-dies-in-bike-accident/article34523941.ece",
    "Text": "Helmut Jahn, a prominent German architect who designed an Illinois State government building and worked on the design of the FBI headquarters in Washington, was killed when two vehicles struck the bicycle he was riding outside Chicago.\n\nJahn, 81, was struck Saturday afternoon while riding north on a village street in Campton Hills, about 90 kilometers west of Chicago. Jahn failed to stop at a stop sign at an intersection and was struck by the two vehicles, headed in opposite directions, Campton Hills Police Chief Steven Miller said in a news release.\n\nJahn was pronounced dead at the scene of the accident. Authorities say the driver of one of the vehicles that struck Jahn was taken to a hospital for treatment of non-life threatening injuries.\n\nA profile posted on the website of his firm, Jahn, says he was born in Germany in 1940 and graduated from Technische Hochschule in Munich. He moved to Chicago in 1966 to study under legendary architect Ludwig Mies van der Rohe, a creator of modernist architecture, at the Illinois Institute of Technology.\n\nJahn's professional career began in 1967 when he joined CF Murphy Associates, which later became Murphy/Jahn. He worked on several major projects, including Chicago’s McCormick Place and the United Airlines terminal at O’Hare International Airport, which includes a walkway famous for its colorful lighting. He also had a hand in the design of the J Edgar Hoover Building, the FBI headquarters in Washington, D.C.\n\nJahn’s work internationally includes the Sony Center in Berlin and the Suvarnabhumi Airport in Bangkok, Thailand.\n\n“Helmut had an exceptional career both for its length and for the consistent quality of the work,” Reed Kroloff, dean of the Illinois Institute of Technology's College of Architecture, told the Chicago Tribune on Sunday. “At his height, he was one of the most influential architects in the world. Not only formally, but technically. He engaged early on with building-skin technologies that were very advanced. He created buildings of every variety.”\n\nOne of his more controversial buildings was the James R. Thompson Building, a glass-sheathed, Illinois government office building in Chicago’s Loop that opened in 1985. It was put up for sale last week. State officials say the 17-story building is a drain on state finances because it’s inefficient to operate and in need of hundreds of millions of dollars in repairs.\n\nJahn taught at the University of Illinois Chicago, Harvard University, Yale University and the Illinois Institute of Technology.",
    "Title": "Famed German architect Helmut Jahn dies in bike accident"
  },
  {
    "Date": "Mon, 10 May 2021 10:53:14 +0530",
    "Description": "As an increasing number of platforms are opening up their apps for audio-based chat forums, Clubhouse is doubling its efforts to get a slice of the Android pie.",
    "Image": "https://th.thgim.com/sci-tech/technology/internet/c0sre/article34356539.ece/ALTERNATES/FREE_960/clubhouse-AFPjpg",
    "Link": "https://www.thehindu.com/sci-tech/technology/internet/clubhouse-app-says-hello-to-android/article34524181.ece",
    "Text": "As an increasing number of platforms are opening up their apps for audio-based chat forums, Clubhouse is doubling its efforts to get a slice of the Android pie.\n\n(Subscribe to our Today's Cache newsletter for a quick snapshot of top 5 tech stories. Click here to subscribe for free.)\n\nA little over a year after making its debut in iOS, audio-chatting app Clubhouse is now opening its account in Android. The app was launched last March exclusively for iOS users to let them connect with others via chat rooms sans cameras.\n\nBy the time it was ready for general use to all Apple users in June, ‘zoom fatigue’ was starting to set in, making people log on to Clubhouse to socialise. Within ten months of its launch, the app enabled over two million people, from musicians to stock traders, to meet, to talk and connect on the platform.\n\nClubhouse’s success has made several other social media firms start their own versions of audio-chatting feature. Twitter launched Spaces for its users to meet and join impromptu discussions started by those they follow. Facebook is said to be working on a similar interface that can be accessed by people via its Messenger app.\n\nEven enterprise chat service Slack is said to be experimenting a Clubhouse-like feature for its users. Most recently, Reddit said it is testing an audio-only chat feature to let its users host live discussions within its communities.\n\nAs an increasing number of platforms are opening up their apps for audio-based chat forums, Clubhouse is doubling its efforts to get a slice of the Android pie. Just a few weeks ago, Clubhouse closed a new round of funding led by Andrew Chen of venture capital firm Andreesen Horowitz - - the app was valued at $4 billion.\n\nNow, it is starting to test waters in a market where Twitter, Facebook and Reddit have already set sail. But Clubhouse founders Paul Davison and Rohan Seth are planning to wade through Android the same way they did in iOS, through invite-only sign ups. When Davison and Seth launched the app for iPhone users, people were given access through invitation links.\n\nWith its Android launch, Clubhouse plans to navigate the same way. “As a part of the effort to keep the growth measured, we will be continuing the waitlist and invite system, ensuring that each new community member can bring along a few close friends,” the company said in a blog post.\n\nThe app will be first rolled out in beta, starting with the U.S., followed by other English-speaking countries. In the next few weeks, Clubhouse plans to collect feedback from the community and fix any issues before a full roll out for all Android users.",
    "Title": "Clubhouse app says hello to Android"
  },
  {
    "Date": "Mon, 10 May 2021 03:24:53 GMT",
    "Description": "The value of the cryptocurrency has fallen sharply after Mr Musk called it a \"hustle\" on US TV.",
    "Image": "https://ichef.bbci.co.uk/news/1024/branded_news/17196/production/_118441649_gettyimages-1229893385-1.jpg",
    "Link": "https://www.bbc.co.uk/news/business-57052811",
    "Text": "The announcement was seen as another major step towards the mainstream acceptance of bitcoin and helped to boost the price of the cryptocurrency to a fresh record high of nearly $62,000.",
    "Title": "Cryptocurrency: Musk's SpaceX to launch dogecoin moon mission"
  },
  {
    "Date": "Mon, 10 May 2021 02:02:43 +0000",
    "Description": "The comments from President Biden’s chief medical adviser came just two days after the C.D.C. belatedly highlighted the danger of airborne transmission.",
    "Image": "https://static01.nyt.com/images/2021/05/09/world/09virus-briefing-indoor-masks1/09virus-briefing-indoor-masks1-facebookJumbo.jpg",
    "Link": "https://www.nytimes.com/2021/05/09/world/fauci-indoor-mask-mandates.html",
    "Text": "Dr. Anthony S. Fauci said on Sunday that he was open to relaxing indoor masking rules as more Americans get vaccinated against the virus, just two days after the Centers for Disease Control and Prevention belatedly emphasized the danger of airborne transmission.\n\nDr. Fauci, President Biden’s chief medical adviser for the pandemic, said that as vaccinations climb, “we do need to start being more liberal” in terms of rules for wearing masks indoors, though he noted that the nation was still averaging about 43,000 cases of the virus daily. “We’ve got to get it much, much lower than that,” he said.\n\nOn Friday, the C.D.C. updated its guidance about how the coronavirus spreads, stating explicitly that people can inhale airborne virus even when they are more than six feet away from an infected individual. Previously, the agency had said that most infections were acquired through “close contact, not airborne transmission.”\n\nThe update brought the agency in line with evidence of the danger from airborne droplets that epidemiologists had noted as the pandemic unfolded last year, and, according to some experts, also underscored the urgency for the federal Occupational Safety and Health Administration to issue standards for employers to address potential airborne hazards in the workplace.",
    "Title": "Fauci Says Indoor Mask Guidance Should Ease With Vaccinations"
  },
  {
    "Date": "Mon, 10 May 2021 10:53:29 +0530",
    "Description": "It is clear that China is failing to meet responsible standards regarding their space debris, says NASA Administrator Bill Nelson",
    "Image": "https://th.thgim.com/sci-tech/science/kvihbp/article34520190.ece/ALTERNATES/FREE_960/AFP99L2C9jpg",
    "Link": "https://www.thehindu.com/sci-tech/science/nasa-denounces-china-over-irresponsible-standards-after-its-rocket-disintegrates-over-indian-ocean/article34520191.ece",
    "Text": "It is clear that China is failing to meet responsible standards regarding their space debris, says NASA Administrator Bill Nelson\n\n(Subscribe to our Today's Cache newsletter for a quick snapshot of top 5 tech stories. Click here to subscribe for free.)\n\nAmerican space agency NASA on Sunday slammed China for failing to meet \"responsible standards\" regarding its space debris, hours after remnants of the country's largest and an out of control rocket disintegrated over the Indian Ocean near the Maldives.\n\nThe debris from China's Long March 5B rocket re-entered the Earth’s atmosphere at 10.24 a.m. Beijing time and fell into an open sea area at 72.47 degrees east longitude and 2.65 degrees north latitude, China's Manned Space Engineering Office said.\n\nReacting to China's space programme, NASA Administrator Bill Nelson said: “It is clear that China is failing to meet responsible standards regarding their space debris.” “Spacefaring nations must minimize the risks to people and property on Earth of re-entries of space objects and maximize transparency regarding those operations,\" he said in a statement.\n\n\"It is critical that China and all spacefaring nations and commercial entities act responsibly and transparently in space to ensure the safety, stability, security, and long-term sustainability of outer space activities,” said Mr. Nelson, former Florida senator and astronaut who was picked for the role in March.\n\n\"It is a great honor to lead @NASA, a can-do agency that accomplishes so much! I look forward to a robust future as we continue to explore the heavens,\" he said in a tweet on May 4.\n\nNASA’s new administrator is big on tackling climate and diversifying the agency's workforce, but hedging on whether the U.S. can put astronauts on the moon by 2024.\n\nThe rocket launched the first module of China's new Tianhe space station into Earth's orbit on April 29. At around 100 feet tall and weighing about 22 metric tonnes, the rocket stage is one of the largest objects to ever re-enter the Earth’s atmosphere on an uncontrolled trajectory.\n\nIts re-entry prompted international concern about where it might land. Scientists said the risk to humans was astronomically low, but it was not impossible for it to land in an inhabited area.\n\nLast year, the re-entry of debris from the first Long March 5B flight fell in Ivory Coast, damaging several homes in villages. It was the largest craft to crash to Earth since the US space laboratory, Skylab scattered debris over the southern Australian town of Esperance in 1979.\n\nChina is expected to carry out more launches in its space station programme in the coming weeks as it aims to complete the space station project next year.",
    "Title": "NASA denounces China over 'irresponsible standards' after its rocket disintegrates over Indian Ocean"
  },
  {
    "Date": "Mon, 10 May 2021 03:41:37 +0000",
    "Description": "Rising vaccination rates in Europe.",
    "Image": "https://static01.nyt.com/images/2021/05/10/us/10-EUROPE-BRIEFING-NL-promo/10-EUROPE-BRIEFING-NL-vaccine-facebookJumbo.jpg",
    "Link": "https://www.nytimes.com/2021/05/09/briefing/vaccinations-afghanistan-israel-settlers.html",
    "Text": "The E.U.’s rising vaccination rates\n\nAfter a long, slow start, vaccination rates across the 27 nations in the E.U. are rising, with an average of nearly three million doses of Covid-19 vaccines administered each day last week.\n\nThe bloc’s vaccination campaign, marred by disruptions in supplies of the AstraZeneca and Johnson & Johnson vaccines, pivoted last month to rely heavily on the Pfizer-BioNTech vaccine. The bloc is expected to soon announce a deal with Pfizer to lock in a further 1.8 billion doses for boosters, variants and children’s vaccines.\n\nIn Germany, vaccines are helping to break a tough third wave. Daily rates of new infections have been dropping steadily since April 21, and more than 30 percent of the country’s population has now received an initial injection.\n\nImprovising to survive: Shops in Hamburg, Germany, have been pushed to the brink in the pandemic and face uncertainty about when they can return to something like normal.",
    "Title": "Your Monday Briefing"
  },
  {
    "Date": "Mon, 10 May 2021 08:13:15 +0530",
    "Description": "The suspected shooter was the boyfriend of a female victim at the party attended by friends, family and children.",
    "Image": "https://th.thgim.com/news/international/3dawxr/article34523994.ece/ALTERNATES/FREE_960/ColoradoShooting",
    "Link": "https://www.thehindu.com/news/international/man-kills-6-then-self-at-colorado-birthday-party-shooting/article34523466.ece",
    "Text": "The suspected shooter was the boyfriend of a female victim at the party attended by friends, family and children.\n\nA gunman opened fire at a birthday party in Colorado, killing six adults before killing himself Sunday, police said.\n\nThe shooting happened just after midnight in a mobile home park on the east side of Colorado Springs, police said.\n\nOfficers arrived at a trailer to find six dead adults and a man with serious injuries who died later at a hospital, the Colorado Springs Gazette reported.\n\nThe suspected shooter was the boyfriend of a female victim at the party attended by friends, family and children. He walked inside and opened fire before shooting himself, police said. Children at the attack weren’t hurt and were placed with relatives.\n\nThe birthday party was for one of the people killed, police said.\n\nPolice on Sunday hadn't released the identities of the shooter or victims. Authorities say a motive wasn't immediately known.\n\n“My heart breaks for the families who have lost someone they love and for the children who have lost their parents,” Colorado Springs Police Chief Vince Niski said in a statement.\n\nIt was Colorado's worst mass shooting since a gunman killed 10 people at a Boulder supermarket March 22.\n\n“The tragic shooting in Colorado Springs is devastating,” Gov. Jared Polis said Sunday, “especially as many of us are spending the day celebrating the women in our lives who have made us the people we are today.”\n\nColorado Springs, wih a population 4,65,000, is Colorado's second-biggest city after Denver.\n\nIn 2015, a man shot three people to death at random before dying in a shootout with police in Colorado Springs on Halloween. Less than a month later, a man killed three people, including a police officer, and injured eight others in a shooting at a Planned Parenthood clinic in the city.",
    "Title": "Man kills 6, then self, at Colorado birthday party shooting"
  },
  {
    "Date": "Mon, 10 May 2021 02:38:15 +0000",
    "Description": "The increase underscores the global disparities in vaccination efforts.",
    "Image": "https://static01.nyt.com/images/2021/05/09/world/09virus-briefing-europe-vaccines2/merlin_187463079_3acce8ab-4c3e-427e-99aa-835719ea9271-facebookJumbo.jpg",
    "Link": "https://www.nytimes.com/2021/05/09/world/eu-covid-vaccine.html",
    "Text": "Vaccinations are picking up pace in the European Union, a stunning turnaround after the bloc’s immunization drive stalled for months.\n\nOn average over the last week, nearly three million doses of the Covid-19 vaccine were being administered each day in the European Union, a group of 27 nations, according to Our World in Data, a University of Oxford database. Adjusted for population, the rate is roughly equivalent to the number of shots given each day in the United States, where demand has been falling.\n\nThe E.U. vaccination campaign, marred by disruptions in supplies of the AstraZeneca and Johnson & Johnson Covid-19 vaccines, pivoted last month to rely heavily on the Pfizer-BioNTech vaccine.\n\nLast month, Ursula von der Leyen, the European Commission president, said that Pfizer had agreed to an early shipment of doses that she said should likely allow the bloc to reach its goal of inoculating 70 percent of adults by the end of the summer. The European Union is also on the verge of announcing a deal with Pfizer and its German partner BioNTech for 2022 and 2023 that will lock in 1.8 billion doses for boosters, variants and children’s vaccines.",
    "Title": "Vaccinations Rise in the E.U. After a Long, Slow Start"
  },
  {
    "Date": "Mon, 10 May 2021 00:39:41 GMT",
    "Description": "A Nigerian professor thinks this scheme should be taught across Africa to help tackle unemployment.",
    "Image": "https://ichef.bbci.co.uk/news/1024/branded_news/2FF6/production/_118387221_cosmas.jpg",
    "Link": "https://www.bbc.co.uk/news/world-africa-56985304",
    "Text": "\"My boss called me one day and told me that he can't afford to settle [pay] me. He prayed for me and asked me to start hustling for myself. It was very difficult at first and I even had to sleep in cars, but now I look back and smile,\" he says.",
    "Title": "How a Nigerian scheme forged in war creates billionaires"
  },
  {
    "Date": "Mon, 10 May 2021 08:58:51 +0530",
    "Description": "Labour Party candidate Mr Khan, 51, defeated his Conservative Party rival, Shaun Bailey",
    "Image": "https://th.thgim.com/news/international/5jgywa/article34520055.ece/ALTERNATES/FREE_960/sadiq",
    "Link": "https://www.thehindu.com/news/international/sadiq-khan-wins-second-term-as-london-mayor-hails-overwhelming-mandate/article34520056.ece",
    "Text": "Labour Party candidate Mr Khan, 51, defeated his Conservative Party rival, Shaun Bailey\n\nSadiq Khan has been re-elected as Mayor of London for a second term after beating his closest rival with a vote share of 55.2 per cent versus 44.8 per cent in an election that was closer than expected.\n\nLabour Party candidate Mr Khan, 51, defeated his Conservative Party rival, Shaun Bailey, after winning a total of 1,206,034 votes as against 977,601 when both first and second preference votes from Thursday’s mayoral election were fully counted overnight on Saturday.\n\nThe Pakistani-origin former Labour member of Parliament was the first Muslim mayor of a European capital city when he was first elected in 2016. The mayoral poll was due last year but was postponed by a year at the peak of the coronavirus pandemic in 2020.\n\n\"I am deeply humbled by the trust Londoners have placed in me to continue leading the greatest city on earth,\" said Khan.\n\n\"I promise to strain every sinew, help build a better and brighter future for London, after the dark days of the pandemic and to create a greener, fairer and safer city for all Londoners, to get the opportunities they need to fulfil their potential. I am proud to have won an overwhelming mandate today,\" he said, speaking at his City Hall office.\n\nMr Khan reiterated his previous pledge to be a mayor for all Londoners and work to improve the lives of every single person in this city.\n\n\"The results of the elections around the UK shows our country, and even our city, remains deeply divided. The scars of Brexit have yet to heal. A crude culture war is pushing us further apart,\" he said.\n\n\"As we seek to confront the enormity of the challenge ahead, and as we endeavour to rebuild from this pandemic, we must use this moment of national recovery to heal those damaging divisions,\" he added.\n\nRival Bailey said he had been \"written off\" by pollsters, journalists and other politicians but “Londoners didn't write me off\".\n\nHis victory is one of the few positives for the Labour Party as the party held on to its dominance in the London Assembly as well. Labour also kept hold of its mayoralty in Greater Manchester, where Andy Burnham was re-elected in a landslide win.\n\nHowever, overall the local election performance has been largely dismal for the Opposition party as it lost many of its strongholds. The Conservatives have gained control of around 12 councils and the Labour has lost control of seven and the Labour failed in its attempt to oust Conservative Andy Street as the popular mayor of the West Midlands.\n\nUK Environment Secretary George Eustice said the Labour had been punished in Leave-voting areas by \"wrangling\" over Brexit in recent years. The Boris Johnson led Conservatives are also seen to have benefitted from the successful roll-out of vaccines against COVID-19.\n\nThe polls were seen as the first major leadership test for Labour leader Sir Keir Starmer, who took over from Jeremy Corbyn after a disastrous December 2019 general election defeat.\n\nHe reacted by dramatically dismissing his deputy leader Angela Rayner, who was also the party’s local election campaign chair. Starmer, who said he takes “full responsibility” for his party's poll setback, is set to reshuffle his top team further.",
    "Title": "Sadiq Khan wins second term as London Mayor, hails overwhelming mandate"
  },
  {
    "Date": "Mon, 10 May 2021 09:50:32 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/world/pakistan/pak-tourist-areas-closed-till-may-16-amid-surge-in-covid-19/articleshow/82514506.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82514506.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>",
    "Image": "https://static.toiimg.com/thumb/msid-82514502,width-1070,height-580,imgsize-295402,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/world/pakistan/pak-tourist-areas-closed-till-may-16-amid-surge-in-covid-19/articleshow/82514506.cms",
    "Text": "ISLAMABAD: During the meeting of the National Command and Operation Centre NCOC ) on Sunday, the chief secretaries of administrative units that have popular tourist destinations requested the Pakistan tourism industry to remind everyone that tourist areas were closed till May 16 and any tourist still going there would be refused entry amid surging coronavirus cases in the country.According to a statement, a special NCOC session, chaired by Minister for Planning, Development and Special Initiatives Asad Umar and Lt Gen Hamooduz Zaman Khan , reviewed the mobility control measures being implemented across the country from May 8 to 16. All Chief Secretaries were also in attendance, reported Dawn.\"Review of SOPs implementation during 8th to 16th May was carried out. During this duration, all markets, businesses and shops will remain closed except essential services including grocery stores, pharmacies/medical stores, medical facilities and vaccination centres, vegetable, fruit, chicken and meat shops, bakeries, petrol pumps, food takeaways and e-commerce (home delivery), utility services (electricity, natural gas, internet, cellular networks/telecom, call centres) and media,\" the statement said.It further said that there would be a complete ban on tourism for both locals and outsiders.\"All tourist resorts, formal and informal picnic spots, public parks, shopping malls, all hotels and restaurants in/around tourist/picnic spots will remain closed during this duration,\" it added.The statement said bookings of all hotels had been cancelled and ban on inter-provincial, inter-city and intra-city public transport would be imposed, except on private vehicles, taxis/cabs, rickshaws with 50 per cent occupancy, reported Dawn.\"The forum showed concern on the reported violations of instructions in various cities and instructed all provinces to ensure complete compliance of instructions with full administrative control,\" the statement concluded.Later, Asad Umar, in his tweet, said: \"In NCOC meeting today, Chief Secretary's from Federating units which have popular tourist destinations, requested to remind everyone that tourist areas are closed from 8th to 16th, so please do not come, or you will be turned back. #StayHomeStaySafe.\"A day earlier Umar, who also heads the NCOC, had said danger was higher than ever.\"The need for caution is clear. The danger is higher than ever and knocking at our doors. Need the country to unite in response and achieve once again what we achieved in the first wave, for which we received global praise. Inshallah we will do it again, together,\" he had tweeted.Meanwhile, according to the NCOC data, 118 people breathed their last and 3,785 contracted the virus throughout the country in a single day.As many as 652 patients were on ventilators while the number of active cases was 81,830. Besides, 5,416 persons were admitted to hospitals across the country.",
    "Title": "Pak tourist areas closed till May 16 amid surge in Covid"
  },
  {
    "Date": "Mon, 10 May 2021 09:45:16 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/world/china/china-to-create-line-of-separation-at-everest-summit-on-covid-fears/articleshow/82514454.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82514454.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>Everest base camp on the Nepalese side has been hit by coronavirus cases since late April. The Nepalese government, starved of tourism revenue, has yet to cancel the spring climbing season, usually from April to early June before the monsoon rains.",
    "Image": "https://static.toiimg.com/thumb/msid-82514438,width-1070,height-580,imgsize-15228,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/world/china/china-to-create-line-of-separation-at-everest-summit-on-covid-fears/articleshow/82514454.cms",
    "Text": "BEIJING: China will set up \"a line of separation\" at the summit of Mount Everest to prevent the mingling of climbers from Covid-hit Nepal and those ascending from the Tibetan side as a precautionary measure, Chinese state media reported on Sunday.Everest base camp on the Nepalese side has been hit by coronavirus cases since late April. The Nepalese government, starved of tourism revenue, has yet to cancel the spring climbing season, usually from April to early June before the monsoon rains.It was not immediately clear how the line would be enforced on the summit, a tiny, perilous and inhospitable area the size of a dining table.A small team of Tibetan climbing guides will ascend Everest and set up the \"line of separation\" at the summit to stop any contact between mountaineers from both sides of the peak, Xinhua news agency reported, citing the head of Tibet's sports bureau.A group of 21 Chinese nationals are en route to the summit on the Tibetan side, Xinhua reported.The Tibetan guides will set up the separation line ahead of their arrival, the state-run news agency said, without describing what the line would look like.It was also unclear whether the Tibetan guides would be the ones enforcing the \"separation\", or whether they would remain in the so-called death zone, where many lives have been lost due to a dearth of oxygen, to hold the line.The top of the 8,848-metre peak is a small mound of snow with barely enough space for half a dozen climbers and guides at any one time.China has not allowed any foreign climbers to ascend from the Tibetan side since the outbreak of the new coronavirus last year due to infection concerns.Tourists in the Everest scenic area in Tibet are also banned from visiting the base camp on the Tibetan side.Mainland China on Sunday reported 12 new Covid-19 cases on May 8 - all of which involved travellers arriving from overseas - up from seven a day earlier. Nepal reported 9,023 new cases on Friday, the country's biggest one-day increase.",
    "Title": "Covid: China to create 'line of separation' at Everest summit"
  },
  {
    "Date": "Mon, 10 May 2021 08:45:18 IST",
    "Description": "<a href=\"https://timesofindia.indiatimes.com/world/us/no-doubt-us-has-undercounted-covid-deaths-anthony-fauci/articleshow/82513707.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/82513707.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>The US, which has reported the world's worst overall Covid-19 death toll, has \"no doubt\" been undercounting fatal cases, top pandemic advisor Anthony Fauci said Sunday. The US has officially lost over 581,000 people to Covid-19 but a University of Washington study estimated deaths at more than 900,000. \"That's a bit more than I would have thought the undercounting was,\" Fauci said.",
    "Image": "https://static.toiimg.com/thumb/msid-82513707,width-1070,height-580,imgsize-82792,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Link": "https://timesofindia.indiatimes.com/world/us/no-doubt-us-has-undercounted-covid-deaths-anthony-fauci/articleshow/82513707.cms",
    "Text": "WASHINGTON: The United States, which has reported the world's worst overall Covid-19 death toll, has \"no doubt\" been undercounting fatal cases, top pandemic advisor Anthony Fauci said Sunday.The country has officially lost over 581,000 people to the disease caused by the SARS-CoV-2 coronavirus -- but a University of Washington study released on Thursday estimated deaths at more than 900,000.\"That's a bit more than I would have thought the undercounting was,\" Fauci told NBC 's \"Meet The Press.\"\"But I think there's no doubt... that we are and have been undercounting.\"The United States has reported over 32.6 million cases since the virus was first identified at the end of 2019 in China.America was battered by a spike in cases and deaths after the end-of-year holidays, but since January new infections have come down as vaccination rates have jumped.\"We are turning the corner. We have 58 percent of adult Americans with at least one shot, over 110 million Americans fully vaccinated,\" White House Covid-19 coordinator Jeffrey Zients told CNN 's State of the Union.President Joe Biden wants 70 percent of adults in the US to have received at least one shot of the Covid-19 vaccine by the July 4 Independence Day holiday.But the rate peaked around April 10 and has been declining since then, with vaccine hold-outs slowing the race to population immunity.Federal, state and local officials are partnering with pharmacies, restaurants, breweries, supermarkets and sports teams to come up with incentives to get people to get their shots.In New Jersey, Governor Phil Murphy launched a \"Shot and a Beer\" program to encourage vaccination, while in West Virginia Governor Jim Justice announced that the state will offer $100 savings bonds to residents aged 16 to 35 who get inoculated.",
    "Title": "'No doubt' US has undercounted Covid deaths: Fauci"
  },
  {
    "Date": "Mon, 10 May 2021 04:18:34 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/05/Untitled-design-75.png",
    "Link": "https://indianexpress.com/article/world/why-do-we-deserve-to-die-kabuls-hazaras-bury-their-daughters-7309024/",
    "Text": "Items recovered outside Sayed Ul-Shuhada high school in Kabul, Afghanistan are laid out so families can identify and collect them after a bombing occurred that afternoon, on Saturday, May 8, 2021. Powerful explosions outside the high school in Afghanistan’s capital on Saturday killed at least 30 people and wounded dozens more, many of them teenage girls leaving class. (Kiana Hayeri/The New York Times)\n\nOne by one they brought the girls up the steep hill, shrouded bodies covered in a ceremonial prayer cloth, the pallbearers staring into the distance. Shouted prayers for the dead broke the silence.\n\nThe bodies kept coming and the gravediggers stayed busy, straining in the hot sun. The ceaseless rhythm was grim proof of the preceding day’s news: Saturday afternoon’s triple bombing at a local school had been an absolute massacre, targeting girls. There was barely room atop the steeply pitched hill for all the new graves.\n\nThe scale of the killing and the innocence of the victims seemed further unnerving proof of the country’s violent unraveling, as the Taliban make daily gains and the government seems unable to halt their advances or protect its people from mass killings. On Sunday there were mourners everywhere in the neighborhood of the bombing, home to the persecuted Shiite Hazara ethnic minority, but hardly any security to protect them.\n\nThe death toll — possibly reaching over 80 young girls — exceeded even previous massacres in this bustling neighborhood of a minority long singled out for persecution by the Taliban and, in recent years, the Islamic State group. Afghanistan’s second vice president, Sarwar Danesh, himself a Hazara, said over 80 girls had been killed in the attack.\n\nAfter the 2001 U.S. invasion, the Hazara were a minority that made the most of the country’s new educational and business opportunities, and they make up a large part of the country’s young technocrat generation. But through it all, Hazara Shiites became a target of choice for Sunni militants like the new Taliban insurgency and ISIS.\n\nThey have grown increasingly angry at the government, accusing the security forces of standing by while they suffer horrific casualties. Now, on the edge of what many fear will become a return of Taliban rule in many areas, and a new civil war some see as inevitable, the Hazara are increasingly determined to take their security into their own hands.\n\nOn Sunday, a wheelbarrow stacked with the bloodied clothing of the girls, packed tight in plastic bags, was parked outside one mosque where bodies had been brought. At another mosque, a basement room, crowded with black-robed women, echoed with muffled sobs. At a third mosque grim-faced men clustered on the steps, murmuring about taking up guns and joining forces with a Hazara warlord named Abdul Ghani Alipur, who is on the run from the government.\n\nOutside the metal gates of the Sayed Ul-Shuhada High School, twisted by the blast, the remains of the girls’ final moments — shredded backpacks, charred notebooks, crushed slippers, loose pages of notes — were piled in a pit, pored over by silent onlookers.\n\nAll over the Dasht-e Barchi neighborhood Sunday, grieving families of Hazara buried their daughters, ages 11 to 18. Streams of mourners snaked up the area’s hills. The air was filled with laments for the dead sounding from mosques. Some girls were so badly disfigured by the blasts they could not be identified Sunday.\n\nThere was the fear that the massacre was just a prelude.\n\n“We can’t do anything but mourn,” said Jawed Hassani, a shopkeeper, outside the Imam Ali mosque. He said: “We supported the government, but all we get in return is being blown up. These girls, they came from working-class families. They don’t have anything.”\n\nNobody has yet claimed responsibility for the attack.\n\nThe government blamed the Taliban, which denied any role. The Taliban, however, continually target the Hazaras for violent persecution. And they have a record of opposing education for girls, especially teenage girls. But some analysts blamed the remnants of renegade Taliban who once claimed allegiance to ISIS.\n\nWhoever was responsible, they appear to have taken pains to kill as many of the girls as possible.\n\nFirst, a suicide bomber blew up a car full of explosives at the school gates. As the students, all girls at that hour, rushed out of the mixed-gender school in panic and into the neighborhood of dusty streets, two more bombs went off, killing even more. Nearly all the victims were girls.\n\n“Yesterday their dreams were shattered,” said Ghulam, a day laborer, preparing to mourn at the Qamar-e-Bani Hashim Mosque.\n\n“Today we are going to bury them with thousands of dreams,” he said. “That is one of the poorest schools in the neighborhood. Those girls don’t even have 15 cents to buy bread.”\n\nFor the Hazaras of sprawling Dasht-e Barchi, home to over 1 million people, the precise identity of the killers didn’t seem to matter all that much Sunday. Their faces bore the minority’s resigned look of perennial persecution. They noted bitterly that, over an hour after Saturday’s attack, it was difficult to spot a single member of the security forces in the school’s vicinity.\n\nAnd they cited many of the other attacks they had been subjected to, and the government’s repeated failure to protect them.\n\n“We get blown up on the street, in the mosque, in the hospital, at the wrestling club, everywhere,” said Kazim Ehsani, the imam of the Qamar-e-Bani Hashim Mosque. “And yesterday when the attack happened, there wasn’t even one police officer,” he said. “Now, there’s a crowd, and there isn’t even one security officer,” the imam said.\n\n“People are collecting their loved ones’ bodies,” he said. “We are in shock. Everybody is terrified.”\n\nEverybody here can easily run down the litany of attacks the Hazaras of Dasht-e Barchi have suffered over the years.\n\n“We haven’t committed any crimes, and now it’s happened to us again,” said Mohammed Hakim Imon, one of the mourners.\n\n“Why do we deserve to die?” he asked. “The people who commit these crimes, they are the enemies of humanity.”\n\nThere was last October’s attack outside an educational center that killed 30, and the May 2020 attack on a hospital maternity ward in which 15 women were killed, both tied to Islamic State. There was the September 2018 attack on a wrestling club that killed 20, the school attack that August in which 34 students were killed, and the 2017 mosque bombing in which 39 died. Not to mention the massacres of Hazara in the civil war-torn Kabul of the early 1990s by the forces of warlord Abdul Rasul Sayyaf and his ally, Ahmad Shah Massoud, now revered — not by Hazaras — as a national hero.\n\nThe absence of government security forces Sunday, even though funerals are often targeted by the extremists, prompted some to say that the community could rely only on itself.\n\n“If we want to protect ourselves, men and women should pick up guns,” said Ghulam, the day laborer.\n\nThe attack “compels Hazaras to pick up guns and defend themselves,” said Arif Rahmani, a Hazara member of parliament. “Whether the government likes it not, people will stand up and provide themselves with their own security,” he said. “Hazaras will have to make their own decisions,” he said. “There will be gunmen on every corner and street of their neighborhoods.”\n\nOutside the school Sunday a crowd surrounded an elderly man shouting, “God, please help us!” A man listening said: “The only option is to take up guns. We just buried an 11-year-old girl. What is her crime?”\n\nThe man, Qasim Hassani, a vendor, continued: “If the government doesn’t stop these terrorists from coming into our neighborhoods, we will do it. Today I am just a vendor. But if they keep pushing, I will be the next Alipur.”\n\nPresident Ashraf Ghani proclaimed Tuesday a national day of mourning for the victims.\n\nThe blast was so powerful it shattered the windows of stores a considerable distance down the street.\n\n“It’s terrifying,” said Naugiz Almadi, a mother clutching her young daughter outside the school. “Hazaras have nothing to protect them. Only God.”",
    "Title": "‘Why do we deserve to die?’ Kabul’s Hazaras bury their daughters"
  },
  {
    "Date": "Mon, 10 May 2021 04:03:26 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2016/06/belgium-britain-eu_kuma-fb1.jpg",
    "Link": "https://indianexpress.com/article/world/scottish-leader-to-london-independence-vote-a-matter-of-when-not-if-7309012/",
    "Text": "Scotland's First Minister Nicola Sturgeon speaks during a media conference at the Scotland House in Brussels on Wednesday, June 29, 2016. Sturgeon is on a one day visit to Brussels to meet with EU officials. (AP Photo/Geoffroy Van der Hasselt, Pool)\n\nScottish leader Nicola Sturgeon told British Prime Minister Boris Johnson on Sunday that another referendum on independence was inevitable after her party won a resounding election victory.\n\nJohnson and his Conservative Party, which is in opposition in Scotland, strongly oppose a referendum, saying the issue was settled in 2014 when Scots voted against independence by 55% to 45%.But pro-independence parties won a majority in the Scottish parliament in elections held on Thursday, which Sturgeon said gave her a mandate to push ahead with plans for a second referendum after the COVID-19 crisis.\n\n“The First Minister reiterated her intention to ensure that the people of Scotland can choose our own future when the crisis is over,” Sturgeon’s media office said in a statement after she spoke to Johnson on the phone.”(She) made clear that the question of a referendum is now a matter of when – not if.\n\n“A statement from Johnson’s Downing Street office after his talk with Sturgeon made no mention of the referendum issue, instead emphasising “the importance of focusing on COVID recovery at this time”.\n\nSturgeon’s Scottish National Party (SNP) won 64 seats in the Scottish parliament, just one short of an overall majority. With its Green allies, who won eight and also favour independence, it is in control of the political agenda in Scotland.\n\nSpeculation has been mounting that when the Scottish parliament legislated for a referendum, the British government would go to court to stop it. But senior minister Michael Gove sidestepped repeated questions about that earlier on Sunday.\n\n“We’re not going to go there,” he said on Sky News. “To start speculating about this type of legislation or that type of court hearing and all the rest of it, it’s just a massive distraction,” he said.\n\nSturgeon told the BBC it would be “absurd and completely outrageous” for the British government to take legal action to stop a referendum. She argued that for London to use “force of law” to prevent a vote would amount to saying that the 300-year-old union between England and Scotland was no longer based on consent.\n\n\n\n“I don’t think we will get there,” she said. Under the 1998 Scotland Act – which created the Scottish parliament and devolved some powers to Edinburgh from London – all matters relating to the “Union of the Kingdoms of Scotland and England” are reserved to the UK parliament.\n\nUnder the act, the UK parliament can grant the Scottish government the authority to hold a referendum, a process that was used to allow the 2014 plebiscite to go ahead and which Sturgeon said should unfold again for a new referendum.(",
    "Title": "Scottish leader to London: Independence vote a matter of ‘when, not if’"
  },
  {
    "Date": "Mon, 10 May 2021 05:36:14 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/05/Untitled-design-64-2.png",
    "Link": "https://indianexpress.com/article/world/outpouring-of-support-from-us-for-india-covid-19-help-touches-usd-half-a-billion-7309102/",
    "Text": "Relief supplies from the United States in the wake of India's COVID-19 situation arrive at the Indira Gandhi International Airport cargo terminal. (Prakash Singh/Pool via AP)\n\nLess than a fortnight after President Joe Biden in his conversation with Prime Minister Narendra Modi pledged his country’s steadfast support for the people of India, America has responded with an unprecedented financial assistance worth nearly USD half a billion.\n\nBiden spoke at length with Modi last month and conveyed solidarity with India in its fight against the viral disease. He assured the prime minister that the US and India will work closely together in the fight against Covid-19.\n\n“Just as India sent assistance to the United States as our hospitals were strained early in the pandemic, we are determined to help India in its time of need,” Biden had said in a tweet.\n\nReflecting an overwhelming support for a “natural ally”, the entire country not only the administration, but also the corporate sector which created a global task force, as well as Americans and Indian-Americans have opened their coffers for India.\n\nThis half a billion dollars includes USD 100 million pledged by the Biden administration, USD 70 million by pharma major Pfizer and 450,000 Remdesivir doses, the governmental purchase price of each of which in the US is USD 390.\n\nThousands of oxygen concentrators and plane loads of life saving drugs and health care equipment are flying off the United States for India almost every day.\n\nSeveral companies like Boeing and Mastercard have announced financial assistance worth USD 10 million each, Google has pledged USD 18 million, which the Global Task Force that comprises CEOs of top American companies have already pledged USD 30 million worth of life saving equipment.\n\nDescribing it as a “Berlin Life Moment”, Mukesh Aghi of US India Strategic and Partnership Forum (USISPF), told PTI he expects the assistance to touch almost USD 1 billion by the end of the month. “It is emotional for the diaspora, almost everyone has someone who has been touched by Covid-19,” he said.\n\nNisha Desai Biswal, president of US India Business Council (USIBC) said, “The outpouring of support from the United States over the past two weeks was a spontaneous mass mobilisation of support for the Indian people from across the America government, business community and diaspora community and the American people.”\n\n“It is unprecedented, and it reflects both the deep bonds between our two countries and the gratitude that Americans feel for the role India played in supporting the United States when we were experiencing our Covid surge last year,” she said.\n\nHowever, given the “speed and severity” that have overwhelmed the capacity of hospitals and local authorities, more assistance will be needed and for a sustained period of timescale of the pandemic, Biswal said.\n\nPeople of the country and the Diaspora too have come out in large numbers. Indian-American Vinod Khosla has committed USD 10 million, top corporate leader John T Chambers has promised USD 1 million.\n\nFor the first time in its history, Sewa International has raised USD 15 million; American Association of Physicians of Indian Origin (AAPI) (USD 3.6 million), Indiaspora (USD 2.5) million and Jai Shetty has raised USD 4 million.\n\n“There has been overwhelming support and offers of assistance from the US Government, private sector, diaspora and the American public at large. In fact, in my interactions in recent days, the US interlocutors across the board ask me, ‘tell us what more we can do for India’,” India’s ambassador to the US Taranjit Singh Sandhu told PTI.\n\n“They recall with fondness the help India gave. These are reflective of strong partnership and close people to people ties between our both nations. We deeply appreciate these gestures. We will continue to engage with the US in our collective fight against the pandemic,” he said.\n\nAmong other major financial contributions announced include Procter and Gamble (USD 6.7 million); Merck (USD 5 million), Walmart (USD 2 million), Salesforce (USD 2.4 million), and Caterpillar (USD 3.4 million). Companies like Deloittee have announced to 12,000 oxygen concentrators to India.\n\nWhile Microsoft is partnering with the US government in providing aid and oxygen, FedEx and UPS have taken up the mantle of taking care of the transportation of life saving health care equipment like oxygen cylinders, ventilators and oxygen concentrators to India.\n\nOn Sunday, Indian-Americans from Tamil Nadu including eminent philanthropist M R Rangaswami, held a “Help Tamil Nadu Breathe” to raise USD 1.5 million in few hours.\n\n“This is an incredible outpouring of generosity, which people have come to expect from America. When the world has a crisis, beyond politics, beyond dispute America steps up,” Rangaswami said.\n\n“It is comforting to see US cargo jets with much needed medical supplies landing at the Delhi airport regularly,” said Karun Rishi, president of the USA-India Chambers of Commerce.\n\nNoting that the stakes are very high for the entire world, he said India’s success or failure to come out of this once in a century crisis will have a direct impact throughout the world.\n\nEchoing Biswal, Rishi said that more needs to be done.\n\n“The scale of assistance to India needs to increase and speeded up. To make some reasonable impact to tide over this crisis, India may need between USD 25-USD 50 billion in assistance in the form of vaccines, technology transfer, increasing vaccines and therapeutics manufacturing capacity, medical equipment and public health measures,” he said.",
    "Title": "Outpouring of support from US for India, Covid-19 help touches USD half a billion"
  },
  {
    "Date": "Mon, 10 May 2021 03:58:14 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/05/Untitled-design-74.png",
    "Link": "https://indianexpress.com/article/world/south-koreas-moon-says-looking-for-north-korea-response-for-peace-talks-7309004/",
    "Text": "Moon's comments, in a speech marking the fourth year of his presidency, come ahead of his first summit with U.S. President Joe Biden in Washington on May 21. (Reuters)\n\nSouth Korean President Moon Jae-in on Monday said he was looking forward to North Korea’s response to engagement efforts as he seeks to restore peace-building amid stalled talks over Pyongyang’s nuclear and missile programmes.\n\nMoon’s comments, in a speech marking the fourth year of his presidency, come ahead of his first summit with U.S. President Joe Biden in Washington on May 21.\n\nThe South Korean president is expected to push the United States to seek engagement with North Korea, though Biden has shown little interest in making North Korea a top priority.\n\nBiden’s administration says its overtures to Pyongyang have not been answered, and it recently completed a policy review that called for a “practical” approach of using diplomacy to find achievable goals toward eventually persuading North Korea to surrender its nuclear weapons.\n\nBut Biden has shown no sign of loosing sanctions, which have hampered Moon’s efforts to launch economic and tourism projects with the North, and the White House has not appointed a special envoy to handle the issue.\n\nMoon has made engaging with North Korea a signature project and appeared to make progress in 2018 amid summits with leader Kim Jong Un, but as Moon enters his final year in office, Pyongyang shows few signs of interest in talking.\n\nIn his speech, Moon said that he wouldn’t be impatient during his final year, but that he would do everything he could to return to the days of engagement.\n\n“If there is an opportunity to turn back the clock of peace again and advance the peace process on the Korean peninsula, I will make all efforts,” he said. “We look forward to North Korea’s response.”",
    "Title": "South Korea’s Moon says looking for North Korea response for peace talks"
  },
  {
    "Date": "Mon, 10 May 2021 03:39:40 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/05/Untitled-design-73.png",
    "Link": "https://indianexpress.com/article/world/top-judges-in-brazil-want-review-after-deadly-police-raid-7308970/",
    "Text": "Relatives and residents protest a day after a deadly police operation in the Jacarezinho favela of Rio de Janeiro, Brazil, Friday, May 7, 2021. A bloody, hours-long gun battle here echoed into Friday, with authorities saying the police mission killed two dozen criminals while residents and activists claimed human rights abuses. (AP Photo/Silvia Izquierdo)\n\nSeveral justices from Brazil’s Supreme Court say a ruling last year that banned police raids into Rio de Janeiro favelas, or slums, must now be reviewed after one of the city’s deadliest police operations.\n\nBrazil’s Supreme Court issued a ruling last year prohibiting police operations in Rio’s favelas during the pandemic unless “absolutely exceptional.”\n\nIn a telephone interview with The Associated Press on Saturday, Supreme Court justice Marco Aurélio Mello said the May 6 raid should be investigated, but didn’t say whether it violated the earlier ruling. Rather, he said that the court’s ruling should have been reviewed as the pandemic persisted.\n\n“The decision stemmed from an assumption that the injunction would be temporary and there would be an obstacle for a few months,” he said. “The state is the law. Trafficking really needs to be fought.”\n\nThree other justices from the 11-member court agreed with Mello that the issue must now be revisited. They spoke with the AP on condition of anonymity given the sensitive nature of the issue.\n\nAuthorities said one police officer and 27 people described by the police as criminals died in the raid. Residents and activists claimed human rights abuses.\n\nLast year’s Supreme Court ruling came after police fatally shot a 14-year-old in a home where there was no indication of any illegal activity. It caused a decline in police operations throughout the middle of last year, as reflected by a plunge in the number of shootouts reported by Crossfire, a non-governmental group that monitors violence, and in official state data on deaths resulting from police intervention. But both indicators have crept back up to around pre-pandemic levels.\n\nRio’s police claim that the May 6 operation in the Jacarezinho favela of Rio’s north zone was the result of 10 months of intelligence gathering. It issued 21 arrest warrants, but only arrested three of the targets.\n\nJustice Mello said that the action in Jacarezinho cannot be classified as “intelligence work,” given how many deaths it produced. He said an investigation should be brought to the federal level.\n\n“We don’t have the death penalty here. Criminals need to be arrested. We must obstruct the entry of weapons in Brazil, but it is not possible to have an event of this magnitude and think that there isn’t something out of context,” he said.\n\nOn Friday, Supreme Court Justice Edson Fachin requested investigations and said there were “indications of arbitrary execution.”\n\nSociologist Daniel Hirata of the Fluminense Federal University criticized the police operation.\n\n“Today in Rio, we have the use of force without respect for legal limitations,” he said. “When you have an operation with almost 30 dead, something has gone wrong.”",
    "Title": "Top judges in Brazil want review after deadly police raid"
  },
  {
    "Date": "Mon, 10 May 2021 02:42:07 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/05/Covid-29.jpg",
    "Link": "https://indianexpress.com/article/world/china-probed-weaponising-coronaviruses-in-2015-reports-7308931/",
    "Text": "Questions remain over the origins of the deadly virus\n\nChinese military scientists allegedly investigated weaponising coronaviruses five years before the COVID-19 pandemic and may have predicted a World War III fought with biological weapons, according to media reports referring to documents obtained by the US State Department.\n\nAccording to ‘The Sun’ newspaper in the UK, quoting reports first released by ‘The Australian’, the “bombshell” documents obtained by the US State Department reportedly show the Chinese People’s Liberation Army (PLA) commanders making the sinister prediction.\n\nUS officials allegedly obtained the papers which were written by military scientists and senior Chinese public health officials in 2015 as part of their own investigation into the origins of COVID-19.\n\n\n\nChinese scientists described SARS coronaviruses — of which COVID is one example — as presenting a “new era of genetic weapons”.\n\nCoronaviruses are a large family of viruses, several of which cause respiratory diseases in humans – ranging from a common cold to Severe Acute Respiratory Syndrome (SARS).\n\nThe PLA papers referenced seem to fantasise that a bioweapon attack could cause the “enemy’s medical system to collapse”.\n\nIt references work by US Air Force colonel Michael J. Ainscough, who predicted World War III may be fought with bioweapons.\n\nThe paper also includes musing that SARS —which hit China in 2003 — could have been a man-made bioweapon deliberately unleashed by “terrorists”.\n\nThey reportedly boasted the viruses could be “artificially manipulated into an emerging human disease virus, then weaponised and unleashed in a way never seen before”.\n\nThe document lists some of China’s top public health figures among the authors and has been revealed in an upcoming book on the origins of COVID, titled ‘What Really Happened In Wuhan’.\n\nChina reported the first COVID-19 case in the central Chinese city of Wuhan in late 2019 and since then the deadly disease has become a pandemic, affecting more than 157,789,300 people and causing over 3,285,200 deaths worldwide.\n\nTom Tugendhat MP and Australian politician James Paterson said the document raises major concerns about China’s transparency on the origins of COVID-19.\n\nTugendhat, chairman of the House of Commons Foreign Affairs Select Committee, was quoted in ‘The Sun’ as saying: “China’s evident interest in bioweapons is extremely concerning. Even under the tightest controls these weapons are dangerous.\n\n“This document raises major concerns about the ambitions of some of those who advise the top party leadership.”\n\nPeter Jennings, the executive director of the Australian Strategic Policy Institute (ASPI), told news.com.au that the document is as close to a “smoking gun” as we’ve got.\n\n“I think this is significant because it clearly shows that Chinese scientists were thinking about military application for different strains of the coronavirus and thinking about how it could be deployed,” said Jennings.\n\n“It begins to firm up the possibility that what we have here is the accidental release of a pathogen for military use,” added Jennings.\n\nHe also said that the document may explain why China has been so reluctant for outside investigations into the origins of COVID-19.\n\n“If this was a case of transmission from a wet market it would be in China’s interest to co-operate … we’ve had the opposite of that.”\n\nAmong the 18 listed authors of the document are People’s Liberation Army scientists and weapons experts.\n\nRobert Potter, a cyber security specialist who analyses leaked Chinese government documents was asked by The Australian to verify the paper. He says the document definitely is not fake.\n\n“We reached a high confidence conclusion that it was genuine … It’s not fake but it’s up to someone else to interpret how serious it is,” Potter told news.com.au.\n\n“It emerged in the last few years … they (China) will almost certainly try to remove it now it’s been covered.”\n\nQuestions remain over the origins of the deadly virus after a much derided World Health Organisation (WHO) probe earlier this year, with the organisation ordering a further investigation which factors in the possibly of a lab leak.\n\nMost scientists have said there is no evidence that COVID-19 is manmade — but questions remain whether it may have escaped from a secretive biolab in Wuhan — from where the pandemic originated.\n\nChina is known to have been carrying out high risk “gain of function” research at the Wuhan Institute of Virology (WIV) — which is near the outbreak’s ground zero at the Huanan Seafood Market.\n\nThere is no evidence so far to suggest it was intentionally released by China.\n\nMeanwhile, in Beijing, the state-run Global Times newspaper slammed The Australian for publishing the article to smear China.\n\nAn academic book that explores bioterrorism and possibilities of viruses being used in warfare was interpreted as a conspiracy theory by The Australian, which deliberately and malignantly intends to invent pretexts to smear China, Chen Hong, a professor and director of the Australian Studies Center at East China Normal University, told the newspaper.\n\n“It is a shame for anti-China forces in Australia to back their own ideology against China at the expense of basic professional journalistic ethics, conspiring to twist the real meaning of the book,” Chen said. PTI AK AKJ AKJ",
    "Title": "China probed weaponising coronaviruses in 2015: Reports"
  },
  {
    "Date": "Mon, 10 May 2021 02:38:14 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/05/Vancouver.jpg",
    "Link": "https://indianexpress.com/article/world/at-least-one-dead-after-shooting-at-vancouver-airport-report-7308916/",
    "Text": "A Royal Canadian Mounted Police officer works at the scene after a shooting outside the international departures terminal at Vancouver International Airport, in Richmond, British Columbia, on Sunday. (AP)\n\nAt least one person died after a shooting at the main terminal at the Vancouver International Airport, the Vancouver Sun reported on Sunday.\n\nPolice were looking for one or more suspects after the shooting at the airport in Richmond, British Columbia, CBC News added.\n\nThe Vancouver International Airport said in a post on Twitter that it was working with the Royal Canadian Mounted Police and responding to reports of a police incident outside the airport’s main terminal.\n\nStatement from Vancouver Airport Authority: pic.twitter.com/aKL7rXQEQR — Vancouver International Airport (YVR) (@yvrairport) May 10, 2021\n\nIt later tweeted that the situation had been contained. “We can confirm the situation has been contained at YVR. The airport is open and safe. Flights are operating,” the airport said on Twitter.\n\nBike paramedics at the airport responded and two ground units were dispatched, according to CBC News.",
    "Title": "At least one dead after shooting at Vancouver airport: Report"
  },
  {
    "Date": "Mon, 10 May 2021 03:10:51 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/05/SpaceX-4.jpg",
    "Link": "https://indianexpress.com/article/world/spacex-accepts-dogecoin-as-payment-to-launch-lunar-mission-next-year-7308950/",
    "Text": "A SpaceX Falcon 9 rocket lifts off from pad 39A at the Kennedy Space Center in Cape Canaveral. (AP)\n\nSpaceX will launch the “DOGE-1 Mission to the Moon” in the first quarter of next year, with Elon Musk’s commercial rocket company accepting the meme-inspired cryptocurrency dogecoin as payment.\n\n“SpaceX launching satellite Doge-1 to the moon next year – Mission paid for in Doge – 1st crypto in space – 1st meme in space”, Musk said in a tweet.\n\n“This mission will demonstrate the application of cryptocurrency beyond Earth orbit and set the foundation for interplanetary commerce”, SpaceX Vice President of Commercial Sales Tom Ochinero was quoted as saying in the statement released by Geometric Energy.\n\nSpaceX launching satellite Doge-1 to the moon next year – Mission paid for in Doge\n\n– 1st crypto in space\n\n– 1st meme in space To the mooooonnn!!https://t.co/xXfjGZVeUW — Elon Musk (@elonmusk) May 9, 2021\n\nMusk had said on Twitter in April that SpaceX was going to put a “literal Dogecoin on the literal moon”.\n\nDogecoin lost more than a third of its price on Sunday, after Musk called it a ‘hustle’ during his guest-host spot on the “Saturday Night Live” comedy sketch TV show.\n\nMusk’s tweets this year turned the once-obscure digital currency, which began as a social media joke, into a speculator’s dream.\n\nOn crypto data tracker CoinGecko.com, dogecoin has jumped more than 800% over the last month and is now the fourth-largest digital currency, with a market capitalization of $73 billion.\n\nIt hit a record high Thursday above $0.73. Electric carmaker Tesla Inc, where Musk is CEO, said in February it bought $1.5 billion worth of bitcoin and would soon accept it as a form of payment for its electric cars, a large stride toward mainstream acceptance that sent bitcoin soaring to a record high of nearly $62,000.",
    "Title": "SpaceX accepts dogecoin as payment to launch lunar mission next year"
  },
  {
    "Date": "Mon, 10 May 2021 03:07:42 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/05/Untitled-design-72.png",
    "Link": "https://indianexpress.com/article/world/us-expresses-serious-concerns-about-jerusalem-clashes-7308933/",
    "Text": "The clashes have been sparked by the planned evictions of several Palestinian families from the Sheikh Jarrah neighborhood in East Jerusalem, an area captured by Israel in a 1967 war. (Reuters)\n\nU.S. National Security Adviser Jake Sullivan on Sunday expressed “serious concerns” to his Israeli counterpart about violent clashes in Jerusalem sparked by planned evictions of Palestinians from East Jerusalem, the White House said in a statement.\n\nSullivan in a phone call with Israeli National Security Adviser Meir Ben-Shabbat “encouraged the Israeli government to pursue appropriate measures to ensure calm during Jerusalem Day commemorations.”\n\nNew confrontations broke out between Palestinians and Israeli police in parts of East Jerusalem on Sunday, including in Sheikh Jarrah and outside the walled Old City, as well as in Haifa, a mixed Arab-Jewish city in northern Israel at the height of the Muslim holy month of Ramadan.\n\nThe clashes have been sparked by the planned evictions of several Palestinian families from the Sheikh Jarrah neighborhood in East Jerusalem, an area captured by Israel in a 1967 war.\n\nIsrael’s attorney-general secured a deferment on Sunday of an Israeli Supreme Court hearing on the evictions, a session that had threatened to stoke more violence in the holy city and heighten international concern.\n\n“Mr. Sullivan also reiterated the United States’ serious concerns about the potential evictions of Palestinian families from their homes in the Sheikh Jarrah neighborhood,” the White House statement said.Sullivan and Ben-Shabbat “agreed that the launching of rocket attacks and incendiary balloons from Gaza towards Israel is unacceptable and must be condemned,” the White House added.\n\nIt said Sullivan also expressed the Biden administration’s commitment to Israel’s security and to supporting peace and stability throughout the Middle East and would remain fully engaged in the days ahead to promote calm in Jerusalem.",
    "Title": "US expresses ‘serious concerns’ about Jerusalem clashes, evictions of Palestinians"
  },
  {
    "Date": "Mon, 10 May 2021 02:31:38 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/05/Untitled-design-70.png",
    "Link": "https://indianexpress.com/article/world/man-kills-six-then-self-at-colorado-birthday-party-shooting-7308925/",
    "Text": "Freddy Marquez kisses the head of his wife, Nubia Marquez, near the scene where her mother and other family members were killed in a mass shooting early Sunday, May 9, 2021, in Colorado Springs, Colorado. The suspected shooter was the boyfriend of a female victim at the party attended by friends, family and children. He walked inside and opened fire before shooting himself, police said. Children at the attack weren’t hurt and were placed with relatives. (Jerilee Bennett/The Gazette via AP)\n\nA gunman opened fire at a birthday party in Colorado, slaying six adults before killing himself Sunday, police said.\n\nThe shooting happened just after midnight in a mobile home park on the east side of Colorado Springs, police said.\n\nOfficers arrived at a trailer to find six dead adults and a man with serious injuries who died later at a hospital, the Colorado Springs Gazette reported.\n\nThe suspected shooter was the boyfriend of a female victim at the party attended by friends, family and children. He walked inside and opened fire before shooting himself, police said.\n\nThe birthday party was for one of the people killed, police said.\n\nNeighbor Yenifer Reyes told The Denver Post she woke to the sound of many gunshots.\n\n“I thought it was a thunderstorm,” Reyes said. “Then I started hearing sirens.”\n\nPolice brought children out of the trailer and put them into at least one patrol car, she said, adding that the children were crying hysterically.\n\nAuthorities say the children, who weren’t hurt in the attack, have been placed with relatives.\n\nPolice on Sunday hadn’t released the identities of the shooter or victims. Authorities say a motive wasn’t immediately known.\n\n“My heart breaks for the families who have lost someone they love and for the children who have lost their parents,” Colorado Springs Police Chief Vince Niski said in a statement.\n\nIt was Colorado’s worst mass shooting since a gunman killed 10 people at a Boulder supermarket March 22.\n\n“The tragic shooting in Colorado Springs is devastating,” Gov. Jared Polis said Sunday, “especially as many of us are spending the day celebrating the women in our lives who have made us the people we are today.”\n\nColorado Springs, population 465,000, is Colorado’s second-biggest city after Denver.\n\nIn 2015, a man shot three people to death at random before dying in a shootout with police in Colorado Springs on Halloween. Less than a month later, a man killed three people, including a police officer, and injured eight others in a shooting at a Planned Parenthood clinic in the city.",
    "Title": "Man kills six, then self, at Colorado birthday party shooting"
  },
  {
    "Date": "Mon, 10 May 2021 02:16:58 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/05/Untitled-design-69.png",
    "Link": "https://indianexpress.com/article/world/more-jerusalem-clashes-on-eve-of-contentious-israeli-parade-7308912/",
    "Text": "Israeli police officers clash with Palestinian protesters near Damascus Gate just outside Jerusalem's Old City, Sunday, May 9, 2021. (AP Photo/Ariel Schalit)\n\nIsraeli police faced off with Palestinian protesters Sunday in another night of clashes in east Jerusalem, a day before Israeli nationalists planned to parade through the Old City in an annual flag-waving display meant to cement Israeli claims to the contested area.\n\nThe late-night skirmishes raised the likelihood of further clashes Monday during the annual Jerusalem Day celebrations.\n\nIsraeli police gave the go-ahead to the parade Sunday, despite days of unrest and soaring Israeli-Palestinian tensions at a flashpoint holy site and in a nearby Arab neighborhood where Jewish settlers are trying to evict dozens of Palestinians from their homes.\n\nAddressing a special Cabinet meeting ahead of Jerusalem Day, Prime Minister Benjamin Netanyahu said Sunday that, “Israel will not allow any extremists to destabilize the calm in Jerusalem. We will enforce law and order decisively and responsibly.”\n\n“We will continue to maintain freedom of worship for all faiths, but we will not allow violent disturbances,” he said. At the same time, he said, “We emphatically reject the pressures not to build in Jerusalem.”\n\nThe United States again expressed its ‘serious concerns’ about the situation in Jerusalem, including clashes between Palestinian worshippers in Jerusalem’s Old City, home to sites sacred by Muslims and Jews, and Israeli police, as well as the expected expulsion of Palestinian families.\n\nWashington made its concerns during a phone call between National Security Advisor Jake Sullivan and his Israeli counterpart. Sullivan urged Israel to — “pursue appropriate measures to ensure calm during Jerusalem Day commemorations,” according to a statement by National Security Council spokeswoman Emily Horne.\n\nJerusalem Day is meant to celebrate Israel’s capture of east Jerusalem, home to the Old City and its sensitive holy sites, in the 1967 Mideast war. But the annual event is widely perceived as provocative, as hardline nationalist Israelis, guarded by police, march through the Damascus Gate of the Old City and through the Muslim Quarter to the Western Wall, the holiest site where Jews can pray.\n\nThis year the march coincides with the Muslim holy month of Ramadan, a time of heightened religious sensitivities, and follows weeks of clashes. That, combined with Palestinian anger over the eviction plan in the nearby Sheikh Jarrah neighborhood, could set the stage for an especially volatile day.\n\nAmos Gilad, a former senior defense official, told Army Radio that the parade should be cancelled or at least kept away from Damascus Gate, saying , “the powder keg is burning and can explode at any time.” Israel’s public broadcaster Kan said the final route of the parade had not yet been decided.\n\nIn recent days, dozens of Palestinians have been wounded in clashes near the Al-Aqsa mosque compound in the Old City. The site, known to Jews as the Temple Mount and to Muslims as the Noble Sanctuary, is considered the holiest site in Judaism and the third holiest in Islam. It has been a tinderbox for serious violence in the past.\n\n“The occupier plays with fire, and tampering with Jerusalem is very dangerous,” Saleh Arouri, a top Hamas official, told the militant group’s Al-Aqsa TV station.\n\nIsrael captured east Jerusalem, along with the West Bank and Gaza Strip, in the 1967 war. The Palestinians seek all three areas for a future state, with east Jerusalem as their capital.\n\nThe violence, along with the planned evictions in east Jerusalem, have drawn condemnations from Israel’s Arab allies and expressions of concern from the United States, Europe and the United Nations.\n\nIn Sunday night’s clashes, Palestinian protesters shouted at police and pelted them with rocks and bottles, while police fired stun grenades and a water cannon to disperse the crowds. Palestinian medics said at least 14 protesters were injured.\n\nThe clashes were less intense than the previous two nights. Police said over 20 police officers had been injured in recent days.\n\nBut there were signs the violence was beginning to spread.\n\nLate Sunday, Palestinian militants in the Gaza Strip fired four rockets toward Israel, setting off air raid sirens in southern city of Ashkelon and nearby areas, the Israeli military said. It said one rocket was intercepted, while two others exploded inside Gaza. Early Monday, Israeli tanks and artillery struck several Hamas posts near the border in retaliation for the rocket fire. There were no reports of injuries.\n\nEarlier in the day, Israel carried out an airstrike on a Hamas post in response to another rocket attack. Gazan protesters affiliated with Hamas militant group also launched incendiary balloons into southern Israel during the day, causing dozens of fires.\n\nIn Jerusalem, meanwhile, Israeli police also clashed with hundreds of Arab students at Israel’s Hebrew University, using stun grenades to disperse the crowd. Police said 15 people were arrested at another protest in the northern city of Haifa.\n\nJordan and Egypt, the first two countries to strike peace deals with Israel, both summoned senior Israeli diplomats to condemn the Israeli actions.\n\nJordan’s King Abdullah II, who acts as custodian of Jerusalem’s Muslim holy sites, condemned what he called “Israeli violations and escalating practices” and urged Israel to halt its “provocations against Jerusalemites.”\n\nAt the Vatican, Pope Francis said he was following the events in Jerusalem with worry and called for an end to the clashes.\n\n“Violence only generates violence,” he told the public gathered at St. Peter’s Square.",
    "Title": "More Jerusalem clashes on eve of contentious Israeli parade"
  },
  {
    "Date": "Mon, 10 May 2021 07:00:28 +0530",
    "Description": "Visitors to Dracula's castle are more likely to find puncture marks in their arms than their necks this month, after medics set up a COVID-19 vaccination centre at the Transylvanian attraction.",
    "Image": "https://c.ndtvimg.com/2021-05/qgdqbiv_dracula-castle-reuters_625x300_10_May_21.jpg",
    "Link": "https://www.ndtv.com/world-news/draculas-castle-in-romania-lures-visitors-with-free-covid-vaccine-shots-2438510",
    "Text": "Bran Castle towers above Bran commune, in Brasov county, Romania.\n\nVisitors to Dracula's castle are more likely to find puncture marks in their arms than their necks this month, after medics set up a COVID-19 vaccination centre at the Transylvanian attraction.\n\nDoctors and nurses with fang stickers on their scrubs are offering free Pfizer shots to all-comers at 14th century Bran Castle, which is purported to be an inspiration for the vampire's towering home in Bram Stoker's novel \"Dracula\".\n\nCastle staff hope the service will bring more people to the site in Romania's Carpathian mountains, where tourist numbers have plummeted since the start of the pandemic.\n\nAnyone can turn up without an appointment every weekend in May. They also get free entry to the castle's exhibit of 52 medieval torture instruments.\n\n\"The idea ... was to show how people got jabbed 500-600 years ago in Europe,\" the castle's marketing director, Alexandru Priscu, said.\n\nOne of the visitors on Saturday was Fernando Orozco, a 37-year-old renewable energy market developer usually based in Berlin who has been working remotely out of Romania.\n\n\"I was already planning to come to the castle and I just thought it was the two-for-one special,\" he said.\n\nThe government has said it wants to vaccinate 10 million of its people by September, but a survey released in April by Bratislava-based think tank Globsec showed Romanians were the least inclined to get vaccinated among the EU's eastern members.\n\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
    "Title": "Dracula's Castle In Romania Lures Visitors With Free Covid Vaccine Shots"
  },
  {
    "Date": "Mon, 10 May 2021 07:26:31 +0530",
    "Description": "A long line of people snaked across the sand of Miami Beach, Florida, as dozens of travelers from Latin America waited their turn at a pop-up coronavirus vaccination booth.",
    "Image": "https://c.ndtvimg.com/2021-05/34u7tv88_vaccine-tourists-fly-from-abroad-for-injections-on-us-beach-650_625x300_10_May_21.jpeg",
    "Link": "https://www.ndtv.com/world-news/coronavirus-vaccine-tourists-fly-from-abroad-for-injections-on-us-beach-2438515",
    "Text": "People get a Johnson & Johnson vaccine at a pop-up vaccination center at the beach in Florida.\n\nA long line of people snaked across the sand of Miami Beach, Florida, as dozens of travelers from Latin America waited their turn at a pop-up coronavirus vaccination booth.\n\nSweating under the Sunday afternoon sun, visitors checked into an online system -- no proof of residence required -- and soon after received a free, single-dose Johnson & Johnson vaccine and a vaccination card.\n\nPeople had come from all over Latin America -- Ecuador, El Salvador, Venezuela -- where the vaccine rollout has been slow and hampered by supply shortages.\n\n\"In my country, (Covid-19) is getting out of hand and there's not much chance we'll have access to the vaccine soon,\" Maria Bonilla, who arrived Saturday from Honduras, told AFP.\n\nThe 40-year-old accountant flew in with her parents, aged 63 and 73. The three of them stood in line, wearing masks. \"We had to make the decision to look for a solution outside the country,\" Bonilla said.\n\nBlanca Diaz, 50, who arrived Friday from Mexico, came to the same conclusion: \"They are just starting to vaccinate older people,\" she said of her home country.\n\nThe rush to find a vaccine has been accompanied by a sharp surge in airfares. Flights from Buenos Aires to Miami, which usually cost around $1,000, have jumped to $2,000 in May.\n\nBonilla is acutely aware of her privilege to be able to travel with her parents to get vaccinated. \"It's unfortunate. It already creates this division that some of us have access to health and others do not,\" she said.\n\nMiami Beach city commissioner David Richardson, a Democrat, who oversaw the facility, told AFP he has mixed feelings about the vaccine tourists.\n\n\"I think we, the United States government, should help as many people as possible,\" he said.\n\n\"My only concern is that it seems that the people who can afford to buy an airfare can come to the United States and get a vaccine now.\n\n\"And what about the poor people in South America?\" Richardson asked, urging the US government to send vaccines overseas \"so that everybody can have access to the vaccine, not just the people who can afford to come here.\"\n\nEasing requirements\n\nOn Sunday, the pop-up vaccination booth inoculated 175 people with the Johnson & Johnson shot, the brand favored by tourists because it requires only one dose.\n\nThis is the second weekend that the booth has been set up on the beach, and it will be back for the next few weekends.\n\nRichardson said he was authorized Sunday morning to provide vaccines to anyone over age 18.\n\nIn theory, Florida vaccinates state residents or people who indicate -- verbally -- that they offer a service in-state. As of 10 days ago, it is no longer necessary to provide documented proof of residence.\n\nThis easing of requirements was implemented to encourage undocumented residents to get vaccinated -- but it also has encouraged vaccine tourists.\n\nSince January, wealthy Latin Americans have been creatively circumventing the now-eliminated residency requirement.\n\nThey would show bank statements for accounts with a US address, or temporary rental contracts -- even with Airbnb -- could be immediately canceled once they had been vaccinated.\n\nMore than nine million people -- out of a total of 21.5 million residents -- have had at least one dose of the vaccine in Florida, according to the US health department.\n\n\"At this point, the people that haven't been vaccinated is certainly not because a lack of supply or a lack of availability,\" Florida Governor Ron DeSantis said last week.\n\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
    "Title": "'Vaccine Tourists' Fly For Injections On US Beach"
  },
  {
    "Date": "Mon, 10 May 2021 06:14:17 +0530",
    "Description": "Donald Trump encouraged the Capitol rioters and so earned his Facebook ban, but the social media giant's rules are in \"shambles\" and need fixing, the co-chair of the network's oversight panel said...",
    "Image": "https://c.ndtvimg.com/2021-02/37qfcsp8_donald-trump-650_625x300_23_February_21.jpg",
    "Link": "https://www.ndtv.com/world-news/donald-trump-egged-on-capitol-rioters-facebook-panel-co-chair-2438502",
    "Text": "Trump was suspended from Facebook and Instagram after posting a video during the attack(FILE)\n\nDonald Trump encouraged the Capitol rioters and so earned his Facebook ban, but the social media giant's rules are in \"shambles\" and need fixing, the co-chair of the network's oversight panel said Sunday.\n\nThe panel agreed just days ago that Facebook was right to oust the ex-president for his comments regarding the deadly January 6 rampage, though it sidestepped an overall decision on whether he will ever be allowed back.\n\n\"He issued these statements which were just egging on -- with perfunctory asking for peace -- but mostly he was just egging them on to continue,\" oversight body co-chair Michael McConnell told Fox News Sunday.\n\nTrump was suspended from Facebook and Instagram after posting a video during the attack by his fired-up supporters challenging his election loss, in which he told them: \"We love you, you're very special.\"\n\n\"He (Trump) bears responsibility for his own situation. He put himself in this bed and he can sleep in it,\" McConnell added.\n\nHowever, the panel gave the company six months to justify why his ban should be permanent -- leaving a grenade in Facebook founder Mark Zuckerberg's lap on the issue of free speech, and spotlighting weaknesses in the platform's plan for self-regulation.\n\n\"We gave them (Facebook) a certain amount of time to get... their house in order,\" McConnell said. \"They needed some time because their rules are shambles... They are unclear, they are internally inconsistent.\"\n\nMcConnell, a constitutional law professor at Stanford, noted that the social media giant was not violating Trump's free speech rights.\n\n- 'Facebook is not a government' -\n\n\"The simple willing answer is private companies are not bound by the First Amendment,\" he said referring the US constitution. \"He's a customer. Facebook is not a government, and he is not a citizen of Facebook.\"\n\nIn its ruling, the oversight board -- envisioned by Zuckerberg as the equivalent of a \"supreme court\" for thorny content decisions -- made additional recommendations on dealing with potentially harmful content from world leaders.\n\nThe panel \"called on Facebook to address widespread confusion about how decisions relating to influential users are made\" and said \"considerations of newsworthiness should not take priority when urgent action is needed to prevent significant harm.\"\n\nTwitter has permanently suspended Trump after the Capitol riot, saying there was a risk he would further incite violence, due to his multiple tweets disputing Joe Biden's presidential election victory.\n\nTwitter on Thursday confirmed that it had pulled the plug on several Trump-linked accounts trying to skirt the ban.\n\nSocial media had been key to Trump's political success, letting him fire off comments without having to explain or back claims.\n\nAt a recent hearing on Capitol Hill, US lawmakers unleashed criticism at the leaders of the top social networks, and promised new regulations.\n\nZuckerberg, Twitter's Jack Dorsey, and Google's Sundar Pichai faced questions from lawmakers who blamed their platforms for political extremism, drug abuse, teen suicides and more.\n\nZuckerberg reiterated his belief that private companies should not be the judges of truth when it comes to what people say.\n\n(This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)",
    "Title": "Donald Trump \"Egged On\" Capitol Rioters: Facebook Panel Co-Chair"
  },
  {
    "Date": "Mon, 10 May 2021 09:04:18 +0530",
    "Description": "China will set up a \"separation line\" on the peak of Mount Everest to avoid possible Covid-19 infections by climbers from virus-hit Nepal, state media reported, after dozens were taken ill from the...",
    "Image": "https://c.ndtvimg.com/2020-12/bpqktojk_mount-everest_625x300_08_December_20.jpg",
    "Link": "https://www.ndtv.com/world-news/coronavirus-news-china-to-set-up-separation-line-on-mount-everest-to-avoid-infections-from-climbers-from-covid-19-hit-nepal-2438542",
    "Text": "Mount Everest straddles the China-Nepal border, with the north slope belonging to China.\n\nChina will set up a \"separation line\" on the peak of Mount Everest to avoid possible Covid-19 infections by climbers from virus-hit Nepal, state media reported, after dozens were taken ill from the summit's base camp.\n\nWhile the virus first emerged in China in late 2019, it has largely been brought under control in the country through a series of strict lockdowns and border closures.\n\nOver 30 sick climbers were evacuated from base camp on the Nepalese side of the world's highest peak in recent weeks as Nepal faces a deadly second wave, raising fears that the virus might ruin a bumper climbing season.\n\nMount Everest straddles the China-Nepal border, with the north slope belonging to China.\n\nTibetan authorities told reporters at a press conference they would take the \"most stringent epidemic prevention measures\" to avoid contact between climbers on the north and south slopes or at the top, reported the official Xinhua news agency on Sunday.\n\nMountain guides will set up dividing lines on the summit of the mountain before allowing mountaineers to start the gruelling climb up, the head of the Tibet Mountaineering Association was quoted as saying by Xinhua.\n\nThe official did not provide details on what the dividing lines would be made of.\n\nTwenty-one Chinese climbers have been approved to climb to the summit of Everest this year after having quarantined in Tibet since early April, the official added.\n\nThe Chinese side will also step up virus control measures at the Chinese base camp on the northern side of the mountain, with non-climber tourists in the Everest scenic area forbidden to enter.\n\nChina has banned foreign nationals from climbing Everest since last year due to the virus outbreak.\n\nBut this year Nepal has issued a record number of climbing permits to try and boost visitors after its tourism industry suffered a devastating blow through 2020 from the pandemic.\n\nAn Everest permit alone from Nepal costs $11,000 and climbers pay upward of $40,000 for an expedition.\n\nMore than a thousand people are typically camped at the bustling tent city at the foot of Everest on the Nepalese side at any one time, including foreign climbers and the teams of Nepali guides that escort them to the peak.\n\nIn the last three weeks, Nepal's daily case trajectory has shot up with two out of five people tested now returning positive as infections spill over from neighbouring India's deadly second wave.\n\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
    "Title": "China To Set Up \"Separation Line\" On Mount Everest Over Covid Fears"
  },
  {
    "Date": "Mon, 10 May 2021 10:17:56 +0530",
    "Description": "Melinda French Gates began working with divorce lawyers well over a year before her split with Bill Gates was announced last week, partly over concerns about her husband's dealings with convicted sex...",
    "Image": "https://c.ndtvimg.com/2021-05/suo2jv5o_bill-gates-melinda-gates-bloomberg_625x300_10_May_21.jpg",
    "Link": "https://www.ndtv.com/world-news/bill-gates-divorce-talks-started-in-2019-due-to-jeffrey-epstein-report-2438580",
    "Text": "The couple said that they plan on remaining co-chairs and trustees of Bill & Melinda Gates Foundation.\n\nMelinda French Gates began working with divorce lawyers well over a year before her split with Bill Gates was announced last week, partly over concerns about her husband's dealings with convicted sex offender Jeffrey Epstein, according to the Wall Street Journal.\n\nThe 56-year-old spoke with attorneys from several firms as early as October 2019, saying the marriage was \"irretrievably broken,\" the Journal reported Sunday, citing documents and people familiar with the matter. Her unease about her ex-husband's ties to Epstein dates back to at least 2013, the paper said.\n\nThe New York Times reported in October 2019 that the billionaire had met with Epstein several times, and once stayed late at his New York townhouse. A spokeswoman for Microsoft Corp. co-founder said at the time that the meetings had centered on philanthropy. Epstein had died in jail two months prior while awaiting trial on federal charges related to sex trafficking.\n\nThe divorce was negotiated during the pandemic, involving legal teams working with a mediator to divide their fortune, which the Bloomberg Billionaires Index pegs at $145 billion.\n\nThe couple said that they plan on remaining co-chairs and trustees of the Bill & Melinda Gates Foundation. Billionaire Warren Buffett serves as the foundation's third trustee. All three have vowed to give away the vast majority of their wealth.\n\nIn the days after the split was announced, a holding company that Bill Gates created transferred equity stakes in four different companies, worth more than $2 billion in aggregate, to Melinda French Gates, Bloomberg News has reported. The bulk of it is from about 14.1 million shares in Canadian National Railway Co.\n\nDays before he died in a New York jail, Epstein named a little-known biotech venture capitalist named Boris Nikolic as backup executor of his will. Nikolic had worked as a science adviser to Bill Gates and more recently funded more than a dozen firms in gene editing and other health technologies.\n\nIn an emailed statement at the time, Nikolic told Bloomberg that Epstein had not consulted him about the will and that he had no intention to fulfill the duties.\n\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
    "Title": "Gates' Marriage \"Irretrievably Broken\" Since 2019 Over Epstein: Report"
  },
  {
    "Date": "Mon, 10 May 2021 11:12:54 +0530",
    "Description": "A knife-wielding attacker stabbed five people in a New Zealand supermarket Monday, critically injuring three, but Prime Minister Jacinda Ardern said it appeared the rampage was not terror related.",
    "Image": "https://i.ndtvimg.com/i/2018-03/police-generic-international-afp_650x400_41520126059.jpg",
    "Link": "https://www.ndtv.com/world-news/five-stabbed-in-new-zealand-knife-attack-terror-link-ruled-out-2438617",
    "Text": "Police said a man had been taken into custody.\n\nA knife-wielding attacker stabbed five people in a New Zealand supermarket Monday, critically injuring three, but Prime Minister Jacinda Ardern said it appeared the rampage was not terror related.\n\nPolice said the attack -- highly unusual in the normally peaceful South Pacific nation -- occurred at a Countdown supermarket in central Dunedin at 2:30pm (0230GMT) and a man had been taken into custody.\n\nWitnesses told local media a man carrying two knives stabbed staff in the supermarket and bystanders who tried to stop him were also injured.\n\nThe most recent mass-casualty attack in New Zealand was the Christchurch mosques shootings in March 2019, when a white supremacist gunman murdered 51 Muslim worshippers and severely injured another 40.\n\nArdern said the first question she asked police was whether the Dunedin attack had national security implications but they assured her it did not.\n\n\"At this stage, there's nothing to suggest from the police's perspective that this is what they would define as a domestic terror event,\" she told reporters.\n\nArdern also said police were not looking for anyone else in relation to the attack.\n\n\"I want to acknowledge early reports of bystanders who have taken action in order to protect those around them... these are courageous acts and we are thinking of the families,\" she said.\n\nCountdown's managing director Spencer Sonn said everyone at the supermarket chain was \"shocked and devastated\" by the attack.\n\nNew Zealand introduced tough gun laws in the wake of the Christchurch attack to limit access to firearms.\n\n(This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)",
    "Title": "Five Stabbed In New Zealand Knife Attack, Terror Link Ruled Out"
  },
  {
    "Date": "Mon, 10 May 2021 03:15:36 +0530",
    "Description": "A gunman opened fire at a birthday party in Colorado, killing six people in the early hours of Sunday before taking his own life, US police said.",
    "Image": "https://c.ndtvimg.com/2018-09/hms9qqjc_us-police-generic_625x300_14_September_18.jpg",
    "Link": "https://www.ndtv.com/world-news/7-dead-at-us-birthday-party-shooting-police-2438476",
    "Text": "None of the children at the party were injured in the attack, police said. (Representational)\n\nA gunman opened fire at a birthday party in Colorado, killing six people in the early hours of Sunday before taking his own life, US police said.\n\nColorado Springs police responded shortly after midnight to an emergency call at a mobile home park, where they found six adults shot dead and one adult male who was seriously injured.\n\nHe was transported to a local hospital, where he died from his injuries.\n\nPreliminary investigations revealed that families had gathered for a birthday party inside one of the trailers when the shooting occurred.\n\n\"The suspect, a boyfriend of one of the female victims, drove to the residence, walked inside and began shooting people at the party before taking his own life,\" the police said in a statement.\n\n\"We are still investigating to determine a motive.\"\n\nNone of the children at the party were injured in the attack, according to the police, and they were being cared for by family members. The victims have not been publicly identified.\n\n\"From the officers who responded to the shooting to the investigators still on scene, we are all left incredibly shaken,\" said Colorado Springs police chief Vince Niski. \"This is something you hope never happens in your own community.\"\n\nColorado Springs mayor John Suthers said the \"senseless act of violence\" had sent the community into mourning, and called for prayers for the victims, their families and the first responders.\n\nA woman who lived in the mobile home park told the Denver Post she was awakened by the sound of so many gunshots that she thought it was a thunderstorm.\n\nColorado Springs-based newspaper The Gazette reported that family and friends of the victims gathered Sunday afternoon outside the trailer to mourn the attack.\n\nIt was the third mass shooting in Colorado Springs since October 2015, including a random Halloween massacre and an attack on a Planned Parenthood clinic in November that same year, local media said.\n\nThe United States has suffered a spate of mass shootings in recent months, including at a FedEx facility in Indianapolis, an office building in California, a grocery store in Boulder, Colorado and at several spas in Atlanta.\n\nPresident Joe Biden last month branded US gun violence an \"epidemic\" and an \"international embarrassment.\"\n\nThere were more than 43,000 gun-related deaths in the United States last year, including suicides, according to the Gun Violence Archive.\n\n(This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)",
    "Title": "7 Dead In US Birthday Party Shooting, Suspect Was A Victim's Boyfriend"
  },
  {
    "Date": "Mon, 10 May 2021 04:07:43 +0530",
    "Description": "The Taliban on Monday declared a three-day ceasefire in Afghanistan to mark this week's Eid al-Fitr holiday, just two days after the government blamed the insurgents for bombs outside a school that...",
    "Image": "https://i.ndtvimg.com/i/2016-06/taliban-fighters-guards-ap_650x400_71465702467.jpg",
    "Link": "https://www.ndtv.com/world-news/taliban-declares-3-day-afghan-ceasefire-for-eid-holiday-2438485",
    "Text": "The ceasefire offer comes as the US continues to pull out its troops from Afghanistan(Representational)\n\nThe Taliban on Monday declared a three-day ceasefire across Afghanistan to mark this week's Eid al-Fitr holiday, just two days after being blamed for killing more than 50 people -- mostly young girls -- in a bomb attack outside a school in the capital.\n\nThe ceasefire offer comes as the United States continues to pull out its last 2,500 troops from the violence-wracked country despite faltering peace efforts between the Taliban and Afghan government to end a decades-long war.\n\n\"Mujahideen of the Islamic Emirate are instructed to halt all offensive operations against the enemy countrywide from the first till the third day of Eid,\" a statement released by the Taliban said.\n\n\"But if the enemy conducts any assault or attack against you during these days, stand ready to robustly protect and defend yourselves and your territory,\" it added.\n\nEid al-Fitr marks the end of the Muslim fasting month of Ramadan, and the holiday begins according to the sighting of the new moon. The Taliban declared similar ceasefires last year to mark Islamic holidays.\n\nThe government usually reciprocates with a truce. Fraidon Khawzon, spokesman for chief negotiator Abdullah Abdullah, said early Monday: \"We welcome the announcement....the Islamic republic is also ready and will announce soon.\"\n\n'Bodies piled on top of each other'\n\nThe latest offer comes after the government blamed the Taliban for Saturday's attack outside a girls' school in Dasht-e-Barchi, a suburb of the capital largely populated by the Shiite Hazara community, which is often targeted by extremist Sunni Islamist militants.\n\nA series of blasts outside the school -- when residents were shopping ahead of the holiday -- killed more than 50 people and wounded over 100.\n\nIt was the deadliest attack in more than a year.\n\nThe Taliban, who denied responsibility, had earlier issued a statement saying the nation needed to \"safeguard and look after educational centres and institutions\".\n\nOn Sunday, relatives buried the dead at a hilltop site known as \"Martyrs Cemetery\", where victims of attacks against the Hazara community are laid to rest.\n\nHazaras are Shiite Muslims and considered heretics by extremist Sunnis. Sunni Muslims make up the majority of the Afghan population.\n\nBodies in wooden coffins were lowered into graves one by one by mourners still in a state of shock and fear, an AFP photographer said.\n\n\"I rushed to the scene (after the blasts) and found myself in the middle of bodies, their hands and heads cut off and bones smashed,\" said Mohammad Taqi, a resident of Dasht-e-Barchi, whose two daughters were students at the school but escaped the attack.\n\n\"All of them were girls. Their bodies piled on top of each other.\"\n\nBooks and school bags belonging to the victims still lay scattered at the site of the attack.\n\nThe Taliban insist they have not carried out attacks in Kabul since February last year, when they signed a deal with Washington that paved the way for peace talks and withdrawal of the remaining US troops.\n\nBut the group has clashed daily with Afghan forces in the rugged countryside even as the US military reduces its presence.\n\nTaliban chief warns US\n\nThe United States was supposed to have pulled all forces out by May 1 as agreed with the Taliban last year, but Washington pushed back the date to September 11 -- a move that angered the insurgents.\n\nThe leader of the Taliban, Hibatullah Akhundzada, reiterated in a message released ahead of Eid that any delay in withdrawing the troops was a \"violation\" of that deal.\n\n\"If America again fails to live up to its commitments, then the world must bear witness and hold America accountable for all the consequences,\" Akhundzada warned in Sunday's message.\n\nAfghan President Ashraf Ghani has declared a day of national mourning for Tuesday.\n\n\"This savage group does not have the power to confront security forces on the battlefield, and instead targets with brutality and barbarism public facilities and the girls' school,\" he said in a statement.\n\nSaturday's blasts drew widespread global condemnation.\n\nPope Francis called it \"an inhumane action\", while Iran blamed the jihadist Islamic State.\n\nIndia, meanwhile, called for the dismantling of \"terrorist sanctuaries\" and a ceasefire to boost peace efforts.\n\n(This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)",
    "Title": "Taliban Declares 3-Day Afghan Ceasefire For Eid Holiday"
  },
  {
    "Date": "Mon, 10 May 2021 10:42:36 +0530",
    "Description": "Less than a fortnight after President Joe Biden in his conversation with PM Narendra Modi pledged his country's steadfast support for the people of India, America has responded with an unprecedented...",
    "Image": "https://c.ndtvimg.com/2021-03/4hhkvlsg_joe-biden-afp650_625x300_26_March_21.jpg",
    "Link": "https://www.ndtv.com/india-news/outpouring-of-support-from-us-for-india-covid-19-help-touches-usd-half-a-billion-2438597",
    "Text": "\"We are determined to help India in its time of need,\" President Joe Biden had said in a tweet.\n\nLess than a fortnight after President Joe Biden in his conversation with Prime Minister Narendra Modi pledged his country's steadfast support for the people of India, America has responded with an unprecedented financial assistance worth nearly USD half a billion.\n\nBiden spoke at length with PM Modi last month and conveyed solidarity with India in its fight against the viral disease. He assured the prime minister that the US and India will work closely together in the fight against COVID-19.\n\n\"Just as India sent assistance to the United States as our hospitals were strained early in the pandemic, we are determined to help India in its time of need,\" President Biden had said in a tweet.\n\nReflecting an overwhelming support for a \"natural ally\", the entire country not only the administration, but also the corporate sector which created a global task force, as well as Americans and Indian-Americans have opened their coffers for India.\n\nJust as India sent assistance to the United States as our hospitals were strained early in the pandemic, we are determined to help India in its time of need. https://t.co/SzWRj0eP3y — President Biden (@POTUS) April 25, 2021\n\nThis half a billion dollars includes USD 100 million pledged by the Biden administration, USD 70 million by pharma major Pfizer and 450,000 Remdesivir doses, the governmental purchase price of each of which in the US is USD 390.\n\nThousands of oxygen concentrators and plane loads of life saving drugs and health care equipment are flying off the United States for India almost every day.\n\nSeveral companies like Boeing and Mastercard have announced financial assistance worth USD 10 million each, Google has pledged USD 18 million, which the Global Task Force that comprises CEOs of top American companies have already pledged USD 30 million worth of life saving equipment.\n\nDescribing it as a \"Berlin Life Moment\", Mukesh Aghi of US India Strategic and Partnership Forum (USISPF), told PTI he expects the assistance to touch almost USD 1 billion by the end of the month. \"It is emotional for the diaspora, almost everyone has someone who has been touched by COVID-19,\" he said.\n\nNisha Desai Biswal, president of US India Business Council (USIBC) said, \"The outpouring of support from the United States over the past two weeks was a spontaneous mass mobilisation of support for the Indian people from across the America government, business community and diaspora community and the American people.\"\n\n\"It is unprecedented, and it reflects both the deep bonds between our two countries and the gratitude that Americans feel for the role India played in supporting the United States when we were experiencing our COVID surge last year,\" she said.\n\nHowever, given the \"speed and severity\" that have overwhelmed the capacity of hospitals and local authorities, more assistance will be needed and for a sustained period of timescale of the pandemic, Biswal said.\n\nPeople of the country and the Diaspora too have come out in large numbers. Indian-American Vinod Khosla has committed USD 10 million, top corporate leader John T Chambers has promised USD 1 million.\n\nFor the first time in its history, Sewa International has raised USD 15 million; American Association of Physicians of Indian Origin (AAPI) (USD 3.6 million), Indiaspora (USD 2.5) million and Jai Shetty has raised USD 4 million.\n\n\"There has been overwhelming support and offers of assistance from the US Government, private sector, diaspora and the American public at large. In fact, in my interactions in recent days, the US interlocutors across the board ask me, 'tell us what more we can do for India''\", India''s ambassador to the US Taranjit Singh Sandhu told PTI.\n\n\"They recall with fondness the help India gave. These are reflective of strong partnership and close people to people ties between our both nations. We deeply appreciate these gestures. We will continue to engage with the US in our collective fight against the pandemic,\" he said.\n\nAmong other major financial contributions announced include Procter and Gamble (USD 6.7 million); Merck (USD 5 million), Walmart (USD 2 million), Salesforce (USD 2.4 million), and Caterpillar (USD 3.4 million). Companies like Deloittee have announced to 12,000 oxygen concentrators to India.\n\nWhile Microsoft is partnering with the US government in providing aid and oxygen, FedEx and UPS have taken up the mantle of taking care of the transportation of life saving health care equipment like oxygen cylinders, ventilators and oxygen concentrators to India.\n\nOn Sunday, Indian-Americans from Tamil Nadu including eminent philanthropist MR Rangaswami, held a \"Help Tamil Nadu Breathe\" to raise USD 1.5 million in few hours.\n\n\"This is an incredible outpouring of generosity, which people have come to expect from America. When the world has a crisis, beyond politics, beyond dispute America steps up,\" Mr Rangaswami said.\n\n\"It is comforting to see US cargo jets with much needed medical supplies landing at the Delhi airport regularly,\" said Karun Rishi, president of the USA-India Chambers of Commerce.\n\nNoting that the stakes are very high for the entire world, he said India's success or failure to come out of this once in a century crisis will have a direct impact throughout the world.\n\nEchoing Biswal, Rishi said that more needs to be done.\n\n\"The scale of assistance to India needs to increase and speeded up. To make some reasonable impact to tide over this crisis, India may need between USD 25-USD 50 billion in assistance in the form of vaccines, technology transfer, increasing vaccines and therapeutics manufacturing capacity, medical equipment and public health measures,\" he said.",
    "Title": "Support From US For India, Covid Help Touches USD Half A Billion"
  },
  {
    "Date": "Mon, 10 May 2021 03:58:28 +0000",
    "Description": " ",
    "Image": "https://images.indianexpress.com/2021/05/School-main.jpg",
    "Link": "https://indianexpress.com/article/world/schools-are-open-but-many-families-remain-hesitant-to-return-7309003/",
    "Text": "Students wait outside the Bronx School for Law where in-person learning resumed for students who opted for hybrid learning. (Photo: The New York Times)\n\nPauline Rojas’ high school in San Antonio is open. But like many of her classmates, she has not returned and has little interest in doing so.\n\nDuring the coronavirus pandemic, she started working 20 to 40 hours per week at Raising Cane’s, a fast-food restaurant, and has used the money to help pay her family’s internet bill, buy clothes and save for a car.\n\nRojas, 18, has no doubt that a year of online school, squeezed between work shifts that end at midnight, has affected her learning. Still, she has embraced her new role as a breadwinner, sharing responsibilities with her mother, who works at a hardware store.\n\n“I wanted to take the stress off my mom,” she said. “I’m no longer a kid. I’m capable of having a job, holding a job and making my own money.”\n\nPauline Rojas, a high school student, at her home in San Antonio, Texas on Saturday. Even as fears of the coronavirus abate, many students like Rojas are continuing to opt out of in-person learning. (Photo: The New York Times) Pauline Rojas, a high school student, at her home in San Antonio, Texas on Saturday. Even as fears of the coronavirus abate, many students like Rojas are continuing to opt out of in-person learning. (Photo: The New York Times)\n\nOnly a small slice of US schools remain fully closed: 12% of elementary and middle schools, according to a federal survey, as well as a minority of high schools. But the percentage of students learning fully remotely is much greater: more than one-third of fourth and eighth graders and an even larger group of high school students. A majority of Black, Hispanic and Asian American students remain out of school.\n\nThese disparities have put district leaders and policymakers in a tough position as they end this school year and plan for the next one. Even though the pandemic appears to be coming under control in the United States as vaccinations continue, many superintendents say fear of the coronavirus itself is no longer the primary reason their students are opting out. Nor are many families expressing a strong preference for remote learning.\n\nRather, for every child and parent who has leaped at the opportunity to return to the classroom, others changed their lives over the past year in ways that make going back to school difficult. The consequences are likely to reverberate through the education system for years, especially if states and districts continue to give students the choice to attend school remotely.\n\nTeenagers from low-income families have taken on heavy loads of paid work, especially because so many parents lost jobs. Parents made new child care arrangements to get through the long months of school closures and part-time hours and are now loath to disrupt established routines. Some families do not know that local public schools have reopened, because of language barriers or lack of effective communication from districts.\n\nExperts have coined the term “school hesitancy” to describe the remarkably durable resistance to a return to traditional learning. Some wonder whether the pandemic has simply upended people’s choices about how to live, with the location of schooling — like the location of office work — now up for grabs. But others see the phenomenon as a social and educational crisis for children that must be combated — a challenge akin to vaccine hesitancy.\n\n“There are so many stories, and they are all stories that break your heart,” said Pedro Martinez, the San Antonio schools superintendent, who said it was most challenging to draw teenagers back to classrooms in his overwhelmingly Hispanic, low-income district. Half of high school students are eligible to return to school five days a week, but only 30% have opted in. Concerned about flagging grades and the risk of students dropping out, he plans to greatly restrict access to remote learning next school year.\n\n“I don’t want to keep opening up this Pandora’s box,” he said.\n\nIn March, half of Black and Hispanic children and two-thirds of Asian American children were enrolled in remote school, compared with 20% of white students, according to the latest federal data. While most district leaders and policymakers believe that the classroom is the best place for children and teenagers to learn, many are hesitant to apply pressure to families who have lived through a traumatic year.\n\nNew York Mayor Bill de Blasio greets a student at the Bronx School for Law. (Photo: The New York Times) New York Mayor Bill de Blasio greets a student at the Bronx School for Law. (Photo: The New York Times)\n\nAn added complication is continued opposition to full-time, in-person learning from some teachers and district officials, with unions arguing that widespread vaccination of educators, and soon teenagers as well, does not eliminate the need for physical distancing. The Centers for Disease Control and Prevention continues to advise 3 to 6 feet of distancing in schools. In that context, students who opt out create the space necessary to serve students who prefer to be in person.\n\nAt the same time, remote learning is a staffing challenge for districts. In some, like San Antonio, it is common practice for teachers to instruct remote and in-person students simultaneously, through a live video stream from the classroom to students at home. In others, such as New York City, unions have resisted having teachers do both at once, making it difficult to fully staff classes.\n\nAnd in New York and several other cities where many teachers have received medical accommodations to work from home, some students inside classrooms have been asked to log in to remote learning platforms to interact with teachers in other locations, leading families to conclude that there is little benefit to being inside the building and driving opt-out rates higher. Districts that offer remote learning next school year could contract the work out to stand-alone online schools, freeing their own teachers to return to buildings. But for many months, some education and children’s health experts have warned about the social and academic consequences of extended remote learning.\n\n“It’s not acceptable that we have a two-tier education system where white kids go to school in person disproportionately and students of color disproportionately go to school online,” said Vladimir Kogan, a political scientist at Ohio State University.\n\nKogan’s research has found that parents are more likely to feel hesitant about in-person learning if their children’s schools were closed for a longer period, which was most likely to be the case in the liberal-leaning urban districts that serve large numbers of nonwhite students. The hesitancy was caused less by fear of the coronavirus than by messaging from school districts about whether in-person learning was safe and desirable, Kogan found.\n\nMany governors, mayors, school boards and superintendents are still debating whether families should continue to have the option of virtual schooling this fall. But one February survey of educators found that 68% expected their systems to offer an array of remote learning options even after the pandemic ends.\n\nAs long as the option for remote school remains, direct outreach to families is the best way to lure students back to traditional classrooms, educators say.\n\nIn the Indianapolis Public Schools, 20% of students remain in fully remote learning, a smaller percentage than in many other urban districts. The district made 1,000 home visits over two days in April to check on children who had been chronically absent during the pandemic, sometimes encouraging them to return to in-person learning.\n\nAntoinette Austin, the district’s social services coordinator, visited one boy who was living with an aunt. She did not speak English and did not know her nephew’s school had reopened. Several other families needed help arranging transportation to get their children to school, Austin said.\n\nHybrid school schedules have also made it difficult for many families to commit to in-person learning during the pandemic.\n\nThat was the case for Angela Kersey, who returned her 13-year-old son, Jonathon, to his Indianapolis school when it initially reopened this winter. But she withdrew him when she found that her work schedule in housing maintenance could not accommodate the upheaval caused by the school’s half-time hours and closures when virus cases were discovered.\n\nSpeaking over Zoom, Kersey rubbed her temples as she recalled trying to keep her son, who has attention deficit hyperactivity disorder, engaged with online learning. There was one especially difficult period when the two were sharing a single bedroom and living with roommates. At times, the strain of acting as both a parent and a teacher caused so many fights that Kersey gave up on virtual learning.\n\n“I had to just surrender,” she said.\n\nUnwilling to return to that routine, she enrolled Jonathon in a five-day-per-week learning center at Brookside Community Church, where college students supervise remote school and sports for 14 children.\n\nJonathon’s regular school is now open five days per week, but Kersey said she did not want to disrupt her son’s new routine.\n\nIn New Orleans, Frederick A. Douglass High School, part of the national KIPP charter school network, first reopened for in-person learning in October and now offers students four days per week in classrooms. Even so, wooing students back has been a major challenge. In the fall, 50 to 75 of the school’s 600 students were showing up each day; more recently, about half were; 90% of the school’s students are Black and come from low-income families.\n\nTowana Pierre-Floyd, the principal, has taken several steps to convince families to return. Maintaining upbeat on-campus events, like homecoming elections, showed students attending virtually what they were missing out on in the building, she said. In addition, the school began issuing weekly progress reports to families with students’ grades and assessment scores, a practice Pierre-Floyd said she will continue even after the pandemic ends.\n\nBecause most students were not as successful virtually, the reports left families “hungry for an option to be with teachers,” she said.\n\nPierre-Floyd envisions her entire student body back in person next school year, but she knows it will require a big adjustment. Some teenagers are providing child care for younger siblings. Parents who lost jobs in the city’s struggling tourism sector sometimes needed their children to work.\n\nShe plans to hire an attendance coordinator and expand an early-college program that allows high school students to work toward a medical assistant certification or develop carpentry skills. She said she hopes those options will show parents the economic utility of returning their children to the building.\n\n“A lot of families have built life structures around their Covid reality,” she said. Now the challenge is to “come out of crisis mode and let’s think about the future again.”",
    "Title": "Schools are open in US, but many families remain hesitant to return"
  },
  {
    "Date": "Mon, 10 May 2021 08:46:48 +0530",
    "Description": "The US government declared a regional emergency Sunday as the largest fuel pipeline system in the United States remained largely shut down, two days after a major ransomware attack was detected.",
    "Image": "https://c.ndtvimg.com/2021-05/kg0db4to_colonial-pipeline-instagram-650_625x300_08_May_21.jpg",
    "Link": "https://www.ndtv.com/world-news/us-declares-regional-emergency-over-cyberattack-at-colonial-pipeline-company-2438534",
    "Text": "Colonial is the largest pipeline operator in the United States by volume.\n\nThe US government declared a regional emergency Sunday as the largest fuel pipeline system in the United States remained largely shut down, two days after a major ransomware attack was detected.\n\nThe Colonial Pipeline Company ships gasoline and jet fuel from the Gulf Coast of Texas to the populous East Coast through 5,500 miles (8,850 kilometers) of pipeline, serving 50 million consumers.\n\nThe company said it was the victim of a cybersecurity attack involving ransomware -- attacks that encrypt computer systems and seek to extract payments from operators.\n\n\"This Declaration addresses the emergency conditions creating a need for immediate transportation of gasoline, diesel, jet fuel, and other refined petroleum products and provides necessary relief,\" the Department of Transportation said in a statement.\n\nThe emergency declaration allows for fuel to be transported by road to the affected states: Alabama, Arkansas, District of Columbia, Delaware, Florida, Georgia, Kentucky, Louisiana, Maryland, Mississippi, New Jersey, New York, North Carolina, Pennsylvania, South Carolina, Tennessee, Texas and Virginia.\n\nThe declaration also provides regulatory relief to commercial motor vehicle operations that are part of the emergency support efforts.\n\nColonial said earlier Sunday that it had opened some smaller delivery lines, but the main system was not yet back up and running.\n\n\"While our mainlines remain offline, some smaller lateral lines between terminals and delivery points are now operational,\" Colonial said in a statement, adding it would \"bring our full system back online only when we believe it is safe to do so.\"\n\n\"We have remained in contact with law enforcement and other federal agencies, including the Department of Energy who is leading the Federal Government response,\" it added.\n\n\"Maintaining the operational security of our pipeline, in addition to safely bringing our systems back online, remain our highest priorities.\"\n\nCalls for improved oversight\n\nCommerce Secretary Gina Raimondo told CBS on Sunday that authorities were working to prevent any disruption to supplies.\n\nColonial, based in the southern state of Georgia, is the largest pipeline operator in the United States by volume, normally transporting 2.5 million barrels of gasoline, diesel fuel, jet fuel and other refined petroleum products per day.\n\nThe attack prompted calls from cybersecurity experts for improved oversight of the industry to prepare for future threats.\n\n\"This attack is unusual for the US. But the bottom line is that attacks targeting operational technology -- the industrial control systems on the production line or plant floor -- are becoming more frequent,\" Algirde Pipikaite, cyber strategy lead at the World Economic Forum's Centre for Cybersecurity, told AFP on Saturday.\n\n\"Unless cybersecurity measures are embedded in a technology's development phase, we are likely to see more frequent attacks on industrial systems like oil and gas pipelines or water treatment plants.\"\n\nGas prices jumped in the United States on Sunday following the ransomware attack. Analysts warn that prices could climb even higher if the pipeline is not reopened soon. Oil prices rose more than one percent Monday.\n\nThe United States was rocked in recent months by news of two major cybersecurity breaches -- the SolarWinds hack that compromised thousands of US government and private sector computer networks and was officially blamed on Russia; and a potentially devastating penetration of Microsoft email servers.\n\nThe latter is believed to have affected at least 30,000 US organizations including local governments and was attributed to an aggressive Chinese cyberespionage campaign.\n\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
    "Title": "US Declares Regional Emergency Over Fuel Pipeline Cyberattack"
  },
  {
    "Date": "Mon, 10 May 2021 01:59:25 +0530",
    "Description": "SpaceX will launch the \"DOGE-1 Mission to the Moon\" in the first quarter of next year, with Elon Musk's commercial rocket company accepting the meme-inspired cryptocurrency dogecoin as payment.",
    "Image": "https://c.ndtvimg.com/2021-04/sa9uoa88_dogecoin-reuters_625x300_21_April_21.jpg",
    "Link": "https://www.ndtv.com/world-news/spacex-accepts-dogecoin-as-payment-to-launch-a-lunar-mission-next-year-2438467",
    "Text": "Musk said in April that SpaceX was going to put a \"literal Dogecoin on the literal moon\".(FILE)\n\nSpaceX will launch the \"DOGE-1 Mission to the Moon\" in the first quarter of next year, with Elon Musk's commercial rocket company accepting the meme-inspired cryptocurrency dogecoin as payment.\n\nGeometric Energy Corporation announced the dogecoin-funded mission on Sunday, with the statement not disclosing the mission's financial value.\n\n\"We're excited to launch DOGE-1 to the Moon!\", SpaceX Vice President of Commercial Sales Tom Ochinero was quoted as saying in the statement released by Geometric Energy. \"This mission will demonstrate the application of cryptocurrency beyond Earthorbit and set the foundation for interplanetary commerce\".\n\nSpaceX launching satellite Doge-1 to the moon next year\n\n\n\n– Mission paid for in Doge\n\n– 1st crypto in space\n\n– 1st meme in space\n\n\n\nTo the mooooonnn!!https://t.co/xXfjGZVeUW — Elon Musk (@elonmusk) May 9, 2021\n\nMusk said on Twitter in April that SpaceX was going to put a \"literal Dogecoin on the literal moon\".\n\nDogecoin lost more than a third of its price on Sunday, after Musk called it a 'hustle' during his guest-host spot on the \"Saturday Night Live\" comedy sketch TV show.\n\nMusk's tweets this year turned the once-obscure digital currency, which began as a social media joke, into a speculator's dream.\n\nElectric carmaker Tesla Inc, where Musk is CEO, said in February it bought $1.5 billion worth of bitcoin and would soon accept it as a form of payment for its electric cars, a large stride toward mainstream acceptance that sent bitcoin soaring to a record high of nearly $62,000.\n\n(This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)",
    "Title": "\"Mission To Moon\": SpaceX Accepts Cryptocurrency For Satellite Launch"
  },
  {
    "Date": "Mon, 10 May 2021 06:22:26 +0530",
    "Description": "A Siberian doctor who treated Kremlin critic Alexei Navalny after he collapsed on a flight in Russia last year has gone missing, Russian police said on Sunday.",
    "Image": "https://c.ndtvimg.com/2021-05/q0ut5j2_siberian-doctor-who-treated-navalny_625x300_10_May_21.jpg",
    "Link": "https://www.ndtv.com/world-news/siberian-doctor-who-treated-kremlin-critic-alexei-navalny-goes-missing-police-2438505",
    "Text": "Alexander Murakhovsky was the head doctor at the hospital in Siberia that treated Navalny. (FILE)\n\nA Siberian doctor who treated Kremlin critic Alexei Navalny after he collapsed on a flight in Russia last year has gone missing, Russian police said on Sunday.\n\nPolice in the Omsk region, about 2,200 km (1,370 miles) east of Moscow, said physician Alexander Murakhovsky had left a hunting base in a forest on an all-terrain vehicle on Friday and had not been seen since.\n\nIt said that emergency services, drones, a helicopter and volunteers on the ground had joined the search effort.\n\nMurakhovsky was the head doctor at the hospital in the Siberian city of Omsk that treated Navalny, President Vladimir Putin's most prominent critic. Murakhovsky was subsequently promoted to the post of regional health minister.\n\nAfter tense negotiations with the authorities, Navalny was airlifted to Germany from Omsk for further treatment.\n\nLaboratory tests in three European countries, confirmed by the global chemical weapons watchdog, established that Navalny had been poisoned with a Soviet-style Novichok nerve agent.\n\nThe Kremlin has repeatedly rejected any suggestion that Russian authorities tried to kill Navalny. He was jailed in February on what he said were trumped up charges.\n\n(This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)",
    "Title": "Siberian Doctor Who Treated Kremlin Critic Goes Missing: Police"
  },
  {
    "Date": "Mon, 10 May 2021 09:52:24 +0530",
    "Description": "A French air force pilot has filed a criminal complaint alleging that as part of a hazing ritual he was tied to a target on a firing range while fighter planes flew overhead and fired off munitions,...",
    "Image": "https://c.ndtvimg.com/2021-05/aonl17k_french-pilot-tied-in-hazing-ritualmay-10reuters_625x300_10_May_21.jpg",
    "Link": "https://www.ndtv.com/world-news/french-air-force-pilot-says-he-was-tied-to-firing-target-in-hazing-ritual-2438562",
    "Text": "The complaint did not identify any of the people alleged to have carried out the hazing.\n\nA French air force pilot has filed a criminal complaint alleging that as part of a hazing ritual he was tied to a target on a firing range while fighter planes flew overhead and fired off munitions, his lawyer told Reuters on Saturday.\n\nThe complaint did not identify any of the people alleged to have carried out the hazing, or say how many of them were involved. Reuters was not able to independently establish the identities of those responsible for the incident.\n\nColonel Stephane Spet, a spokesman for the French air force, said an internal inquiry had been ordered by air force command and those responsible had been punished.\n\nThe most severe punishment was restriction to barracks, Spet said. He did not say how many people had received this punishment, or for how many days.\n\nSpet said that the pilot's safety was never in danger.\n\nThe pilot said in the complaint, which was seen by Reuters, that the hazing occurred in March 2019, soon after he arrived at a combat fighter unit at the Solenzara air base on the French Mediterranean island of Corsica.\n\nThe pilot had a hood put over his head, and was forced into the back of a pick-up truck by several colleagues who drove him to the firing range, according to the complaint.\n\nPhotos, which were included in the complaint, showed a man in military fatigues with his legs and hands bound, attached to the firing range target with heavy-duty nylon straps.\n\nVideo footage, which is cited in the complaint and was provided to Reuters by the pilot's lawyer, Frederic Berna, also showed combat jets making several low passes nearby.\n\nThe complaint alleges that, during some of these passes, the pilot tied to the target could hear the sound of live munitions being fired from the aircraft.\n\nSpet did not dispute the authenticity of the images, but he said they created the mistaken impression that the aircraft were directing fire at the pilot who was tied to the target.\n\nHe said that the firing the pilot heard was from aircraft that were on a training exercise at a different location, and that the closest any munition round came to him was about one kilometre (0.6 miles).\n\nBerna said his client did not want his name disclosed publicly because of privacy concerns. Reuters has seen the pilot's name in the complaint.\n\nBerna said the photos and video footage cited in the complaint were filmed by service members who were present, and the images later shared in a WhatsApp group chat. Members of the group chat then shared the images with the pilot filing the complaint, the lawyer said.\n\nAsked why his client waited until now to file the complaint, Berna said the pilot had initially been in denial about the gravity of what he experienced, and did not want to challenge the military authorities.\n\nHe raised the issue with his superiors at the end of 2020, the lawyer said, and decided to file the criminal complaint when he felt the military was not responding adequately.\n\nSpet said the air force command was informed of the incident in January this year, and ordered an internal inquiry.\n\n\"The pilots responsible for staging this were severely punished in April 2021, with measures that went as far as restriction to barracks,\" Spet said.\n\nBerna said neither he nor his client had any knowledge of any punishment imposed on service personnel over the incident.\n\nIn a separate statement, the air force said it condemned any actions that harm the physical or mental wellbeing of its personnel, and that it would cooperate with any criminal investigation.\n\nA spokeswoman for the Solenzara base referred Reuters to the air force statement.\n\nThe complaint was filed with the state prosecutor's office in the city of Marseille on May 5, according to Berna. The lawyer said his client is still in the air force and serving as a pilot but is no longer a combat pilot.\n\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
    "Title": "French Pilot Alleges He Was Tied To Firing Target In Hazing Ritual"
  },
  {
    "Date": "Mon, 10 May 2021 05:00:12 +0530",
    "Description": "The White House was working closely with top US fuel pipeline operator Colonial Pipeline on Sunday to help it recover from a ransomware attack that forced the company to shut a critical fuel network...",
    "Image": "https://c.ndtvimg.com/2021-05/kg0db4to_colonial-pipeline-instagram-650_625x300_08_May_21.jpg",
    "Link": "https://www.ndtv.com/world-news/us-government-working-to-aid-top-fuel-pipeline-operator-after-cyberattack-2438491",
    "Text": "Colonial said on Sunday its main fuel lines remain offline.\n\nThe White House was working closely with top US fuel pipeline operator Colonial Pipeline on Sunday to help it recover from a ransomware attack that forced the company to shut a critical fuel network supplying populous eastern states.\n\nThe attack is one of the most disruptive digital ransom schemes reported and has prompted calls from American lawmakers to strengthen protections for critical US energy infrastructure from hacking attacks.\n\nCommerce Secretary Gina Raimondo said the pipeline fix was a top priority for the Biden administration and Washington was working to avoid more severe fuel supply disruptions by helping Colonial restart as quickly as possible its more than 5,500-mile (8,850 km) pipeline network from Texas to New Jersey.\n\n\"It's an all hands on deck effort right now,\" Raimondo said on CBS' \"Face the Nation\" program. \"We are working closely with the company, state and local officials, to make sure that they get back up to normal operations as quickly as possible and there aren't disruptions in supply.\"\n\nColonial said on Sunday its main fuel lines remain offline but some smaller lines between terminals and delivery points are now operational. Neither Raimondo nor the company gave an estimate for a full restart date and Colonial declined further comment on Sunday.\n\nUS gasoline futures jumped more than 3% to $2.217 a gallon, the highest since May 2018, as trading opened for the week and market participants reacted to the closure.\n\nColonial transports roughly 2.5 million barrels per day of gasoline and other fuels from refiners on the Gulf Coast to consumers in the mid-Atlantic and southeastern United States.\n\nIts extensive pipeline network serves major U.S. airports, including Atlanta's Hartsfield Jackson Airport, the world's busiest by passenger traffic.\n\nA Charlotte Douglas International Airport spokesperson said the airport had supply on-hand and was \"monitoring the situation closely,\" adding that the complex is supplied by another major pipeline as well as Colonial.\n\nRetail fuel experts including the American Automobile Association said an outage lasting several days could have significant impacts on regional fuel supplies, particularly in the southeastern United States.\n\nDuring previous Colonial outages, retail prices in southeastern states have risen substantially.\n\nOffices of governors in several of the U.S. states most vulnerable to fuel shortages - including Tennessee, Georgia and Maryland - were not immediately available for comment.\n\nCYBERCRIMINALS SUSPECTED\n\nWhile the U.S. government investigation is in the early stages, a former U.S. official and three industry sources said the hackers are suspected to be a professional cybercriminal group called DarkSide.\n\nDarkSide is one of many ransomware gangs extorting victims while avoiding targets in post-Soviet states. The groups gain access to private networks, encrypt files using software, and often also steal data.\n\nThey demand payment to decrypt the files and increasingly ask for additional money not to publish stolen content.\n\nIn the Colonial attack, the hackers took more than 100 gigabytes of data, according to a person familiar with the incident.\n\nAs the FBI and other government agencies worked with private companies to respond, the cloud computing system the hackers used to collect the stolen data was taken offline Saturday, the person said.\n\nColonial's data did not appear to have been transferred from that system anywhere else, potentially limiting the hackers' leverage to extort or further embarrass the company.\n\nCybersecurity firm FireEye is among those dealing with the attack, industry sources said. FireEye declined to comment. Colonial said it was working with a \"leading, third-party cybersecurity firm,\" but did not name the firm.\n\nMessages left with the DarkSide hackers were not immediately returned. The group's dark website, where hackers regularly post data about victims, made no reference to Colonial Pipeline.\n\nColonial declined to comment on whether DarkSide hackers were involved in the attack, when the breach occurred or what ransom they demanded.\n\nBIDEN BRIEFED ON HACK\n\nPresident Joe Biden was briefed on the cyberattack on Saturday morning, the White House said, adding that the government was working to try to help the company restore operations and prevent supply disruptions.\n\nU.S. Senator Bill Cassidy, a Republican from Louisiana who sits on the Energy Committee, said lawmakers are prepared to work more with privately held critical infrastructure companies to guard against cyberattacks.\n\n\"The implication for this, for our national security, cannot be overstated. And I promise you, this is something that Republicans and Democrats can work together on,\" he said on NBC's \"Meet the Press.\"\n\nAnother fuel pipeline serving the same regions carries a third of what Colonial does. Any prolonged outage would require tankers to transport fuels from the US Gulf Coast to East Coast ports.\n\nThe Federal Motor Carrier Safety Administration is issuing a temporary hours of service exemption to truckers transporting refined products to 17 southern and east coast states including Alabama, Delaware, Florida, Georgia, New Jersey and New York.\n\nComplicating the fallback plans, according to one industry source familiar with the federal response, was that the ranks of fuel-truck drivers for the main road transportation companies, which could pick up some of the pipeline volume, are down by 25% or more because of coronavirus infections.\n\nOil refining companies contacted by Reuters over the weekend said their operations had not yet been impacted. Some were working to find alternative transport for customers.\n\nThe privately held, Georgia-based company is owned by CDPQ Colonial Partners L.P., IFM (US) Colonial Pipeline 2 LLC, KKR-Keats Pipeline Investors L.P., Koch Capital Investments Company LLC and Shell Midstream Operating LLC.\n\n(This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)",
    "Title": "US Government Working To Aid Top Fuel Pipeline Operator After Cyberattack"
  }
]